{"url": "https://www.indiatimes.com/entertainment/hollywood/11-super-awkward-oscar-moments-that-ll-make-you-laugh-and-cringe-at-the-same-time-362622.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscar_1550837192_800x420.jpg", "title": "11 Super Awkward Oscar Moments That'll Make You Laugh And Cringe At The Same Time!", "text": "The countdown has begun! In just a few days, we will witness the 91st Academy Awards 2019. Every year, most of us look forward to the Oscars. Okay maybe not! But then it won’t be wrong to say that this award ceremony does provide a lot of fodder for us to have a meme fest for at least a week. Apart from the amazing speeches, performances and red carpet looks, Oscars unintentionally makes way for giggle-worthy memes, almost every year without fail.\ngiphy\nWhile the ceremony itself is known to be predictable, sometimes it does take us by a surprise. Therefore, ahead of this year’s much-awaited Academy Awards ceremony we decided to take a walk down memory lane and raise a toast to all such awkward/funny moments that kept us entertained for a long time. Scroll!\n1. Jennifer Lawrence - the name is enough\ntwitter\nJ Law is probably the only celebrity who never fails to entertain us. She might not be a presenter, a winner or a nominee every year but she gets the spotlight every single time. Why you ask? Well, her adorable, goofy nature makes her shine bright like a diamond! And when she doesn’t charm us with that she makes sure that she trips, jumps over the seats or carry her drink all around. I don’t think one can ever get over her awkward fall before she went up on the stage to receive her best actress trophy in 2013. Without further ado, here are pictures for your perusal.\nDon't Miss 253 SHARES 335 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\ntwitter\ntwitter\nwe heart it\n2. Angelina Jolie’s leg\ntwitter\nAt the 84th Academy Awards’ red carpet, Angelina Jolie did make a fashionable appearance in a strapless black Versace gown but what caught everyone’s fancy was her pose! The dress had a thigh-high split revealing her leg and the internet found it so amusing that soon after, it presented its own version of her pose. It became a fad in no time and more than the ceremony, Jolie became the most talked-about topic. In fact, it also led to the discovery of a new slang - Leg-bombing.\ntwitter\n3. Scarlett Johansson and John Travolta’s super awkward picture\nagencies\nBack in 2015, at the 87th Academy Awards ceremony, John Travolta bagged the title of Creep of the Oscars. The Pulp Fiction actor made headlines for all the wrong reasons. It was when he put his arm around actress Scarlett Johansson’s waist and tried to give her an unrequited peck! The photo which was clicked at a wrong time went on to become viral. What’s more it also inspired a lot of toe-curling memes.\nreddit\nThat particular picture gained so much momentum that Johansson had to give a statement in one of her interviews. She said,\n'The image that is circulating is an unfortunate still-frame from a live-action encounter that was very sweet and totally welcome. That still photo does not reflect what preceded and followed if you see the moment live.”\n4. John Travolta acting creepy again and this time with Idina Menzel on the stage!\nIn 2014, Travolta became a laughing stock when he flubbed actress Idina Menzel’s name. While John Travolta and his antics are never ending, no one anticipated that he would goof up with the same person twice and that too in a row. Following the name flub, the very next year Travolta was mocked massively both online and offline for pawing at Menzel’s face while presenting an award together. Don’t believe us? Check it out for yourself:\nbustle\n5. Nicole Kidman’s new way of clapping like a seal\ntwitter\nNicole Kidman left millions of people scratching their heads after she demonstrated an odd way of clapping at the 2017 Oscars. When she stood up to give a round of applause to a winner, most of the people didn’t even register who won for they were busy decoding why Kidman clapped the way she did. The clapping was so awkward that people discussed about it extensively for weeks.\nSo much so, that Nicole Kidman finally had to clear the air in an interview.\n“It was really awkward,” she admitted during an Australian radio interview. “I was like, ‘I wanna clap, I don’t wanna not be clapping’ — that’d be worse, right? Like ‘Why isn’t Nicole clapping?’ So therefore I’m clapping but it was really difficult because I had a huge ring on that was not mine — but it was absolutely gorgeous — and I was terrified of damaging it.”\nWell, diamond ring or not, we are not forgetting that clap anytime soon.\n6. Neil Patrick Harris stripping down to his undies on the stage\nvariety\nWell, let’s just say 2015 was a phenomenal year for meme lovers as it had more than one funny moment. As if J Law’s fall, Travolta’s creepiness wasn’t enough our very own Neil Patrick Harris aka Barney Stinson ended walking on the stage in his pair of tighty-whitties. Yes, you read that right! In a bid to enact the movie Birdman’s underwear scene, he took this bold step. Once the deed was done, people were too stunned to notice the parody part of the sketch. Well, it sure was a ballsy move for NPH, to say the least.\n7. Sacha Baron Cohen dressing up as The Dictator only to sprinkle ashes on a host!\nyoutube\nBack in 2012, the year that the movie The Dictator released, there were a lot of talks about actor Sacha Baron Cohen being banned from attending the Oscars for he had threatened to come dressed up as his character from the film. Putting a rest to all such rumours, he did appear on the red carpet only to be escorted out. Why you ask? Well, he took the stunt way too far. Not only did Cohen come dressed up as General Aladeen but also carried out a publicity stunt that went wrong.\nThe British comedian in full character claimed to be carrying the ashes of former North Korean leader Kim Jong-Il. While talking to host Ryan Secrest, he then said that it was Kim's dying wish \"to be sprinkled over the red carpet and over Halle Berry's chest\".\nA second later, he tipped the urn all over the host which covered his tux in white dust. In just a few seconds, he was rescued out of the venue by security guards. Well, talk about comedy gone wrong.\n8. Ben Stiller came dressed up in Na’vi inspired garb from Avatar\nyoutube\nBen Stiller took his presenting job way too seriously in 2010’s Oscar ceremony. In charge of presenting the Best Make Up Award, Stiller walked out on the stage in full Avatar get up, much to the amusement of the A-list audience. He then went on to poke fun at the movie which was snubbed at the ceremony that year. Rest assured he did secure one of the top slots in the best cameos of Oscars’ history.\n9. Angelina Jolie’s cringey PDA with her brother\ntwitter\nWait, before you start cussing, we are NOT making this up! In what sounds like a bizarre parallel world, Angelina Jolie took everyone by a surprise when she walked the red carpet with her brother James Haven only to kiss him on the mouth in full public glory in 2000. It fueled incest rumours even more, when she said that she is so in love with her brother in her acceptance speech. The rumour mills even suggested that this episode drove a wedge between Jolie and her former husband Brad Pitt.\n10. Ellen DeGeneres Pizza Delivery in the middle of the Oscars ceremony\ntwitter\nWell, A-lister or not, hunger pangs can make people go crazy. In 2014’s Oscars ceremony, host Ellen DeGeneres ordered free pizza for hungry Hollywood biggies. The comedienne and talk show star ushered a delivery man from Big Mama's & Papa's Pizzeria into the Dolby Theatre and then urged the audience to pay the tip. As per reports, the pizza delivery guy ended up taking home more than 1000 dollars as tip.\n11. Last but not the least, the much-talked about star-studded selfie\ntwitter\nRight after pizza, Ellen DeGeneres went down the stage only to click the most star-studded selfie ever. At the 90th Academy Awards ceremony , Ellen squeezed Jared Leto, Jennifer Lawrence, Channing Tatum, Meryl Streep, Julia Roberts, Kevin Spacey, Bradley Cooper, Brad Pitt, Lupita Nyong’o, Angelina Jolie and Lupita’s Brother Junior apart from herself in one frame to click one helluva selfie. Posting it on Twitter, she wrote “If only Bradley's arm was longer. Best photo ever. #oscars.” To say that it shattered the most retweeted photo record on twitter would be an understatement.\nThe 91st Academy Awards will take place this Sunday in Los Angeles.", "description": "The countdown has begun! In just a few days, we will witness the Academy Awards 2019. Every year, most of us look forward to the Oscars. Okay maybe not! But then it won’t be wrong to say that this award ceremony does provide a lot of fodder for us to have a meme fest for at least a week. Apart from the amazing speeches, performances and red carpet looks, Oscars unintentionally makes way for giggle", "authors": ["Bhavya Sadhwani"], "date_publish": "22/02/2019, 18:29:12"}