{"url": "https://www.indiatimes.com/entertainment/celebs/19-years-after-hum-dil-de-chuke-sanam-sanjay-leela-bhansali-salman-khan-to-reunite-for-a-love-story-362653.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/salman_khan_1550910767_800x420.jpg", "title": "19 Years After Hum Dil De Chuke Sanam, Sanjay Leela Bhansali & Salman Khan To Reunite For A Love Story", "text": "There are a few tried and tested formulas in Bollywood that never fail. Like, some actor-director collaborations raise up the curiosity and expectations among people and for all the right reasons. One such news got confirmed today.\n19 years after the massive success of their film Hum Dil De Chuke Sanam, Salman Khan and Sanjay Leela Bhansali are all set to reunite for a love-story.\nTwitter\nThe news was announced on social media by trade analyst Taran Adarsh. In his tweet he revealed that the film will go on the floors very soon. In his tweet, he wrote:\n#BreakingNews: Sanjay Leela Bhansali & Salman Khan reunite after 19 year for a love story... The film is set to go on floors soon. — taran adarsh (@taran_adarsh) February 23, 2019\nBhansali and Salman are a dream team as after their 1999 hit film Hum Dil De Chuke Sanam, Salman also appeared in a guest appearance in Saawariya.\nDon't Miss 554 SHARES 3.7 K SHARES 2.2 K SHARES 3.1 K SHARES 248 SHARES\nThe news spread like wildfire and people started reacting positively to the news. Here are a few reactions.\nWe will witness the destruction on box office 🔥🔥🔥🔥🔥 — Farhan Rasheed 🇮🇳 (@filmy_farhan) February 23, 2019\nWhat a news if this will happen then sure all records of Indian cinema will breaks. Thanks for news Taran sir and thanks a lot to bhaijaan. This is true gift to fans by Salman and Sanjay sir. Excitement level is so so high... @BeingSalmanKhan @bhansaliprod_fc @filmfare — Kapil Prem (@beingkapilmathu) February 23, 2019\nNews of the decade pic.twitter.com/WWzJMFYAFV — Bharat's Aleem (@BeingAleem1) February 23, 2019\nI am waiting very very excitement Sanjay Leela Bhansali movie and bhaijaan ke liye — Md Junaid ansari (@MdJunai80560830) February 23, 2019", "description": "There are a few tried and tested formulas in Bollywood that never fail. Like, some actor-director collaborations raise up the curiosity and expectations among people and for all the right reasons. One such news got confirmed today. 19 years after the massive success of their film Hum Dil De Chuke Sanam, Salman Khan and Sanjay Leela Bhansali are all set to reunite for a love-story.", "authors": ["Isha Sharma"], "date_publish": "23/02/2019, 15:00:12"}