{"url": "https://www.indiatimes.com/entertainment/36-years-on-naseeruddin-shah-to-return-as-vinod-in-jaane-bhi-do-yaaro-sequel-we-re-so-excited-362688.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/36_years_on_naseeruddin_shah_to_return_as_vinod_in_jaane_bhi_do_yaaro_sequel__were_excited_1550993219_800x420.jpg", "title": "36 Years On, Naseeruddin Shah To Return As Vinod In Jaane Bhi Do Yaaro Sequel & We’re So Excited", "text": "36 Years On, Naseeruddin Shah To Return As Vinod In Jaane Bhi Do Yaaro Sequel & We’re So Excited\n36 Years On, Naseeruddin Shah To Return As Vinod In Jaane Bhi Do Yaaro Sequel & We’re So Excited\nLong before Shashi Tharoor’s Farrago moment took the internet by storm, people were tripping over “Nalayak, Adharmi, Durachari, Mamachari, Bhrashatachari, bol Sorry!” Thanks to the cult movie Jaane Bhi Do Yaaro.\nJaane Bhi Do Yaaro is one of the most epic films ever made in Bollywood. With no abuses and unadulterated comedy, the cult-favourite of all, Jaane Bhi Do Yaaro was simply one of the best comedy films that not only tickles our funny bones but is also very relevant in today’s age. And we can’t thank Kundan Shah enough for this masterpiece.\nTwitter\nWondering why we are talking about the movie? Because a sequel to 1983 cult classic is in the works, and apparently Naseeruddin Shah will reprise his role as Vinod.\nYoutube\nShah and Ravi Baswani played two struggling photographers in the satire on corruption.\n“We are doing 'Jaane Bhi Do Yaaro' sequel. The script is ready. Kundan ji had written it. Naseeruddin Shah is reprising his role. We will have someone else from Raviji's part as he is no longer with us. The actors who are available are Naseeruddin Shah, Neena Gupta, Satish Kaushik and Pankaj Kapur,” a source close to the production told PTI.\nTwitter\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\n\"For the sequel, both NFDC and Nadiadwala will be working jointly,\" the source added.\nThe original film ended with both Shah and Boswani's characters being framed for the crimes that they had not committed. The sequel will take their journey forward after they come out of jail.\nYouTube\n\"The second part will start from where the first part ended. The characters of Vinod and Sudhir have come out of the jail and are old. Pankaj Kapur's character has become a top industrialist while whoever plays Om Puri's character is his competitor,\" the source said.\nThe shooting for the film is expected to begin by next year and we are totally looking forward to this. What about you?\nWith inputs from PTI", "description": "Jaane Bhi Do Yaaro is one of the most epic films ever made in Bollywood. With no abuses and unadulterated comedy, the cult-favourite of all, Jaane Bhi Do Yaaro was simply one of the best comedy films that not only tickles our funny bones but is also very relevant in today’s age. And we can’t thank Kundan Shah enough for this masterpiece.", "authors": ["Garima Satija"], "date_publish": "24/02/2019, 12:53:44"}