{"url": "https://www.indiatimes.com/entertainment/after-struggling-for-6-yrs-siddhant-chaturvedi-aka-mc-sher-finally-tastes-success-how-here-s-his-story-362707.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/siddhant_chaturvedi_aka_gully_boys_mc_sher_struggled_for_6_yrs__was_often_replaced__rejected_1551010033_800x420.jpg", "title": "After Struggling For 6 Yrs, Siddhant Chaturvedi AKA MC Sher Finally Tastes Success & How! Here’s His Story", "text": "After Struggling For 6 Yrs, Siddhant Chaturvedi AKA MC Sher Finally Tastes Success & How! Here’s His Story\nAfter Struggling For 6 Yrs, Siddhant Chaturvedi AKA MC Sher Finally Tastes Success & How! Here’s His Story\nDo you know Siddhant Chaturvedi AKA Gully Boy’s MC Sher has already bagged his second film? According to latest reports, he has bagged a lead role in a film, which will be produced Farhan Akhtar and Ritesh Sidhwani’s Excel Entertainment.\nTwitter\nUnless you have been living under the rock, you would know that Siddhant Chaturvedi has become an overnight sensation after the release of Gully Boy. The man stole all the limelight from Ranveer Singh and Alia Bhatt with his stellar performance in the movie.\nGirls have been swooning over his charming personality and a lot of others too are crushing on him too. After Rajkummar Rao in 2017 and Vicky Kaushal in 2018, Siddhant Chaturvedi is hailed the breakout star of Gully Boy.\nHe recently received a handwritten note from the legendary star Amitabh Bachchan. Looks like everyone is swooning over his spectacular antics in the film.\nIt seems, 'Apna time aa gaya' for Siddhant Chaturvedi! But success didn’t come easily to him. He is just 25. He was studying to become a chartered accountant like his father but left it midway to pursue a career in Bollywood. When he was 19, he tried his luck in the city of dreams.\nDon't Miss 9 K SHARES 1.2 K SHARES 906 SHARES 24.3 K SHARES\nHe struggled for six years before and was often rejected and replaced by other actors, he revealed. Here’s his story!\n“I struggled for six years and there were many rejections and low points along the way. I started from the bottom. But I always had this raging ambition to go out there and prove myself with that one perfect opportunity. I always used to think 'ki apna time kab ayega'. And as luck would have it, Zoya had been looking for MC Sher for a year and I happened to be there at the right time”.\nZoya Akhtar had spotted Siddhant Chaturvedi while he was dancing at the success party of Excel-produced Amazon show Inside Edge, in which he played the role of a rookie fast bowler. The rest, as they say, is history.\n“I joined the film just 22 days before the shooting so it was not like I had a rap background, nothing. I knew that this was a grand film and I had to give my all to the role. But I was also conscious that just because it is a big opportunity, I should not overdo it. All I wanted was some respect and appreciation for the role but what I have got is beyond my expectations.”\nWhile in the movie he inspires Ranveer’s Murad to achieve his dreams, in real life, it was vice versa.\n“Playing a lead role is always the dream. But I also knew that nobody was going to launch me because I don't have a market value in terms of a name or a family background. So I always thought that let me be a good actor first, public will make me the star if they like me.”\nHis parents, he says, were supportive. In fact, they were the ones who suggested that he shouldn’t do roles just for the sake of money. “They say beggars can't be choosers but here I was being choosy because that's what makes or breaks an actor.”\nAnd now he is happy that he made them proud. “I think they have watched the film for 15 times already.”\nSiddhant considers his father, Ranveer, Zoya, and film's producers Farhan Akhtar and Ritesh Sidhwani his MC Shers.\n“While watching the film, I could connect with Murad's (central character) journey. Some of the things have happened to me, people have tried to put me down and I have been replaced from films because I did not have a name but I built my confidence slowly.”\n“Farhan sir spotted me first for 'Inside Edge'. He mentored me. Zoya gave me this opportunity and Ranveer was a great co-star who encouraged me and instilled faith in me,” he said.\nSiddhant Chaturvedi is a star in the making!\nWith inputs from PTI", "description": "Unless you have been living under the rock, you would know that Siddhant Chaturvedi has become an overnight sensation after the release of Gully Boy. The man stole all the limelight from Ranveer Singh and Alia Bhatt with his stellar performance in the movie. He struggled for six years before and was often rejected and replaced by other actors, he revealed. Here’s his story!", "authors": ["Garima Satija"], "date_publish": "24/02/2019, 17:09:09"}