{"url": "https://www.indiatimes.com/entertainment/hollywood/after-winning-in-an-oscar-for-bohemian-rhapsody-rami-malek-in-talks-to-play-villain-in-bond-25_-362987.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/after_oscar_win_for_bohemian_rhapsody_rami_malek_in_final_talks_to_play_villain_in_bond_25_1551429976_800x420.png", "title": "After Winning An Oscar For Bohemian Rhapsody, Rami Malek In Talks To Play Villain In Bond 25", "text": "Everyone was rooting for Bradley Cooper to win the Best Actor’s Oscar trophy, but the award went into Rami Malek’s kitty. He was on cloud nine when he won the award at the Dolby Theatre in Los Angeles. He was high on happiness. So much so, that the man who played the role of Freddie Mercury in Bohemian Rhapsody so spectacularly, tumbled off the stage soon after his thanking speech.\nHe had a shocked expression on his face too. He apparently didn’t care about his surroundings at that point of time. Luckily, the trophy stayed in one piece. He faced no injuries but paramedics were called soon after to treat Rami Malek.\nRami Malek is definitely on a winning streak. He is now in talks to play the antagonist in the latest installment of James Bond franchise.\nEven earlier as well, it was reported that Rami Malek is being eyed for the role of villain in the 25th James Bond movie. However, he was busy with his schedule on the last season of his breakout show Mr. Robot which shoots from March through July. According to Collider, the actor's team has successfully managed his shooting schedule to accommodate the Bond film.\nDon't Miss 139 SHARES 3.7 K SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nThe film will be directed by Cary Joji Fukunaga, who came on board as a director after Danny Boyle exited the project over \"creative differences\". The yet-untitled film will mark Daniel Craig's fifth and possibly the last outing as the famed British spy.\nActor Ralph Fiennes, Naomie Harris and Ben Whishaw will also reprise their roles in the new film. French star Lea Seydoux, who played psychologist Madeleine Swann in Sam Mendes' Spectre, is also returning. MGM will distribute the film in partnership with Annapurna Pictures. The film will release on April 8, 2020.", "description": "Rami Malek is definitely on a winning streak. The man who played the role of Freddie Mercury in Bohemian Rhapsody so spectacularly, is now in talks to play the antagonist in the latest installment of James Bond franchise. The film will be directed by Cary Joji Fukunaga, who came onboard as a director after Danny Boyle exited the project over \"creative differences\". The yet-untitled film will mark", "authors": ["Garima Satija"], "date_publish": "01/03/2019, 15:06:06"}