{"url": "https://www.indiatimes.com/entertainment/celebs/after-an-indefinite-ban-on-pak-artists-in-india-atif-aslam-removed-from-salman-s-notebook-362422.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/atif_aslam_pulwama_1550572393_800x420.jpg", "title": "After An Indefinite Ban On Pak Artists In India, Atif Aslam Removed From Salman’s Notebook", "text": "After the February 14 terror attack that killed at least 40 CRPF jawans, the All India Cine Workers’ Association released a statement saying,\n“All Indian Cine Workers Association strongly condemns brutal terrorist attack on our soldiers at Pulwama district in Jammu and Kashmir. Our heartfelt condolences to the families of the victims. AICWA stands with nation in confronting such terror and inhumanity. We’’re officially announcing a total ban on Pakistani Actors and Artists working in Film Industry. Still if any organisation insist on working with Pakistani Artists will be banned by AICWA and a strong action will be taken against them. Nation comes first, we stand with our nation.”\nFollowing which, Pakistani singer Atif Aslam has reportedly been removed from Notebook, a film produced by Salman Khan Films. According to the reports, the producers associated with the film have reportedly decided to contribute Rs 22 lakh for the families of martyrs of the terror attack.\n(Also read: Cine Workers Association Announce A Total Ban On Pakistani Actors And Artists In Bollywood)\nA join statement by Salman Khan Films and Cine 1 Films read:\nDon't Miss 4 K SHARES 8.9 K SHARES 886 SHARES 21.1 K SHARES 7.8 K SHARES\n“Our entire crew could shoot safely in the Valley primarily due to the efforts of the Indian Army, the CRPF and also the people of Kashmir, who have constantly ensured that law and order prevail in the region even under the most extreme circumstances. We offer our prayers for the victims and extend our heartfelt condolences to their families.”\nReports also claim that Atif Aslam’s will be scrapped and will be now re-recorded soon with a new singer. Even the Pakistani singers who were brought onboard for Bharat will be replaced. A Deccan Chronicle report quoted a source saying,\n“This time, Salman knows that he can’t ignore the demand to ban the Pakistani singers. And while he believes the voices of Rahat Fateh Ali Khan and Atif Aslam suit him best, there are far bigger truths to tackle right now.”", "description": "Pakistani singer Atif Aslam has reportedly been removed from Notebook, a film produced by Salman Khan Films. According to the reports, the producers associated with the film have reportedly decided to contribute Rs 22 lakh for the families of martyrs of the terror attack.", "authors": ["Isha Sharma"], "date_publish": "19/02/2019, 16:01:34"}