{"url": "https://www.indiatimes.com/entertainment/celebs/ajay-devgn-and-team-total-dhamaal-donate-rs-50-lakh-to-families-of-martyred-crpf-jawans-362348.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/total_dhamaal_1550481963_800x420.jpg", "title": "Ajay Devgn And Team 'Total Dhamaal' Donate Rs 50 Lakh To Families Of Martyred CRPF Jawans", "text": "The humongous loss of over forty CRPF soldiers who were killed and five others critically injured when a suicide bomber rammed a vehicle laden with explosives into their bus on Thursday is a loss that is going to feel heavy for a long time.\nThe Pakistan-based terror group Jaish-e-Mohammed (JeM) claimed responsibility for the attack on the convoy of 78 vehicles that were on the way from Jammu to Srinagar.\nIn the wake of the attack, Ajay Devgn took to Twitter to announce that his upcoming film ‘Total Dhamaal’ the team has unanimously decided that they will not be releasing the film in Pakistan. Directed by Indra Kumar, ‘Total Dhamaal’, the film is all set to hit the theaters on February 22.\n(Also read: Pulwama Terror Attack: Uri Makers Donate Rs 1 Crore To The Army Welfare Fund)\nAgencies\nDon't Miss 4 K SHARES 8.9 K SHARES 886 SHARES 21.1 K SHARES 7.8 K SHARES\nThe film stars Devgn, Madhuri Dixit, Arshad Warsi, Javed Jaffrey, Anil Kapoor and Riteish Deshmukh. Ajay Devgn tweeted,\nIn light of the current situation the team of Total Dhamaal has decided to not release the film in Pakistan. — Ajay Devgn (@ajaydevgn) February 18, 2019\nThe team also extended monetary support to the families of the martyred soldiers as the the team has reportedly donated Rs 50 lakh to the grieving families of the martyrs.\n(Also read: Janhvi Kapoor Slams Pakistani Newspaper That Called Pulwama Terror Attack A Fight For Freedom)", "description": "The humongous loss of over forty CRPF soldiers who were killed and five others critically injured when a suicide bomber rammed a vehicle laden with explosives into their bus on Thursday is a loss that is going to feel heavy for a long time. The Pakistan-based terror group Jaish-e-Mohammed (JeM) claimed responsibility for the attack.", "authors": ["Isha Sharma"], "date_publish": "18/02/2019, 14:48:09"}