{"url": "https://www.indiatimes.com/entertainment/celebs/alia-bhatt-delivers-an-emotional-speech-at-her-school-friend-s-wedding-and-it-s-heartwarming-362630.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/alia_bhatt_1550897069_800x420.jpg", "title": "Alia Bhatt Delivers An Emotional Speech At Her School Friend's Wedding And It's Heartwarming!", "text": "Taking a short break from the Gully Boy madness and the massive success, Alia Bhatt flew down to Delhi to attend the wedding of one of her closest school friends.\nAlia's social media handles are a proof that she is very close to her school friends and most of her short breaks from work are spent holidaying and chilling with her girlfriends.\nThe pictures from the Delhi wedding are all over the internet and people can't stop gushing over the fact that Alia looks resplendent and happy as she gets her best friend married.\nDon't Miss 8.9 K SHARES 1.2 K SHARES 2.4 K SHARES 2.3 K SHARES 24.3 K SHARES\nFrom Haldi pictures to the pictures of her dressed up as a bridesmaid for various functions, Alia has her fashion game on point.\nBut currently, the thing that is making the internet gush is her speech as a bridesmaid. While guests chuckled as Alia recalled her childhood memories with the bride, Alia and all her friends got a little emotional.\nIn her speech, Alia says,\n\"When I was younger, Bobby and I would play this game called actress-actress. And we made this pact that every time she was at her house she would be the actress and every time I would be at my house I would be the actress. But only that pact was never followed.\"\nHave a look at some pictures from the wedding celebrations right here.", "description": "Alia's social media handles are a proof that she is very close to her school friends and most of her short breaks from work are spent holidaying and chilling with her girlfriends. The pictures from the Delhi wedding are all over the internet and people can't stop gushing over the fact that Alia looks resplendent and happy as she gets her best friend married.", "authors": ["Isha Sharma"], "date_publish": "23/02/2019, 10:09:52"}