{"url": "https://www.indiatimes.com/entertainment/celebs/alia-batt-ranveer-singh-starrer-gully-boy-leaked-online-by-tamil-rockers-a-day-after-its-release-362343.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1550479579_800x420.jpg", "title": "Alia Batt-Ranveer Singh Starrer Gully Boy Leaked Online By Tamil Rockers A Day After Its Release", "text": "The most anticipated movie of the year, Gully Boy finally hit the theatres on Valentine's Day. Starring Alia Bhatt and Ranveer Singh, the movie is based on the desi hip hop culture and the rise of it in India.\nscreengrab\nAfter an overwhelming response on social media and shattering box office collection, the movie has been receiving appreciation from all corners of the globe. Whether its Bollywood or Will Smith, Gully Boy has been rewarding in ways more than one.\n#GullyBoy benchmarks...\nCrossed ₹ 50 cr: Day 3\n₹ 75 cr: Will cross on Day 5 [Mon]\nWill cross *lifetime biz* of Zoya Akhtar’s #DilDhadakneDo [₹ 76.88 cr] on Day 5 and #ZindagiNaMilegiDobara [₹ 90.27 cr; Zoya’s highest grossing film] in Week 1 itself. India biz. — taran adarsh (@taran_adarsh) February 18, 2019\nTamil Rockers, who are the hackers in Bollywood films, leaked the film online within few hours of its release. This is not the first time they have released a film. Previously, Tamil Rockers have leaked Thackeray, Oru Adaar, Nijan Prakashan to name a few, have been hit by piracy too.\nDon't Miss 9 K SHARES 554 SHARES 8.9 K SHARES 2.2 K SHARES\nDespite being banned at their URL, they come up with newer domains and upload free HD movies.\nscreengrab\nTalking about the menace of piracy, IFFI’s vice-president Ramesh Tekwani had told IANS, “The government decision of including an anti-camcording provision in the Cinematography Act to control piracy will need serious implementation.” He had added, “Announcement is fine but people should be stopped from recording films by asking them to deposit their phones before entering theatres. One single phone can shoot the entire film. People also know different ways to record the film.”\nGully Boy is a film about a 22-year-old boy \"Murad\" (Ranveer Singh) from the slums in Mumbai. Murad aka Ranveer feels he has the potential to be a rapper. Authentic Hip Hop in India is the latest fad and like any part in the world, rapping is rising from the streets and this movie shows Murad's journey to become one.\nInternet has also called Gully Boy as one of the finest performances of Alia Bhatt and Ranveer Singh. The movie has so far collected Rs 70 crore and is expected to touch Rs 100 by the end of this week. Directed by Zoya Akhtar, the film will soon cross the lifetime collection of Dil Dhadakne Do and Zindagi Na Milegi Dobara.", "description": "Tamil Rockers, who are the hackers in Bollywood, leaked the Bollywood film Gully Boy online within few hours of its release. This is not the first time they have released a film. Despite being banned at their URL, they come up with newer domains and upload free HD movies.Tamil Rockers, who are the hackers in Bollywood films, leaked the film online within few hours of its release.", "authors": ["Saloni Singh"], "date_publish": "18/02/2019, 14:11:52"}