{"url": "https://www.indiatimes.com/entertainment/bollywood/alia-bhatt-s-emotional-speech-salman-slb-to-reunite-for-a-romantic-film-and-more-from-ent-362666.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/top_bollywood_news_1550921748_800x420.jpg", "title": "Alia Bhatt's Emotional Speech, Salman-SLB To Reunite For A Romantic Film And More From Ent", "text": "The thing that is making the internet gush is her speech as a bridesmaid. While guests chuckled as Alia recalled her childhood memories with the bride, Alia and all her friends got a little emotional.\nLike, some actor-director collaborations raise up the curiosity and expectations among people and for all the right reasons. One such news got confirmed today. 19 years after the massive success of their film Hum Dil De Chuke Sanam, Salman Khan and Sanjay Leela Bhansali are all set to reunite for a love-story.\nDon't Miss 419 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES\nShe tweeted, \"I just want to say to all those Kashmiri students and those who have suffered because of mobs... It's not you. It's them. They are the ones who are the terrorists not you. And everyone understands this except for those pathetic apologies for human beings... Those paid to do this.\"\nShe said, \"Though I have always believed that art should be kept away from all boundaries and politics, I think we have to take a stand now. Enough is enough.\"\nAamir said, “Going through that entire journey of the first season was very traumatic for me. To the extent, I had become emotionally very brittle, I was in very bad shape. At the end of the one year, I could not go out. For absolutely no reason at all, I would just break down.\"", "description": "Like, some actor-director collaborations raise up the curiosity and expectations among people and for all the right reasons. One such news got confirmed today. 19 years after the massive success of their film Hum Dil De Chuke Sanam, Salman Khan and Sanjay Leela Bhansali are all set to reunite for a love-story.", "authors": ["Isha Sharma"], "date_publish": "23/02/2019, 17:02:47"}