{"url": "https://www.indiatimes.com/entertainment/alia-bhatt-gives-a-classy-reply-to-kangana-ranaut-for-mocking-her-boyfriend-ranbir-kapoor-363298.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_gives_a_classy_reply_to_kangana_ranaut_for_mocking_her_boyfriend_ranbir_kapoor_1551939889_800x420.jpg", "title": "Alia Bhatt Gives A Classy Reply To Kangana Ranaut For Mocking Her Boyfriend Ranbir Kapoor!", "text": "Kangana Ranaut is unstoppable. Perhaps, she is the only celebrity from Bollywood who has never shied away from answering tricky questions. No matter what question is thrown upon her, she would always bare her heart out and voice out her opinion.\nA lot of times Kangana Ranaut’s statements become controversial because she often attack people taking their names and talk about what she feels is right and wrong. From saying that Bollywood has ganged up against her to talking about her alleged affair with Hrithik Roshan in open, the diva has never been fearful.\nAlso Read: Kangana Ranaut Attacks Bollywood Again, Says The Industry Never Takes A Stand For Her\nSo, recently Kangana Ranaut made some interesting comments about Ranbir Kapoor. She mocked him for not participating in political conversations and not taking stance for the nation. She, in fact, called him selfish.\nDon't Miss 4 K SHARES 554 SHARES 3.1 K SHARES 248 SHARES\nReacting to that, Alia Bhatt gave a classy reply to Kangana Ranaut. She lauded her for her ability to speak her mind always, but at the same time she supported her beau too. Check out what she said in the video below.\n“Listen, I definitely don't have the ability to speak as candidly as Kangana does and I really really respect her for that. And may be in a way she is right that sometimes we do hold back. Kyunki hum nahi chahte ke, khamakha kyun bolna... My dad always says that there are already so many opinions in the world that the world could do with one less opinion. So, I have an opinion but I will keep it to myself. But kudos to her because she genuinely speaks really well,\" said Alia Bhatt.\nAlso Read: Kangana Ranaut Slams Ranbir Kapoor And Other Actors For Refusing To Comment On Politics", "description": "So, recently Kangana Ranaut made some interesting comments about Ranbir Kapoor. She mocked him for not participating in political conversations and not taking stance for the nation. She, in fact, called him selfish. Reacting to that, Alia Bhatt gave a classy reply to Kangana Ranaut. She lauded her for her ability to speak her mind always, but at the same time she supported her beau too. Check o", "authors": ["Garima Satija"], "date_publish": "07/03/2019, 12:04:19"}