{"url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-sheds-light-on-his-work-equation-with-madhuri-dixit-reuniting-after-18-years-362617.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/anil_kapoor_1550836274_800x420.jpg", "title": "Anil Kapoor Sheds Light On His Work Equation With Madhuri Dixit & Reuniting After 18 Years!", "text": "Anil Kapoor Sheds Light On His Work Equation With Madhuri Dixit & Reuniting After 18 Years!\nAnil Kapoor Sheds Light On His Work Equation With Madhuri Dixit & Reuniting After 18 Years!\nAfter 18 films and a gap of 18 years, Anil Kapoor and Madhuri Dixit are back and it's indeed a 'Total Dhamaal'! One of 90's favorite hit couple has reunited again for a film and it's something that's making both of them happy.\nTwitter\n\"Would you believe, I’ve done 18 films with Madhuri Dixit,\" exclaimed Anil Kapoor as he spoke about how she hasn't changed at all over the years—something he says he realised after teaming up with her once again in Indra Kumar’s Total Dhamaal.\nJust to jog your memory a little, the two actors also starred in Kumar’s iconic 1992 hit Beta.\nTalking about working with Madhuri, Anil said,\nTwitter\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\n\"We've teamed up in so many movies that we could tell each other's responses on camera without any discussion. I am very comfortable working with Madhuri. The last time we came together in a film was for Rajkumar Santoshi's Lajja in 2001 and now she is back, looking just as beautiful as she did back then.\"\nAs an actor, he's also happy that Madhuri hasn't changed. He said,\nTwitter\n\"It is reassuring when your co-star of many years takes a break to build her personal life, gets married, has children, comes back and is still the same. Believe me, it didn't feel like we hadn't worked together for 18 years. It felt like just yesterday when we did films like Tezaab, Beta, Khel and Pukar.\"\nWhen asked about his favourite film with Madhuri, he says, he said it's Rakesh Roshan's Kishen Kanhaiya. He added,\nTwitter\n\"We had so much fun mimicking Dev saab and Hemaji. I still remember that. And now in Total Dhamaal, we had a wild time. The film is non-stop entertainment. There are lots of scenes with animals. Some of them have been shot with real animals. But all of it is pure fun. Kids and grownups will love the film.\"\nTotal Dhamaal would be Anil's second release within a month and he's ecstatic about it. He added,\n\"That's true... But Total Dhamaal is as different from Ek Ladki Ko Dekha Toh Aisa Laga as chalk from cheese. Audience won't mind seeing me twice in one month. I haven't had so much fun shooting for a film in a very long time.\"\n(With agency inputs)", "description": "Anil Kapoor on Madhuri Dixit: We've Worked in 18 Films, Could Tell Each Other's Responses on Camera Anil Kapoor and Madhuri Dixit were last seen together in 2001 in Rajkumar Santoshi's Lajja. The two actors also starred in Kumar’s iconic 1992 hit Beta.", "authors": ["Isha Sharma"], "date_publish": "22/02/2019, 17:26:21"}