{"url": "https://www.indiatimes.com/entertainment/annu-kapoor-turns-63-deepika-padukone-acts-goofy-to-make-her-mom-smile-more-from-ent-362505.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/annu_kapoor_turns_63_deepika_padukone_plays_goofy_to_make_mom_smile__more_from_entertainment_1550664744_800x420.png", "title": "Annu Kapoor Turns 63, Deepika Padukone Acts Goofy To Make Her Mom Smile & More From Ent", "text": "1. Happy Birthday, Annu Kapoor! 9 Films That Prove He's The Most Undervalued Actor In Bollywood\nWhether it's reel or real life, Annu Kapoor has manged to make a mark in the showbiz industry. But it has a been a really long journey, almost 30 years. He started his journey with the famous Antakshari show on television.\n2. These Goofy Pics Of Deepika Padukone Trying To Make Her Mom Smile Will Turn Your Heart To Mush!\nThe pictures shared by Padukone were taken on the day of Sportstar Aces Awards last week, where Prakash Padukone was felicitated with a lifetime achievement award. Padukone captioned these pictures as: \"Trying to get her to smile... but she's such a natural.\"\n3. Shahid Kapoor To Play Dingko Singh, Cancer-Surviving Boxer Whose Unbelievable Story Inspired Mary Kom\nDon't Miss 5.3 K SHARES 44.2 K SHARES 2.6 K SHARES 5.1 K SHARES 419 SHARES\nAfter Priyanka Chopra played the role of Mary Kom in her biopic, now a biographical movie is being made on Dingko Singh as well. Shahid Kapoor is not only playing the lead role but is also producing the movie along with Raja Krishna Menon.\n4. Ajay Devgn Makes A Valid Point Around Star Kids, Asks Trolls To Judge Him But Spare His Kids\n\"Judge me, but don't judge my kids. Kajol and I are the actors, judge us...it's because of us, our children are under the spotlight every time. \"Being judgmental about someone is not a good thing. If I start passing judgement on someone, that person would obviously feel bad...so do my children. Honestly speaking, those people don't really matter. But I feel bad sometimes when my kids go through such harsh trolling.\" the actor said to IANS.\n“Imran has thrown a no ball .Every time they ask what makes you think its our doing . After the mumbai terrorist attack a pak TV anchor asked me why you are so sure it is Pakistan it can be any country I said fine I will give you 3 you choose one .Brazil , Sweden and Pakistan,” he tweeted.", "description": "From Annu Kapoor to Deepika Padukone, here is all that rocked the world of entertainment. Whether it's reel or real life, Annu Kapoor has manged to make a mark in the showbiz industry. But it has a been a really long journey, almost 30 years. He started his journey with the famous Antakshari show on television.", "authors": [], "date_publish": "20/02/2019, 18:00:44"}