{"url": "https://www.indiatimes.com/entertainment/arunachal-violence-hits-satish-kaushik-protesters-burn-his-5-theatres-as-he-narrowly-escapes-death-362772.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/arunachal_violence_hits_satish_kaushik_protestors_burn_his_5_theatres_as_he_narrowly_escapes_death_1551083942_800x420.png", "title": "Arunachal Violence Hits Satish Kaushik, Protesters Burn His 5 Theatres As He Narrowly Escapes Death", "text": "Protests in Arunachal Pradesh have turned violent against the government’s move to grant permanent residency certificates (PRCs) to certain categories of people. On Sunday, the protest spilled to the streets as a lot of protesters defied the curfew and set fire to the private residence of deputy chief minister Chowna Mein and ransacked the office of the deputy commissioner.\nActor Satish Kaushish has apparently also borne heat of the protests as five theatres he is associated with, have been burnt down too.\n1. This was how the venue of 1st @ItaFilmFestival went up in flames last night during widespread violence in #Itanagar that erupted during #PRC-related protests. The festival was called off and all guests were evacuated from hotel today. pic.twitter.com/fi4ovhK2BK — Utpal Borpujari (@UtpalBorpujari) February 23, 2019\n“I am associated with five theatres named Picture Time. I am a promoter. I got a call this (Saturday) morning from the owner, Sushil Choudhary, that our five theatres were burnt,” Satish Kaushik told IANS.\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\nHe was being evacuated to Guwahati along with 50 other delegates to the first Itanagar International Film Festival, which was cancelled after the violence erupted.\n“I reached yesterday (Friday) and went to the hotel. I was supposed to get ready for the evening function... But they (organisers) said 'hold on' there is some problem ... The event could not take place due to protests. The protesters were on a rampage and pelting stones. We couldn't make it to the convention centre.\n\"There was a fire. We got stuck. We thought we'd leave in the morning but we got stuck. We crossed the border with the help of an IAS officer. He sent people and about 10-12 vehicles for us. Then we crossed the (Arunachal Pradesh) border,” he added.\nWith inputs from IANS", "description": "Protests in Arunachal Pradesh have turned violent against the government’s move to grant permanent residency certificates (PRCs) to certain categories of people. On Sunday, the protest spilled to the streets as a lot of protestors defied the curfew and set fire to the private residence of deputy chief minister Chowna Mein and ransacked the office of the deputy commissioner. Actor Satish Kaushish h", "authors": ["Garima Satija"], "date_publish": "25/02/2019, 14:07:47"}