{"url": "https://www.indiatimes.com/entertainment/bring-back-abhinandan-farhan-akhtar-to-sushmita-sen-celebs-pray-for-iaf-pilot-s-safe-return-362900.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bring_back_abhinandan_farhan_akhtar_to_sushmita_sen_celebs_pray_for_iaf_pilots_safe_return_1551333210_800x420.png", "title": "Bring Back Abhinandan! Farhan Akhtar To Sushmita Sen, Celebs Pray For IAF Pilot’s Safe Return", "text": "After Indian Air Force’s (IAF) air strike at terrorist camps in Pakistan’s Balakot, Pakistan Air Force (PAF) intruded into Indian air force targeting military installations. Pakistan said that it carried out “\"strikes across Line of Control from within Pakistani airspace\", but “it was not retaliation or escalation”. They just wanted to demonstrate that they are fully prepared.\nWhen Indian airforce also retaliated to this, in the battle, Pakistani F-16 was downed by an IAF Mig 21 Bis aircraft, but IAF also lost a Mig-21. The Indian government confirmed that an Indian Air Force (IAF) Wing Commander piloting a MiG-21 fighter jet has not returned after Pakistan claimed that it had arrested IAF pilot Wing Commander Abhinandan.\namazonaws.com\nThe entire nation is praying for the pilot’s safe return, including Bollywood celebrities. Celebrities from the film world on Wednesday took to social media to pray for the Indian Air Force (IAF) Wing Commander Abhinandan who according to Pakistan is in their custody.\nWe are all praying for the safe return of Wing Commander Abhinandan Varthaman #IAF gratitude from the daughter of a retired Indian Airforce officer @fbhutto for choosing humanity first & a way to peace🙏 Dugga Dugga & God bless https://t.co/6ztsyV5Dss — sushmita sen (@thesushmitasen) February 27, 2019\nThoughts with #WingCommanderAbhinandan and his family. Hoping for his early and safe return. #IndianAirForce — Farhan Akhtar (@FarOutAkhtar) February 27, 2019\nDon't Miss 554 SHARES 8.9 K SHARES 2.1 K SHARES\nSuch courage, dignity , honor and grace under pressure. My thoughts are with you #WingCommanderAbhinandan #respect — Hrithik Roshan (@iHrithik) February 27, 2019\nThoughts and strength to #WingCommandarAbhinandan amd his familly....India stands tall and proud with you.... — Karan Johar (@karanjohar) February 27, 2019\nAs an Indian & as a concerned citizen I hope better sense prevails & sanity prevails human lives remain at stake... https://t.co/HwuIkCUt1y — Arjun Kapoor (@arjunk26) February 27, 2019\nHeartbreaking yet thought provoking the images of our #WingCommanderAbhinandan captured by Pakistani army. Yes emotions run high, yet all one can wonder, Is war really the road to peace here? Just pray that Abhinandan returns home peacefully and safe. — arjun rampal (@rampalarjun) February 27, 2019\nThe right thing to do Pakistan! Treating soldiers with respect is the humanitarian thing to do ... https://t.co/nzvsLglost — Huma Qureshi (@humasqureshi) February 27, 2019\nMy thoughts are with the family and colleagues of #WingCommanderAbhinandan\nHere's hoping he's back soon. And that our soldiers remain safe - because ultimately, it's their families that are affected and have to deal with the pain- the public moves on. — Gul Panag (@GulPanag) February 27, 2019\nThe video to be shared with the underlying message loud and clear. Immense respect for #WingCommanderAbhinandan’s exemplary valour and balance. What a true soldier. So proud. #RealHero https://t.co/MQWX7rokwI — Nimrat Kaur (@NimratOfficial) February 27, 2019\nWe are all praying for the safe return of Wing Commander Abhinandan Varthaman #IAF gratitude from the daughter of a retired Indian Airforce officer @fbhutto for choosing humanity first & a way to peace🙏 Dugga Dugga & God bless https://t.co/6ztsyV5Dss — sushmita sen (@thesushmitasen) February 27, 2019\n#India action was #counterterrorism no civilians hurt,no military personnel targeted/hurt,what #pakistan did is an act of war,they targeted military personnel,while no one wants war, #pakistan has aggravated the situation.Praying for #wingcommanderabhinandan safe return #jaihind — Celina Jaitly (@CelinaJaitly) February 27, 2019", "description": "The entire nation is praying for pilot Abhinandan Varthamam's safe return, including Bollywood celebrities. Celebrities from the film world on Wednesday took to social media to pray for the Indian Air Force (IAF) Wing Commander Abhinandan who according to Pakistan is in their custody.", "authors": ["Garima Satija"], "date_publish": "28/02/2019, 11:22:40"}