{"url": "https://www.indiatimes.com/entertainment/celebs/cine-workers-association-announce-a-total-ban-on-pakistani-actors-and-artists-in-bollywood-362341.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1550478216_800x420.jpg", "title": "Cine Workers Association Announce A Total Ban On Pakistani Actors And Artists In Bollywood", "text": "The country has witnessed the most shocking terror attack in a very long time. 44 CRPF personnel were killed in a bus on the Jammu-Srinagar highway by a terrorist on Thursday. The terrorist was driving a sedan which had 60 kg RDX that blew up in a 150-metre radius. The bomber detonated the explosives right next to bus.\nSince then, there has been an outburst against Pakistan after Jaish-e-Mohammad claimed it was their doing. While some want Pakistan to be declared as a terrorist state, others are cutting off all ties with the country.\nNavjot Singh Sidhu, has been sacked from The Kapil Sharma Show, after he said, only a handful of people are responsible for this and we should not blame the entire country. Such is the uproar in the country who have taken a pledge to not forget or forgive.\nAnd now All India Cine Workers have announced a complete ban of Pakistani artists working in Bollywood from here on. Here’s the official notice released by the top cinema body:\nDon't Miss 554 SHARES 3.7 K SHARES 8.9 K SHARES 2.1 K SHARES\nAll India Cine Workers Association announce a total ban on Pakistani actors and artists working in the film industry. #PulwamaAttack pic.twitter.com/QpSMUg9r8b — ANI (@ANI) February 18, 2019\nInfact, Maharashtra Navnirman Sena (MNS) has asked music label companies to stop working with Pakistani singers. \"We have verbally communicated to Indian music companies like T-Series, Sony Music, Venus, Tips Music etc to not work with Pakistani singers. These companies should stop it immediately or we will take action in our own style,\" Amey Khopkar, head of the MNS Chitrapat Sena told PTI.\nTwitter\nRecently, Bhushan Kumar's T-Series had collaborated with Rahat Fateh Ali Khan and Atif Aslam for two different singles. \"They have removed their songs (from the company's YouTube channel) post our warning,\" Khopkar added.\nLooks like this is not going to end anytime soon.", "description": "Recently, Bhushan Kumar's T-Series had collaborated with Rahat Fateh Ali Khan and Atif Aslam for two different singles. \"They have removed their songs (from the company's YouTube channel) post our warning,\" Khopkar added.Recently, Bhushan Kumar's T-Series had collaborated with Rahat Fateh Ali Khan and Atif Aslam for two different singles.", "authors": ["Saloni Singh"], "date_publish": "18/02/2019, 13:31:09"}