{"url": "https://www.indiatimes.com/entertainment/fan-pulls-drags-nawazuddin-siddiqui-by-his-neck-to-click-selfie-with-him-video-goes-viral-362793.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/fan_pulls__drags_nawazuddin_siddiqui_by_his_neck_to_click_selfie_with_him_video_goes_viral_1551159749_800x420.png", "title": "Fan Pulls & Drags Nawazuddin Siddiqui By His Neck To Click Selfie With Him, Video Goes Viral", "text": "Fan Pulls & Drags Nawazuddin Siddiqui By His Neck To Click Selfie With Him, Video Goes Viral\nFan Pulls & Drags Nawazuddin Siddiqui By His Neck To Click Selfie With Him, Video Goes Viral\nSome fans can go to any length to meet their idols or just to grab their attention, right? And in a country like India where actors are considered demi-gods and are worshipped literally, the obsession is quite crazy.\nWe have all heard stories of fans running from their home in quest to meet their favourite star, right? But what happened recently came as a shock to us too. In a video that is going viral, a fan can be seen pulling and dragging Nawazuddin Siddiqui in order to click a selfie with him. Without further ado, take a look!\nNawazuddin Siddiqui was in Kanpur when the incident took place. He has been shooting for his upcoming film Raat Akeli Hai. When he was mobbed, his security guards came to his rescue.\nMeanwhile, on work front, Nawazuddin Siddiqui and Sanya Malhotra starrer Photograph’s trailer was released last month. The movie has been winning applauses at international film festival and will be released in India soon. Nawazuddin recently also said that he doesn’t want his film to be released in Pakistan after the Pulwama attack.\nDon't Miss 944 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES\nRead More: After Pulwama Attack, Nawazuddin Siddiqui Says He Doesn’t Want His Film 'Photograph' To Release In Pakistan", "description": "Nawazuddin Siddiqui was in Kanpur when the incident took place. He has been shooting for his upcoming film Raat Akeli Hai. When he was mobbed, his security guards came to his rescue. In a video that is going viral, a fan can be seen pulling and dragging Nawazuddin Siddiqui in order to click a selfie with him. Without further ado, take a look!", "authors": ["Garima Satija"], "date_publish": "26/02/2019, 11:11:43"}