{"url": "https://www.indiatimes.com/entertainment/fans-demand-a-movie-on-wing-commander-abhinandan-want-ranveer-singh-to-play-him-on-the-big-screen-363230.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/fans_demand_a_movie_on_abhinandans_courage__bravery_want_ranveer_singh_to_play_his_role_1551852008_800x420.png", "title": "Abhinandan Varthaman:Fans Demand A Movie On Abhinandan’s Courage & Bravery, Want Ranveer Singh To Play His Role", "text": "Fans Demand A Movie On Wing Commander Abhinandan, Want Ranveer Singh To Play Him On The Big Screen\nFans Demand A Movie On Wing Commander Abhinandan, Want Ranveer Singh To Play Him On The Big Screen\nHe is a hero in real life. His dignity, courage and bravery deserve a salute from the entire nation. Abhinandan Varthaman is a man of honour who showed immense courage in front of his captors.\nAfter Wing Commander Abhinandan Varthaman, who was captured by Pakistan after his MiG-21 plane crashed on the Pakistan side of the Line of Control, returned to India, the entire country is in celebratory mode.\nFrom people naming their newborns after him to people wearing his gunslinger moustache, Abhinandan Varthaman has taken the entire country by storm. Abhinandan Varthaman’s gunslinger moustache has become the latest fashion trend. That’s how proud people are of him.\nDon't Miss 9 K SHARES 5.3 K SHARES 9.2 K SHARES 1.2 K SHARES 373 SHARES\nSo much so that some of them want a movie to be made on the Wing Commander life and bravery. They have already decided who would fit best in his role onscreen. Fans have proposed Ranveer Singh’s name! We would defiantly love to watch the movie, right?\n@RanveerOfficial Why don’t you try a Abhinandan style moustache. #AbhinandanMoustache — Pulkit Shah (@pulkitshahh) March 3, 2019\nYou should enact Abhinandan when his Bio/ Pulwama attack movie will be made — Police (@snjay0) March 3, 2019\nI propose that Ranveer Singh should play the role of #Abhinandan in the Bollywood movie about to be made - no one else can carry off that moustache.\nP.S.: And PLEASE! Not Salman Khan! — The Bad Doctor (@DOCTORATLARGE) March 1, 2019\nAny guesses who would play Abhinandan- Ranveer Singh — Deepak Rastogi (@dpakrastogi) March 5, 2019\n@RanveerOfficial You should totally inact Respectable WING COMMANDER #Abhinandan\nWe as public will be inspired to see his journey through you! — Mini (@Mini76541361) March 5, 2019\nAny guesses who would play Abhinandan- Ranveer Singh — Deepak Rastogi (@dpakrastogi) March 5, 2019\nRanveer Singh as Abhinandan? Too Mooch! https://t.co/Kt01cjFsmf — Deep Halder (@daipayanhalder) March 5, 2019\nMeanwhile, the grapevine is abuzz with rumours that Sanjay Leela Bhansali is making a movie on the Balakot airstrikes. Will he cast Ranveer Singh in the role of Abhinandan Varthaman? Only time will tell.", "description": "After Indian Air Force pilot Abhinandan Varthaman, who was captured by Pakistan after his MiG-21 plane crashed on the Pakistani side of the Line of Control, returned to India, the entire country is in the mood of celebration. So much so that some of them want a movie to be made on the Wing Commander life and bravery. They have already decided who would fit best in his role onscreen. Fans have pro", "authors": ["Garima Satija"], "date_publish": "06/03/2019, 11:40:05"}