{"url": "https://www.indiatimes.com/entertainment/celebs/forget-confirming-the-relationship-farhan-akhtar-drops-a-major-hint-about-his-shibani-dandekar-s-wedding-363231.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/farhan_and_shibani_1551851643_800x420.jpg", "title": "Farhan Akhtar:In April, We May: Farhan Akhtar Drops A Major Hint About His And Shibani Dandekar's Wedding!", "text": "Farhan Akhtar and Shibani Dandekar might not have given any official confirmation on their relationship status but their social media PDA says it all. Be it their pictures together or his valentine's poem for his ladylove Shibani, they have confirmed it without actually saying the words.\nLove is in the air for Farhan and Shibani and their frequent vacays, public appearances and social media PDA have said it all! While the couple is spending most of their time together, several news reports claimed that they are planning to tie the knot soon.\nWhen a leading newspaper asked Shibani if she was in a relationship with Farhan, she chose to neither confirm or deny the news. She said,\nDon't Miss 3.8 K SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES\n\"I am not secretive, but I don't feel the need to say things out loud. I don't need to make an announcement about who I'm dating. It's up to me to decide when and what I want to share about my personal life, and it is up to the audience to decide how they look at it. How much information I want to put out in the public domain is my prerogative.\"\nA few months ago, a news report had quoted a source close to a couple saying,\n\"They are extremely serious about each other and Farhan's kids have also warmed up to Shibani, so this looks like the most obvious step for the two.\"\nAfter all the cryptic interviews, looks like Shibani and Farhan are serious about taking the next step together!\nInstagram\nFarhan appeared on Film Companion's Tapecast along with Bhumi Pednekar, where he dropped a major hint on his wedding. Bhumi played a Do-Not-Play cassette for Farhan, where Shibani asked when they're getting married.\nApart from laughing at the question, he added,\nInstagram\n\"She's just having fun with all the rumours going around. I don't know it maybe April or April may be May.\"\nReports also claim that the couple will opt for a private christian ceremony.", "description": "Love is in the air for Farhan and Shibani and their frequent vacays, public appearances and social media PDA have said it all! While the couple is spending most of their time together, several news reports claimed that they are planning to tie the knot soon.", "authors": ["Isha Sharma"], "date_publish": "06/03/2019, 11:47:35"}