{"url": "https://www.indiatimes.com/entertainment/former-students-alia-bhatt-varun-dhawan-to-shake-a-leg-with-tiger-shroff-ananya-panday-in-student-of-the-year-2_-362941.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/alia_bhatt_1551351498_800x420.jpg", "title": "Former Students Alia Bhatt, Varun Dhawan To Shake A Leg With Tiger Shroff & Ananya Panday In Student Of The Year 2", "text": "Former Students Alia Bhatt, Varun Dhawan To Shake A Leg With Tiger Shroff & Ananya Panday In Student Of The Year 2\nFormer Students Alia Bhatt, Varun Dhawan To Shake A Leg With Tiger Shroff & Ananya Panday In Student Of The Year 2\nStudent Of The Year 2 couldn’t get this bigger. It will have the original batch students Alia Bhatt and Varun Dhawan shaking a leg with the new students Tiger Shroff and Ananya Panday. Yes!\nInstagram\nEver since the news is out, SOTY fans cannot contain their excitement to watch these sizzling 4 students together on the big screen.\nTwitter\nA source close to Mumbai Mirror reveals, “Farah Khan will be choreographing the song which only features Alia and the film’s team is figuring out ways to incorporate her co-stars from the first film, Varun and Sidharth, in the sequel. Both the actors are expected to shoot their portions in the coming weeks too. Alia and Tiger’s song will be shot over one week on a grand set that is being put up at a suburban studio.”\nDon't Miss 8.9 K SHARES 1.2 K SHARES 2.4 K SHARES 6.1 K SHARES 2.3 K SHARES\nWell, Alia and Varun share a great bond with each other and they look killer together, while Alia is not very comfortable with Siddharth Malhotra due to obvious reasons.\nTwitter\nAlia and Sid parted their ways and now the actress is dating Ranbir Kapoor and apparently, Siddharth is in a relationship with the new student Tara Sutaria. We hope they let their bygones be bygones and have a rocking reunion.", "description": "Student Of The year couldn’t get this bigger; it will have the original batch students Alia Bhatt and Varun Dhawan dancing with the new students Tiger Shroff and Ananya Panday. Yes! Ever since the news is out SOTY fans cannot contain their excitement to watch these sizzling 4 students together on the big screen. A source close to Mumbai Mirror reveals, “Farah Khan will be choreographing the", "authors": ["Manisha Mandal"], "date_publish": "28/02/2019, 16:16:12"}