{"url": "https://www.indiatimes.com/entertainment/from-khans-to-deepveer-reddit-user-spills-secrets-of-bollywood-celebs-we-re-shook-362807.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/this_reddit_user_exposes_aeroplane_secrets_of_bollywood_stars_1551170322_800x420.png", "title": "From Khans To DeepVeer, Reddit User Spills Secrets Of Bollywood Celebs & We’re Shook!", "text": "How is the life of a superstar? It looks so fascinating from the outside – all glitz and glamour – but not many people what know lies underneath the whole starry and glamourous image.\nIn a country like India where movie stars are considered demi-gods and are worshipped, it would be hard to believe how they are in real life.\nA Reddit user, who is a security manager for VIPs at Chhatrapati Shivaji airport, recently revealed how it is like to meet celebrities in real life. Do they throw tantrums? A lot of them. Read on!\n#1 Deepika Padukone and Ranveer Singh are mostly on their phones when they are together!\nDon't Miss 554 SHARES 8.9 K SHARES 907 SHARES 3.1 K SHARES 248 SHARES\n#2 Shahid Kapoor's wife Mira Rajput is an angry woman with \"ridiculous\" demands.\n#3 Sara Ali Khan and Janhvi Kapoor are good, but Sridevi's younger daughter Khushi rolls her eyes.\n#4 Vicky Kaushal is a gentleman in real life as well!\n#5 Jaya Bachchan is grumpy. Granddaughter Navya often throws 'Do you know who I am?'\n#6 Ranveer is always high on energy!\n#7 Kartik Aryan passes crude jokes!\n#8 Pankaj Tripathi AKA Kaaleen Bhaiya is \"bade dil wala\"!\n#9 Saif Ali Khan and Kareena Kapoor behave \"aloof\", and as you may have expected, Taimur Ali Khan is adorable!\n#10 Salman Khan throws tantrums even when he is the one who is late.\n#11 This one is a clear hint that Arjun Kapoor and Malaika Arora are dating, but they want to keep the secret safe.\n#12 Ranbir Kapoor is a charmer!\n#13 Rekha is unrecognisable without makeup!\n#14 Kapil Sharma is arrogant!\n#15 Jacqueline Fernandez is sweet but she has a lot of demands.\n#16 Ayushmann Khurrana is a sweet-heart!\n#17 Is Kangana mental, someone asked? Here's the answer!\n#18 Priyanka Chopra and Nick Jonas give each other their own space!\n#19 They are celebrities, after all. They can be tired too sometimes. They need their personal space, don't they?\nWhich one was most surprising for you? Tell us in the comments section below.", "description": "How is the life of a superstar? It looks so fascinating from the outside – all glitz and glamour – but not many people know what hides beneath the face that has a blind massive following all across the world. In a country like India where movie stars are considered demi-gods and are worshipped, it would be hard to believe how they are in real life.", "authors": ["Garima Satija"], "date_publish": "01/03/2019, 11:25:24"}