{"url": "https://www.indiatimes.com/entertainment/celebs/gully-boy-actor-vijay-varma-opens-up-on-how-he-was-awestruck-by-ranveer-singh-s-commitment-362419.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1550572152_800x420.jpg", "title": "Gully Boy Actor Vijay Varma Opens Up On How He Was Awestruck By Ranveer Singh's Commitment", "text": "Gully Boy is a film that doesn't just belong to its lead actors Ranveer Singh and Alia Bhatt but each and every character in the film deserves as much love and adulation as them.\nZoya Akhtar and Kagti's film is not just about a boy's journey of breaking the glass ceiling and coming out from his circumstantial turbulence but it's about an internal journey of each and every character. In the film, Moeen is one of the most important characters.\nTwitter\nPlayed by Vijay Varma, the character sees its ups and downs in life but his friendship with Murad is consistent and endearing.\nInstagram\nThey have a few fights and arguments on some issues but the jail scene makes up for all the mess that their friendship faces.\nDon't Miss 9 K SHARES 1.2 K SHARES 24.3 K SHARES 17 K SHARES\nTogether, Murad-Moeen are a dream-team. Vijay Varma is receiving a lot of praise for his role because of the rawness he has managed to add to his character.\nHe is as real as it could get and even when most of his ways in life are unfair and illegal, your heart still goes out for him.\nIn a recent interview with Zoom TV, he got into the details of making the character of Moeen alive on the silver-screen, his camaraderie with Ranveer Singh and how they most contributed in making their performance realistic and appealing.\nTalking about Ranveer Singh's commitment towards the project, Varma said,\n\"I was awestruck by his commitment, he was so committed to his part, I didn't see the party animal in Ranveer Singh. I didn't see it for once and I am being completely honest. I saw that Ranveer Singh on the wrap party, the crazy Ranveer Singh with energy. On the sets, he was just Murad. Totally introvert, into himself, extremely inhibited, just trying to channelise all his energy inward. So beautiful to see, so pleasant on the sets. He was invisible.\"\nVijay further added that Ranveer Singh wasn't willing to get any attention from the people of Dharavi. He said,\n\"We were shooting in Dharavi surrounded by 5000 people peeping out of their windows, doors. They look at Ranveer for some time and later started looking away from him for other things, just because he didn't want any attention.\"\nHe further spilled the beans on how Ranveer contributed as an actor to make both the characters extremely believable. He said,\nExcel Entertainment\n\"He was a delight to work with and I think he is the most generous co-actor to work with and I have worked with the finest before. His understanding of the script, his involvement in the script, and he would never give instructions to his co-actor. He'll do his bit and let the director do their bit. And because there was a great amount of camaraderie between us in on set and off-set and while we were trying to understand the dynamics between them. He felt that Moeen's characterr status has to be up throughout and only then Murad's becoming something will make sense.\"\nWith the kind of sincerity Varma as shown as Moeen, we see a bright future ahead of him!\n(Also read: Gully Boy's Dialogue Writer Explains How Alia-Ranveer Brought Murad-Safeena To Life In The Film)", "description": "Zoya Akhtar and Kagti's film is not just about a boy's journey of breaking the glass ceiling and coming out from his circumstantial turbulence but it's about an internal journey of each and every character. In the film, Moeen is one of the most important characters. Played by Vijay Varma, the character sees its ups and downs in life but his friendship with Murad is consistent and endearing.", "authors": ["Isha Sharma"], "date_publish": "19/02/2019, 15:25:03"}