{"url": "https://www.indiatimes.com/entertainment/celebs/interesting-facts-about-gully-boy-kareena-talks-about-spotlight-on-taimur-and-more-from-ent-362624.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/top_trending_news_1550837567_800x420.jpg", "title": "Interesting Facts About Gully Boy, Kareena Talks About Spotlight On Taimur And More From Ent", "text": "Interesting Facts About Gully Boy, Kareena Talks About Spotlight On Taimur And More From Ent\nInteresting Facts About Gully Boy, Kareena Talks About Spotlight On Taimur And More From Ent\nShe said, “We view it as something socially irresponsible because we have been such good parents, we haven’t shied away, we never hid Taimur’s face. In Hollywood, they don’t allow children’s faces to come (publish). But because Saif and I took the modern approach, we can’t do that.”\nWell, there are multiple stories and anecdotes that have been revealed by the cast and crew of the film that prove that there is a lot that went behind making this over-ambitious film a reality-and a beautiful one at that. Read on!\nInstead of shying away from the media, both Farhan and Shibani are very comfortable in posing for media and they made an official confirmation on the same when they arrived at DeepVeer reception in Mumbai holding hands.\nDon't Miss 9 K SHARES 1.2 K SHARES 24.3 K SHARES 17 K SHARES\nDhairya was last seen as Captain Sartaj Singh Chandok in Vicky Kaushal and Yami Gautam starrer recent blockbuster Uri.\nSet in Kashmir, the romantic-drama film is produced by Salma Khan, Khetani and Ashwin Varde and it is slated to release on March 29.\n\"Kabir Singh\", directed by Sandeep Vanga, is a remake of his own directorial Telugu language film \"Arjun Reddy\" (2017). Jointly produced by Cine1 Studios and T-Series, the film stars Shahid and Kiara Advani in the lead. It releases on June 21.", "description": "Kareena said, “We view it as something socially irresponsible because we have been such good parents, we haven’t shied away, we never hid Taimur’s face. In Hollywood, they don’t allow children’s faces to come (publish). But because Saif and I took the modern approach, we can’t do that.”", "authors": ["Isha Sharma"], "date_publish": "22/02/2019, 18:31:21"}