{"url": "https://www.indiatimes.com/entertainment/ironic-after-rape-accusation-alok-nath-to-play-a-judge-in-a-movie-based-on-metoo-movement-362974.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/after_rape_accusation_alok_nath_to_play_judge_in_a_movie_based_on_the_metoo_movement_1551423820_800x420.png", "title": "Ironic? After Rape Accusation, Alok Nath To Play A Judge In A Movie Based On #MeToo Movement!", "text": "It couldn’t have been more ironical than this. Alok Nath, who was hailed as the most Sanskari man in Bollywood (mainly because of the roles he played), was accused of rape by one of his colleagues Vinta Nanda last year, leaving everyone in shock. People took a lot of time to digest this very fact, but now what has been revealed is even more surprising.\nAccording to the latest reports, in his forthcoming movie, Alok Nath will be seen playing the role of a judge. The man who is himself fighting the legal battle after #MeToo accusation will play a judge in the forthcoming movie. What’s more? The movie is based on the #MeToo movement, it is said.\nWondering why was he cast in the role? It said that the movie was shot before the sexual harassment allegations were levied on Alok Nath. The movie is titled #MainBhi.\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\n“I’m not doing any films at the moment. This was something I shot for a while ago. Is there a problem? You sound sad that I’m doing a film. It’s a puny role for poor producers, let it release,” the 62-year-old actor told Mirror.\nin.com\nUnbelievable. Alok Nath, accused of rape, is playing a judge in a film titled ‘Main Bhi’ or ‘Me Too’. Let that sink in. He told the paper “you seem unhappy” that he is doing this role.\nNot only are we letting down survivors, we are mocking them. https://t.co/cHDTXMEoC4 — #MeTooIndia (@IndiaMeToo) March 1, 2019\nAppealing to you @sushant_says and @CintaaOfficial to take cognisance of the voices of four women who have spoken up against this man, ask the film's production house why it is platforming Nath. CINTAA should release a statement officially condemning this. Please stand with women — #MeTooIndia (@IndiaMeToo) March 1, 2019\nSo let's also address the \"innocent until proven guilty\" which has and will come up in responses. In this case there's an FIR and due process is being followed. Alok Nath has access to lawyers and the entire judicial recourse in addition to social capital and public sympathy. — #MeTooIndia (@IndiaMeToo) March 1, 2019\nHis access to legal recourse has not been taken away and he will continue to have his day in court. But when men accused by multiple women of predatory behaviour continue to get work while the case is being heard.... — #MeTooIndia (@IndiaMeToo) March 1, 2019\n....it sends the message that women's lived experiences (in present or past) is lesser than the man's social capital. That their voices do not matter. While a boycott is never a solution, the platforms that give such a man work need to be questioned and pressured and called out. — #MeTooIndia (@IndiaMeToo) March 1, 2019\nInterestingly, Alok Nath was accused of rape by Vinta Nanda who worked with him on the TV show Tara. According to her, the incident took place 20 years ago when the show was running on TV. Post her accusation, Himani Shivpuri and Sandhya Mridul had also accused Alok Nath of sexual misconduct, but he denied the claims.", "description": "According to the latest reports, in his forthcoming movie, Alok Nath will be seen playing the role of a judge. The man who is himself fighting the legal battle after #MeToo accusation will play a judge in the forthcoming movie. What’s more? The movie is based on the #MeToo movement, it is said.", "authors": ["Garima Satija"], "date_publish": "01/03/2019, 12:41:23"}