{"url": "https://www.indiatimes.com/entertainment/kit-harington-thinks-game-of-thrones-screwed-political-landscape-says-people-tried-to-be-joffrey-363283.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kit_harington_thinks_game_of_thrones_screwed_political_landscape_says_people_tried_to_be_joffrey_1551874711_800x420.jpg", "title": "Kit Harington Thinks Game Of Thrones ‘Screwed Political Landscape’, Says People ‘Tried To Be Joffrey'", "text": "Kit Harington recently appeared on The Late Show to chat with host Stephen Colbert about the forthcoming season of Game Of Thrones. Of course, he didn’t give away any spoilers. However, he said that he thinks the current times are emulating 'Game of Thrones'.\nKit Harington fears that the political scenario of the recent times has somewhat started resembling the plotline of his hit fantasy series Game of Thrones, about the power struggle among seven warring kingdoms as they ignore threats from an immortal enemy.\nRife with treachery and passion to possess the coveted Iron Throne, politics and propaganda are the driving themes in the HBO series.\nThe actor, who stars as the fan favourite character, Jon Snow, was asked by late-night show host Stephen Colbert about Game of Thrones being a \"big culture definer for the 2010s\".\nDon't Miss 863 SHARES 1.6 K SHARES 421 SHARES 5.3 K SHARES\n\"So we can blame you for where we are right now,\" Colbert joked in an oblique reference to contemporary US politics, to which Harington agreed and said King Joffrey (one of the most hated villains on the show) may have been an inspiration for some politicians.\n\"I got this theory that we kind of screwed the political landscape,\" the actor said, adding that it seems as if the current times are emulating the show.\nI just felt like certain political figures tried to emulate (King) Joffrey and things went a bit wrong,\" Harington said.\nIn a dig at US President Donald Trump, Colbert added, \"Got the hair.\" Game of Thrones, based on the books by GRR Martin, returns for its final season on April 14.\nInputs From PTI", "description": "Kit Harington fears that the political scenario of the recent times has somewhat started resembling the plotline of his hit fantasy series \"Game of Thrones\", about the power struggle among seven warring kingdoms as they ignore threats from an immortal enemy. Rife with treachery and passion to possess the coveted Iron Throne, politics and propaganda are the driving themes in the HBO series. The act", "authors": [], "date_publish": "06/03/2019, 17:32:09"}