{"url": "https://www.indiatimes.com/entertainment/hollywood/luke-perry-star-of-90-s-show-beverly-hills-90210-passes-away-at-52-hollywood-mourns-363158.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/luke_perry_1551765258_800x420.jpg", "title": "Luke Perry, Star Of 90's Show 'Beverly Hills, 90210', Passes Away At 52; Hollywood Mourns", "text": "The world is crestfallen with the death of actor Luke Perry, the star of hit 90's television show \"Beverly Hills, 90210\". The actor was hospitalised last week after he suffered a massive stroke at his home in Sherman Oaks, a wealthy suburb of Los Angeles. He was kept under observation.\nAgencies\nPerry's representative Arnold Robinson told The Hollywood Reporter that the actor was surrounded by his family members at the time of his death.\nreuters\n\"He was surrounded by his children, Jack and Sophie; fiancee, Wendy Madison Bauer; ex-wife, Minnie Sharp; mother, Ann Bennett; stepfather, Steve Bennett; brother, Tom Perry; sister, Amy Coder; and other close family and friends,\" said Robinson.\n\"The family appreciates the outpouring of support and prayers that have been extended to Luke from around the world, and respectfully request privacy in this time of great mourning. No further details will be released at this time,\" he added.\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\nThe actor's hospitalisation coincided with the day Fox announced the reboot of \"Beverly Hills 90210\" with the original cast scheduled for a reappearance, though Perry was not believed to return.\nPerry was born as Coy Luther Perry to Ann Bennett and Coy Luther Perry Jr, a steelworker, on October 11, 1966 in Ohio.\nreuters\nBefore becoming an actor, Perry worked in an asphalt paving company. His earliest roles were in \"Loving\" (198788) and \"Another World\" (198889).\nIn his breakout show \"Beverly Hills\", which ran from 1990 to 2000, Perry played the brooding, suave high school student Dylan McKay.\nThe series followed the lives and romantic entanglements of a group of teenagers living in an affluent area of Los Angeles. The role made him a global superstar and a teenage idol.\n\"I'm going to be linked with him until I die, but that's actually just fine. I created Dylan McKay. He's mine,\" Perry was once quoted as saying about his career-defining role.\nThe actor's most recent stint was on The CW's comic book adaptation \"Riverdale\", in which he portrayed Fred Andrews, the father of show's protagonist Archie Andrews.\nHis last cinematic outing would be Quentin Tarantino's ninth directorial \"Once Upon a Time in Hollywood\", starring Leonardo DiCaprio and Brad Pitt in the lead. The film will release in July this year.\nShortly after the news of his death broke, Perry's \"90210\" co-stars -- Ian Ziering, Jennie Garth, Shannon Doherty and Gabrielle Carteris -- were among the first to pay tributes to the actor.\nreuters\n\"Dearest Luke - I am so heart broken and at a loss for words. You my friend were a mighty soul and have left your mark. My love and prayers to the family and all who loved you. RIP,\" Carteris wrote on Twitter.\nZiering posted a photo of himself with Perry on Instagram and captioned it, \"Dearest Luke, I will forever bask in the loving memories we've shared over the last thirty years.\"\n\"May your journey forward be enriched by the magnificent souls who have passed before you, just like you have done here for those you leave behind. God please give him a seat close to to you, he deserves it,\" he added.\nIn a statement to Entertainment Weekly, Garth said she is feeling heartbroken.\"He meant so much to so many. Such a very special person. I share my deep sadness with his family and all who loved him. Such a terrible loss,\" she added.\nDoherty said, \"I am in shock. Heartbroken. Devastated by the loss of my friend. I have so many memories with Luke that make me smile and that are forever imprinted on my heart and mind.\"\nRiverdale/Screengrab\nActors Sarah Michelle Geller, Rosario Dawson and DiCaprio also condoled Perry's death.\n\"Luke Perry was a kindhearted and incredibly talented artist. It was an honour to be able to work with him. My thoughts and prayers go out to him and his loved ones,\" DiCaprio posted on Twitter.\nGeller, who starred in TV show \"Buffy the Vampire Slayer\", based on Perry's 1992 horror comedy of the same name, shared a photo of hers with the actor on Instagram.\n\"My entire high school experience was shaped by Brenda and Dylan. Now I have to hold my dear friend @theshando hand, while she mourns the loss of #lukeperry This is not how it's supposed to happen. I hope his family knows many lives he touched. 'I chose. I chose you. I want you. I've always wanted you' - my favourite quote,\" she wrote in the caption.\nDawson tweeted, \"Luke Perry. My teen crush. I'm glad I got to tell you. Sheepishly red faced and all. You were lovely and you gave great hugs. Grateful to witness and experience your kindness and warmth. #RestInPeace love. Blessings to your family.\"\n\"Riverdale\" creator Roberto Aguirre-Sacasa described Perry as \"a father, brother, friend and mentor\". \"So heartbroken about Luke. He was a father, brother, friend, and mentor. Each night before he had to shoot a scene, he'd call me and we'd talk about... Everything. I will miss those calls. And my heart goes out to all his family and friends,\" he wrote.\nMeanwhile, the production on the next season of \"Riverdale\" was halted in the wake of Perry's death.\nRead some more heartbreaking tributes that poured from all over the world:\nSaddened by the death of #LukePerry. He was kind, generous, and very humble. Rare qualities for someone as enigmatic, talented, and successful as Luke. My thoughts and prayers are with his family. — Chad Lowe (@ichadlowe) March 4, 2019\nSorry to hear about the passing of Luke Perry, he was always such a good guy and a gentleman... — Mark McGrath (@mark_mcgrath) March 4, 2019\nIt’s so sad to hear that actor Luke Perry has passed. Condolences to his family , his wife and two children.\nR.I.P brother. You’ll be very missed by us all. — Aiden Turner (@aidenturner) March 4, 2019\nWhat a sad loss. RIP Luke Perry, my onscreen husband & baby daddy, and a true blue good ol’ boy in real life. You were taken waaaay too soon. 🕊💔 #lukeperry #rip pic.twitter.com/VdfVXt6OqF — Elaine Hendrix (@elaine4animals) March 4, 2019\nMy friend Luke Perry has left us. I will miss you.\nWe are all here for such a short time. We need to love each other and have compassion. That is all. And that’s all it’s ever been. — Steven Weber (@TheStevenWeber) March 4, 2019\nReally sad to hear about Luke Perry:( My thoughts are with his loved ones. He was one of the nice people #rip #lukeperry — Barry Watson (@realBarryWatson) March 4, 2019\nSuper sad to hear the news about actor Luke Perry. Interviewed him several times, always such a lovely gentleman. Great guy. God bless him and his family. pic.twitter.com/YZq59joDK3 — Maria Shriver (@mariashriver) March 4, 2019\nDear Liuke ..love love and my heart is so sad I’m sending love to your family and Alexis is waiting for you ,you will laugh and dance God bless you 🙏🏿🙏🏿🙏🏿😇 — Rosanna Arquette (@RoArquette) March 4, 2019\nLuke Perry was one of the nicest, most genuine, loveliest people I have met working in this town. He was kind and vibrant and full of stories that he loved to share. He was a beautiful being and this is a sad, sad day. — Julie Plec (@julieplec) March 4, 2019\nInto the Light, Luke Perry.\nOne of the best....#RedWing pic.twitter.com/Qoov2wcpar — Frances Fisher (@Frances_Fisher) March 4, 2019\nInputs From PTI", "description": "The world is crestfallen with the death of actor Luke Perry, the star of hit 90's television show \"Beverly Hills, 90210\". The actor was hospitalised last week after he suffered a massive stroke at his home in Sherman Oaks, a wealthy suburb of Los Angeles. He was kept under observation.", "authors": [], "date_publish": "05/03/2019, 10:29:37"}