{"url": "https://www.indiatimes.com/entertainment/celebs/malaika-arora-opens-up-about-her-divorce-explains-why-it-s-important-for-women-to-date-again-362435.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/malaika_1550580267_800x420.jpg", "title": "Malaika Arora Opens Up About Her Divorce & Explains Why It's Important For Women To Date Again", "text": "Malaika Arora Opens Up About Her Divorce & Explains Why It's Important For Women To Date Again\nMalaika Arora Opens Up About Her Divorce & Explains Why It's Important For Women To Date Again\nAfter her divorce with Arbaaz Khan, Malaika Arora is in a happy space and she is reportedly dating actor Arjun Kapoor. Be it her divorce or her relationship with Arjun Kapoor, Malaika has dealt with every decision in her life very gracefully.\nMalaika appeared on Kareena Kapoor Khan's radio show Ishq FM where she opened up on her divorce and revealed how she was advised by people to not go ahead with the decision. She said,\n“Nobody really encourages you to go right ahead. Even the night before the divorce, I had my family sit with me and ask me, are you sure? I heard this all along and perhaps rightly so because these are people who worry and care for you.”\n(Also read: Malaika's Spain Trip Is A Full On Fam-Jam And It Proves Not All Celebrity Divorces Are Messy!)\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\nShe further added that there were people who called her a ‘brave woman’ and those who were proud of her decision. “That made me really happy.” She adds,\n“If you are in an unhappy marriage and that’s what you decide to do you should do it with a lot of dignity, self-respect. Don’t let anybody tell you that you are any less of a woman. With me, I could sense that a lot of people were like, how the hell did you pull it off?”\nShe explains that it's comparatively easier for men to move on with their lives post divorce than women. She adds,\n“It’s the biggest disparity there is among all the other disparities there are which women have to face. It’s never easy. As humans we start to blame other people. But for me, happiness is the most important. Arbaaz and I weighed pros and cons, we thought about a lot of things and then arrived at that decision. We just realised we’ll be better people because together we were just making each other and everybody around us really unhappy.”\nTalking about moving on and why women should get into the dating scene again, Malaika said,\n“It’s not impossible. Swipe left, right, whatever it might be! Have fun! For the first time in your life, you will also discover a kind of freedom. To be in a bed all alone is also a new feeling!”", "description": "After her divorce with Arbaaz Khan, Malaika Arora is in a happy space as she is reportedly dating actor Arjun Kapoor. Malaika appeared on Kareena Kapoor Khan's radio show Ishq FM where she opened up on her divorce and revealed how she was advised by people to not go ahead with the decision.", "authors": ["Isha Sharma"], "date_publish": "19/02/2019, 17:29:06"}