{"url": "https://www.indiatimes.com/entertainment/oscars-2019-india-based-period-end-of-sentence-wins-best-documentary-short-award-362739.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscars_2019_indiabased_period_end_of_sentence_wins_best_documentary_short_1551064601_800x420.png", "title": "Oscars 2019: India-based 'Period. End of Sentence' Wins Best Documentary Short Award", "text": "Breaking taboos, a film based on menstruation has just won an Oscar. Period. End of Sentence, a documentary that tackles the stigma around menstruation in rural India, is available on Netflix.\nThe 26-minute film revolves around a group of women who use a new machine in order to create low-cost sanitary pads so that women in their village can be financial independent and at the same time improve their feminine hygiene.\ndocumentary.org\nThe movie was directed by 25-year-old filmmaker Rayka Zehtabchi and produced by Guneet Monga. What’s interesting here is that a woman director has won the award, which is rare.\nDon't Miss 162 SHARES 253 SHARES 335 SHARES 24.3 K SHARES 17 K SHARES\n“I can't believe a film about menstruation just won an Oscar... A period should end a sentence, not a girl's education,” said an elated filmmaker Rayka Zehtabchi as she picked up the award for Best Documentary Short for Period: End Of Sentence.\nPeriod. End of Sentence taboo gives viewers a sneak peek into the taboos surrounding menstruation in rural India as many girls drop out of school when their hit puberty because of their periods.\nTwitter is overwhelmed by the love and honour the movie is getting.\n“A period should end a sentence not a girls education” ❤️ #oscars — Joey King (@JoeyKing) February 25, 2019\n“I’m not crying because I’m on my period or anything! I can’t believe a film about menstruation just won an Oscar!” — Emily Nussbaum (@emilynussbaum) February 25, 2019\n“I’m not crying because I’m on my period...” is the new standard by which all opening sentences of acceptance speeches should be judged. — Stephen Amell (@StephenAmell) February 25, 2019\nPERIOD. END OF SENTENCE!!!!!! OMFG I LOVE WOMEN — Madeline Brewer (@madkbrew) February 25, 2019", "description": "Breaking taboos, a film based on menstruation has just won an Oscar. Period. End of Sentence, a documentary that tackles the stigma around menstruation in rural India, is available on Netflix. The 26-minute film revolve around a group of women who use a new machine in order to create low-cost sanitary pads so that women in their village can be financial independent and at the same time improve t", "authors": ["Garima Satija"], "date_publish": "25/02/2019, 08:44:17"}