{"url": "https://www.indiatimes.com/entertainment/oscars-2019-period-end-of-sentence-wins-lady-gaga-bradley-s-performance-is-all-love-more-from-ent-362790.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscars_2019_1551098528_800x420.jpg", "title": "Oscars 2019: Period. End Of Sentence Wins, Lady Gaga & Bradley's Performance Is All Love & More From Ent..", "text": "Twitter\nAn India-based film on menstruation won an Oscar. Period. End of Sentence, a documentary that tackles the stigma around menstruation in rural India, is available on Netflix.\nLook who stopped by the #Oscars Thank You Cam, presented by @Cadillac! Best Documentary Short winners for Period. End of Sentence. #KeepRising pic.twitter.com/NssJfSPkI3 — The Academy (@TheAcademy) February 25, 2019\nIndia-based documentary Period. End Of Sentence won an Oscar earlier today and has since found itself being discussed both online and offline. The cast and crew of the film too were pleasantly surprised to win this prestigious award. Bollywood celebrities including Vicky Kaushal and Priyanka Chopra congratulated the cast and crew on the victory.\n1. This was how the venue of 1st @ItaFilmFestival went up in flames last night during widespread violence in #Itanagar that erupted during #PRC-related protests. The festival was called off and all guests were evacuated from hotel today. pic.twitter.com/fi4ovhK2BK — Utpal Borpujari (@UtpalBorpujari) February 23, 2019 Don't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\nProtests in Arunachal Pradesh have turned violent against the government’s move to grant permanent residency certificates (PRCs) to certain categories of people. On Sunday, the protest spilled into the streets as protesters defied curfew and set fire to the private residence of Deputy Chief Minister Chowna Mein, and ransacked the office of the Deputy Commissioner. Actor Satish Kaushish has apparently also borne heat of the protests as five theatres he is associated with, have been burnt down.\nTwitter\nSomethings are too good to be true and honestly, watching Lady Gaga and Bradley Cooper perform their hit 'Shallow' at the Oscars 2019 was one such thing. Their chemistry on the stage was absolutely lit.\nWE WON!!! To every girl on this earth... know that you are a goddess... if heavens are listening... look MA we put @sikhya on the map ❤️ — Guneet Monga (@guneetm) February 25, 2019\nIt’s a proud day for every Indian who’s passion is cinema as we made it to Oscars 2019, and even won the award. Guneet Monga the producer of Period. End of Sentence won the Best Documentary Short Film and we couldn't be more proud.", "description": "Oscars 2019: India-based 'Period. End of Sentence' Wins Best Documentary Short Award Breaking taboos, a film based on menstruation has just won an Oscar. Period. End of Sentence, a documentary that tackles the stigma around menstruation in rural India, is available on Netflix. Oscars 2019: From Priyanka Chopra To Vicky Kaushal, Bollywood Is Celebrating The Win Of Period. End Of Sentence India-b", "authors": ["Manisha Mandal"], "date_publish": "25/02/2019, 18:31:50"}