{"url": "https://www.indiatimes.com/entertainment/celebs/oscars-2019-here-s-the-complete-list-of-winners-at-the-91st-academy-awards-362703.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscars_1551073531_800x420.jpg", "title": "Oscars 2019: Here's The Complete List Of Winners At The 91st Academy Awards", "text": "Oscars 2019: Here's The Complete List Of Winners At The 91st Academy Awards\nOscars 2019: Here's The Complete List Of Winners At The 91st Academy Awards\nOscars are the most coveted award shows across the globe. Whether it's foreign language films, animated cinema or short films, this is one such platform that recognises talent from all corners. And this year was no different.\nFrom fresh talent to legendary artists, 2019 Academy Awards had an interesting line up of winners. The show which was held in Dolby Theatre, was a unique one in a lot of ways, This was a first show that had no host.\nFrom Queen's electrifying performance to Lady Gaga-Bradley Cooper's Shallow performance, Oscars was mesmerising like always.\nThe list of winners too pleasantly surprised the audience. While Green Book took home the Best Picture award, Rami Malek whisked away the Best Actor award for Bohemian Rhapsody. An India based film Period too made its way into Oscars in the short Documentary movie category and emerged victorious.\nHere's taking a look at the complete winners list from Oscars 2019.\nBest Picture: \"Green Book\"\nBest Director: Alfonso Cuaron for \"Roma\"\nBest Actress: Olivia Colman for \"The Favourite\"\nOlivia Colman is blown away as she accepts her Best Actress Award for her performance in @the_favourite. #Oscars pic.twitter.com/4oQAUUv19Y — The Academy (@TheAcademy) February 25, 2019\nBest Actor: Rami Malek for \"Bohemian Rhapsody\"\nBest Supporting Actress: Regina King for \"If Beale Street Could Talk\"\nDon't Miss 51.2 K SHARES 807 SHARES 4.3 K SHARES 310 SHARES 3.7 K SHARES\nBest Supporting Actor: Mahershala Ali for \"Green Book\"\nBest Foreign Language Film: \"Roma\" (Mexico)\nBest Animated Feature Film: \"Spider-Man: Into The Spider-Verse\"\nBest Original Screenplay: \"Green Book\"\nBest Adapted Screenplay: \"BlacKkKlansman\"\nBest Original Score: \"Black Panther\"\nBest Original Song: \"Shallow\" from \"A Star Is Born\"\nBest Documentary Feature: \"Free Solo\"\nLook who stopped by the #Oscars Thank You Cam, presented by @Cadillac! Best Documentary Short winners for Period. End of Sentence. #KeepRising pic.twitter.com/NssJfSPkI3 — The Academy (@TheAcademy) February 25, 2019\nBest Documentary Short: \"Period.", "description": "Oscars are the most coveted award shows across the globe. Whether it's foreign language films, animated cinema or short films, this is one such platform that recognises talent from all corners. And this year was no different. From fresh talent to legendary artists, 2019 Academy Awards had an interesting line up of winners. The show which was held in Dolby Theatre", "authors": ["Saloni Singh"], "date_publish": "25/02/2019, 16:21:10"}