{"url": "https://www.indiatimes.com/entertainment/oscars-2019-from-priyanka-chopra-to-vicky-kaushal-bollywood-is-celebrating-the-win-of-period-end-of-sentence-362778.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/period_end_of_sentence_1551089519_800x420.jpg", "title": "Oscars 2019: From Priyanka Chopra To Vicky Kaushal, Bollywood Is Celebrating The Win Of Period. End Of Sentence", "text": "Oscars 2019: From Priyanka Chopra To Vicky Kaushal, Bollywood Is Celebrating The Win Of Period. End Of Sentence\nOscars 2019: From Priyanka Chopra To Vicky Kaushal, Bollywood Is Celebrating The Win Of Period. End Of Sentence\nIndia-based documentary Period. End Of Sentence won an Oscar earlier today and has since found itself being discussed both online and offline. The cast and crew of the film too were pleasantly surprised to win this prestigious award.\nTwitter\nGuneet Monga - the producer of the film - is on cloud nine and is celebrating this well-deserved win.\nEven our Bollywood actors are joyous that an India-based film has won the Best Documentary Short Film Award at the Oscars 2019.\nLook who stopped by the #Oscars Thank You Cam, presented by @Cadillac! Best Documentary Short winners for Period. End of Sentence. #KeepRising pic.twitter.com/NssJfSPkI3 — The Academy (@TheAcademy) February 25, 2019\nPriyanka Chopra, Vicky Kaushal, Akshay Kumar, Dia Mirza and Neha Dhupia, amongst others, are celebrating and congratulating the winners for this big day. Take a look at their congratulatory tweets.\nDon't Miss 562 SHARES 529 SHARES 2.1 K SHARES 24.3 K SHARES 17 K SHARES\nOne of the most special moments of the evening...a film based on the taboos around menstruation wins BEST DOCUMENTARY SHORT! Congratulations to the entire #Periodendofsentence team, and my fearless friend @guneetm!! #Oscars2019 — PRIYANKA (@priyankachopra) February 25, 2019\nCongratulations to @guneetm and the entire team of #PeriodEndOfSentence for winning big at the #Oscars! Much needed topic of discussion and well deserved win 👏👏 — Akshay Kumar (@akshaykumar) February 25, 2019\nWhat a great time for women in film... congratulations @guneetm and @sikhyaent on your #Oscar win for #Periodendofsentence ... what a huge moment. We are all so proud of you. Time to tune into @NetflixIndia n watch this beautiful documentary all over again! — Neha Dhupia (@NehaDhupia) February 25, 2019\nPeriod. End Of Sentence has real Padman Arunachalam Muruganathan talking about the menstruation in this documentary.\nMenstruation continues to be taboo in many parts of the world, not just India. Due to the lack of conversation about it and the unavailability of hygienic products to a large chunk of women, menstruation is often punctuated with illnesses, infections and inconvenience. While a film cannot change that overnight, the hope is that it will accelerate this conversation all over the world.", "description": "Right now every Indian cinema lover is talking about Period. End Of Sentence win at the Oscars 2019. The cast and crew of the film too were astonished to win this prestigious award. While Guneet Monga the producer of the film is on cloud nine and celebrating this big win.", "authors": ["Manisha Mandal"], "date_publish": "25/02/2019, 16:24:03"}