{"url": "https://www.indiatimes.com/entertainment/pakistani-actress-mahira-khan-reacts-to-iaf-s-air-strike-says-nothing-more-ignorant-than-cheering-for-war-362858.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/pakistani_actress_mahira_khan_reacts_to_iafs_air_strike_says_its_ignorant_to_cheer_for_war_1551246610_800x420.png", "title": "Pakistani Actress Mahira Khan Reacts To IAF's Air Strike, Says Nothing More Ignorant Than Cheering For War", "text": "Pakistani Actress Mahira Khan Reacts To IAF's Air Strike, Says Nothing More Ignorant Than Cheering For War\nPakistani Actress Mahira Khan Reacts To IAF's Air Strike, Says Nothing More Ignorant Than Cheering For War\nNot only the family members of Pulwama martyred soldiers were happy, but the entire nation woke up to the good news yesterday. Twelve days after the Pulwama terror attack, Indian Air Force (IAF) carried out major strikes at terror camps of Jaish-e-Mohammed in Balakot dropping 1,000kg bombs, which killed up to 350 terrorists, reportedly.\nTwitter\nAfter all these days of anxiety and pain, India finally observed what may be called the historic breakthrough. Everyone was in a mood of celebration yesterday. Everyone, including Bollywood celebrities, were happy.\nTwitter\nIn the wake of the tensions that rising between India and Pakistan, Pakistani actress Mahira Khan who was seen in Shah Rukh Khan starrer Raees said that there is nothing more uglier than the war, and that she hopes better sense will prevail. Here’s what she tweeted.\nDon't Miss 529 SHARES 554 SHARES 2.8 K SHARES 6 K SHARES\nNothing uglier. Nothing more ignorant than cheering for war. May sense prevail.. Pakistan zindabad. https://t.co/sH0VGGAERC — Mahira Khan (@TheMahiraKhan) February 26, 2019\n“Nothing uglier. Nothing more ignorant than cheering for war. May sense prevail... Pakistan zindabad,” she wrote.\nAnother Pakistani actress Mawra Hocane, who was seen in Indian film Sanam Teri Kasam, feels it is time to put humanity first.\n\"It is time we understand this as humans. The media needs to take charge and stop being provocative. It's our duty to inculcate peace and use our words for better and not worse. Praying for peace always,\" she posted.\n“There can be NO winners in war if we value Human Life at all.“\nChristopher Holliday.\nIt’s time we understand this as humans.The media needs to take charge & stop being provocative. It’s our duty to inculcate peace & use our words for better & not worse.\nPraying for peace always! — MAWRA HOCANE (@MawraHocane) February 26, 2019\nActor Fahad Mustafa also hoped for peace, and said, \"War does not determine who is right ...Only who is left. Say no to war.\"\nWar Does Not DEtermine who is right ..Only who is left\nSay no to war🙏🇵🇰 — Fahad Mustafa (@fahadmustafa26) February 26, 2019\nWhile many wished for peace, there were some stars who reacted strongly. Actor Hamza Ali Abbasi posted, \"Balakot, well done India. Much improvement from the fake Surgical Strike claim. This time yes IAF aircraft crossed LOC 4 to 6 miles at 2.55 a.m. and had to retreat at 2.59 a.m. due to PAF (Pakistan Air Force) scrambling, dropping the load on the way martyring our trees. But now, Pakistan must retaliate.\"\nmasala.com\nTaking a dig at a famous dialogue from Karan Johar's film My Name Is Khan, Veena Malik said, \"My Name is tree...And I'm not a Terrorist.\"\nMy Name is tree...And I'm not a Terrorist 😂😂😂...!!!#Surgicalstrike2 — VEENA MALIK (@iVeenaKhan) February 26, 2019\nMeanwhile, in response to the IAF strike, Pakistan's Prime Minister Imran Khan directed the country's armed forces and citizens to \"remain prepared for all eventualities\".", "description": "In the wake of the tensions that rising between India and Pakistan, Pakistani actress Mahira Khan who was seen in Shah Rukh Khan starrer Raees said that there is nothing more uglier than the war, and that she hopes better sense will prevail. Here’s what she tweeted.", "authors": ["Garima Satija"], "date_publish": "27/02/2019, 11:19:11"}