{"url": "https://www.indiatimes.com/entertainment/celebs/pulwama-terror-attack-bollywood-superstar-akshay-kumar-to-donate-rs-5-cr-to-martyrs-kin-362364.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/akshay_kumar_1550488463_800x420.jpg", "title": "Pulwama Terror Attack: Bollywood Superstar Akshay Kumar To Donate Rs 5 Cr To Martyrs' Kin", "text": "When it comes to situations of crisis, it's heartwarming to see the Indian film fraternity come together in solidarity. After the Pulwama Attack that killed more than 40 of our CRPF jawaans on 14th February, the stars have not just condemned the attack but have done their bit as dutiful citizens.\nThe stars have proved that they are responsible Samaritans and apart from expressing their opinions on social media and media interviews, their actions are definitely speaking louder than their words.\nNow, according to a report in Hindustan Times, Akshay Kumar has vowed to donate ₹5 crore through Bharat Ke Veer — a fundraising initiative of the Union Ministry of Home Affairs.\nAgencies\nJust to jog your memory a little, Akshay was one of the first few actors who reacted to the incident and gave his two cents. He had written,\nDon't Miss 4 K SHARES 8.9 K SHARES 2.1 K SHARES 886 SHARES 20.7 K SHARES\n#Pulwama is something we cannot & will not forget.We’re all angry & it’s time to act. So act now,donate to the martyrs of Pulwama on https://t.co/5j0vxsSt7f There’s no better way to pay homage to them & show your support.This is the only official site,pls don’t fall prey to fakes pic.twitter.com/sYruUtzgKY — Akshay Kumar (@akshaykumar) February 16, 2019\nBollywood stands in solidarity\n“The number of the martyrs has gone up to 49 .. i am contributing for now 50 .. that’s ₹2.5cr,” he said in a tweet. The news was confirmed by a news agency and a spokesperson was quoted as saying: “Yes, Mr Bachchan will give ₹5 lakh to each of the soldiers’ families and is currently finding out the correct process to do so,” said the spokesperson.\nThe team announced that they have extended monetary help to the families of the soldiers who were killed in the Pulwama attack. The team of Uri: The Surgical Strike, too, in collaboration with their production house RSVP, have donated to the families of Uri attack/Army Welfare Fund. A tweet by the team read:\n“RSVP &Team URI committed Rs. 1 Cr to families of URI attack /Army Welfare Fund -will ensure part goes to victims #Pulwama ..but urge more to respond -in small lots - and also our Indian “Unicorns” to donate graciously.”\n3. Diljit Dosanjh didn't just donate ₹3 lakh to the CRPF Wives Welfare Association fund but he made an announcement on Instagram and urged everyone to do so.\nHe wrote, \"Our Soldiers Protect the Country and the Citizens of the country. They have to live away from their loved ones, not knowing what the next day will bring. The families don’t know when will they see them next. But there was always a hope which is now gone for these families. We can’t take the sorrow away but can try to help a little by donating. It’s our time to do something to help the families of our Shaheed Jawans in this Difficult Time : WE STAND WITH THE SOLDIERS AND THEIR FAMILIES..\"\nThe team also extended monetary support to the families of the martyred soldiers and has reportedly donated Rs 50 lakh to the grieving families of the martyrs.", "description": "After the Pulwama Attack that killed more than 40 of our CRPF jawaans on 14th February, the stars have not just condemned the attack but have done their bit as dutiful citizens. The stars have proved that they are responsible Samaritans and apart from expressing their opinions on social media and media interviews, their actions are definitely speaking louder than their words.", "authors": ["Isha Sharma"], "date_publish": "18/02/2019, 16:41:18"}