{"url": "https://www.indiatimes.com/entertainment/randeep-hooda-feels-proud-after-winning-silver-at-national-equestrian-championship-and-so-are-we-362903.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/randeep_hooda_1551335025_800x420.jpg", "title": "Randeep Hooda Feels Proud After Winning Silver At National Equestrian Championship And So Are We", "text": "Randeep Hooda Feels Proud After Winning Silver At National Equestrian Championship And So Are We\nRandeep Hooda Feels Proud After Winning Silver At National Equestrian Championship And So Are We\nBollywood actor Randeep Hooda is an outstanding actor and he has proved it time and again with every film. While he may not be seen on silver screen very often, he ensures he's constantly creating awareness about the environment and animals.\nTwitter\nThis is also the reason, why Randeep Hooda ends up winning hearts. The actor loves and adores his horses, in fact, Randeep has a farm where he has a number of horses as his pet.\nTwitter\nAnd now, he is a proud winner of a silver medal at the National Equestrian Championship (NEC) that was recently held in Mumbai.\nDon't Miss 4.2 K SHARES 19.6 K SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nTwitter\nHooda shared his proud moment on twitter, he wrote, “So got a silver medal at the Nationals NEC on Dream Girl thanks to my team mates from the Indian Army from RVC (Remount and Veterinary Corps) and ASC (Indian Army Service Corps). Proud moment to be given the medal by the QMG Gen Ambre with gratitude to my grooms who look after my horses”. We are equally proud of Randeep.\nOn the work front, the actor will be seen in Dhaka an American film directed by Sam Hargrave. The film also stars legendary actors like Manoj Bajpayee, Chris Hemsworth and David Harbour.\nTwitter\nMore power to Randeep Hooda.", "description": "Hooda shared his proud moment on twitter, he wrote, “So got a silver medal at the Nationals NEC on Dream Girl thanks to my team mates from the Indian Army from RVC (Remount and Veterinary Corps) and ASC (Indian Army Service Corps). Proud moment to be given the medal by the QMG Gen Ambre with gratitude to my grooms who look after my horses”. We are equally proud of Randeep.", "authors": ["Manisha Mandal"], "date_publish": "28/02/2019, 11:23:35"}