{"url": "https://www.indiatimes.com/entertainment/ranveer-singh-will-follow-the-pakistani-actors-ban-says-if-one-soldier-s-mother-supports-it-we-should-too-363021.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranveer_singh_1551507358_800x420.jpg", "title": "Ranveer Singh Will Follow The Pakistani Actors' Ban, Says If One Soldier's Mother Supports It, We Should Too", "text": "Ranveer Singh Will Follow The Pakistani Actors' Ban, Says If One Soldier's Mother Supports It, We Should Too\nRanveer Singh Will Follow The Pakistani Actors' Ban, Says If One Soldier's Mother Supports It, We Should Too\nIn the wake of Pulwama attack, Pakistani artists have been banned in India and vice versa and every actor are rightfully following the ban. But Ranveer Singh feels one shouldn’t mix and sports, but he will follow the ban respectfully till even one mother of soldier feels they shouldn’t work with the Pakistani actors.\nTwitter\nAt an event, the Gully Boy actor was asked about his opinion on the Pakistani artist ban, to which he said,\n‘ I am very cognisant that there is this school of thought that one should not mix art and sport with it, they are two different realms. But at the same time, us as artists and sportsmen, we are not sacrificing the same way that some of our compatriots are. Art and sports are different realms. The boundaries should be different.\nTwitter\nBut we are not sacrificing the way some of our compatriots are. If there's even one mother of a soldier who believes that we shouldn't engage, we should follow that”. Ranveer clearly has won hearts with his sensible answer.\nDon't Miss 44.4 K SHARES 605 SHARES\nTwitter\nRanveer Singh is right now the most bankable actor. He is having the time of his life. The actor’s personal and professional life is rocking and he is thoroughly enjoying every bit of it.\nHe will be next seen in 83, the film based on the first World Cup win Of Indian Cricket Team. The film is helmed by Kabir Khan and Ranveer will be playing ex-cricket captain Kapil Dev’s role in it.", "description": "In the wake of Pulwama attack, Pakistani artists have been banned in India and vice versa and every actor are rightfully following the ban. But Ranveer Singh feels one shouldn’t mix and sports, but he will follow the ban respectfully till even one mother of soldier feels they shouldn’t work with the Pakistani’s At an event, the Gully Boy actor was asked about his opinion on the Pakistani artist", "authors": ["Manisha Mandal"], "date_publish": "02/03/2019, 11:57:49"}