{"url": "https://www.indiatimes.com/entertainment/richest-feline-on-the-planet-karl-lagerfeld-s-cat-might-inherit-his-200-million-fortune-362466.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/karl_lagerfields_cat_choupette_lagerfield_can_inherit_a_slice_of_his_200_million_fortune_1550647653_800x420.jpg", "title": "Richest Feline On The Planet? Karl Lagerfeld’s Cat Choupette Might Inherit His $200 Million Fortune!", "text": "Richest Feline On The Planet? Karl Lagerfeld’s Cat Choupette Might Inherit His $200 Million Fortune!\nRichest Feline On The Planet? Karl Lagerfeld’s Cat Choupette Might Inherit His $200 Million Fortune!\nOne of the most popular name in the world of international fashion, Karl Lagerfeld, the artistic director for fashion brand Chanel has passed away due to ill health at the age of 85.\nHe was in Paris for Chanel’s couture show when his health condition deteriorated so much that he couldn’t even take a bow at the end of the show. Soon, he was admitted to a hospital, where he passed away.\nBT.com\nKarl Lagerfeld’s cat named Choupette, who is the most popular cat in fashion, could just become the richest cats on the planet too.\nimages.complex.com\n“Choupette is a rich girl,” he had once said on a TV show hinting that he has written her into his will. “She has her own fortune,” he had added. She had earned at least three million euros ($3.4 million) with him by doing adverts for a German car firm and a Japanese cosmetics brand.\npinimg.com\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\n“If anything happens the person who looks after her will not go without,” Karl Lagerfeld who also designed for Fendi had said before his death.\nmontaignestyle.com\nJust in case you didn’t know, Choupette has 175,000 followers on social media. Unlike other cats, she eats at a table. “She is like a human being, only with an extra quality - silence,” Lagerfeld had quipped.\n“Choupette is the centre of my world,” he had once admitted. She has never done advertisements for cat food. Why? Because “She is too sophisticated for that,” he had said.\nThe pampered eight-year-old cat was “kidnapped” by Karl Lagerfeld in 2011 from his young friend and male model Baptiste Giabiconi. She could just be about to inherit a slice of his estimated $200-million (176-million-euro) fortune.\nWith inputs from AFP", "description": "Karl Lagerfeld’s cat named Choupette Lagerfeld, who is the most popular cat in fashion, could just become the richest cats on the planet too. She could just be about to inherit a slice of his estimated $200-million (176-million-euro) fortune. The pampered eight-year-old cat was “kidnapped” by Karl Lagerfeld in 2011 from his young friend and male model Baptiste Giabiconi.", "authors": ["Garima Satija"], "date_publish": "20/02/2019, 13:17:32"}