{"url": "https://www.indiatimes.com/entertainment/richa-chadha-lends-support-to-lgbtq-will-inaugurate-india-s-first-holistic-medical-clinic-363340.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/richa_chadha_lends_support_for_lgbtq_to_inaugurate_indias_first_holistic_medical_clinic_1551958265_800x420.png", "title": "Richa Chadha Lends Support To LGBTQ, Will Inaugurate India’s First-Holistic Medical Clinic", "text": "Celebrities are household names. A lot of them are a source of inspiration for their fans. Who better than them can influence the audiences to do the right thing?\nLast year turned out to be the year of love. Supreme Court of India decriminalised homosexuality by diluting section 377 of India Penal Code. And now, India has finally got it’s first holistic LGBTQ art centre as well as medical clinic in Mumbai.\nActress Richa Chadha who has always been vocal about her views on the matters that concern the nation has extended her support to the community as well. Taking it a step ahead, she will now be seen inaugurating this unique project.\n“It's great that there can be a space where people can come forward without fear of being judged, and get the mental and physical support they need. The Humsafar Trust has been working in this direction for so many years and they have a real sense of the common problems that need to be addressed. Now that Section 377 has been repealed, I think more such health centres should be there to help bring more inclusivity and access,” she said.\nTwitter\nDon't Miss 24.3 K SHARES 17 K SHARES 11.2 K SHARES 9.5 K SHARES 8.9 K SHARES\nThe centre is said to be India's first ever community centre to provide Anti Retroviral Therapy and holistic clinic for the LGBTQ individuals. It has been set up with the help of the Mumbai District State AIDS Control Society (MDACS) and FHI 360.\nIt will facilitate access to treatment and care among most-at-risk communities including transgender community, MSM and female sex workers. There will be free HIV medication provided by National AIDS Control Organization, and provision of mental health counselling too, read the statement.\nWith inputs from IANS", "description": "Actress Rich Chadha who has always been vocal about her views on the matters that concern the nation has extended her support to the community as well. Taking it a step ahead, she will now be seen inaugurating this unique project. “It's great that there can be a space where people can come forward without fear of being judged, and get the mental and physical support they need. The Humsafar Trust", "authors": ["Garima Satija"], "date_publish": "07/03/2019, 18:04:15"}