{"url": "https://www.indiatimes.com/entertainment/shahid-kapoor-to-play-dingko-singh-cancer-surviving-boxer-whose-unbelievable-story-inspired-mary-kom-362487.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/shahid_to_play_dingko_singh_cancer_survivingboxer_whose_unbelievable_story_inspired_mary_kom_1550656241_800x420.png", "title": "Shahid Kapoor To Play Dingko Singh, Cancer-Surviving Boxer Whose Unbelievable Story Inspired Mary Kom", "text": "You probably know nothing about boxing, if you haven’t heard of Dingko Singh. His unbelievable story has inspired many boxers from Manipur including Mary Kom.\nAfter Priyanka Chopra played the role of Mary Kom in her biopic, now a biographical movie is being made on Dingko Singh as well. Shahid Kapoor is not only playing the lead role but is also producing the movie along with Raja Krishna Menon.\n“The thing that I loved about this story is that he is one of those superstars who we don’t know much about. If a film like Dangal (2016) wasn’t made, we wouldn’t know as much about the Phogat sisters. Dingko is a cancer survivor, and he went through 13 rounds of chemotherapy. He has even gone on to say that his biggest win was surviving cancer and not the gold medal he won at the age of 19 at the 1998 Asian Games in Bangkok,” Shahid told Bombay Times about the unsung hero of our country.\nHere’s all you need to know about Dingko Singh:\n#1 Dingko Singh was born on Jan 1, 1979 in a remote village called Sekta in the Imphal East District\nindianexpressonline.files.wordpress.com\nDon't Miss 2.2 K SHARES 906 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\n#2 He grew up in an orphanage as his family couldn’t raise the little boy due to poor financial conditions.\ntoiimg.com\n#3 His stint with boxing started at the orphanage itself, because that was the need of the hour for him. He indulged in a lot of fights with other kids in order to gain respect among the group, it is said.\nTwitter\n#4 His talent was identified by the trainers of Special Area Games, a scheme initiated by initiated by the Sports Authority of India. He was trained under the supervision of Major O.P. Bhatia.\nTwitter\n#5 At the age of 10, in 1989, he won Sub Junior National Boxing Championship at Ambala. From here on, he was seen as the promising Boxing star of India.\nsocialnews.xyz\n# In 1997, he won the King’s Cup 1997 at Bangkok and was declared as the best boxer of the meet.\nYouTube\n#6 In 1998, he was selected for Bangkok Asian Games but his name was dropped at the last minute for reasons unknown. He went on a drinking spree and collapsed after long sessions of drinks. Finally, he was selected, and he ended India’s 16 years of wait for a gold medal at Asian Games in the 54 kg Bantamweight category.\nEast Mojo\n#7 In 1999, he participated in National Games, also preparing for the 2000 Sydney Olympics. It is during the national games that he fractured his hand. The injury, it is said, was neglected by Indian officials. In the first round itself, he crashed out, and his career couldn’t be revived thereafter.\nwikimedia.org\n#8 In 1998, he was honoured with Arjuna Award, and given a home as well as a job by Indian Navy. In 2013, he was awarded with a Padma Shri.\nTwitter\n#9 In Feb 2017, the news of him suffering from cancer came out. He was suffering from bile duct cancer, and doctors had to remove 70 percent of his liver. To get his cancer treated, he had to sell off his house that the government had given him. Gautam Gambhir and Sarita Devi also extended financial aid to him.\nTwitter\nAfter many rounds of chemotherapy, Dingko is now recovering and is back to coaching at the Sports Authority of India (SAI) complex. Mary Kom had earlier said it was Dingko’s success that inspired her to take up boxing. What an inspiring journey he has had indeed.", "description": "You probably know nothing about boxing, if you haven’t heard of Ngangom Dingko Singh. His unbelievable story has inspired many boxers from Manipur including Mary Kom. After Priyanka Chopra played the role of Mary Kom in her biopic, now a biographical movie is being made of Dingko Singh as well. Shahid Kapoor is not only playing the lead role but is also producing the movie along with Raja Krishna", "authors": ["Garima Satija"], "date_publish": "20/02/2019, 16:19:13"}