{"url": "https://www.indiatimes.com/entertainment/shekhar-kapur-recalls-horror-of-india-pak-partition-says-his-mother-played-dead-to-save-him-362968.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shekhar_kapur_shares_his_mother_played_dead_to_save_him_and_his_sister_during_indiapak_partition_1551419916_800x420.png", "title": "Shekhar Kapur Recalls Horror Of India-Pak Partition, Says His Mother ‘Played Dead’ To Save Him", "text": "Indian Air Force pilot Abhinandan Varthaman will finally be released today by Pakistan. When the news was announced yesterday, all Indians took a breath of relief. The tensions between India and Pakistan are apparently worsening, and everyone is worried.\nFilmmaker Shekhar Kapur who has helmed several critically acclaimed films like Mr India, took to Twitter yesterday to narrate the chilling incident from the time of India-Pakistan partition.\nTOI\nA lot of people from both the sides had died during that time. Those who returned safely have spine chilling stories. A lot of people faked identities, some even pretended to be dead in order to safely return to India.\nShekhar Kapur has a similar story. He shared about the terrifying time when his mother had to pretend like she was dead in order to save him and his sister.\nVariety\nDon't Miss 10.3 K SHARES 195 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nShekhar Kapoor revealed he was born in Lahore, Pakistan. He wrote that while they were migrating to India, her mother in the train played dead to hide him and his sister under the body. Here’s his tweet.\nI was born in Lahore. My mother escaped massacre by hiding me n my sister under her body in a train to india. Playing dead. Most people were killed. One million people died in Partition. 10 million refugees. On both sides. India n Pakistan were created of the blood of one people. — Shekhar Kapur (@shekharkapur) February 28, 2019\nHe also wrote that one million people were killed in the India-Pakistan partition. About 10 million were refugees, he wrote.\nFurthermore, he also tweeted about Wing Commander Abhinandan Varthaman’s return to India. Pakistan Prime Minister Imran Khan had announced that they will be releasing him as a gesture of peace. He will be received at the Wagah Border today. “#WingCdrAbhinanadan You have become a beacon of courage patriotism and dignity. And also a beacon of hope. We look forward to welcome you home soon, Sir,” he tweeted.\n#WingCdrAbhinanadan You have become a beacon of courage patriotism and dignity. And also a beacon of hope. We look forward to welcome you home soon, Sir 🙏 — Shekhar Kapur (@shekharkapur) February 28, 2019\nAbout a few days ago, he had also tweeted, “It’s really important not to fan the flames of war rhetoric. It’s not a game. U r not facing bullets or bombs. U r not the family praying and hoping fervently that your husbands brothers or fathers are safe. Nor living in border areas in fear. It’s easy to be armachair soldiers.”\nIt’s really important not to fan the flames of war rhetoric. It’s not a game. U r not facing bullets or bombs. U r not the family praying and hoping fervently that your husbands brothers or fathers are safe. Nor living in border areas in fear. It’s easy to be armachair soldiers. — Shekhar Kapur (@shekharkapur) February 27, 2019\nAlso Read: Welcome Back, Abhinandan Varthaman! Bollywood Celebrates The Return Of IAF Pilot", "description": "Shekhar Kapur has a similar story. He shared about the terrifying time when his mother had to pretend like she was dead in order to save him and his sister. Shekhar Kapoor revealed he was born in Lahore, Pakistan. He wrote that while they were migrating to India, her mother in the train played dead to hide him and his sister under the body. Here’s his tweet. He also wrote that one million peop", "authors": ["Garima Satija"], "date_publish": "01/03/2019, 11:57:19"}