{"url": "https://www.indiatimes.com/entertainment/siddhant-chaturvedi-aka-mc-sher-has-his-priorities-straight-won-t-do-a-film-just-for-the-heck-of-it-362562.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/siddhant_chaturvedi_1550752282_800x420.jpg", "title": "MC Sher aka Siddhant Chaturvedi Of Gully Boy Was Told This Film Will A Big Screw Up For Him By A Big Producer", "text": "Right now everyone is talking about Ranveer Singh and Alia Bhatt’s Gully Boy and why not! Hats off to these outstanding actors for giving such fabulous performances.\nTwitter\nBut there's another boy who is ruling everyone’s heart, he is none other than apna MC Sher aka Siddhant Chaturvedi. This boy left us swooning with his brilliant performance in Gully Boy. In fact, he has become a national crush and it's not even surprising.\nAfter watching the film, Indiatimes decided to have a chat with Siddhant. We met him at Gully Boy director Zoya Akhtar’s office, where he was wearing a white shirt along with a red jacket paired with denims looking completely different from MC Sher image, but the confidence on his face won us all over again.\nDon't Miss 9 K SHARES 8.9 K SHARES 2.2 K SHARES 1.2 K SHARES\nInstagram\nSiddhant is just 25 years old and not a rapper in real life. hard to believe right? But that’s indeed a fact. Siddhant, who is overwhelmed with the success of this film, revealed how he was told this film might be a big screw up for him. An elated Siddhant said he shares a great camaraderie with producer Ritesh Sidhwani, who discovered him after Inside Edge and he is the one who told him Gully Boy might be a big screw up for him.\n“Ritesh Sidhwani who discovered me after Inside Edge, immediately called me to meet him and since then I have been kind of mentored by him. There were lots of other roles which I wanted to do with him but he was like you are better than this, have patience and then Gully Boy happened, but even he was surprised about Zoya calling me for an audition. So, he called me and asked me if I have auditioned for the film. I was like yes sir, soon I quizzed him about the film and he said, 'It’s a good film but you are a little young, but try, maybe it could be a big screw up.' I was like sir, I will try, I will try my best.”\nWell, we are sure Ritesh must have taken his words back once the film got released.\nTwitter\nThe boy happily swinging on his chair while giving the interview said, said that he knew this film would bring him recognition, but this kind of response is overwhelming, “I knew that the film is going to be grand because it’s a classic; I also knew that I will be appreciated for MC Sher but this kind of response is very overwhelming. I am fortunate and glad. I am still soaking it in me.”\nTwitter\nTalking about how he got the film, Siddhant said, “I was at Inside edge success party dancing on the dance floor where I happened to catch Zoya’s attention. I was dancing on Govinda’s song. I am a huge Govinda fan and then came Dil Dhadakne Do Gala Gudiyaan song. I pulled Zoya on the dance floor and she was like Who are you? With a lot of excitement, I told her - I am Siddhant, I am an Inside Edge actor. To which she said, she hasn’t seen it, and then she asked me if I am from Mumbai. I said, “ Haan Bachi apun idhar se hi hai’. This line came to me spontaneously and she was like OK. Then she told me I want your audition for this part and later, I was sent a rap song. I was given the rap a day prior to the audition. I researched a bit about rap and prepped myself. I wrote about my own struggle, I was jobless for 6 years, so I wrote a some lines on myself and I auditioned and I was selected. Zoya loved my audition and sent me the script and after I read the script I was like this is it for me.”\nTwitter\nProud of his choice Siddhant says, he had been offered a lot of roles earlier but was waiting for the right one,\n“I was very certain that if I do a film, I should be noticed. It was my conscious decision, I had been offered a lot of roles earlier but I didn't want to do anything just for the sake of it. In fact, I was offered big banner films, sometimes it didn’t work out because I am not a star son and was replaced. Sometimes, I didn’t like the script. I was very choosy, I don’t know why, because beggars can’t be choosy, but yes, I was very confident about myself and my art. Also, my dad always supported me and told me to wait for the right script.”\nSiddhant who convinced us that he is a rapper in real life too with his MC Sher character reveals he learned rapping just before the beginning of the shoot,\n“I am not a rapper, rapping happened just 20 days before the film. I listen to Kishore Kumar, Mohammad Rafi, ghazals, rock, so hip hop for me was always a physical movement. I used to never understand rap, they say it so fast, feel hi nahi aata tha muje. I had never acquired the taste for rap.”\nGrateful with the success of Gully Boy, Siddhant recalls his struggles,\n“There was a time when I was jobless. I left my studies only to focus on acting, I just worked on myself. I used to write and read a lot. I have seen from Christian Bale to Govinda, I have all the knowledge about world cinema. I was preparing myself because if I ever get an opportunity I should know everything. But I didn’t know rapping would come to me, but even for that I gave my best. I just prepared for the audition in a day.”\nTalking about his next projects, he says, “I don’t want to cash myself on this, you may see me after 4 years because I want to do something solid. I have waited for long to get this recognition, so I just don’t want to do just anything now. I can wait for a long time because I trust my craft.”\nHe is definitely the most secure actor. Make way for this charismatic person MC Sher aka Siddhant Chaturvedi because he is bound to soar high from here on.", "description": "Right now everyone is talking about Ranveer Singh and Alia Bhatt’s Gully Boy. What A Film, hats off two these outstanding actors for giving such fabulous performance. But there is one boy who ruled everyone’s heart, he is none other than apna MC Sher aka Siddhant Chaturvedi. This boy left us swooning with his brilliant performance in Gully Boy. After watching this film Indiatimes decided to have", "authors": ["Manisha Mandal"], "date_publish": "21/02/2019, 17:56:26"}