{"url": "https://www.indiatimes.com/entertainment/celebs/siddharth-takes-a-dig-at-government-again-alia-s-reply-to-kangana-and-more-from-ent-363346.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/trending_top_news_1551962351_800x420.jpg", "title": "Siddharth Takes A Dig At Government Again, Alia's Reply To Kangana and More From Ent", "text": "“Listen, I definitely don't have the ability to speak as candidly as Kangana does and I really really respect her for that. And may be in a way she is right that sometimes we do hold back. Kyunki hum nahi chahte ke, khamakha kyun bolna... My dad always says that there are already so many opinions in the world that the world could do with one less opinion. So, I have an opinion but I will keep it to myself. But kudos to her because she genuinely speaks really well,\" said Alia Bhatt.\nJust a few days ago, he attacked and raised his voice against PM Modi for politicizing the Pulwama attack for his own benefit.\nThe book will be adapted into a Spanish-language series and filmed largely in the Nobel prize-winning author's home country of Colombia, with García Márquez's sons, Rodrigo García and Gonzalo García Barcha, serving as executive producers, reported The Guardian.\nDon't Miss 343 SHARES 1.5 K SHARES 1.2 K SHARES 465 SHARES\n“We were shooting on the streets in Glasgow and then I had to walk on the footpath. As I was walking, a car went by and our desi bhai was sitting in the car, who waved and said: 'Hey, Salman Khan, how you doing?' So, I waved back at him and walked on. What to do,\" the Badla actor told Shah Rukh Khan,” Amitabh Bachchan recently revealed once again at the promotions of Badla.\n“It's great that there can be a space where people can come forward without fear of being judged, and get the mental and physical support they need. The Humsafar Trust has been working in this direction for so many years and they have a real sense of the common problems that need to be addressed. Now that Section 377 has been repealed, I think more such health centres should be there to help bring more inclusivity and access,” she said.", "description": "“Listen, I definitely don't have the ability to speak as candidly as Kangana does and I really really respect her for that. And may be in a way she is right that sometimes we do hold back. Kyunki hum nahi chahte ke, khamakha kyun bolna... My dad always says that there are already so many opinions in the world that the world could do with one less opinion. So, I have an opinion but I will keep it t", "authors": ["Isha Sharma"], "date_publish": "07/03/2019, 18:06:56"}