{"url": "https://www.indiatimes.com/entertainment/spike-lee-jumps-into-the-arms-of-samuel-l-jackson-to-hug-him-celebrate-his-historic-oscar-win-362741.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/spike_lee_jumps_into_the_arms_of_samuel_l_jackson_to_hug_him__celebrate_his_historic_oscar_win_1551068352_800x420.png", "title": "Spike Lee Jumps Into The Arms Of Samuel L Jackson To Hug Him & Celebrate His Historic Oscar Win", "text": "Spike Lee Jumps Into The Arms Of Samuel L Jackson To Hug Him & Celebrate His Historic Oscar Win\nSpike Lee Jumps Into The Arms Of Samuel L Jackson To Hug Him & Celebrate His Historic Oscar Win\nIf you want to celebrate like a boss, take lessons for Spike Lee! The man has been nominated for the Oscar award five times in the past, but he could only take the trophy home tonight.\nTwitter\nAs Spike Lee won his first ever Oscar for Best Adapted Screenplay in BlacKkKlansman, he couldn’t contain his excitement. He walked on to the stage and excitedly jumped into the arms of Samuel L. Jackson.\nThis moment right before he got down to his real political speech is winning applause.\nIn his speech, he said, “The 2020 presidential election is around the corner. Let’s all mobilize, let’s all be on the right side of history. Make the moral choice between love versus hate. Let’s do the right the thing! You Know I had to get that in there.”\nWatch Spike Lee accept his first ever #Oscar pic.twitter.com/ofs9mfoXA5 — The A.V. Club (@TheAVClub) February 25, 2019\nMeanwhile, fans cannot stop gushing over his jump and hug. Take a look!\nBest part of the night spike Lee jumps into Sam Jackson's arms...lol #OSCARS — Morri (@Morri81367661) February 25, 2019\nDon't Miss 253 SHARES 335 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nSpike Lee jumps into Samuel Jackson’s arms onstage after his movie wins best adapted screenplay! #oscars pic.twitter.com/2vhdXik7yG — Liza Donnelly (@lizadonnelly) February 25, 2019\nSpike Lee jumps and Samuel L. Jackson pic.twitter.com/0OUXZY5rpO — Ⓜ️arcusD ᴿᴵᴾ ᴹᵃʳᶜᵘˢᴰ² (@_MarcusD3_) February 25, 2019\nSpike Lee jumps up and hugs Samuel L. Jackson with his entire body. #oscars. This is epic. — Xeni Jardin (@xeni) February 25, 2019\nPlease ... I need me a gif of the moment Spike Lee jumps on Samuel L Jackson! #Oscars #BestMoment pic.twitter.com/JKPyVsfMu0 — Vielka (@Vielkis) February 25, 2019\nWhen I am SEVENTY YEARS OLD I hope I’m strong enough to have someone jump on me like Spike Lee jumps on Samuel L Jackson and not break into a thousand pieces !! It’s all I ask !! https://t.co/Ir8sx1kR1r — Tess Noël (@tesswenger) February 25, 2019", "description": "If you want to celebrate like a boss, take lessons for Spike Lee. As Spike Lee won his first ever Oscar for Best Adapted Screenplay in BlacKkKlansman, he couldn’t contain his excitement. He walked on to the stage and excitedly jumped into the arms of Samuel L. Jackson.", "authors": ["Garima Satija"], "date_publish": "25/02/2019, 09:46:08"}