{"url": "https://www.indiatimes.com/entertainment/sridevi-s-first-death-anniversary-jaane-bhi-do-yaaro-sequel-is-on-the-cards-more-from-ent-362715.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sridevis_first_death_anniversary_jaane_bhi_do_yaaro_sequel_is_on_the_cards__more_from_ent_1551011402_800x420.png", "title": "Sridevi's First Death Anniversary, Jaane Bhi Do Yaaro Sequel Is On The Cards & More From Ent", "text": "Sridevi's First Death Anniversary, Jaane Bhi Do Yaaro Sequel Is On The Cards & More From Ent\nSridevi's First Death Anniversary, Jaane Bhi Do Yaaro Sequel Is On The Cards & More From Ent\n1. On Sridevi's First Death Anniversary, Janhvi Kapoor Remembers Mother With A Heart-Touching Picture\n“My heart will always be heavy. But I’ll always be smiling because it has you in it,” she wrote.\n“We are doing 'Jaane Bhi Do Yaaro' sequel. The script is ready. Kundan ji had written it. Naseeruddin Shah is reprising his role. We will have someone else from Raviji's part as he is no longer with us. The actors who are available are Naseeruddin Shah, Neena Gupta, Satish Kaushik and Pankaj Kapur,” a source close to the production told PTI.\n3. After Struggling For 6 Yrs, Siddhant Chaturvedi AKA MC Sher Finally Tastes Success & How! Here’s His Story\nIt seems, 'Apna time aa gaya' for Siddhant Chaturvedi! But success didn’t come easily to him. He is just 25. He was studying to become a chartered accountant like his father but left it midway to pursue a career in Bollywood. When he was 19, he tried his luck in the city of dreams.\nDon't Miss 1.1 K SHARES 419 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\n4. Kartik Aaryan Dances With His Mom On Sonu Ke Titu Ki Sweety Song ‘Dil Chori’ & Their Love Is Warming Our Hearts\nHe will next be seen in Lukka Chuppi alongside Kriti Sanon. Katrik Aryan, who is busy with the promotions of the movie, recently celebrated one year anniversary of the surprise blockbuster movie. He shared a throwback video of his mother dancing along with him on Dil Chori, and it was simply adorable.\n5. Ranveer Singh Rapping On ‘Apna Time Aayega’ At A Shaadi In Delhi Proves He Is ‘Bohot Hard’\n#apnaTimeAyega 🎧🕺🏻\n-\n🎥| Ranveer Singh at a wedding in Delhi , tonight💖 pic.twitter.com/0c5LZJqUTx — RanveerSingh TBT💗 (@RanveerSinghtbt) February 23, 2019\nRecently, the man who is known for his quirky avatar and crazy infectious energy was spotted at a wedding in Delhi. Donning a kurta and a pyjama, Ranveer Singh performed Apna Time Ayega with all his energy.", "description": "Last year, the entire nation mourned the tragic and shocking demise of Sridevi. Leaving behind her husband Boney Kapoor and her two daughters Janhvi Kapoor and Khushi Kapoor, Sridevi had reportedly accidentally drowned in the bathtub at a hotel in Dubai.", "authors": [], "date_publish": "24/02/2019, 17:58:49"}