{"url": "https://www.indiatimes.com/entertainment/swara-bhasker-slams-comedian-trevor-noah-for-his-insensitive-remarks-on-indo-pak-tensions-363032.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/swara_bhasker_1551511678_800x420.jpg", "title": "Swara Bhasker Slams Comedian Trevor Noah For His Insensitive Remarks On Indo-Pak Tensions", "text": "Swara Bhasker has always been a no-nonsense person and if you rub her the wrong way she will teach you a lesson for life.\nTwitter\nJust a few days ago she blasted Veena Malik for taking a dig at the IAF pilot Abhinandan Varthaman. And now she slammed comedian Trevor Noah for his insensitive joke on the current tension between both the countries.\nInstagram\nTrevor joked about how Indian military must be fighting with Pakistan in Bollywood style and even sang a few Hindi songs. Swara called his joke cruel and racist and blasted him.\nDon't Miss 364 SHARES 466 SHARES 1.7 K SHARES 5.6 K SHARES 30.9 K SHARES\n@Trevornoah @ComedyCentral a not racist & cruel version of this joke (IF Ur Writers was diverse)- India & Pak thankfully walking back from brink of war. Meanwhile, Bollywood looking to see how many dance numbers they can fit in2 movie version of this episode! Thanks @vedashastri pic.twitter.com/cjG3CBAVrd — Swara Bhasker (@ReallySwara) March 1, 2019\nShe took to twitter and wrote, “@Trevornoah @ComedyCentral a not racist & cruel version of this joke (IF Ur Writers was diverse)- India & Pak thankfully walking back from brink of war. Meanwhile, Bollywood looking to see how many dance numbers they can fit in2 movie version of this episode! Thanks @vedashastri”.\nTwitter\nSwara is known for sharing her opinions in every situation and she is appreciated for that, but sometimes she even gets trolled for it, but she doesn’t give a damn and that’s what we love about her. Way to go girl!", "description": "Swara Bhasker is on fire, she has always been this no-nonsense person if you rub her wrong way she will teach you a lesson for life. Just a few days ago she blasted Veena Malik for taking a dig at the IAF pilot Abhinandan Varthaman. And now she slammed comedian Trevor Noah for his insensitive joke on the current tension between both the countries.", "authors": ["Manisha Mandal"], "date_publish": "02/03/2019, 14:05:48"}