{"url": "https://www.indiatimes.com/entertainment/taapsee-pannu-supports-pak-actor-ali-zafar-says-nothing-wrong-in-supporting-your-own-country-362999.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/taapsee_pannu_1551434878_800x420.jpg", "title": "Taapsee Pannu Supports Pakistani Actor Ali Zafar, Questions What’s Wrong In Supporting Our Own Country", "text": "The current relationship between India and Pakistan is not very cordial after the Pulwama attack. All the Pakistani actors are been banned and vice versa. Actors like Ali Zafar, Mahira Khan are strongly supporting their country Pakistan, but they are being trolled, especially Ali. He was mercilessly trolled for supporting his own country.\nTwitter\nTaapsee Pannu who has been his co star came out in his support and said, “ I don’t understand this. Do you expect him, being a Pakistani, to support a country he is not a part of?” She further adds, “He has already been banned and we are all fine with it but how will it be if I am supporting my country and Pakistanis are trolling me, which they are now when I have tweeted about the Pulwama terror attack. What do you expect?”\nTwitter\nShe even says it’s obvious for him to support his own country,\n“It’s his country. [If he doesn’t support his PM], he will be trolled otherwise. We are trolled here when we don’t celebrate our victories. It is stupid to expect him to do anything else. It’s not like he is not able to work because he is banned in India. He is working there and will. He needs to celebrate his country’s achievements and so do we and we are doing that. Obviously, he will support his country. What’s wrong in that?”\nTwitter\nDon't Miss 364 SHARES 466 SHARES 1.7 K SHARES 30.9 K SHARES 1.1 K SHARES\nWell, let's hope we can find a solution instead of attacking one another.", "description": "The current relationship between India and Pakistan is not very cordial after the Pulwama attack. All the Pakistani actors are been banned and vice versa. Actors like Ali Zafar , Mahira Khan are strongly supporting their country Pakistan, but they are been trolled her, especially Ali. He was mercilessly trolled for supporting his own country.", "authors": ["Manisha Mandal"], "date_publish": "01/03/2019, 16:17:33"}