{"url": "https://www.indiatimes.com/entertainment/celebs/these-videos-of-chainsmokers-coldplay-performing-at-the-ambani-bash-will-give-you-a-major-fomo-362857.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ambani_bash_1551246551_800x420.jpg", "title": "These Videos Of Chainsmokers-Coldplay Performing At The Ambani Bash Will Give You A Major FOMO!", "text": "The celebrations in Switzerland's Saint Moritz escalated to some other level when guests were entertained by Coldplay's Chris Martin and The Chainsmokers! The Ambanis are currently hosting a three-day pre-wedding bash in Switzerland for Akash Ambani and Shloka Mehta. The pictures and videos of the celebrations are all over the internet.\nApart from the Winter Wonderland and carnival, the guests thoroughly enjoyed the performances by two of the most popular bands including Coldplay and Chainsmokers!\nWell, Ambanis surely know how to throw a party and with the live music concert inside the pre-wedding venue, the celebrations just doubled up for the people present there.\nDon't Miss 2.3 K SHARES 419 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nA large bunch of Bollywood celebrities could be seen enjoying and this included Ranbir Kapoor, Alia Bhatt, Karan Johar, Malaika Arora, Arjun Kapoor, Jacqueline Fernandez, Karisma Kapoor, Vidya Balan, Disha Patani, Ayan Mukerji, Manish Malhotra and Rajkumar Hirani among others.\nTake a look at the videos of Chris Martin and Alex Pall-Andrew Taggart performing for the guests.\nThe couple will return to Mumbai after their pre-wedding celebrations and tie the knot on March 9 in Mumbai.", "description": "Ambani's surely know how to throw a party and with the live music concert inside the pre-wedding celebrations venue, the celebrations just doubled up for the people present there. A large bunch of Bollywood celebrities are enjoying the celebrations and this includes Ranbir, Alia, Karan, Malaika Arora, Arjun Kapoor, Jacqueline Fernandez, Karisma Kapoor, Vidya Balan, Disha Patani, Ayan Mukerji, Man", "authors": ["Isha Sharma"], "date_publish": "27/02/2019, 11:15:13"}