{"url": "https://www.indiatimes.com/entertainment/celebs/vidya-balan-shares-her-two-cents-on-pak-artists-ban-in-india-says-tough-call-needs-to-be-taken-362636.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vidya_balan_1550902109_800x420.jpg", "title": "Vidya Balan Shares Her Two Cents On Pak Artists Ban In India, Says Tough Call Needs To Be Taken", "text": "Vidya Balan Shares Her Two Cents On Pak Artists Ban In India, Says Tough Call Needs To Be Taken\nVidya Balan Shares Her Two Cents On Pak Artists Ban In India, Says Tough Call Needs To Be Taken\nWhen it comes to standing up in solidarity for the nation, film fraternity is always united. After Pulwama attack, a host of Bollywood actors, including Akshay Kumar, Priyanka Chopra, Ajay Devgan and Vicky Kaushal, among others, have condemned the Pulwama attack.\n(Also read: In The Wake Of Pulwama Attack, AICWA Asks For Visa Cancellation, Deportation Of Pak Artists)\nIn the worst-ever terror attack in Jammu and Kashmir since terrorism erupted in the 1980s, a suicide bomber on February 14 rammed his SUV packed with explosives into a CRPF bus in Pulwama district, killing at least 40 troopers. Pakistan-based terror outfit Jaish-e-Mohammed later claimed responsibility for the attack.\nApart from that, makers of several upcoming films have taken a stand and decided not to release their films in Pakistan. Giving her two cents on the ban of Pakistani artists in India, actress Vidya Balan on Friday said a strong stand needs to be taken this time.\nDon't Miss 4 K SHARES 8.9 K SHARES 886 SHARES 21.1 K SHARES 7.8 K SHARES\nAgencies\n\"Though I have always believed that art should be kept away from all boundaries and politics, I think we have to take a stand now. Enough is enough.\"\nVidya was further quizzed if art should be kept away from politics, to which she responded,\n\"As an individual I believe that there is no better way to bring people together than arts, be it music, poetry, dance, theatre, cinema or any other art form. But this time I think we should just take a break from this practice and see what can be done for the future. As I said, some tough calls have to be taken at some point.\"\nOn the professional front, Vidya is all geared up to experiment as an artist and will soon be seen hosting a radio show as a radio jockey.\n(With IANS inputs)", "description": "A host of Bollywood actors including Akshay Kumar, Priyanka Chopra, Ajay Devgn and Vicky Kaushal, among others, have condemned the Pulwama attack. The film Total Dhamaal directed by Indra Kumar too did not release in Pakistan for the same reason. Read more here.", "authors": ["Isha Sharma"], "date_publish": "23/02/2019, 12:32:36"}