{"url": "https://www.indiatimes.com/entertainment/celebs/virat-was-rahul-says-anushka-describing-how-they-used-fake-names-to-plan-their-wedding-363164.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/virushka_1551769853_800x420.jpg", "title": "Virat Was Rahul, Says Anushka Describing How They Used Fake Names To Plan Their Wedding", "text": "For celebrities, planning a wedding could be one of the most tricky and difficult things. Considering how their life is in constant media spotlight, it becomes difficult for them to maintain secrecy.\nHowever, in 2017, Anushka Sharma and Virat Kohli's wedding was one that took many of us by a complete surprise and for all the right reasons. It wasn't just a dreamy wedding but they kept it 'private' in real sense of the word.\nAgencies\nAfter more than a year of the memorable wedding in Tuscany, Italy, Anushka spoke to a magazine and revealed how it was a private event and only 42 of their close friends and family were invited for it. Talking to Vogue, Anushka revealed,\nInstagram\nDon't Miss 864 SHARES 762 SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\n“We wanted to have a home-style wedding. There were only 42 people there, with all our friends and family present. I wanted it to be about Virat and me marrying each other, and not this big celebrity wedding. The energy at our wedding was blessed.\"\nShe added how they used fake names while planning their wedding. She said,\nAgencies\n“We even used fake names while talking to the caterer; I think Virat’s was Rahul.\"\nThe news of the wedding broke on December 11, 2017,when the couple officially announced it on social media by posting pictures from the wedding.", "description": "After more than a year of the memorable wedding in Tuscany, Italy, Anushka spoke to a magazine and revealed how it was a private event and only 42 of their close friends and family were invited for it. Talking to Vogue, Anushka revealed, “We wanted to have a home-style wedding. There were only 42 people there, with all our friends and family present.", "authors": ["Isha Sharma"], "date_publish": "05/03/2019, 11:35:05"}