{"url": "https://www.indiatimes.com/entertainment/welcome-back-abhinandan-varthaman-bollywood-celebrates-the-return-of-iaf-pilot-362960.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/hema_malini_1551359436_800x420.jpg", "title": "Welcome Back, Abhinandan Varthaman! Bollywood Celebrates The Return Of IAF Pilot", "text": "It’s the best news of the day. As per fresh information, IAF pilot Abhinandan Varthaman will be released tomorrow.\nIndian Pilot #AbhinandanVarthaman To Return To India Tomorrow Afternoon Via Wagah Border. Air Attache Group Captain J D Kurien To Bring Him By Road. Jai Hind #AbhinandanMyHero #WelcomeBackAbhinandan — Narendra Modi (@narendramodi177) February 28, 2019\nPakistani Prime Minister Imran Khan, just declared they will be releasing our IAF pilot who was in their custody, in a gesture of peace. The entire nation welcomed this news with opened arms.\nWing Commander Abhinandan to be released tomorrow: Pak PM Imran Khan pic.twitter.com/yBbT7eeN3l — Jammu Weekly News (@jammuweeklynews) February 28, 2019\nImran in the parliament of his country announced, “Yesterday I tried to call (Prime Minister) Narendra Modi to say that we don't want escalation. Our push for de-escalation doesn't mean we are afraid. We have an Indian pilot. As a peace gesture, we will release him tomorrow”.\nDon't Miss 51.2 K SHARES 605 SHARES\nTwitter\nEvery single person is happy with this news including Bollywood celebs. From Hema Malini to Nimart Kaur, stars are celebrating the return of our brave-heart Wing Commander Abhinandan Varthaman.\nTwitter\nSo glad to hear about the release of #WingCommanderAbhinandan. Our hearts swell with pride and joy and we are all waiting to welcome our braveheart back🙏 Jai Hind 🇮🇳 🇮🇳 #WelcomeBackAbhinandan — Vivek Anand Oberoi (@vivekoberoi) February 28, 2019\n🙏🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🙏. Happy to hear our pilot is going to be released tomorrow🙏 God bless! — Hema Malini (@dreamgirlhema) February 28, 2019\nThank you Mr @ImranKhanPTI for releasing #WingCommanderAbhinandan and caring for an Indian soldier's life. Please also genuinely work towards combating terrorism with us that hurts innocents and halts progress of both countries. We only want progress and our safety, not war. — Chetan Bhagat (@chetan_bhagat) February 28, 2019\nExcellent to know braveheart #WingCommanderAbhinandan will be home tomorrow. May this be the beginning to the end of all war murmurs. #AboutTime — Nimrat Kaur (@NimratOfficial) February 28, 2019\nThis made my day !!! #WingCommandarAbhinandan will be back with us tomorrow. #WelcomeBackAbhinandan . 🇮🇳 — SONAL CHAUHAN (@sonalchauhan7) February 28, 2019\nHuge respect for this man @ImranKhanPTI , a big thank you for returning #Abhinanadan tomorrow and truly setting an example that we all want peace. 🙏 — meera chopra (@MeerraChopra) February 28, 2019\nOh god! U really need to calm down @TimesNow ! Bowing down ????? Let him come back home safe first ! U are jeopardising it with ur big mouth ! The volume is loud but substance is zero ! https://t.co/k7TnzcNfBm — Gauahar Khan (@GAUAHAR_KHAN) February 28, 2019\nBhaisaab, #Abhinandan ko lautne toh deejiye, please? Baad mein credit le leejiyega.\nZara si sharm kar loge toh kya nuksaan hoga? https://t.co/MYPqUMa5XW — VISHAL DADLANI (@VishalDadlani) February 28, 2019", "description": "It’s the best news of the day. IAF pilot Abhinandan Varthaman will be released tomorrow.Pakistani Prime Minister Imran Khan just declared they will be releasing our IAF pilot who was in their custody in a gesture of peace. The entire nation welcomed this news with opened arms.Imran in the parliament of his country announced, “Yesterday I tried to call (Prime Minister) Narendra Modi to say that we", "authors": ["Manisha Mandal"], "date_publish": "28/02/2019, 17:21:33"}