{"url": "https://www.indiatimes.com/entertainment/when-21-sikh-soldiers-stood-against-10-000-afghans-real-life-story-that-inspired-akshay-kumar-s-kesari-362846.html", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/when_21_sikh_soldiers_stood_against_10000_men_reallife_story_that_inspired_akshay_kumars_kesari_1551183845_800x420.png", "title": "battle of Saragarhi:When 21 Sikh Soldiers Stood Against 10,000 Men: Real-Life Story That Inspired Akshay Kumar’s Kesari", "text": "The Punjabi power – haven’t we all heard how Sikhs have a bigger hearts than their chests. Sardars are often called super-human entities. Have you ever seen a Sardar Ji begging? Never, right? That’s because the Khalsa says -- a Sikh must live on honest labour, give generously to the ones in need, because they believe whatever is given is given to the Guru. And when it comes to courage and valour, Sikh Regiment is one of the most decorated in the country.\nYouTube/DharmaProductions\nApart from jokes doing the rounds about Punjab Kesari and Zubaan Kesari, when the trailer of Akshay Kumar starrer Kesari had revealed, everyone was in awe of the powerful punch that it delivered in just three minutes.\nYouTube/DharmaProductions\n2019 has brought a wave of patriotism in Bollywood, especially after the release of films like Uri: The Surgical Strike and Manikarnika among others. Now, Kesari, starring Akshay Kumar, is also one of the most anticipated movies of the year.\nYouTube/DharmaProductions\nBut do you know the real-life story of the epic 1897 Battle of Saragarhi that has inspired the movie? Just reading the story might send shivers down your spines.\nYouTube/DharmaProductions\nDon't Miss 886 SHARES 5.4 K SHARES 24.3 K SHARES 17 K SHARES 11.2 K SHARES\nFor starters, the battle is as legendary as the Battle of Thermopylae – the one which inspired the Zack Snyder’s movie 300. Akshay Kumar plays Havildar Ishar Singh, the leader of the regiment called 36th Sikhs, which was stationed in Saragarhi, a small village which is now in Pakistan. The area was frequently invaded by Afghans. On the day of battle, 10,000 men attacked the village. Since the British headquarters said that the army will take time to arrive, the Sikh men had to take the matter into their hands.\nYouTube/DharmaProductions\nThe battle of Saragarhi took place in the 19th century on 12th September 1897, which is called the Great Game. The name was given owing to the heightened tensions between Britain and Russia as they battled over territories in central Asia, including Afghanistan.\nYouTube/DharmaProductions\nAfghani troops had often been hostile on Indian borders, but this time when they attacked, the Sikh soldiers weren’t prepared. They had marched down with 10,000 soldiers, it is said.\nYouTube/DharmaProductions\nAt 9 AM, Gurmukh Singh informed the British headquarters in Fort Lockhart, via heliograph, that they were under attack. He had signalled Colonel Haughton that they were under attack and they need help, but he said that he won’t be able send help immediately. So, our soldiers decided to fight and prevent the enemies from reaching the forts.\nYouTube/DharmaProductions\nSepoy Bhagwan Singh was the first one to be killed. Naik Lal Singh was severely injured, but still, he along with Sepoy Jiwa Singh carried Bhagwan Singh’s body to the inner layer of the post.\nYouTube/DharmaProductions\nMeanwhile, the enemies had managed to break the wall and get in. It is said that Afghan general had asked them to surrender but Havildar Ishar Singh didn’t take a step back. From using the fire-power to using fighting with hands, they did their best.\nYouTube/DharmaProductions\nThe last man standing was Sepoy Gurmukh Singh, the man who communicated the battle to Haughton. Before he took his last breath, he exclaimed “Bole So Nihal, Sat Sri Akal!”\nYouTube/DharmaProductions\nAfghans had destroyed Saragarhi, and then, they turned their attention to Fort Gulistan, where reinforcements had arrived already.\nYouTube/DharmaProductions\nIt was reported that 21 Sikh soldiers had killed 600 Afghans, as 600 bodies were found after the battle. The details of the Battle of Saragarhi are considered fairly accurate as Col. Haughton, who was constantly keeping in touch with Gurmukh Singh, had himself narrated it.\nYouTube/DharmaProductions\nThe soldiers were recognised by the British with memorials, a battle honour and a regimental holiday. All 21 soldiers were awarded the prestigious Indian Order of Merit Class III award. From that day on, Sep 12 is celebrated as the Saragarhi Day in honour of the 21 soldiers who lost their lives in the battle.\nYouTube/DharmaProductions\nThe historical war drama is directed by Anurag Singh, who is known for films like Jatt & Juliet 1 and 2, Punjab 1984 and Super Singh.", "description": "Do you know the real life story of the epic 1897 Battle of Saragarhi that has inspired Akshay Kumar starrer Kesari? Just reading the story might give you shivers down your spines. For starters, the battle is as legendary as the Battle of Thermopylae – the one which inspired the Zack Snyder’s movie 300. Akshay Kumar plays Havildar Ishar Singh, the leader of the regiment called 36th Sikhs, which sta", "authors": ["Garima Satija"], "date_publish": "01/03/2019, 17:54:25"}