{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/priyanka-chopra-also-featured-in-english-song-sucker-sung-by-jonas-brothers/articleshow/68215989.cms", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68215658,width-650,resizemode-4/weather.jpg", "text": "से खबरें आ रही थीं कि ' जोनस ब्रदर्स ' एक बार फिर साथ आ रहे हैं और आखिरकार यह सच हो गया। करीब 5 साल से अधिक गैप के बाद 'जोनस ब्रदर्स' ने अपना नया सॉन्ग 'Sucker' रिलीज़ कर दिया है। 'जोनस ब्रदर्स' का यह सॉन्ग बॉलिवुड दीवानों के लिए भी खास है, क्योंकि इसमें प्रियंका चोपड़ा भी नजर आ रही हैं।'जोनस ब्रदर्स' के इस नए सॉन्ग 'Sucker' में निक जोनस के अलावा जो और केविन भी हैं और इसमें नजर आ रही हैं उनकी अपनी-अपनी लवलाइफ। यानी इस विडियो में तीनों भाइयों के साथ हैं निक की वाइफ प्रियंका चोपड़ा, जो जोनस की मंगेतर सोफी टर्नर और केविन की पत्नी डेनिएल जोनस।रिश्तों की बॉन्डिंग को दर्शाने वाले इस सॉन्ग की लाइनें कुछ ऐसी हैं...'I’m a sucker for youSay the word and I’ll go anywhere blindlyAny road you take you know that you’ll find meइस सॉन्ग को रिलीज़ करने से पहले निक अपने इंस्टाग्राम पर कुछ तस्वीरों और फोटोज़ के जरिए इसकी जानकारी पहले ही दे चुके हैं। इसके अलावा उन्होंने अपने भाई फ्रैंकी जोनस का भी एक विडियो पोस्ट किया है, जिसमें वह इसी गाने 'Sucker' पर डांस करते नजर आ रहे हैं।", "title": "'जोनस ब्रदर्स' के म्यूज़िक विडियो में दिखा प्रियंका चोपड़ा का डिफरेंट अंदाज", "description": "Bollywood News: 'जोनस ब्रदर्स' ने अपना एक म्यूज़िक विडियो 'Sucker' रिलीज़ किया है, जिसमें निक जोनस के साथ उनके दोनों भाई केवन और जो के अलावा प्रियंका चोपड़ा, सोफी टर्नर और डेनिएल भी नजर आ रही हैं।", "authors": [], "date_publish": "01/03/2019, 13:57:34"}