{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/swara-bhaskar-questions-to-pm-modi-and-surgical-strike-2-over-air-strike-but-got-trolled-back/articleshow/68195477.cms", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68195477,width-650,resizemode-4/weather.jpg", "text": "Part of the job, no? या इसके अलग से points मिलने चाहिए??!??? https://t.co/oaeJVi3TSw — Swara Bhasker (@ReallySwara) 1551238953000\n@ReallySwara Itna jalan aaye haye... Achha laga hamein... — ravib (@ravibahadur13) 1551239340000\n@ReallySwara Yes it's part of his job. But as a free & safe citizen we can atleast appreciate him for this — Ranjeet (@life_hacker23) 1551239119000\n@ReallySwara Looks like u r in hangover from last night's grieving partyget well soon...#UrbanNaxals #ModiDobara deal with it... — DR Null Sshnuke(23) (@DSshnuke) 1551240431000\n@ReallySwara Pagli sudhar ja Kam se Kam 2024 tak ke liye.. — shantanu Dixit (@dixit_shantanu) 1551252643000\n@ReallySwara We appreciate your work as an actor when you go extra mile to get the character on screen well. So our… https://t.co/bnTqXUGOUN — sudha narayan (@sudhanarayan) 1551255556000\n@ReallySwara सड़े हुए मुह से सड़ी हुई बात ही निकलेगी ना कोई नहीं Keep it on — Thakur Shravan Singh (@Shravan44166564) 1551240131000\n@ReallySwara Back to work?? https://t.co/bzQdNQ5BqW — Shiva (@singhshiva1988) 1551241589000\n@ReallySwara आपका दोगलापन देखा है। इंडिया में कुछ बोलती हो और पाकिस्तान में कुछ। 12 घंटे काम करोगी तो हस्तमैथुन के लिए भी समय नहीं मिलेगा। — Dipesh (@ImdipeshKumar) 1551254443000\n@ReallySwara भगवान तेरी इस जलने की अदा को कायम रखे। बरनोल लगा ले। अभी तेरे कई और रिश्तेदार ठोकने है आर्मी को। — St. Patriot (@NitinPathakDel) 1551240704000\nX\nअपने बेबाक और गाली-गलौज से भरे पोस्ट के लिए मशहूर अभिनेत्री स्वरा भास्कर ने पुलवामा टेरर अटैक के बाद हुए एयर स्ट्राइक को लेकर प्रधानमंत्री पर निशाना साधा है। हमेशा की तरह इस बार भी अपने पोस्ट को लेकर स्वरा जमकर ट्रोल की गईं। दरअसल मैडम स्वरा ने एयर स्ट्राइक को लेकर पीएम नरेन्द्र मोदी के ऊपर निशाना साधना चाहती थीं, लेकिन लोगों ने उन्हें ही अपने निशाने पर लेते हुए ट्रोल कर दिया।बता दें, स्वरा भास्कर ने सोशल मीडिया पर एक खबर शेयर की, यह खबर थी, प्रधानमंत्री नरेन्द्र मोदी के रातभर जागकर एयर स्ट्राइक को मॉनिटर करने के बारे में। अब इस न्यूज़ को शेयर करते हुए स्वरा ने ट्वीट किया और लिखा, 'यह उनके (प्रधानमंत्री मोदी) काम का हिस्सा है, इस काम के लिए भी उन्हें अलग से नंबर मिलने चाहिए?'बस स्वरा का इतना लिखना था कि सोशल मीडिया पर लोग स्वरा की सोच पर बरस पड़े, खूब भला-बुरा कहा और हिदायत दी कि वह सिर्फ फिल्मों में काम करें।एक डायरेक्टर ने उनका यौन शोषण किया था लेकिन उन्हें इस बात को जानने में 6-8 साल लग गए। स्वरा ने किसी का नाम लिए बगैर कहा कि यह हैरसमेंट वर्क प्लेस पर हुआ था और डायरेक्टर काफी हिंसक था।", "title": "स्वरा भास्कर ने सर्जिकल स्ट्राइक 2 और पीएम मोदी पर किया सवाल, जमकर पड़ी गंदी गालियां", "description": "Bollywood News: सोशल मीडिया में अपने बेबाकीपन को लेकर फेमस अभिनेत्री स्वरा भास्कर ने जब एयर स्ट्राइक और प्रधानमंत्री के कामकाज पर सवाल उठाया तो लोगों ने उन्हें खूब फटकार लगाकर चुप कर दिया।", "authors": [], "date_publish": "28/02/2019, 10:28:40"}