{"text": "0-5? How Many Stars Are People Giving To SRK's Zero? Here Are The First Reactions!\n0-5? How Many Stars Are People Giving To SRK's Zero? Here Are The First Reactions!\n21.12.2018\nToday is the day. The day when the nation will give its verdict on Shah Rukh Khan's mega-release Zero. The film helmed by Aanand L. Rai film Zero also stars Anushka Sharma and Katrina Kaif and the film will test the waters today as it has finally hit theatres. The story revolves around a vertically-challenged man, Baua Singh and ever since the trailer released, fans have had their high expectations from the film.\nShah Rukh Khan's fan-clubs all over India were super-excited and geared up for SRK's big release. Here's a glimpse of SRK's unfazed stardom.\nDon't Miss 5.1 K SHARES 153 SHARES 2.4 K SHARES 360 SHARES 12.5 K SHARES\nSRK fans from Delhi welcoming kids from Slum Education and Development Trust to the FDFS screening of #Zero #ZeroDay pic.twitter.com/Z4EaYYj7T6 — Bauua Universe (@SRKUniverse) December 21, 2018\nThat's not all. Even film fraternity extended their heartiest wishes to SRK.\nHearing fab stuff about #zero . Preview show reactions and critics alike ! All the best @iamsrk and team!! This ones a winner 🥂 — emraan hashmi (@emraanhashmi) December 21, 2018\nI’ll go on a limb and say this...#Zero will be a head turner, time stopper, heart breaker and the rescuer of love.\nGrandest luck to @iamsrk @AnushkaSharma #KatrinaKaif — Kubbra Sait (@KubbraSait) December 20, 2018\nZero day today .. all the best @aanandlrai and team zero — Anurag Kashyap (@anuragkashyap72) December 21, 2018\nThis has made me happy. Dil se dua thi is baar! Can’t wait to see the film. https://t.co/gRb7vP0f8U — Ayushmann Khurrana (@ayushmannk) December 20, 2018\nThis has made me happy. Dil se dua thi is baar! Can’t wait to see the film. https://t.co/gRb7vP0f8U — Ayushmann Khurrana (@ayushmannk) December 20, 2018\nBefore you book your tickets, read these tweets.\nRed Chillies\n#zero opens with FANTASTIC occupancy in early morning shows across India. All India average occupancy is 45-50% & at some centers like Kolkata, Bangalore, Hyderabad, guwhati Opening is colossal 75-80% — Sumit kadel (@SumitkadeI) December 21, 2018\nDear @iamsrk please take a break nd re-invent urself...cant take it anymore #zero — GURU (@venky_zindabad) December 21, 2018\nSRK career graph purely as a box office superstar\n1992:Phenomenal debut\n1993:Superstar\n1995:Megastar, a legend, called by majority as no 1\n1998 to 2007:Undisputed no. 1, two bad years in between\n2008:Lost the no. 1 rank\n2010:Out of top 2\n2015:Beginning of downfall\n2018: End#Zero — Sayar (@NemesisOfPain) December 21, 2018\nInterval. Wow. Just wow. It's hilarious so far. Bauaa Singh has got some super funny dialogues. SRK is acing it so far. Anushka Sharma is adorable af. Katrina Kaif has a lesser screen time so far but she is rocking it. It's fun, fun and more fun. #Zero#ZeroReview — Bauuuwaaas Mann (@srkianzaki) December 21, 2018\nRace 3: Disappointment\nTOH: Maha Disappointment#Zero: Baap of all Disappointments\nEnd of an era.This is the worst year for these 3 Khans.\nNow Taimur Ali Khan is the only hope to regain the legacy of Khans.#ZeroReview #ZeroDay — Principle Patel (@PatelSiddhant_) December 21, 2018\nRace 3: Disappointment\nTOH: Maha Disappointment#Zero: Baap of all Disappointments\nEnd of an era.This is the worst year for these 3 Khans.\nNow Taimur Ali Khan is the only hope to regain the legacy of Khans.#ZeroReview #ZeroDay — Principle Patel (@PatelSiddhant_) December 21, 2018\nNot read a single review. Watched the first half of Zero. It is very funny. Shah Rukh is in crackling form. The hall is in splits. #Zero. — Naomi Datta (@nowme_datta) December 21, 2018\nThis year has to be any eye opener for manm, all 3 Khans of Bollywood has failed to get audiences to Theater #Zero #TOH #Race3 whereas small good content driven movies has won people’s hearts. #Wakeup — Rajat Lunkad (@rajatlunkad) December 21, 2018\nBREAKING :\nSRK taking SRK out of the theatre in middle of the movie #Zero pic.twitter.com/5ivz7UXNkY — Thakur Baldev Singh (@HathwalaThakur) December 21, 2018\nThese people booked tickets of #Zero in advance. pic.twitter.com/UwxuJGN09i — Crush Ka Bhai 🤦🏻‍♂ (@CartikPatel) December 21, 2018", "title": "0-5? How Many Stars Are People Giving To SRK's Zero? Here Are The First Reactions!", "date_publish": "21/12/2018, 13:01:57", "description": "Today is the day. The day when the nation will give its verdict on Shah Rukh Khan's mega-release Zero. The film helmed by Aanand L. Rai film Zero also stars Anushka Sharma and Katrina Kaif and the film will test the waters today as it has finally hit theatres. The story revolves around a vertically-challenged man, Baua Singh and ever since the trailer released, fans have had their high expectation", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/0-5-how-many-stars-are-people-giving-to-srk-s-zero-here-are-the-first-reactions-359033.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/zero_1545379816_800x420.jpg"}