{"text": "10 Bollywood Directors Select Their Favourite Films Of 2018 & AndhaDhun Is A Clear Winner!\n10 Bollywood Directors Select Their Favourite Films Of 2018 & AndhaDhun Is A Clear Winner!\nBeing declared as the best film of 2018 by IMDb, Ayushmann Khurrana starrer Andhadhun has also turned out to be the favourite of all big directors. 10 directors revealed the best films of 2018, and most of them had the Ayushmann Khurrana starrer on their list.\nBe it black comedy thriller AndhaDhun, light-hearted film Badhaai Ho or horror comedy Stree, the year of 2018 saw a string of content driven and small budget movies which have outperformed at the box-office, and proved that Bollywood not just runs on starry ventures and big-budget production. So before the year ends, many renowned filmmakers from the industry have shared their favourite films of 2018.\nHere's the list of directors' favourite films of 2018:\nAshwini Iyer Tiwari: AndhaDhun, Patakha, Stree, Badhaai Ho and Raazi\nAli Abbas Zafar: Raazi, Badhaai Ho and Sanju\nMilap Zaveri: Padmaavat, Sonu Ke Titu Ki Sweety, Badhaai Ho, AndhaDhun, Stree, Parmanu - The Story of Pokhran, KGF, Sanju, Baaghi 2, Hichki, Raid, Sui Dhaaga and of course my own film Satyamev Jayate.\nHansal Mehta: Stree, AndhaDhun and Star Is Born. I am also very proud of my own Omerta.\nSuresh Triveni: AndhaDhun, Badhaai Ho, Manto, Mitron (thought it was underrated), Raazi, Tumbbad, Soorma, Mulk, October and Love Sonia.\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nSaket Chowdhary: Tumbbad, Manto, Badhaai Ho, Stree, Raazi and AndhaDhun.\nRaj Nidimoru: AndhaDhun and Tumbbad.\nAmit Sharma: Raazi, I couldn't watch the other films as I was shooting my own Badhaai Ho.\nSriram Raghavan: Raazi, Tumbbad, October, Manto and Stree. My AndhaDhun was to originally release with Stree. Thankfully it didn't.\nOnir: Village Rockstar, AndhaDhun, Stree, Badhaai Ho, Mulk and my own film Kuch Bheege Alfaaz.\nWith inputs from IANS", "title": "10 Bollywood Directors Select Their Favourite Films Of 2018 & AndhaDhun Is A Clear Winner", "date_publish": "31/12/2018, 17:51:35", "description": "Be it black comedy thriller \"AndhaDhun\" or light hearted comedy film \"Badhaai Ho\" or horror comedy \"Stree\", the year of 2018 saw a string of content driven and small budget movies which have outperformed at the box-office, and proved that Bollywood not only runs on starry ventures and big-budget production.", "authors": [], "url": "https://www.indiatimes.com/entertainment/10-bollywood-directors-select-their-favourite-films-of-2018-andhadhun-is-a-clear-winner-359582.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/badhaai_ho_1546250784_800x420.jpg"}