{"text": "If you think your life is sad and dramatic that almost once week you beg to God “Bhagwan ji boring bana do iss life ko” just the way Geet does in Jab We Met, then you, my friend, have higher chances of winning a reality TV show.\ndubeat.com\nIndian reality TV shows have nothing to do with reality. It’s 10% real talent 90% “merey papa auto chalatein hain” drama. These shows are scripted, have prepared participants, who purposely manipulate emotions, and of course great editing! All this makes the lives of the contestants look like a cohesive TV show that we all get hooked to watching. That’s Indian reality shows for you guys, and if you still have an inch of doubt, read this –\nTwitter\n“I was selected in the top 100 but didn’t go any further. Reason: to get selected you need to have a sad story to attract audiences’ sympathy. A few of the contestants lied that their parents aren’t allowing them to dance but the irony was that their parents came to drop them.”\nDon't Miss 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES 2.4 K SHARES\nThat’s what Sanya Malhotra, the Dangal girl who, besides her great dance videos, acted spectacularly in Badhaai Ho, said on Son Of Abish (9:30 minutes onward in the video above) and also to Humans Of Bombay admitting that participants are chosen carefully in order to instill a sense of empathy in the audiences, at least in Dance India Dance.\nAnd people go to any extent to participate in these shows and enjoy their two-minutes of fame. On a Sunday when I had nothing to do, I was scrolling down my social media feed, and meanwhile I switched on TV for background noise. I was watching Roadies after years and was shocked to know how much things have changed. A woman on the show had shared her chest number with judge Nikhil Chinapa in order to be selected.\nThat is when I realised most of these so-called reality TV shows are trash and rigged. But things were a little different when it all started.\nThe first reality TV show of any kind was Bournvita Quiz Contest hosted by Derek O’Brien that was telecasted on Zee TV in 1992. First it was live quiz contest, then it became a radio show, and then a reality TV show.\nmouthshut.com\nLong before almost the entire nation was glued to their television sets cheering for Amit Sana when Abhijeet Sawant took home the first ever trophy of Indian Idol season 1, it all began with Antakshari in 1994, the show which we all remember because of Annu Kapoor who interestingly introduced the teams as Deewane, Parwaane and Mastaane. The show successfully ran for 13 years. It was way before the tug of war for TRPs began.\nTOI\nThen came Boogie Woogie making its debut in 1996. Hosted by Javed Jaffery with his brother Naved Jaffery and Ravi Behl, the show was most sought after by the kids who wanted to pursue a career in dancing.\nFun Fact: Did you the popular contest Dance India Dance – Dharmesh Sir – who is now a judge of another reality TV show called Dance Plus was one of the contestants on the show.\nIn 1995 came Sa Re Ga Ma Pa hosted by Sonu Nigam which was a great reality show that gave Bollywood singers like Sunidhi Chauhan and Shreya Ghoshal a platform to successful career.\nAnd this was way before Himesh Reshammiya spiced up the show with dialogues like “mujhe tere ghar mein roti chaiye” and it remained to be a mere source of entertainment.\nIn 2000, Kaun Banega Crorepati had started to air, the show that changed it all for Amitabh Bachchan.\n(Read More: From Bankruptcy To Crorepati, An Inspiring Journey Of Bollywood’s Shahenshah #50YearsOfBachchan)\nIt was in 2004, that Set India came up with Indian Idol, the Indian adaptation of American Idol. And then the era of high-entertainment content with shows like Bigg Boss (A show where the more contestants fight, the more are the TRPs) came in.\ndaily.social\nThe Great Indian Laughter Challenge, which aired in 2005 for four seasons gave India its most celebrated comedian – Kapil Sharma who now runs his own show.\nAlso Read: Enough Hue & Cry Over ‘Koffee With Karan’ But Where’s The Outrage On The Sexist ‘The Kapil Sharma Show’?\npinimg.com\nNow, the reality TV shows have reduced to mere entertainment. It’s all about drama and TRPs and talent has been long forgotten.\nWhat’s heartbreaking is that the contestants who have won the shows haven’t been popular – most of them don’t have successful career. For instance have you even heard of Abhijeet Sawant and Amit Sana in a long time? We all already have a lot of drama in our real lives, do we need to watch these fake reality TV shows for more? Tell us your thoughts in the comments section below.", "title": "10 Percent Talent, 90 Percent Sob Story: The Success Formula To Crack Every Reality TV Show!", "date_publish": "22/04/2019, 12:05:56", "description": "Indian reality TV shows have nothing to do with reality. It’s 10% real talent 90% “merey papa auto chalatein hain” wala drama. These shows are scripted, have prepared participants, who purposely provoke conflict, and of course great editing! All this makes the lives of the contestants look like a cohesive TV show that we all get hooked to watching. That’s Indian reality shows for you guys, and if", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/10-percent-talent-90-percent-sob-story-the-success-formula-to-crack-every-reality-tv-show-365558.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/how_real_are_indian_reality_tv_shows_1555411760_800x420.jpg"}