{"text": "10 Years On, India Pays Tribute To The Bravehearts Of 26/11 Who Put Nation Before Themselves\n10 Years On, India Pays Tribute To The Bravehearts Of 26/11 Who Put Nation Before Themselves\nTen years ago, Lashkar-e-Taiba terrorists sailed into Mumbai from Karachi and carried out coordinated terror attacks in Mumbai that lasted for three consecutive days. Several people were trapped; there were bomb explosions and gunfires one after the other. The wave of immense fear ran across the entire nation, which noticed an eerie silence with all eyes glued to the TV sets.\nAbout 166 people died and hundreds of them were injured. But the scars are still afresh and probably it will take a lifetime to heal.\nThe country salutes those who fought to keep the city safe and saved many lives. The country pays tribute to the victims and the bravehearts who lost their lives.\nTen years after the 26/11 attacks, the entire nation is mourning together.\n#1\nTributes to those who lost their lives in the gruesome 26/11 terror attacks in Mumbai.\nOur solidarity with the bereaved families.\nA grateful nation bows to our brave police and security forces who valiantly fought the terrorists during the Mumbai attacks. — Narendra Modi (@narendramodi) November 26, 2018\nDon't Miss 3.6 K SHARES 508 SHARES 815 SHARES\n#2\nNever forget!\n#26/11 — Abhishek Bachchan (@juniorbachchan) November 26, 2018\n#3\n#4\nWill never forget 26/11. We have only grown stronger #mumbaikar #jaihind — Varun Dhawan (@Varun_dvn) November 26, 2018\n#5\nRemembering those who put the nation before themselves. And our salute to the city whose resilience always made its people stronger #RememberingTheHeroes pic.twitter.com/T80KfE6chr — Mumbai Police (@MumbaiPolice) November 26, 2018\n#6\nI offer my heartfelt tribute to the ones who put Mumbai first, till the very end. #RememberingTheHeroes pic.twitter.com/ZRVq9AaY0B — CP Mumbai Police (@CPMumbaiPolice) November 26, 2018\n#7\nRemembering our heroes of 26/11... Everyone who helped each other through the tough time.. My heart goes out to their courage and sacrifice and for all the innocent victims .. #MumbaiTerrorAttack — Arjun Kapoor (@arjunk26) November 26, 2018\n#8\n26/11. We will never forget. What has changed since, Mumbai? Are we any safer? We were promised Police Reforms, counter-terrorism training and modern equipment for a woefully understaffed and underpaid @MumbaiPolice force. Seen any? — VISHAL DADLANI (@VishalDadlani) November 26, 2018\n#9\nTen years after the Mumbai terror attacks, thoughts with families and individuals who suffered. We salute those from the police and security forces who made the supreme sacrifice that day. India remains honour-bound to securing justice, and defeating terrorism #PresidentKovind — President of India (@rashtrapatibhvn) November 26, 2018\n#10\nToday, remembering the bravest of souls who led from the front, foiled the 26/11 attacks by giving their all. My salute and deepest gratitude to the martyrs, thoughts and prayers with the families. #MumbaiTerrorAttack — Suresh Raina🇮🇳 (@ImRaina) November 26, 2018\n#11\n.@SecPompeo: On behalf of all Americans, I express my solidarity with the people of India and the city of Mumbai on the 10th anniversary of the #MumbaiTerrorAttack. We stand with the families and friends of the victims, including six American citizens. https://t.co/NGj4xSGkAv pic.twitter.com/F6oI1Rhouh — Department of State (@StateDept) November 25, 2018\n#12\nRemembering the heroes of 26/11 Mumbai terrorist attack who sacrificed themselves for defending the country. 🇮🇳🙏#MumbaiTerrorAttack pic.twitter.com/Vj6s2EVAKI — Madhur Bhandarkar (@imbhandarkar) November 26, 2018\n#13\nMy deepest condolences with families of those who lost their lives in the horrific terror attacks in Mumbai on this day in 2008.\nWe salute the heroic warriors who laid down their lives to protect their fellow countrymen. The nation is indebted to their supreme sacrifice. — Amit Shah (@AmitShah) November 26, 2018\n#14\nRemembering the hero's of 26/11 .. They kept nation before self .. You continue to live in our heart ...#MumbaiTerrorAttack #2611Attack pic.twitter.com/4p4PIAOo7l — Rahul Dev Official (@RahulDevRising) November 26, 2018\n#15\n10 years ! 26.11.2008\n10 #Islamists from #Pakistan attacked #Mumbai & launched one of the worst terror attacks in Indian history. We lost 100s of humans ....Please dont forget... or Forgive!! #RestInPeaceHeros🙏#terrorists #MumbaiTerrorAttack pic.twitter.com/DkiuGypQUO — Koena Mitra (@koenamitra) November 25, 2018\n#16\nTukaram Omble Ji,A real Martyr....\nASI In @MumbaiPolice Was Shot 23 Times On His Chest By Kasab But Tukaramji Didn't Leave Kasab And It Was Him Due To Which Kasab Was Captured Alive...\nSalute Tukaramji's Bravery And Courage.\nYou'll Be In Prayers Sir.\n🙏🙏#MumbaiTerrorAttack pic.twitter.com/z5lYAqJMEA — ☬ SINGH ਸਿੰਘ ☬ 🇮🇳 (@HatindersinghR) November 26, 2018\n#17\n#MumbaiTerrorAttack\n\"Hard times don't create heroes. It is during the hard times when the hero within us is revealed\"#2611Attack, changed the public perception about police\nNEVER FORGET, NEVER FORGIVE\nSalute to those brave hearts❤ — Rushi Pasalkar (@lost_boy_r03) November 26, 2018\n#18\nWe salute our heroic warriors who laid down their lives to protect us. We are indebted for their supreme sacrifice. For now and forever you will inspire us.\nMy deepest condolences and prayers are with families of innocent victims of #MumbaiTerrorAttack pic.twitter.com/cy0I6hQXGJ — Nehal Shah (@NehalShahBJP) November 26, 2018\n#19\n#MumbaiTerrorAttack\nVo chilaatay rahe hum suntay rahe,vo marrtay rahe hum dekhtay rahe,thay kuch jo uth khar laday thay us raat,aaj uni ki yaad me kuch kehena chahata hun, ae mere veer saathion me tumare jaisa ban na chahta hun!\n#26/11,2018 — Smoked Ink! (@InkSmoked) November 26, 2018\n#20\n10 years ago, Pakistani terrorists attacked Mumbai & tried to break India.\nThanks to the sacrifices of our brave commandos, police & the resilience of people, this cowardly attack only brought us all closer.\nMy tributes to the brave victims of #2611Attack#MumbaiTerrorAttack pic.twitter.com/DAQcVrUBEa — Arundhati Reddy (@ArundhatiBlogs) November 26, 2018", "title": "10 Years On, India Pays Tribute To The Bravehearts Of 26/11 Who Put Nation Before Themselves", "date_publish": "26/11/2018, 12:40:13", "description": "India will never be able to forget the night of 26/11 and how it changed the lives of people in Mumbai forever. Ten years after the 26/11 attacks, the entire nation is mourning together. The country salutes those who fought to keep the city safe and saved many lives. The country pays tribute to the victims and the bravehearts who lost their lives.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/10-years-on-india-pays-tribute-to-the-bravehearts-of-26-11-who-put-nation-before-themselves-357387.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/india_will_never_forget_2611_pays_tribute_to_the_bravehearts_who_put_nation_before_themselves_1543219036_800x420.png"}