{"text": "11 Facts About Baahubali: Before the Beginning Show That Will Pump Up Your Excitement!\n11 Facts About Baahubali: Before the Beginning Show That Will Pump Up Your Excitement!\nRevenge, retribution, redemption. And at the heart of it all the journey of a young woman looking to avenge her father’s death that culminates in her being the powerful queen of Mahishmathi.\nIf that name rings any bells, it’s because this is the story of Sivagami, the mother of Bhalladeva, the antagonist in the blockbuster Baahubali movies. Now Netflix is bringing Baahubali: Before the Beginning set several years before the events in Baahubali to a screen near you.\nDie-hard fans may be disappointed that the series will not have Rana Daggubati, Prabhas or most of the other heavy-weights. But here are 11 facts that will make you want to watch this show.\nscreen grab/youtube\n1. Here’s why it all began:\nThe series rewinds to 50 years before the Baahubali movies. Viewers will also get an indepth look into what daily life was like in Mahishmathi.\n2. Location, location…leeches:\nscreen grab/youtube\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe series is being shot across multiple locations including Ramoji Film City in Hyderabad, Cherrapunji, Thailand, and Kerala. Fun fact: The Kerala experience was a little clingier than expected with the production team fighting off tonnes and tonnes of leeches.\n3. A new queen is crowned:\nNetflix\nThe movie will have Mrunal Thakur playing the role of the younger Sivagami. Mrunal says that it will be difficult to match up to Ramya, who plays Sivagami in the movies, and admits it was difficult to get into the Shivagami “Mera Vachan Hi Hai Shasan” mode. She learnt Kalaripayattu for the role and is now learning to ride a horse. Mrunal has previously worked in Marathi movies, TV shows like Kumkum Bhagya and a movie Love Sonia.\n4. New cast, star cast:\nFlickr\nBaahubali: Before the Beginning will also star Rahul Bose as Skandadasa. Others in the cast include Atul Kulkarni, Vaquar Sheikh, Jameel Khan, Siddharth Arora and Anup Soni.\n5. The rise of new kingdoms:\nWhile most of the drama in the movies unfolds in the palace (other than the epic fights of course), the series goes a little deeper and we will meet new characters from the streets of Mahishmathi. It will also introduce new kingdoms not seen in the movies.\n6. New characters:\nscreen grab/youtube\nYou’ll see a lot more sub-plots and characters in the series but it will predominantly be about Shivagami, Katappa and Sivagami’s husband, Bijjaladeva, who was born handicapped.\n7. Director’s cut:\nEven though the series is not directed by the film director, SS Rajamouli, he does direct some action sequences for the season finale. So that’s a big yay.\n8. You don’t need to read the book first:\nThe series is based on the book The Rise of Sivagami by Anand Neelakantan. It is the first book in the series Baahubali: Before the Beginning and is a prequel to the film Baahubali: The Beginning\n9. Even more drama than the movies:\nscreen grab/youtube\nThis one is going to be more drama, so there’s more reason for nail-biting than just fight sequences.\n10. Learn Kattappa’s backstory:\nWhile we finally know the answer to why Katappa killed Baahubali, we don’t know why he became Katappa, fierce, loyal and with his own warped moral compass. So expect some more dope on that too.\n11. An Indian Game of Thrones?\nNetflix\nAuthor Anand Neelkanthan, who is also a screenwriter for the show says that the series will be much like an Indian Game of Thrones and there is content that the censor board would not have cleared for a movie.\nThe Baahubali series is expected to be released in 2019 on Netflix.", "title": "11 Facts About Baahubali: Before the Beginning Show That Will Pump Up Your Excitement!", "date_publish": "09/11/2018, 09:28:23", "description": "Now Netflix is bringing Baahubali: Before the Beginning set several years before the events in Baahubali to a screen near you. Die-hard fans may be disappointed that the series will not have Rana Daggubati, Prabhas or most of the other heavy-weights. But here are 11 facts that will make you want to watch this show.", "authors": ["Kabeer Sharma"], "url": "https://www.indiatimes.com/entertainment/11-facts-about-baahubali-before-the-beginning-show-that-will-pump-up-your-excitement-356320.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/baahubali_prequel_1541745755_800x420.jpg"}