{"text": "No matter how much you try to deny it but films do have a major influence on our lives. Cinema is an art form that holds the power to move an audience. For instance, a Kal Ho Na Ho taught us the importance of living life like there’s no tomorrow and on the other hand, a Dear Zindagi tried to kick start conversations around mental health and the stigma attached to it. Now, haters can come up with names of thousand movies that they deem as useless, but as they say, it’s all about perspective. It’s only on us whether we want to see the bright side or scrutinize everything with the sole motive to take out flaws.\nWe, however, aim to be a part of the former club. Therefore, we have curated a list of 11 movies from recent times that managed to make a point and loudly so. These movies not only entertained us, but gave us life lessons on courage, perseverance, motivation and everything in between. So, here goes:\n1. Padman\nAmidst many arguments on how this movie was a propaganda and how Akshay Kumar and his wife Twinkle Khanna are trying to make a name for themselves by making movies on social causes, most of us forgot the bottom line of the film. First things first, due credit needs to be given to the man Arunachalam Muruganantham, who invented low cost sanitary napkins and made life easier for many women of our country. Secondly, we failed to latch on to the life lessons that this movie taught us.\nFirst and foremost, it taught us a lesson that we all know deep down but somehow in the hustle-bustle of our lives, we tend to overlook it - No one but you alone can help yourself! As cliched as it may sound, akele aaye the akele hi jana hai holds true and the more you grow the more relatable this line gets. Who better than your own self to bank upon in rough times? If Padman wasn’t determined enough, do you think he would have achieved his goal ? Imagine, even his loved ones left his side for they feared the society and its judgments. However, our guy didn’t lose hope and kept finding a way to make the cheapest sanitary napkins and in the end, he emerged successful and how.\n2. Hichki\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThis film dealt with a medical condition namely the tourette syndrome. Hichki also marked Rani Mukerji’s comeback after a long hiatus. This movie might not have done phenomenally well at the box office but it sure won a lot of hearts purely because of its strong storyline and warm characters. While this film revolved around schools and lack of teachers, resources etc but the bigger picture had several underlying lessons to be learnt from. Firstly, Hichki prompted everyone to let go of his or her insecurities and taught that self-confidence is everything. A drawback or a medical condition in no way, means that you are lesser than your contemporaries. It shouldn't stop you were exploring your true potential and pursue your dream without hesitation. What’s more it also signified that there is no thing like a failure, as every setback is just a new learning and it acts as an opportunity to explore different options.\nLast but not the least, most of us need that one person be it a teacher, mentor or a friend who uplifts us by believing in us unconditionally. To have that kind of support is definitely a blessing and should be valued, to day the least.\n3. October\nThis Shoojit Sircar directorial received a mixed reaction from the audiences and the critics alike. It wasn’t your conventional love story. The plot might have come across as a simple story of a girl and boy but as the movie progresses, the complexities hit you way way hard than you can imagine. This incomplete love story between Varun Dhawan and Banita Sandhu had more than one life lesson to teach. Apart from the cliched true love is unconditional and has no expectations, it also taught that all it takes is one person, one moment, one single word to change someone’s life forever! What’s more this beautiful film made us realise that the hurt to see your loved one in pain is something that can't be explained in mere words.\n4. Raazi\n“Ae watan mere watan aabad rahe tu”\nThis film in particular had the lesson that most of us would have recognised. The selfless and nation-loving Sehmat left no stone unturned to keep her country safe. A brilliant spy who didn’t think twice about her own life, crosses the border to protect the country but ends up falling for her Pakistani husband. However, country trumps love and she chooses the pain of betraying her husband over her country. The life lesson however indicates that no kind of war is good because it only brings pain and destruction.\n5. Sanju\nThe much talked about biopic on the life and times of Bollywood’s bad boy-turned-good Sanjay Dutt attracted a lot of attention both good and bad. There were debates on whether this movie tried to whitewash his image in public and tried to redeem his lost respect. Amidst all this, most of us forgot how it brought forward a lot of life’s realities. For starters, this film again proved that Jab Jaago Tab Savera. There’s no right time but the present to start afresh. Life gives you many opportunities to undo all the wrongdoings. On the other hand, life is also a great leveller. You can have all the money in the world yet when the time is wrong, nothing can stop you from sinking. The silver lining, however, is that if a person can own up to his or her mistakes, nothing can stop him/her from starting afresh. All in all, fall down but rise and pick yourself up.\n6. Badhaai Ho\nBadhaai Ho turned out to be quite a path-breaking film last year. Addressing an issue that no one could think of in the first place, it got a lot of positive response due to a unique plot. Despite the whole parents having an unplanned baby after a long gap and the siblings feeling embarrassed bit, what was even more interesting to note was the fact that Ayushmann, who played the eldest son went through an awakening of his own. Once he made peace with it, he realised that society is going to make fun regardless. It’s basically on us how to emerge over all the judgements and do what is morally right. It taught us how, one shouldn’t be bogged down by what the peers or the society thinks. Rise above all that name calling and choose the righteous path over image.\n7. Uri: The Surgical Strike\nOne of the most recent releases of the lot, Uri celebrated Army in the best manner and rightly so. Not only did it educate civilians about the sacrifices that Army undergoes to protect the nation, it also taught us the most important lesson of all. Team work is equal to dream work. Not just that, it also made us realise that the right emotions at the right time is not a wrong thing.\nSometimes, emotions bring out the best results. Not just that, it also made us remember a simple lesson that we have been taught all our life, one must honor his/her commitments. Major Vihaan promised that India will take revenge for the Uri attack and not even one soldier will be hurt. He made sure that the execution was so watertight that none of his jawans were at a risk. In the end when the team returned after accomplishing their mission, every single person had a sense of pride.\n8. Hindi Medium\nThis Irrfan Khan starrer was another small budgeted film that struck the right chord with the audience. School admissions are no child’s play these days. On top of that, in the race to bag the best school for our children, we take some unconventional routes but what we fail to understand is that we are only making it tougher for the generations to come. We all need to understand the fact that the rich are only going to get richer and these things affect the middle class more than anyone else.\nCircumstances unite and class only divides. Another important key learning is that we need to embrace our own language and stop judging people who are not as adept as we are with English. There’s always a learning curve and a good person holds much more value than a devious English speaking one.\n9. Tumhari Sulu\nAn easy breezy yet lovable character Sulu managed to tug at our heartstrings with her adorable personality and a never say die attitude. She not only entertained us with her simplicity and enthusiasm but she also taught us that if you make up your mind you can conquer the world. You might face some difficulties on the way but as they say where there’s a will there is definitely a way.\n10. 2.0\nThis Rajinkanth and Akshay Kumar starrer made headlines for reasons more than one. From killer VFX to a gripping storyline, it shattered a lot of records at the box office. The bottom line, however, said something that we all know but we choose to overlook it. Technology might have a lot of perks but it does have it’s own set of drawbacks and side-effects. It is harmful for not just the users but also for the environment.\n11. Tumbbad\nThis movie was definitely a dark horse. With no big names to boast, this film taught us a very important lesson. Greed will get you in a lot of trouble. We need to make do with things that we do have and work hard for the things that we don’t. Attaining wealth by evil ways will only bring woes and at the end of the day because it’s tainted.", "title": "11 Films From Recent Times That Had Underlying Life Lessons Which Many Of Us Failed To Notice", "date_publish": "15/02/2019, 11:36:33", "description": "No matter how much you try to deny it but films do have a major influence on our lives. Cinema is an art form that holds the power to move an audience. For instance, a Kal Ho Na Ho taught us the importance of living life like there’s no tomorrow and on the other hand, a Dear Zindagi tried to kick start conversations around mental health and the stigma attached to it. Now, haters can come up with n", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/11-films-from-recent-times-that-had-underlying-life-lessons-which-many-of-us-failed-to-notice-338289.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/life_lessons_1549971898_800x420.jpg"}