{"text": "Life is pretty simple these days. Most of the millennials have a set routine. We work hard and binge harder, don’t we? Well, barring the ‘party animals’, most of us look forward to ending a day’s work with some entertaining content a la Netflix, Prime and thousands of other OTTs style. Now, pop culture is an addictive thing. Despite having our preferences carved in stone, every once in a while, we end up following the trends and watch something out of mere curiosity.\ngiphy\nOne such movie that caught everyone’s eye in recent time was To All The Boys I’ve Loved Before. Every single being saw the feel-good rom-com and thus made the lead guy Noah Centineo, an internet sensation. If you are thinking of denying this, then i’d suggest don’t even try because you can fool the world but not your own self. Without ascertaining life’s deep and dark side, let’s just say that the internet collectively crushed on the charming young boy. So much so, that he became the next Radhika Apte of Netflix globally!\nnetflix\nNoah has had three romantic movies to his credit already. While the reviews and performances of the other two remain to be questionable, it’s only vital that we get to know the boy a little more than his onscreen boy-next-door image. So, here are some of the little known facts about Noah Centineo, who has stolen the hearts of many girls and given some major boyfriend goals to all the boys. Scroll!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n1. He not only is a good actor but the guy is creative as well. In the movie To All The Boys I’ve Loved Before, he came up with the idea of that cutesy pocket scene.\n2. He’s going to be in the Charlie’s Angel reboot! The downside is that he won’t be the bad guy but he’ll be playing a love interest of one of the Angels.\ntwitter\n3. He’s much in demand because he has a lot of interesting projects lined up. He will soon transform into a superhero for a movie! Yes, you read that right. According to reports, he’s in talks to play He-Man in the movie Masters Of The Universe\nyoutube\n4. He’s a philanthropist. Noah is supporting several charities and in order to raise funds for them, he is auctioning the opportunity to join him on a romantic hike followed by a picnic while enjoying the gorgeous sunset. All the proceeds from the auction will go to charity!\nyoutube\n5. The Italian-American actor wanted to pursue professional soccer before he ended up in the acting field\nimdb\n6. Noah Centineo had a guest appearance in Camila Cabello’s hit music video Havana\n7. When Noah was just 6 years old, a dog attacked him and left him with that sexy scar most of the girls really dig.\ninstagram\n8. Just like his onscreen image, Noah is a die-hard romantic in real life as well. He often imparts wisdom to his fans and posts cutesy stuff on his Twitter account.\nTo the girl in the high waisted denim shorts, dark spaghetti strap t-shirt and red clip in her hair who I haven’t stopped thinking about since earlier today when I didn’t even attempt to talk to you as you walked past me...i’m still thinking about you. And it’s heartbreaking 😑 — Noah (@noahcent) May 21, 2018\n9. He made a blink-and-miss appearance in Keeping Up With The Kardashians\nyoutube\n10. Last year, a video of Centineo resurfaced on the internet where he spoke about mental health issues, substance abuse and yoga. Talk about wisdom at such a young age!\nNoah talking about coping with bad habits, anxiety, and depression pic.twitter.com/akDexeR93S — Dee (@buttrfIytattoo) August 20, 2018\n11. Oh and he's SINGLE!\ntwitter\nThe world suddenly seems like a happy place, doesn't it?", "title": "11 Facts About Internet's Heartthrob Noah Centineo Who Stole Hearts With His Old-World Romance", "date_publish": "22/04/2019, 18:25:24", "description": "If you haven’t been counting the days for Game Of Thrones last and final season, then I'm sorry to tell you but STOP calling yourself a true fan! I mean seriously, at this very moment in time with just 5 days left for season 8, most of the true-blue fans are freaking out and waiting with bated breath for it to begin. It goes without saying that it’s a bittersweet feeling for almost everyone. On on", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/11-facts-about-internet-s-heartthrob-noah-centineo-who-stole-hearts-with-his-old-world-romance-365150.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/noah_centineo_1555937716_800x420.jpg"}