{"text": "11 Instances That Prove Game Of Thrones Season 8 Has Been The Most Dramatic One Of The Lot!\n11 Instances That Prove Game Of Thrones Season 8 Has Been The Most Dramatic One Of The Lot!\nSpoiler alert: This article contains spoilers on Game of Thrones season 8. If you have still not watched all three episodes, you need to catch up soon.\nvia GIPHY\nGame of Thrones season 8 is finally happening – it has officially begun. After 595 days, if anything says it’s worth it, then it was the epic battle of Winterfell. The Long Night finally came and the Night King and his army of dead are no more. There are three more episodes left but one more epic battle that will decide who finally sits on the Iron throne.\nBut wait… did you notice that this season has been more dramatic than ever before? These instances prove just that. Take a look!\n#1 To be honest, Drogon staring at Jon Snow as he kissed Daenerys Targaryen has to be the funniest scene on GoT!\nvia GIPHY\n#2 Cersie refused Euron Greyjoy’s indecent proposal only to agree after 30-seconds. All for a savage, epic one-liner? #JustCerseiThings\nTwitter\nOf course, this scene was as dramatic as any 90’s SRK film.\nWHO DID THIS?! I DEMAND ANSWERS! 😂😂☠️☠️😵😵 pic.twitter.com/b2TU26z55Y — Umar Ahmed (@TheUmarAhmed) April 15, 2019\nDon't Miss 159 SHARES 842 SHARES\n#3 Arya appeared from nowhere to kill the Night King.\nvia GIPHY\nIn the episode’s climatic moment, Arya Stark pounces on him from nowhere and then stabs him, like it was child’s play.\n#4 And then her mid-air hand-switch was just too much!\nvia GIPHY\nTo kill the Night King, Arya Stark pulls off a Michael Jordan-esque midair hand switch. Like seriously?\nArya switched hands like pic.twitter.com/4UT6dSwf78 — Barstool Sports (@barstoolsports) April 29, 2019\n#5 Night King's smirk at Daenerys!\nHotstar\nNight King's smirked at Daenerys after she realises that dragon fire did nothing. That was the final hint of a human emotion from the deadliest creature. For some, it was terrifying, and for others, it was funny.\n#6 Love was in the air during the war!\nvia GIPHY\nThe battle of life and death is going on, and strangely everyone is with their crushes. Tyrion and Sansa are discussing they could have made a better couple. Arya saves the Hound from White Walkers and then he saves her life later. Jorah Mormont and Danny are fighting the battle together. In fact, Jaime, Tormund and Ser Brienne of Tarth (the love-triangle) are also battling it out together.\nYou know, who was the only lonely person? Jon Snow. He didn’t even get to kill the Night King. That wasn’t fair, tbh.\n#7 It was such a big battle but no major character died. NONE.\nTwitter\nWhile fans were speculating that Arya, Jaime or Brienne Of Tarth might be dead in the biggest ever battle against the army of dead in Game of Thrones, none of the major characters died. All of them got lucky multiple times.\n#8 Everybody got drunk before the war because #JoHaiSamaKalHoNaHo!\nvia GIPHY\nTormund and Jaime were close to confessing their love for Brienne of Tarth under the influence of alcohol. Also, Brienne became the first woman Knight of the seven kingdoms because Jaime was drunk and all emotional.\n#9 No wait, some were enjoying sex as well.\nvia GIPHY\nWhy did Arya had to sleep with Gendry. Why?\n#10 And what’s up with Bran? And why the hell he had to warg during the battle?\nTwitter\nAnd the big question is where did he go? why nobody asks him any questions?\n#11 That piano background score during the last 20 minutes of the battle made it even more dramatic.\nBut honestly, it was amazing. Kudos to Ramin Djawadi, the man behind it.\nAlso Read: 21 Iconic Game Of Thrones Quotes That Are Filled With Inspiring Life Lessons!", "title": "11 Instances That Prove Game Of Thrones Season 8 Has Been The Most Dramatic One Of The Lot!", "date_publish": "30/04/2019, 17:13:20", "description": "Don't you agree that Game of Thrones season 8 was more dramatic than any of the seasons ever before? From Night King's smirk to Arya Stark's mid-air hand switch, here are the instances that prove just the same. And by the way, this article contains spoilers.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/11-instances-that-prove-game-of-thrones-season-8-has-been-the-most-dramatic-one-of-the-lot-366342.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/11_instances_that_prove_game_of_thrones_season_8_has_been_the_most_dramatic_one_of_the_lot_1556624523_800x420.jpg"}