{"text": "An award winning host, storyteller and viral content creator, Jay Shetty is here to change lives of as many as he can. The inspirational speaker rose to fame just three years ago, thanks to digital medium, and since then there has been no looking back.\nInstagram/Jay Shetty\nWondering what makes him different from gurus and monks! Well, this 31-year-old is different from many pundits as he addresses real life issues every millennial is facing. And those aren't when will you get married, or get a job but deeper issues like how to deal with loneliness, how to deal with a bad break up, how to overcome your fears and many such viral wisdom that no one really addresses.\nThis makes him one of the most viewed people on the internet internationally. So much so, that his popularity landed him on the show with Ellen DeGeneres. Take a look\nDon't Miss 151 SHARES 531 SHARES 684 SHARES 520 SHARES\nLife coach and vlogger Jay Shetty sat down with Ellen to talk about his journey from being a monk to becoming one of the most popular motivational speakers in the world.\nFor those who aren't following him yet, here we present to you his top 11 life lessons that motivational speaker Jay Shetty shows which will make you rethink about life and elements surrounding it.\n1. After you break up\nThere are a lot of times when a relationship leaves you heartbroken. According to a survey, couples are getting impatient about dealing with each other's problems and are not consistence in dating. So remember you are not alone dealing with a wounded heart. So remember this and shake it off.\n2. If you fall in love too fast\nIt's okay. as long it happens organically, there's nothing to be afraid of. Not every relationship is the same, so experience it for its newness.\n3. On preparing for failure\nNo one should decide your performance but you. If you lose some, win some. Nothing makes you a failure, it just becomes a learning curve. Whether your job is eating you up or your relationships are not long term, just know it's not you, it's always the situation.\n4. On addiction and recovery\nNothing should become an addiction or obsession. Whether it's substance intake, relationship, or even a game on your phone. Don't let it rule your mind. Know your problem and work towards it before you need help.\n5. If you're feeling drained, watch this\nTake a break. Nothing is as important as you. No job, no person, no amount of money is bigger than your sanity and mental peace. So don't let materialistic things take that away from you. Take that pending vacation, be at home and do nothing. It's okay to laze around, you deserve it.\n6. If you feel pressure\nDon't let any amount of pressure upset you and over take you. Hold back because it's okay to say no to parties, dating or travel plans. It's okay to say no. Don't become a social mess and be all over. Take that time off to switch off and come back better. Learn to prioritise and people will prioritise you.\n7. If they stop messaging\nLearn to move on. You can't control someone's mind or feelings for you and you should not. It's okay to wait and give time. Don't be impulsive.\n8. If you want to overcome your fears\nWill you please believe in yourself? Take that leap of faith and challenge yourself and I promise you, you will feel amazing like never before. No relationship or person or job can give you a feeling of satisfaction the way you yourself can.\n10. If you're drowning in information\nSnap out. Too much or too less information can be hazardous. Don't overthink about your future. Let things unfurl at their own pace and you will see yourself in a more calmer zone.\n11. If you feel lonely\nYou are not alone. We know it's easier said than done but it's really true. One out of three people face loneliness because of their fears. Learn to take up a skill or a craft and release your energies on excelling at that. Believe me, everything is a blessing.\n12. Learn to let go\nInvest your money in experience rather than things. This is a great way to of breaking the loneliness and materialism cycle. Schedule a time to talk to a friend. Take a class to learn something new. Volunteer to deepen your sense of purpose and spend time with people who look more like your future than past.\nBefore we sign off, just remember, delay is a blessing. So don't fret if things don't pace up your way. Believe in yourself and the world is yours.", "title": "11 Life Lessons From Motivational Speaker Jay Shetty That'll Help You Rethink Your Life", "date_publish": "25/03/2019, 16:53:38", "description": "An award winning host, storyteller and viral content creator, Jay Shetty is here to change lives for as many as he can. The inspirational speaker rose to fame just three years ago, thanks to digital medium, and since then there has been no looking back.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/11-life-lessons-from-motivational-speaker-jay-shetty-that-ll-help-you-rethink-your-life-364011.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/jay_shetty_1553085246_800x420.jpg"}