{"text": "In 2016, during an interview, Deepika Padukone spoke about Ranveer Singh (Her boyfriend then) and said, \"He is my best friend. I am emotional, sensitive and vulnerable and I hurt easily. I can be so naked in front of Ranveer... and I know he will never hurt me or take me for granted. That is the kind of trust and understanding we have.\"\nIn an industry where everything changes every single day, maintaining relationships is one of the toughest things. Both Ranveer and Deepika didn't just date for six years but together, they built a foundation for the kind of love you only hear about in books and see in films.\nThe romance between the couple sparked on the sets of Bhansali's film in 2012. Many speculated and thought just like other on-the-set flings, this one would fizzle out in oblivion just as soon as the film ends. What they didn't see coming was a love story that they would all together celebrate in 2018.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nToday, one day after they were officially announced man and wife, we only have best wishes for the couple who solemnized their affair and are on their way to make their love last forever.\nAlso read: 11 Quotes By Ranveer & Deepika That Prove They Deserve The 'Best Couple' Trophy!)\nEven though we all were far away from their celebrations in Italy, we did get all the updates-thanks to social media. From stalking Ranveer-Deepika's team on social media to waiting for their official pictures with bated breath, here is all that we loved about the #DeepVeer wedding (Clearly the most hashtagged event of the year)\n1. Two people who enjoyed the most at their wedding were-Ranveer and Deepika themselves!\nPinterest\n2. A destination wedding with ONLY close friends and family members. Because weddings are supposed to be for people who actually matter.\n3. Apart from all the designer couture and lavish jewellery, the couple followed all the traditions.\n4. The couple made sure that the wedding was a private affair-Guests were requested to not click any photos and post on social media sites.\n5. The couple decided to not accept any gifts, instead, they requested the guests to donate the money to Deepika's Live Love Laugh foundation.\nInstagram\n6. Ranveer, like always was in his full form. From dancing on cheap Bollywood songs to making a 'Dhamakedaar filmy' entry, Ranveer Singh was indeed the filmiest groom we had ever seen!\n7. The inclusivity and acceptance of each other's traditions. The couple tied the knot twice- once following the traditions as per Konkani traditions and the next day, Sindhi wedding ceremony took place.\n8. Food (Because weddings are ALL ABOUT FOOD, isn't it?): From Mangalorean cuisine to Sindhi food that included Sai Bhaji, Sindhi Curry and Pooran Poli, a dedicated team of chefs was appointed to give all the guests and family members a special gastronomic experience.\n9. Deepika's love for roses and water-lilies became a major inspiration for the wedding decor.\n10. A lot of things at their wedding were EXTRA and we loved every bit of it. From groom entering the wedding venue in a sea-plane to an exclusive deal that was signed by the Chefs t hat the food menu would not be prepared anywhere else.\nPinterest\n11. The media wasn't invited to cover the wedding but as a part of a sweet gesture, Ranveer and Deepika sent out thank you notes with sweets to their media friends. Now, that's sweet, right?\n12. Ranveer Singh didn't shy away from expressing his emotions to his lady-love. According to reports, Ranveer went down on his knees during the Sangeet ceremony to propose Deepika once again.\n(Also read: Film Fraternity Pours In Wishes For Ranveer-Deepika, Congratulates Them For New Beginnings!)", "title": "12 Endearing Things About Ranveer-Deepika's Fairytale Wedding That Will Make You Swoon!", "date_publish": "16/11/2018, 11:53:54", "description": "From stalking Ranveer-Deepika's team on social media to waiting for their official pictures with bated breath, here is all that we loved about the #DeepVeer wedding. 12 Sweetest Things That We Absolutely Loved About Ranveer-Deepika's Dreamy Fairytale Wedding!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/12-endearing-things-about-ranveer-deepika-s-fairytale-wedding-that-will-make-you-swoon-356785.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542350240_800x420.jpg"}