{"text": "Their wedding ceremony was a private affair but the whole country rejoiced and celebrated the union of their love. Deepika Padukone and Ranveer Singh are a power couple in the true sense and apart from being in love, their individual choices as actors have proved to be a fruitful one too.\nThey are at the top of their game in the film industry and have set some really high #CoupleGoals for everyone else to follow.\nAgencies\nAt the trailer launch of Simmba, Singh told the media, \"I have achieved 'boyfriend of the millennium' now I'm working towards being the husband of the millennium.\"\nNothing much has changed and Singh is working his way towards being the husband of the millennium. In case you are wondering what we are talking about, here are 12 times when Singh proved that he is damn serious about achieving the tag.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n1. When Ranveer Singh expressed how he wants to become the 'Husband Of The Millenium'\n2. When he couldn't stop praising his wife Deepika for preparing so well for their Italy wedding.\n3. When he proved that he has eyes only for his wife Deepika Padukone! Because Jug ghoomeya-thaare jaisa na koi\n4. When he proved that he is not at all insecure of his wife and actor Deepika. Instead, the better she works, the better he looks in the film.\n5. Because she is his best friend, ya! When Singh proved that even after their marriage, friendship is the solid foundation of their relationship.\n6. After winning the best actor award for Padmaavat, Ranveer expressed his love for the Queen of his heart-Deepika Padukone\n7. When he couldn't stop expressing his love for wife Deepika Padukone, who curated their dream wedding.\n8. Her happiness is his happiness and he wouldn't change it for anything else.\n9. When he expressed how he always knew that DP was the one. Even after marriage, his world revolves only around her.\n10. While most of the men today run away from commitment, Ranveer again proved that being committed to the love of his life is important for him.\n11. The key to a successful marriage is being thankful and grateful for all the times your partner goes out of the way and Singh has already cracked the code.\n12. Their marriage is all about being in love and doing little things for each other.", "title": "12 Times Ranveer Singh Proved He's Serious About Winning The 'Husband Of The Millenium' Tag!", "date_publish": "13/01/2019, 11:42:11", "description": "Their wedding ceremony was a private affair but the whole country rejoiced and celebrated the union of their love. Deepika Padukone and Ranveer Singh are a power couple in the true sense and apart from being in love, their individual choices as actors have proved to be a fruitful one too.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/12-times-ranveer-singh-proved-he-s-serious-about-winning-the-husband-of-the-millenium-tag-360074.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_and_deepika_1547120367_800x420.jpg"}