{"text": "Do you know what the only certain thing in life is? It’s death. You might not know how you’re going to spend the rest of your life, but the moment you’re born; one thing is certain – YOU WILL DIE.\n“Cancer… the cloud that comes, but never passes. It just hovers over you for the rest of your life, silently waiting in the shadows,” said Akshay Kumar who had lost his father to cancer.\nCancer comes like an uninvited guest at that time when you least expect it – affecting not just the patient but the entire family, emotionally as well as physically. For a lot of people, the C-word sends shivers down their spines.\nSurviving cancer is one of the luckiest things in the entire universe. It’s like almost meeting the death. And once you battle it out and survive, your perspective towards life changes – for the good.\nHere are some of the life lessons that people like Sonali Bendre, Irrfan Khan and Ayushmann Khurrana’s wife Tahira Kashyap gave us, that each one of us should live by before it’s too late.\n#1 Don’t hold on to an emotion for too long!\nOf course, it breaks you – the news of being diagnosed with cancer – but don’t hold on to it. Feel that emotion and release them soon after.\nDon't Miss 862 SHARES 322 SHARES 122 SHARES 197 SHARES 291 SHARES\nYou know what Ayushmann Khurrana and his wife Tahira Kashyap did after she was diagnosed with cancer. They didn’t cry the entire night; they went out for a movie date.\nHold on to an emotion – neither sadness nor happiness. If you hold on to happiness for too long, it becomes nostalgia of the past as opposed to happiness or joy for the present. You’ve had a happy moment, sure, but life right now, isn’t too bad; don’t compare.\n#2 Laughter truly is the best medicine!\nOnce you accept the fact that one day – sooner or later – you’ll die, you’ll have nothing to lose in life. Just laugh a little more; just love a little more; cuddle your loved ones and pets; watch comedy gigs; meditate. Just stop worrying about the end. It’s the journey that matters.\nAlso Read: Cancer Made Irrfan Khan See Life From A Whole New Perspective & He Isn’t Panicking Anymore\n#3 Things can change at an instant!\nYou might have planned every single thing about your life – from finances to your future kids – but cancer will always come unexpectedly.\nChange is the only constant. All you need to learn in life is to adapt to this change quickly. That’s what Irrfan Khan and Sonali Bendre did.\n#4 Turn a lemon into a lemonade!\nFocus on the positive – Be positive, see the good in everything, life is beautiful and so are you.\ninstagram/iamsonalibendre\n#5 It’s only hair!\nOf course, cancer treatments aren’t anything close to what you call “fun”. They have side effects too. Sonali Bendre decided to get rid of her hair on her own terms because it’s only hair, after all. Why let each falling strand of hair remind you again and again of the bad times you’re going through? Why not shave it off in one-go and accept what life has thrown upon you.\n#6 Accept what life has thrown upon you!\n#7 Don’t let your bad times define you!\nDon’t let life get you down. Don't let it make you come across as a victim. Instead, be spiritual, have the will to fight it off. Be an inspiration for others.\n#8 Don’t be afraid to die!\nTruth is better than the fear.\n#9 Always celebrate life!\nIt’s strange but a cancer patient is the most positive person you’ll ever meet. His/her outlook towards life or the meaning of life for him/her changes completely. It’s the little things/feelings that matter in life – the deeds you do and the moments you live.\nIt’s rightly said – when your body lies in the grave, people only talk about how you were and what you did and never about what you owned or have left behind.\n#10 Live your life normally despite the challenges!\n#11 Your body is home for your soul, don’t destroy it!\nYour body has been through so much. Give it time to heal and recover.\nLife will pass you by if you aren’t careful. Sonali Bendre was in pain for a very long time but she kept ignoring it, and it turned out to be cancer. Treat your body like a temple. Spend time with your own self, sometimes.\n#12 Share your story/problems!\nYou have an avenue to talk it out. When you share your problems, you’ll hear similar tales from friends and acquaintances.\n#13 Uncertainty is the only certainty!", "title": "13 Times Sonali Bendre & Irrfan Khan Taught Us How To Live Life While Battling Cancer!", "date_publish": "10/12/2018, 18:16:08", "description": "Surviving cancer is the one of the luckiest thing in the entire universe. It’s like almost meeting the death. And once you battle it out and survive, your perspective towards life changes – for the good. Here are some of the life lessons that people like Sonali Bendre, Irrfan Khan and Ayushmann Khurrana’s wife Tahira Kashyap gave us, that each one of us should live by before it’s too late.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/13-times-sonali-bendre-irrfan-khan-taught-us-how-to-live-life-while-battling-cancer-357060.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/13_times_sonali_bendre__irrfan_khan_taught_us_how_to_live_life_while_battling_cancer_1544445159_800x420.jpg"}