{"text": "14 Videos Of Ranveer Singh That Prove He Can Headline Any Party & Turn It Into A Blockbuster Gala!\n14 Videos Of Ranveer Singh That Prove He Can Headline Any Party & Turn It Into A Blockbuster Gala!\nRanveer Singh real life is a big fat party and he surely knows how to be happy and keep everyone around him happy. The enthu-cutlet that he is, he is the last person to leave every party and this fact was proved right when Akshay Kumar revealed the same on Koffee With Karan.\nEven at his own wedding reception, Ranveer was seen breaking the dance floor as he danced his way to glory with love of his life Deepika Padukone.\nAgencies\nCelebrations haven't hit the dead-end as the newlyweds are enjoying the marital bliss by juggling smoothly between work and personal commitments.\nAgencies\nThe couple attended the #Nickyanka wedding reception in Mumbai last night and it was a blockbuster Bollywood night and we know whom to thank. Come on, this isn't a mystery anymore.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nWhat happens when Ranveer Singh pulled Urmila Matondkar to the dance floor? Well, you wish you get to see them together on the big screen someday!\nWell, the last few Bollywood parties were royally owned by Ranveer Singh as he headlined most of the events by burning the dance floor with his movies. We have proofs!\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\n#10\n#11\n#12\n#13\n#14", "title": "14 Videos Of Ranveer Singh That Prove He Can Headline Any Party & Turn It Into A Blockbuster Gala!", "date_publish": "21/12/2018, 14:26:42", "description": "Ranveer Singh real life is a big fat party and he surely knows how to be happy and keep everyone around him happy. The enthu-cutlet that he is, he is the last person to leave every party and this fact was proved right when Akshay Kumar revealed the same on Koffee With Karan. Even at his own wedding reception, Ranveer was seen breaking the dance floor as he danced his way to glory with love of his", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/14-videos-of-ranveer-singh-that-prove-he-can-headline-any-party-turn-it-into-a-blockbuster-gala-359040.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_singh_1545384037_800x420.jpg"}