{"text": "15 Photos From The Final Chapter Of Game Of Thrones Are Here And We Can Already Feel The Winter\n15 Photos From The Final Chapter Of Game Of Thrones Are Here And We Can Already Feel The Winter\nThe wait for the most exciting show is getting longer than ever. Game Of Thrones came like a storm and stayed with us every season.\nThe finale is all to premiere in April this year but it has been almost 2 years since we saw the royal families fighting and killing each other over the Iron Throne.\nIn the midst of this, GOT makers have been throwing teasers and trailers to keep the excitement going. And now HBO released a set of fresh 15 images from the final chapter of Game Of Thrones Season 8.\nHBO\nThe images of the entire ensemble is a reminder to all of us to start from where we left. Although these images do not dwell into too much, you might want to analyse and draw your own conclusion.\nDon't Miss 161 SHARES\nThe fresh batch of photographs show the remaining characters, including Jon Snow (Kit Harington), Daenerys Targaryen (Emilia Clarke), Arya Stark (Maisie Williams) and even Davos Seaworth (Liam Cunningham).\nTake a look\n1.\nHBO\n2.\nTwitter/HBO\n3.\nTwitter/HBO\n4.\nTwitter/HBO\n5.\nTwitter/HBO\n6.\nTwitter/HBO\n7.\nTwitter/HBO\n8.\nTwitter/HBO\n9.\nTwitter/HBO\n10.\nTwitter/HBO\n11.\nTwitter/HBO\n12.\nTwitter/HBO\n13.\nTwitter/HBO\n14.\nTwitter/HBO\n15.\nhbo", "title": "15 Photos From The Final Chapter Of Game Of Thrones Are Here And We Can Already Feel The Winter", "date_publish": "07/02/2019, 11:33:59", "description": "The finale season is all to premiere in April this year but it has been almost 2 years since we saw the royal families fighting and killing each other over the Iron Throne. The wait for the most exciting show is getting longer than ever. Game Of Thrones came like a storm and stayed with us every season.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/15-photos-from-the-final-chapter-of-game-of-thrones-are-here-and-we-can-already-feel-the-winter-361723.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/got_1549522640_800x420.jpg"}