{"text": "Main Hoon Na is one of the most loved classics film! Helmed by Farah Khan, Main Hoon Na starred Shah Rukh Khan, Sushmita Sen, Amrita Rao and Zayed Khan in lead roles.\nChoreographer-filmmaker Farah Khan says she has a very good idea for a sequel of her debut directorial Main Hoon Naa, which clocked 15 years of its release in Bollywood on Tuesday.\nOn the possibility of \"Main Hoon Na 2\", Farah told IANS over phone from Mumbai,\nRed Chillies\n\"I hope and pray that it is made because I have an idea for it. It all depends if Shah Rukh (Shah Rukh Khan)... he needs to be wanting to do that right now.\"\nShe added,\n\"I had a very good idea for part two. The film keeps coming on channels and people are still loving it.\" Released in 2004, the Shah Rukh-starrer told the tale of Major Ram who goes undercover as a college student upon orders to protect a general's daughter from a rogue soldier and fulfil his dying father's desire to reconcile with his family. It had soft undertones of the India-Pakistan conflict.\nShe also thanked Shah Rukh Khan and wrote,\nDon't Miss 594 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nWe don't know whether the sequel will happen or not but let's revisit the film and identify why we still love the film!\n1. When Shah Rukh Khan- the original lover-boy of Bollywood was in his full-form. Be it wooing his lady love or being the perfect brother to Zayed Khan, SRK was a delight in the movie.\n2. Sushmita Sen- This is a reason good enough to remember and recall the movie with a big smile! Sushmita was endearing and perfect as Miss Chandni! Since then, she has taken a break\n3. Suniel Shetty- The badman we couldn't really hate! As Raghavan, Suniel Shetty was perfectly tailor-made for the role. However, not many know that he wasn't the first choice of Farah Khan. Actors like Naseeruddin Shah and Kamal Haasan were approached for the role.\nTwitter\n4. For a debut, Farah Khan made a masala entertainer that had all aspects! From casting Shah Rukh Khan to adding great songs, it was a commercial potboiler that people loved watching!\n5. Amrita Rao and Zayed Khan's romance! College romances are indeed special but what Farah showed in the film was breezy and a breath of fresh-air. It wasn't a usual love story and romance that brews between Sanjana and Lucky, it was special!\n6. Anu Malik's music! Be it the soulful title track, the love songs or the peppy \"Tumse Milke Dil Ka\", these are the songs that still remain in our playlist for the only reason that they were fabulous!\n7. Way before Rohit Shetty started making films in his style, Farah Khan made a film with gravity-defying (Still enjoyable because who gives a damn about logic in films) sequences. The chase and action sequences of the film were perfect! The iconic car chase between Raghavan and SRK, who chases him in a Rickshaw remains insanely popular!\n8. The film majorly revolved around the plot of friendship and love. Be it what Ram and Sanjana share or what Laxman and Ram share, everything about their bonding was endearing.\n9. Farah Khan's film gave us some important life lessons on how it's important to look beyond someone's appearance as there's much more to a person than how they look.", "title": "15 Years Of Main Hoon Na: Here's Why This Shah Rukh Khan Film Still Fills Us With Nostalgia!", "date_publish": "30/04/2019, 17:07:12", "description": "Main Hoon Na is one of the most loved classics film! Helmed by Farah Khan, Main Hoon starred Shah Rukh Khan, Sushmita Sen, Amrita Rao and Zayed Khan in lead roles.Today, the film completes 15 years of its release. Choreographer-filmmaker Farah Khan says she has a very good idea for a sequel of her debut directorial Main Hoon Naa, which clocked 15 years of its release in Bollywood on Tuesday.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/15-years-of-main-hoon-na-here-s-why-this-shah-rukh-khan-film-still-fills-us-with-nostalgia-366356.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/main_hoon_na_1556624421_800x420.jpg"}