{"text": "1500 Drunk Strangers Sang 'I Want It That Way' Together And Reminded Us Of Our Karaoke Nights!\n1500 Drunk Strangers Sang 'I Want It That Way' Together And Reminded Us Of Our Karaoke Nights!\nWe have all been to one of the parties with friends where we ended up singing our old favourite songs. Whether its a karaoke night or a house party, Vengaboys and Backsreet Boys always top the charts.\nWell, for 1500 people in Brisbane, Australia, this dream of singing in unison came true. A pub choir group made 1500 drunk strangers sing I Want It That Way. Yes, Pub Choir got the inebriated folks together and made them learn the song in 90 minutes.\nThe result was phenomenal.\nLearning it in 3 parts, the song turned out to be a smashing hit. The video, since then has gone viral, so much so, that one of the members of BSB, Kevin Richardson tweeted about the outcome\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nPub Choir believes in getting together inebriated strangers to sing together in harmony once a month. And looks like they nailed it with this one. People across the globe want a similar gathering in their respective cities and we can't wait to have this in our town too. Such is the power of music!", "title": "1500 Drunk Strangers Sang 'I Want It That Way' Together And Reminded Us Of Our Karaoke Nights!", "date_publish": "06/02/2019, 13:56:25", "description": "1500 Drunk Strangers Sang 'I Want It That Way' From BackStreet Boys And Remided Us Of Our Karaoke Nights1500 Drunk Strangers Sang 'I Want It That Way' From BackStreet Boys And Remided Us Of Our Karaoke Nights1500 Drunk Strangers Sang 'I Want It That Way' From BackStreet Boys And Remided Us Of Our Karaoke Nights1500 Drunk Strangers Sang 'I Want It That Way' From BackStreet Boys And Remided Us Of Ou", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/1500-drunk-strangers-sang-i-want-it-that-way-together-and-reminded-us-of-our-karaoke-nights-361668.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/backstreet_1549438660_800x420.jpg"}