{"text": "She’s fiery, she’s a badass and she’s eccentric, in a good way. Obviously! Lady Gaga or the Mother Monster, as she likes to call herself, is a living legend! Not that she has never been not successful but last year (2018) turned out to a phenomenal one for her. She achieved the artistry grand slam - after bagging an Oscar this Sunday for Best Original Score - Shallow for her film A Star Is Born. She is the only artist to bag a Golden Globe, two Grammys, an Oscar and a Bafta in the same year. If this doesn’t earn her the well-deserved respect then i don’t know what will.\nevening standard\nIn an interview, the Poker Face singer had said, \"I’m so proud to be part of a movie that addresses mental health issues. A lot of artists deal with that. And we’ve gotta take care of each other. So if you see somebody that’s hurting, don’t look away. And if you’re hurting, even though it might be hard, try to find that bravery within yourself to dive deep and go tell somebody and take them up in your head with you.\"\nagencies\nPersonally, i’ve been a big fan of her from the word go! I’ve loved her eccentric phase, her bonkers phase and now even her conventional non-whacky one, at that. For the uninitiated, if you really want to get to know the real Stefani Joanne Angelina Germanotta, because that’s her real name, you have to watch her biopic GAGA: FIVE FOOT TWO on Netflix. This woman never fails to inspire and encourage commoners and fellow artist/celebrities aike and not with just her amazing work, mind you. The woman is so well-articulate that she knows when to say the right words to sweep people off their feet with her compassion, wit and wisdom, all at once.\nTherefore, we decided to compile some of her best quotes to inspire you to be your true authentic self without giving a damn to what the world of the society thinks of you. Scroll!\nDon't Miss 583 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\n#10\n#11\n#12\n#13\n#14\n#15\n#16\nTime to listen to the jukebox of A Star Is Born again! And just for you here's a recommendation. Give it a listen and let us know in the comment box whether you liked it or not.", "title": "16 Powerful Quotes By Lady Gaga Which Will Inspire You To Be Your True Authentic Self!", "date_publish": "26/02/2019, 12:40:09", "description": "After “Shallow” won the night’s first televised award -- best pop duo/group performance -- an emotional Lady Gaga shouted out Bradley Cooper (who was over at the BAFTAs overseas) and addressed the crucial messages of A Star Is Born. \"I’m so proud to be part of a movie that addresses mental health issues,” Gaga said. “A lot of artists deal with that. And we’ve gotta take care of each other. So if y", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/16-powerful-quotes-by-lady-gaga-which-will-inspire-you-to-be-your-true-authentic-self-362046.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/lady_gaga_1550060531_800x420.jpg"}