{"text": "American TV show FRIENDS ran between 1994 and 2004 and became one of the most popular TV shows ever made! The show revolved around the relationships between six New Yorkers, Ross, Rachel, Monica (Courteney Cox), Phoebe (Lisa Kudrow), Chandler (Matthew Perry) and Joey (Matt LeBlanc).\nFrom soaking up some sun to taking a dip at the beach, Malaika is seizing every moment of her vacation. Several reports have claimed that Arjun too has gatecrashed the rumoured 'Bachelorette' to be with Malaika.\n\"I don’t deal with it. Main khaali dheel de deta hoon. Tiger has spent 25 years of his life without a girlfriend. Abhi ek hai toh usko rehne do na… he’s found a girlfriend and I am very happy about it. Lekin usko ek tichki diya hai maine. He understands the meaning of life, and how it’s led within a social framework. He knows that he can never cross that line of decency and he never does\".\nDon't Miss 862 SHARES 346 SHARES\n\"Back in our birthplace for Dabangg 3 shoot.\"\nIt is reported that Dabangg 3 will be helmed by choreographer and filmmaker Prabhu Dheva. The first installment of the movie series Dabangg, which released in 2010, was directed by Anurag Kashyap while Dabangg \" was directed by Arbaaz Khan.\n5. Nargis Fakhri Shares A Moving Post On Her Weight Loss Journey And It's A Must-Read For Everyone!\nAfter losing 20 kgs in a year, Nargis Fakhri took to her social media account to share the news with a very important message. Fakhri went through a massive body transformation and her post makes a sense because of the nature of the message which is highly empowering.", "title": "16 Unmissable Bloopers From FRIENDS, Nargis Fakhri Shares A Moving Post On Her Weight Loss & More From Ent.", "date_publish": "01/04/2019, 18:30:42", "description": "American TV show FRIENDS ran between 1994 and 2004 and became one of the most popular TV shows ever made! The show revolved around the relationships between six New Yorkers, Ross, Rachel, Monica (Courteney Cox), Phoebe (Lisa Kudrow), Chandler (Matthew Perry) and Joey (Matt LeBlanc).American TV show FRIENDS ran between 1994 and 2004 and became one of the most popular TV shows ever made! The show re", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/16-unmissable-bloopers-from-friends-nargis-fakhri-shares-a-moving-post-on-her-weight-loss-more-from-ent-364697.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bollywood_1554123959_800x420.jpg"}