{"text": "17 Awkward And Funny Things That Happened On This Season Of Koffee With Karan\n17 Awkward And Funny Things That Happened On This Season Of Koffee With Karan\nOne of the best things to have happened to Indian Television is Karan Johar's celebrity chat show Koffee With Karan. The show is in its sixth edition and the candid confessions of Bollywood superstars still remain the key-highlights of this chat show!\nEvery year, KJo invites a few people from the fraternity and puts them into a spot and ask them to open up a little more about their personal and professional lives.\nThis year, KJo introduced a new gaming section after rapid-fire round and the episodes have been hilarious. Let's rewind and see how this season of KWK was all about awkward and funny confessions and some extra-hilarious moments!\n1. When Ranbir Kapoor's ex and Ranbir Kapoor's current girlfriend graced KJo's couch and spoke about his other 'ex' Katrina and how they all go to the same gym. Umm, Why KJO, WHY?\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nStar India\nThe buck didn't stop there. They went on to planning a trip together: Ranbir & Alia + Ranveer & Deepika. Bollywood is definitely a weird place with weirder equations and relationships. Kitne Ajeeb Rishte Hain Yahaan Pe? Well, no one knows.\n2. When Alia Bhatt burped on National Television and everyone started to laugh.\nStar India\n3. When Deepika and KJo chatted about the exchange of 'messages' between Ranveer and him.\nStar India\nBut yeah, it's only human!\n4. When the conversation between Akki and Ranveer Singh was all about 'hair'. KJo was like a mother who brings up the most awkward childhood photo to embarrass you and both AK and Ranveer laughed when they saw the photo.\nStar India\n5. When Ranveer Singh shared an old anecdote between him and Akshay. He said Akshay taught him how it's all about money. Whether it's a baby event or a birthday party, keep dancing and earning money. The whole incident cracked KJo up!\nStar India\n6. When Akshay Kumar royally roasted Ranveer Singh for being the last person to leave when he attends someone's wedding. He added, \"By the time he leaves, everyone is already tired.\"\nStar India\n7. When Ranveer was asked to describe Akshay Kumar, he had his fan-boy avatar out and he exaggerated to his heart's content!\nStar India\n8. When Aamir Khan was asked to save between SRK and Salman and he had an epic response! He chose to save Shah Rukh because 'Bhai Kabhi Nahi Doobenge\". This is definitely an Audi-winning worthy answer.\nStar India\n9. When Sara Ali Khan made her Koffee debut with Dad Saif and decoded their 'crazy' family pattern.\nStar India\n10. When Sara revealed why Kareena is more like a friend than mom and how paranoid she will be if Sara ever calls her 'Choti Maa'\nStar India\n11. When Janhvi confessed that she would ditch a dating app and rather find someone on a food app! *Same feelings, Janhvi!*\nStar India\n12. When Ajay Devgn revealed how addicted Kajol is to Online shopping!\nStar India\n13. When KJo revealed how Kajol dissed his expensive present! (A Lous Vuitton bag to be precise)\nStar India\n14. When Ajay Devgn royally trolled Karan Johar for making a film like Kaal!\nStar India\n15. When Ajay Devgn trolled Kajol for her age!\nStar India\n16. When for the first time ever, KJo revealed his real name!\nStar India", "title": "17 Awkward And Funny Things That Happened On This Season Of Koffee With Karan", "date_publish": "13/12/2018, 14:04:26", "description": "One of the best things to have happened to Indian Television is Karan Johar's celebrity chat show Koffee With Karan. The show is in its sixth edition and the candid confessions of Bollywood superstars still remain the key-highlights of this chat show!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/17-awkward-and-funny-things-that-happened-on-this-season-of-koffee-with-karan-358505.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/karan_1545296266_800x420.jpg"}