{"text": "She entered the world of cinema as the 'student of the year' but the tag of being Mahesh Bhatt's daughter constantly questioned her talent and credibility as an actor. SOTY released but she didn't become critics' favorite debutante that year.\nTwitter\nThen came Imtiaz Ali's Highway and the game changed! She played Veera with so much conviction that she instantly became everyone's favourite and there has been no looking back.\nAt 26, Alia Bhatt has a lot to boast about. We are not talking about her 100% success (we can let go off Shaandaar) but the very fact that her 2019-2020 is also packed with some of the most exciting projects in her kitty!\nAgencies\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 12.5 K SHARES 5.5 K SHARES\nWith her heart in the right place and a smile that can lighten up anyone's day, Alia Bhatt has always been honest and candid.\nBe it her choice of films or nepotism, she has never sugar-coated even the harshest of realities.\nAgencies\nShe can burp on national television and be absolutely unapologetic about it, proving that she might be a megastar but she's as human and normal as the next person. There are more than one reason why Alia is loved and liked by not just her co-stars and team but she has a huge-fan following too!\nShe is one of the most bankable stars today and her instincts while choosing films have mostly been accurate! From playing a complex character like Veera to pulling off a fragile and lost Kaira in Dear Zindagi, she has walked all roads and with utmost poise and ease.\nOn her 26th birthday, let's recall all the times when Alia was so honest that it hit home and proved that she is real, honest and witty! Read on.\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\n#10\n#11\n#12\n#13\n#14\n#15\n#16\n#17\n#18", "title": "18 Times Alia Bhatt Was Unabashedly Honest About Her Own Self And The Film Industry!", "date_publish": "15/03/2019, 12:08:10", "description": "From playing a complex character like Veera to pulling off a fragile and lost Kaira in Dear Zindagi, she has walked all roads and with utmost poise and ease. On her 26th birthday, let's recall all the times when Alia was so honest that it hit home and proved that she is real, honest and witty! Read on.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/18-times-alia-bhatt-was-unabashedly-honest-about-her-own-self-and-the-film-industry-363716.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_1552631861_800x420.jpg"}