{"text": "'1920' Actress Adah Sharma Reveals She Lost Out On A Film Last Minute Due To A Star Kid\n'1920' Actress Adah Sharma Reveals She Lost Out On A Film Last Minute Due To A Star Kid\nAdah Sharma was loved by her fans and critics with her very first film 1920 which released in 2008 and since then she has been entertaining her fans by working in different kind of films, be it Bollywood or South.\nDespite 1920 being a commercial hit, she got a slow start in Bollywood, but the actress is super optimistic and believes she has received the best so far.\nTwitter\nIndiatimes had an exclusively candid conversation with Adah where she spoke about her career choices, nepotism, rejection and the ongoing #MeToo movement.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nTo begin with we asked Adah where she went hiding after 1920, and she said, “I don’t think anything went wrong in my career after 1920, I think it went right, I worked 3 years in South to establish myself with the most promising directors, in South where many heroines work in same kind of films, I managed to work with best of the directors and biggest actors. I got roles written for me, Sanam was written for me which was remade in Baaghi, I did commercial and important roles, I got to prove that I can act with my very first film. I had nobody in the industry and I still made so much, I feel I am fortunate.”\nAdah believes in not crying of not being a privileged kid.\n“When I started off, I didn’t know anything, I never faced a camera in my life but I still gave my best, I gave everything that I had\".\nTwitter\nTalking about nepotism, she said, \" I think that’s obvious thing like sunrise and sunsets, but what can be done, I cannot sit and cry about the disadvantage that already exists, so better I focus on my work and make myself the best.”\nRight now, Bollywood is in its most liberated phase, where every women are sharing about their #MeToo movement, we asked Adah if she even encountered a similar uncomfortable situation, the actress replied,\nTwitter\n“I haven’t been physically molested, raped or touched inappropriately, I would have punched and slapped, but the verbal proposition is something that we all girls and boys must have faced. But I have straightforward said NO and walked out, due to that I have lost many good works but that’s fine.”\nShe further added, “I feel not only Bollywood, the entire world is bad and selfish, but we cannot stop looking at the positive side, I like to think that there are people who do good things without any reason.”\nAdah even recalled the time she was replaced by a star kid in a film last minute, she said, “I have lost a film last minute because of one-star kid, but I don’t want to reveal names. I was dashed for a day, I was devastated, but I moved on”.\nShe further said, “ I am a greedy person and I want to do everything in my acting career, I want to do a nice dance movie which I am doing with Prabhudheva, and that will be my Tamil debut. So good things are happening to me, I can’t just sit and cry about not being a star kid. The only thing is, star kids gets more chances compared to outsiders, they are forced in your faces every day, so even if you don’t like a star kid, they will get 20 more chances and you will tend to start liking them, but with us, if you fail once, you are gone, we don’t get a second chance.”\nLooking forward to seeing Adah is more Bollywood roles as well.", "title": "'1920' Actress Adah Sharma Reveals She Lost Out On A Film Last Minute Due To A Star Kid", "date_publish": "26/10/2018, 11:02:25", "description": "Adah Sharma was loved by fans and critics with her very first film 1920 in 2008, she left everyone stunned with her brilliant performance, till date she has been entertaining her fans by working in different kind of films be it Bollywood or south. Despite 1920 being such a big hit, she got a slow start in Bollywood, but the actress is super optimistic and believes she has got the best so far.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/1920-actress-adah-sharma-reveals-she-lost-out-on-a-film-last-minute-due-to-a-star-kid-355475.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/adah_1540548779_800x420.jpg"}