{"text": "On Saturday, The Kapil Sharma Show offered a free trip to nostalgia to all its viewers. The host Kapil Sharma teleported everyone to the good old days of 1983, when the India cricket team registered an iconic win.\nActor comedian Kapil Sharma invited and hosted the 1983 world cup winning team on the chat show. There were some shuffles for the episode as Kapil Dev was welcomed by Kapil on the show and Harbhajan Singh replaced Archana Puran Singh and Navjot Singh Sidhu for this very episode.\nSony\nPresent on the show were Mohinder Ambarnath, Sreekanth, Dilip Vengsarkar, Yashpal Sharma, Sandeep Patil, Kirti Azad, Roger Binny, Madanlal, Balwinder Sandhu and Sunil Valson among others also were present as guests. Sunil Gavaskar could not be present on the show but he joined the team through video.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe episode remains one of the most iconic ones as Kapil also displayed pictures from the iconic match that took all the players back to their winning days of glory. Later, the team also went on to narrates trivias and anecdotes from 1983, the very year when they registered the epic victory of World Cup.\nColors\nHere are a few highlights from the show.\nSony Entertainment television\n1. Apart from Kapil Dev, people who joined the show were his teammates Mohinder Amarnath, Sandeep Patil, Dilip Vengsarkar, Krishnamachari Srikkanth, Roger Binny, Kirti Azad, Madan Lal, Syed Kirmani, Balwinder Sandhu and Yashpal Sharma.\n2. The former players shared a number of experiences and anecdotes related to their iconic tournament and their time with the Indian team.\n3. Kapil Sharma began with revealing his own childhood memories and how he was about three when his namesake Kapil Dev and the team Prudential World Cup at Lord’s. He added that that was how his parents also named him Kapil. While he had several nicknames before that, it was only after 1982 that his father named him Kapil.\n4. Kapil Dev added that forget winning the trophy, they never even thought that they could make the cut to finals. He shared a funny story on how the entire team was so sure of not reaching the finals that they had even decided to leave for the USA for a trip. But when they got to know about reaching the finals,they were also a little upset that their USA trip was temporarily cancelled. Everyone started laughing after this anecdote as this was one big revelation for the viewers too.\n5. Yashpal Sharma, the middle-order batsman who played 37 Tests and 42 ODIs for India revealed that whatever he could achieve, a major share of credit belongs to yesteryear star Dilip Kumar. He added that “Yusuf Bhai” had come to watch one of the Ranji Trophy matches and he was so impressed by his performance that he further recommended his name to the BCCI. Serendipity?Well, yes!\nThat's not all. The internet is pretty impressed with the makers and the whole team of the show for being able to pull off such a difficult feet of bringing everyone together. They declared the episode as 'historic'. Here are a few more reactions.\nIts a once in lifetime moment\nFor all of us dat we r witnessing this grt #kapilsharmashow @KapilSharmaK9 & team for dis#83WorldCupOnTKSS Episode\nBcoz no other show on indian telvision history can b bttr dan #TheKapilSharmaShow To host such an historic episode wid living #Legends — Jasminder (@imjassi16) March 9, 2019\nBahut maza aaya!!\nI don't know why ppl search for comedy in every episode. Boss they r legends n listening to their story makes u happy n that's what #TheKapilSharmaShow is all abt.\nI just loved it n excited for tomorrow's episode. First time on Indian TV. #83WorldCupOnTKSS — Ram (@Ram112018) March 9, 2019\nThe real reason why India lifted the '83 WC. The main turning point where Kapil dev scored those crucial 175* runs against Zim team in Semis. You are the reason we loved Cricket!! Love u Sir! Hats off to the whole team!👌👌🇮🇳🇮🇳💪💪#83WorldCupOnTKSS #TheKapilSharmaShow — Pratik Pattnaik (@IamPratik21) March 9, 2019\nThe real reason why India lifted the '83 WC. The main turning point where Kapil dev scored those crucial 175* runs against Zim team in Semis. You are the reason we loved Cricket!! Love u Sir! Hats off to the whole team!👌👌🇮🇳🇮🇳💪💪#83WorldCupOnTKSS #TheKapilSharmaShow — Pratik Pattnaik (@IamPratik21) March 9, 2019\nWhat an amazing episode @KapilSharmaK9. Proper characters all of the 1983 heroes. Hope someday we will see the 2011 WC winning team on a show like this together. #TheKapilSharmaShow https://t.co/ltve5VMtsp — Saurabh Malhotra (@MalhotraSaurabh) March 9, 2019\nHistorical episode in the history of Indian Television 📺 #TheKapilSharmaShow\nThank you @KapilSharmaK9 for giving us the opportunity to witness this #1983worldcup with lots of laughter and joy ✊\nLooking forward to watch tomorrow's episode #83WorldCupOnTKSS 🏆 — Shikha🔥 (@Bubbles42936033) March 9, 2019", "title": "1983 World Cup Winning Team Take Over The Kapil Sharma Show Stage, People Call It 'Historic'", "date_publish": "10/03/2019, 16:58:02", "description": "The host Kapil Sharma teleported everyone to the good old days of 1983, when the India cricket team registered an iconic win. Actor comedian Kapil Sharma invited and hosted the 1983 world cup winning team on the chat show. There were some shuffles for the episode as Kapil Dev was welcomed by Kapil on the show and Harbhajan Singh replaced Archana Puran Sungh and Navjot Singh Sidhu for this very e", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/1983-world-cup-winning-team-take-over-the-kapil-sharma-show-stage-people-call-it-historic-363480.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kapil_sharma_1552219770_800x420.jpg"}