{"text": "19 years ago, on this day, Hrithik Roshan made his debut in Kaho Naa Pyaar Hai. The popularity of the film made Hrithik Roshan's a popular actor. In no time, he was a sensation among the younger generation, who idolized him for his dance moves. From Kaho Naa Pyaar Hai to Kaabil, Hrithik Roshan's Bollywood journey of two decades is proof that hard work and dedication goes a long way.\nTwitter\nWhile the actor was constantly questioned for his 'privilege' and nepotism was a tag that he got as soon as he entered, it's his journey as an actor that proved that he made a firm position in the film industry all by himself.\nTwitter\nBe it pulling off a comic role in Koi Mil Gayaa to playing the role of Akbar in Ashutosh Gowarikar's period drama Jodha Akbar, Hrithik Roshan slipped into the skin of his characters and made each of his characters visionary.\nHe may have had a few hits and misses along the way but that never made him keep his acting career in the back burner. He juggled between his Daddy duties and professional life and with so much ease and perfection that till today, he remains one of the most bankable stars, brand endorser and hero in every sense of the word.\nDon't Miss 3.1 K SHARES 353 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nToday, as his debut film completes 19 years of its release, let's look back at the journey of Hrithik-the actor which is full of failures, experiments, trials, and successes. These 12 dialogues from his most memorable films prove that he has never stopped experimenting.\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\n#10\n#11\n#12", "title": "#19YearsOfHrithik: 12 Iconic Dialogues That Sum Up Hrithik's Versatility As An Actor Over The Years!", "date_publish": "14/01/2019, 11:40:35", "description": "19 years ago, on this day, Hrithik Roshan made his debut in Kaho Naa Pyaar Hai. The popularity of the film made Hrithik Roshan's a popular actor. In no time, he was a sensation among the younger generation, who idolized him for his dance moves. From Kaho Naa Pyaar Hai to Kaabil, Hrithik Roshan's Bollywood journey of two decades is proof that hard work and dedication goes a long way.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/19yearsofhrithik-12-iconic-dialogues-that-sum-up-hrithik-s-versatility-as-an-actor-over-the-years-360367.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hrithik_roshan_1547466345_800x420.jpg"}