{"text": "20 Years On, ‘Kuch Kuch Kuch Hota Hai’ Still Remains One Of The Glossiest Rom-Coms Of All Time\n20 Years On, ‘Kuch Kuch Kuch Hota Hai’ Still Remains One Of The Glossiest Rom-Coms Of All Time\n“Kuch kuch hota hai Rahul, tum nahi samjhoge…” – but we all could connect with that feeling of being in love, and most of us have been through it too, right?\nvia GIPHY\nKuch Kuch Hota Hai, written and directed by Karan Johar, was his debut film. And he accepts that there were some flaws in the movie, like Shah Rukh Khan’s character Rahul, who made girls go weak in their knees, was a bit of a “fraud”, he says, 20 years after the release of the movie.\nvia GIPHY\n“Rahul was a bit of a fraud anyway. He used to say ‘we love once, marry once’ but did it twice. In my head I hope the marriage works, but it must have been a tough marriage,” he told Indian Express.\nNot just once, we all have watched the movie many times, and we still love to watch it over and over again, because it still holds a special place in our hearts, and here’s why!\n1. It is simply the glossiest rom-com of the 90s!\nvia GIPHY\nNo matter how stupid it might sound now, the movie remains to be the guilty pleasure for most of us even now. Let’s just admit this fact.\nWe all know now that Rahul and Anjali’s love story wasn’t great, but it was just an outcome of rebound, right? But we all love to watch the movie even now, don’t we?\n2. It started a series of embarrassing fashion trends that almost all of us followed and have memories associated with.\nvia GIPHY\nCool headbands, short hair, waist pouch, friendship bands, jumpsuits, white sneakers, floral shirts, chokers and demin jackets – Kuch Kuch Hota hai fashion trends were the new cool back then.\nDon't Miss 183 SHARES 155 SHARES 343 SHARES 1 K SHARES 5 K SHARES\n3. We never fail to find a way to use the epic dialogues of the movie in our daily lives even today, don’t we?\nvia GIPHY\n“Tussi Ja rahe ho? Tussi na jao” – I have personally used his dialogue multiple times, and there are plenty more like:\n“Pyaar dosti hai”\n“Hum ek baar jeete hai, ek baar marte hai, shaadi bhi ek baar hoti hai ... aur pyar ek baar hi hota hai”\n“Main ladkiyon ke peeche nahi bhaagta ... ladkiya mere peeche bhaagti hai”\n4. It was one of the epic films that had two love-triangles in two different time zones.\nvia GIPHY\nHow can you not recall the story of Tina, Rahul and Anjali at an instant when talking about love triangles! Several Bollywood movies have showed complex love triangle stories but Kuch Kuch Hota Hai was an epic narrative of love, romance, heartbreak and heartache.\nWhat made it even more special was the fact that it had two love-triangles in two time zones. One had an immature Rahul, tom-boy Anjali and ever-charming Tina. The other one had a mature Rahul, an Anjali who from a tom-boy turned into a lady and Aman who loves her and wants to marry her.\n5. The music of the film still rules our hearts.\nvia GIPHY\nFrom sad song Tujhe Yaad Na Meri Aayi to the rock version of Raghupati Raghav Raja Ram, whenever you’re bored or want some fun in your life, just groove on to the songs of Kuch Kuch Hota Hai. Remember the dance step on “Koi Mil Gaya, Mere Dil Gaya.”\nAlso Read: German Orchestra Plays The Iconic Tune Of 'Kuch Kuch Hota Hai' At Berlin Film Festival\n6. The movie was the new cool for the youth!\nvia GIPHY\nFrom Anjali saying, “Rahul is a cheater… he is a cheater” to the little Anjali greeting her grandma with “Hi sexy”, there are plenty of incidents from the movie that taught us a new grammar of love and also gave us a new vocabulary altogether. For instance, “But he's your best friend yaar!”\n7. Each character in the movie was amazing and cracked us up!\nvia GIPHY\nFrom Rahul's widowed mother (Farida Jalal) and her hilarious Satsang sessions to Ms. Briganza’s constant flirting with Principal Malhotra, and Anjali, the little kid who keeps trolling her father for things like not wearing a pant to work, each character was amazing and gave us plenty of reasons to crack up.\n8. It showed us the beauty of sacrifice in love.\nvia GIPHY\nJust imagine you’re a girl who’s practicing to say “I love you” to the love of your life, who comes to you and tells you about the other girl who has stolen his heart. Would you have the guts to smile and tell him, “go tell her\"?\nThat might not sound real, but it was a genuine painful heart-aching situation that hit the chords with a lot of people.\n9. And lastly, it gives us some lessons on love, life and relationships.\nvia GIPHY\nKuch Kuch Hota Hai told us it is okay to fall in love with your best friend and that it might just be the best kind of romance. It also showed us that love can happen twice and that it isn’t always perfect.", "title": "20 Years On, ‘Kuch Kuch Kuch Hota Hai’ Still Remains One Of The Glossiest Rom-Coms Of All Time", "date_publish": "16/10/2018, 15:53:35", "description": "“Kuch kuch hota hai Rahul, tum nahi samjhoge…” but we all could connect with that feeling of being in love, didn’t we? Kuch Kuch Hota Hai, written and directed by Karan Johar, was his debut film. He accepts that Shah Rukh Khan’s character Rahul, who made girls go weak in their knees, was a bit of a “fraud”.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/20-years-on-kuch-kuch-kuch-hota-hai-still-remains-one-of-the-glossiest-rom-coms-of-all-time-354898.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/20_years_on_kuch_kuch_kuch_hota_hai_remains_to_be_a_special_film_for_every_90s_kid_heres_why_1539689568_800x420.jpg"}