{"text": "2019 Is The Year When It All Ends! It’s Time To Say Goodbye To Avengers, Game Of Thrones & Star Wars\n2019 Is The Year When It All Ends! It’s Time To Say Goodbye To Avengers, Game Of Thrones & Star Wars\nSo, 2019 is a big year on many fronts and there are a lot of things to look forward to. The current mood of the India revolves around Lok Sabha elections that will decide who will rule the largest democracy for next five years. But it’s not only the real-life that we are talking about. There is a lot going on in the world of films and Television as well.\nThe finale season of Game Of Thrones, the season 8 in which the fans after years of wait will finally get to know as to who will win the game of ice and fire and end up sitting on the Iron Throne after having defeated the army of dead (White Walkers). It’s just a day away. Game Of Thrones season 8 will premiere tomorrow morning for Indian fans.\nAnd then on April 26, Avengers: Endgame will hit the screens finally. After 11 years and 21 movies, the film will finally conclude another phase of Marvel Cinematic Universe. Are you ready to witness the retirement of your favourite superheroes?\nAnd that’s not all, my friends. In the same month when the two of the biggest franchises – Game Of Thrones and Avengers – will begin their conclusions, Star Wars: The Rise Of Skywalker’s trailer has also been released. The final entry in the Star Wars trilogy will hit the screens on Dec 20.\nDon't Miss 264 SHARES\nIt’s strange, to be honest, that all the franchises that dominated the world of entertainment are coming to an end, at the same. What will the fans look forward to? There was a crazy fandom around these franchises, and it’s time to say goodbye to it.\nAll good things come an end, after all. But we still believe that the best ending to a story is none at all. Wouldn’t you agree?", "title": "2019 Is The Year When It All Ends! It’s Time To Say Goodbye To Avengers, Game Of Thrones & Star Wars", "date_publish": "14/04/2019, 13:47:03", "description": "So, 2019 is a big year on many fronts and there are a lot of things to look forward to. The current mood of the Indian citizens revolves around Lok Sabha elections, but it’s not only the real-life that we are talking about. There is a lot going on in the world of films and Television as well.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/2019-is-the-year-when-it-all-ends-it-s-time-to-say-goodbye-to-avengers-game-of-thrones-star-wars-365423.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/2019_is_the_year_when_it_all_ends_time_to_say_goodbye_to_avengers_game_of_thrones__star_wars_1555227650_800x420.png"}