{"text": "2018 was a year of blockbuster hits, mega-flops and a year of good content. Films like Badhaai Ho, Andhadhun and Stree proved that all you need to bring the audience to the theatres is a good script.\n2018 has set the bar high and now, 2019 is upon us. The expectations are already ten-fold.\nWe made a list of 25 releases of 2019 for which you certainly need to block the dates and mark your calendar. From period-drama to revenge-thrillers, 2019 is a mixed bag of all genres and the year surely looks like a good one for cine-goers. What's your pick? Choose from this list!\n1. Uri\nRSVP Movies\nVicky Kaushal owned 2018 with films like Raazi, Sanju, Lust Stories and Manmarziyaan. And now, the actor is all set to give his best shot again in wooing the audience. In Uri, Kaushal will be seen playing the role of an army officer. Helmed by Aditya Dhar, this is one of 2019's most anticipated films. The film is based on 2016 surgical strikes on Pakistan, after the Uri Base Camp in Jammu & Kashmir was attacked.\n2. Cheat India\nDon't Miss 183 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nThe tag line of the film says: ‘Nakal Mein Hi Akal Hai’. Starring Emraan Hashmi, the film looks like a storyline based on the faulty education system in India.\n3. Manikarnika: The Queen of Jhansi\nAfter sidelining all the roadblocks and controversies, Kangana Ranaut made her directorial debut with the film. Based on the life of Rani Laxmi Bai of Jhansi and her war against the British East India Company, during the Indian Rebellion of 1857, the film also stars Ankita Lokhande, Mohammed Zeeshan Ayyub and Atul Kulkarni in pivotal roles. The trailer of the film was unveiled last month and got a great response.\n4. Ek Ladki Ko Dekha Toh Aisa Laga\nIn the trailer of the film, Sonam Kapoor's character says: \"True love mein kuch na kuch siyappa toh ho hi jata hai..\" Well, the film isn't a conventional love story with hurdles but the film is Bollywood's first mainstream commercial LGBT movie. The film that revolves around the struggles of a homosexual couple stars Sonam Kapoor, Anil Kapoor, Rajkummar Rao and Juhi Chawla in pivotal roles. The trailer of the film was appreciated and it got a big thumbs up from the people.\n5. Sonchiriya\nWhen Abhishek Chaubey makes a film, you know it won't be a conventional one. The maker of Ishqiya franchise is all set to woo the audience with his upcoming Indian crime film. With a stellar star cast of actors like Sushant Singh Rajput, Bhumi Pednekar, Manoj Bajpayee, Ranvir Shorey and Ashutosh Rana, the the film is a rooted tale set in Chambal.\n6. Gully Boy\nWhile we have seen Ranveer Singh and Alia Bhatt collaborate for brand endorsements, this is their first film together. The film is a tale of a 22-year-old kid from a ghetto in Bombay. The story will majorly focus on the life of a rapper, and the story is his journey from realising his love for rap, to chasing his dream, and to inadvertently transcending his class. This Zoya Akhtar film is a real story of gully gang boy(India's leading rapper).\n7. Sandeep Aur Pinky Faraar\nArjun Kapoor and Parineeti Chopra starrer Sandeep Aur Pinky Faraar is all set to impress the audience on March 1, 2019. Helmed by Dibakar Banerjee, Arjun will be seen as a Haryanvi cop and Parineeti will be seen as an ambitious girl from the corporate world and how the universe conspires and their lives are suddenly intertwined.\nTalking about the film, Dibakar Banerjee had said,\n“I feel this is my first film all over again, at least in terms of the excitement with the material. Sandeep and Pinky bring to screen the two Indias that are forever clashing. I want the audience not to lose a second of that. We finished the shoot one month late because of the intense weather conditions on the Indo-Nepal border. I don’t want Sandeep and Pinky to be shortchanged on edit time.\"\n8. Luka Chuppi\nAfter Sonu Ke Titu Ki Sweety Kartik Aaryan is suddenly the new lover-boy on the block. Starring Kartik and Kirti Sanon, this rom-com will be directed by Laxman Utekar and produced by Dinesh Vijan.\nIn an official statement about the film, Dinesh Vijan said, The story travels from Mathura to Gwalior and Agra. Kartik plays the star reporter of a local TV channel in Mathura. We had toyed with the title Mathura Live before settling for a game of hide-and-seek. While Kartik is the quintessential good boy every girl wants to take home to mamma, Kriti represents today’s youth who advocate gender equality and have their own ideology.\"\n9. Badla\nInstagram\nAs the title suggests, the revenge drama has been directed by Sujoy Ghosh, who is the master of this genre.\nThe film has a plot-line that revolves around the lives of two men who grow older dreaming of taking revenge on one another. However, as soon as they reach the point where they have to pull the trigger, they realize the definition of revenge has changed for them. The film reunites the Pink team Taapsee Pannu and Amitabh Bachchan. For all those who are a sucker for drama-thrillers, this is unmissable!\n10. Kesari\nWhen Akshay Kumar takes up a project, you have your expectations automatically set high. This Indian period war drama film stars Akshay Kumar and Parineeti Chopra in the lead roles. Helmed by Anurag Singh, the film will revolve around the story of Havildar Ishar Singh who participates in the Battle of Saragarhi (in which an army of 21 Sikhs fought against 10,000 Afghans in 1897) while yearning for the respect of his estranged daughter.\nThe film is all set to hit the theaters on March 21, 2019.\n11. Mental Hai Kya\nThe name says it all. This hilarious drama stars Kangana Ranaut and Rajkummar Rao in lead roles. The producer of the film Ekta Kapoor took to social media to share Kangana's look from the film and captioned it, \"It's time to bring out the crazy in you.. Because Sanity is overrated! Here's the first look of #MentalHaiKya starring #KanganaRanaut and @RajkummarRao. @balajimotionpic\"\nThe posters of the film left many intrigued as Kangana sports a cool short hairdo and a funny face, while Rajkummar is seen with his nails coloured in black to match his eyeballs. Well, this looks like a roller coaster ride you should definitely sign up for!\n12. The Zoya Factor\nStarring Dulquer Salmaan and Sonam Kapoor, the film is loosely based on an eponymous novel by Anuja Chauhan. Directed by Abhishek Sharma and bankrolled by Fox Star Studios. The film will release on April 5, 2019. Since Dulquer will be seen playing the role of Indian cricket captain, he went through rigorous cricket practice sessions. Pictures of his practice were all over the internet and ended up impressing his fans.\n13. Kalank\nKaran Johar’s mega-budget and a star-studded film Kalank is one of the most highly anticipated movies of the year. Apart from starring actors like Sonakshi Sinha, Alia Bhatt, Aditya Roy Kapur, Varun Dhawan, the film also reunites Sanjay Dutt and Madhuri Dixit after 25 years!\n14. Arjun Patiala\nArjun Patiala will be a treat for all comedy lovers. Starring Kriti Sanon, Diljit Dosanjh, and Varun Sharma, this Indian romantic comedy film has been directed by Rohit Jugraj and co-produced by T-Series' Bhushan Kumar and Dinesh Vijan of Maddock Films.\nThe film will revolve around the plot of a brewing romance between a tall woman and a short man, with the height difference causing comic difficulties. The film will release on 3 May 2019\n15. Student of the Year 2\nApart from Tiger Shroff, the film has become a launchpad for debutantes Chunky Panday's daughter Ananya Panday along with Tara Sutaria. The second film in KJo's Student of the year franchise, the film is one of the most awaited films of the year. Hollywood star Will Smith also visited the sets of Punit Malhotra's 'Student of the Year 2'. Hollywood star Will Smith also visited the sets of Punit Malhotra's 'Student of the Year 2'. Apart from spending some time with the lead cast of the film which stars Tiger Shroff, Tara Sutaria, and Ananya Panday, he was also seen dancing with them. Will Smith shared a picture of him shaking a leg with Tiger, captioning it, \"On Set in Bollywood!! Shout out to the Cast & Crew of Student of the Year 2. Thanx for Letting Me Play.\"\n16. Jabariya Jodi\nTwitter\nStarring Sidharth Malhotra and Parineeti Chopra in lead roles, the film makes an attempt to hive a hilarious spin to the tradition of groom kidnapping, prevalent in Bihar where grooms are kidnapped in order to prevent dowry. Talking to Bombay Times, he said,\n\"In Jabariya Jodi, the audience will see me playing a rustic character for the first time. He is a Patna boy, who carries out pakadua vivaah (forced marriages). I was aware of forced marriages taking place in Bihar. I did my own research on the subject as well and came across a large number of such incidents that also happen in UP. Come to think of it, these are only the cases that were reported. When I heard the story, I was excited about it and took it to Ekta Kapoor (producer), she loved the concept and even added to the humour quotient of the film by bringing in some writers on board. When we narrated the script to Parineeti (Chopra), she loved it and quickly came on board. Marjavaan’s backdrop is the underbelly of Mumbai. It is an intense action film, which revolves around a love story. I haven’t done massy and masala films before, so this was a new experience.\"\n17. India's Most Wanted\nDirected by Rajkumar Gupta, IMW will be a tribute to unsung heroes of our society. In the film, Kapoor will play the role of a 30-year-old police officer from a special unit of Haryana Police. Arjun will reunite with her Ishaqzaade Parineeti Chopra for the third time for this project.\nThe story will revolve around finding and arresting a terrorist during a secret mission in which no bullets were fired. Arjun Kapoor had shared his first look from the film. He wrote,\n“Honoured to be a part of an untold story that will inspire India! #IndiasMostWanted, a tribute to all the unsung heroes who dedicate their lives to protect ours. In cinemas 24th May 2019. Directed by Raj Kumar Gupta. Co-produced by @rajkumar_rkg & @foxstarhindi”\n18. Bharat\nReportedly, based on the Korean film Ode To My Father, Bharat will cover 70 years of Indian history beginning from the Partition in 1947. This Ali Abbas Zafar film will unfold as it will trace the life of an Indian (Salman Khan), living through some of the most significant moments in history. Talking about this Katrina Kaif and Salman Khan starrer, Zafar told Filmfare,\n“Though I loved the script, I told him, ‘Bhai, I’m not good at adaptations because till the time I don’t write my own stuff, I don’t know whether I’ll be able to direct it well. I shared what I had in mind and why I wanted Bharat as the title. He said it worked for him. That’s how Bharat happened. It’s a different film for both of us. Something Salman’s gonna push himself hard to get right. That’s exciting because the film is unexplored territory.”\n19. Kabir Singh\nThe film is an official remake of a Telugu film Arjun Reddy (2017). The film is being written and directed by Sandeep Vanga. Produced by Cine1 Studios and T-Series, the film stars Shahid Kapoor and Kiara Advani. Shahid will be seen as an alcoholic surgeon who goes on a self-destructive path after his ex-lover marries someone else. The film is all set to release on 21 June 2019.\n20. Good News\nProduced by Karan Johar's Dharma Productions, Good news will star Akshay Kumar, Diljit Dosanjh, Kiara Advani, and Kareena Kapoor Khan. When the star cast is so good, it's only fair to have expectations set up higher than ever. This comedy film definitely is a film to watch out for.\n21. Mission Mangal\nThe film is already in news for being India's first space film. Starring Akshay Kumar in the main lead, the film will be helmed by Jagan Shakti. Last year, Akshay Kumar had posted a picture with the cast of 'Mission Mangal' which also stars Kriti Kulhari, Taapsee Pannu, Sonakshi Sinha, Vidya Balan, Sharman Joshi, and Nithya Menon. Captioning the picture as, \"Proud and excited to bring the story of India’s Mars Mission, #MissionMangal to you. Coincidentally the mission was launched on this very date, 5th Nov. 2013. Meet the team and do share your best wishes for our shubh mangal journey. Shoot begins soon.\"\n22. Made in China\nInstagram/Rajkummar Rao\nLeaving all Khans behind, Rajkummar Rao proved to be one of the most bankable actors of 2018. In Made in China, the actor will be seen playing the role of a struggling Gujarati businessman, who sets on a journey to China in order to make his business flourish. This comedy film will showcase several lessons that Rajkummar has to undergo to become a successful entrepreneur. Directed by Mikhil Musale, who won a National Award for his 2016 drama-thriller ‘Wrong Side Raju’, the film is being produced by Dinesh Vijan.\n23. Marjaavaan\nThe team released the first look poster of the film which said “Ishq mein marenge bhi, maarenge bhi”.The whole feel of the film suggests that it will be one feisty love story. Starring Sidharth Malhotra, Riteish Deshmukh, Tara Sutaria, the film will release in October. For the second time, Rakul Preet Singh will be seen sharing the screen space with Sidharth Malhotra.\n24. Housefull 4\nInstagram\nStarring Akshay Kumar, Riteish Deshmukh, Bobby Deol, Kriti Sanon, Kriti Kharbanda, Pooja Hegde, Rana Daggubati and Chunky Pandey, this will be the fourth in the Housefull franchise. The film made a lot of headlines for all the right reasons. Sajid Khan and Nana Patekar had to leave the film in the wake of #MeToo movement after they were accused by multiple women.\n25. Brahmastra\nThis Christmas release of the year stars Ranbir Kapoor, Alia Bhatt and Amitabh Bachchan in pivotal roles. In an interview, Ranbir Kapoor revealed that Ayan Mukerji \"has spent six years of his life working really hard to make an original story\" and that the trilogy would be made over a period of 10 years. The film is being claimed to be a \"romantic-fairytale in a supernatural format.\". Director Ayan Mukerji explained that the title 'Brahmastra' \"resonates with the “ancient wisdom, energies and power,”. Nagarjuna also confirmed that he would be playing a \"pivotal\" role in the film.", "title": "25 Bollywood Movies That Every Cinema Lover Should Be Excited About In 2019!", "date_publish": "06/01/2019, 11:54:44", "description": "2018 has raised our expectations and now, everyone is eyeing in 2019. We made a list of 25 releases of 2019 for which you certainly need to block the dates and mark your calendar. From period-drama to revenge-thrillers, 2019 is a mixed bag of all genres and the year surely looks like a good one for cine-goers. What's your pick? Choose from this list!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/25-bollywood-movies-that-every-cinema-lover-should-be-excited-about-in-2019_-359666.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/2019_movies_1546510018_800x420.jpg"}