{"text": "If you haven’t been counting the days for Game Of Thrones last and final season, then I'm sorry to tell you but STOP calling yourself a true fan! I mean seriously, at this very moment in time with just 5 days left for season 8, most of the true-blue fans are freaking out and waiting with bated breath for it to begin. It goes without saying that it’s a bittersweet feeling for almost everyone. On one hand, after two long years, the season is almost here but on the other hand, the show that united billions of people over the globe is finally coming to an end.\nHBO\nBefore the big day arrives, it’s only natural that we reminisce the best moments of the much-loved American Fantasy show. Therefore, between re-watching all the seasons, we managed to compile a list of the most satisfying moments that gave us guilty pleasures.\nDisclaimer: No we do not promote killing of human beings, but come on, some of the deaths on the show did give you a lot of happiness, didn’t it?\nWithout further ado, scroll!\n1. Tyrion Lannister slapping his nephew Joffrey Baratheon: Season 1, Episode 2\nvia GIPHY\nIn this moment when Tyrion tells Joffrey to go and offer sympathies to Ned and Lady Stark for their son Bran's fall and he disobeys, the little lord wasted no time in disciplining him. The first slap gave us so much pleasure that when the second and then the third strike happened, it almost felt lie Christmas, didn't it?\nDon't Miss 159 SHARES 842 SHARES\n2. Tyrion slapping Joffrey yet again : Season 2, Episode 6\nWell, the deafening slaps in the first season wasn't a one off thing! Season 2 had Tyrion slapping 'King' Joffrey yet again for he ordered his army to kill people for they threw a cow pie at him. Tyrion not only called him a vicious mad King, he also hit him in the face and mocked his power. Double bonanza, if you may!\n3. Direwolf Nymeria biting Joffrey: Season 1, Episode 2\nfanaru.in\nBasically every scene where Joffrey was slapped, bitten or mocked gave us pleasure in abundance! This time, when Arya's wolf Nymeria pounded on him for intimidating Arya and bit his hand, most of us broke into slow claps!\n4. The birth of the dragons: Season 1, Episode 10\npinterest\nWhen Danny stepped into Khal Drogo's pyre along with the dragon eggs, no one anticipated that the eggs will hatch. Most of us had an inkling that Daenerys will survive but when she is found sitting right in the middle of is cross legged and suddenly the head of a baby dragon appears, we couldn't help but jump in wonder! The makers, in that very moment, knew that viewers were hooked on to the show for good.\n5. Jon Snow beating the shit out of Ramsay Bolton: Season 6, Episode 9\nTechnically, the entire episode Battle Of The Bastards kept us on the edge of our seats, however, this one moment when Jon Snow punched the shit out of Ramsay, that scene has to be one of the top ten scenes of the series. It was satisfying on so many levels that mere words can't explain that feeling.\n6. Drogon coming to the rescue of Danny: Season 5, Episode 9\nvia GIPHY\nTrapped in the fighting pits of Meeren and Sons Of The Harpy killing everyone in sight, Daenerys almost saw death. With her eyes closed waiting for her end, she was awestruck when Drogon arrived at the scene to rescue her. She climbed on Drogon's scaly spine and flew away, leaving the gory scene miles behind her. This is another one of the many wow moments of the show.\n7. Summer saves Bran and kills the assassin: Season 1, Episode 2\nyoutube\nBack in the first season, Robb Stark was lured into the fields on the pretext of an unruly fire. It was then that the assassin entered Bran's room to end his life. However, Cat's presence turned out to be a hindrance as she put up brave fight. Just when we though the end is near, Summer - Bran's direwolf made a whistle-worthy entry and killed the assassin in one move.\n8. Jaime saving Brienne from the bear: Season 3, Episode 7\nHBO\nWhen Locke throws Brienne Of Tarth in the pit to fend for herself from a bear with the help of a wooden sword, we almost thought that the fearless woman will meet her end and will be torn into tiny little pieces by the bear but when Jaime jumped in the pit to help her escape, in that very moment it was clear that those two had an unspoken bond. We are excited how this plot will unfold in the last season!\n9. Knights of the Vale save Jon and his army: Season 6, Episode 9\nvia GIPHY\nEven though we have established in the beginning that the Battle of the Bastards was epic in every sense of the word, it's time to appreciate the scene when Jon Snow thought that there was no way he and his army could survive the battle, in came the knights of the Vale and wreaked havoc on Ramsay's army! That way it was shot still manages to give us goosebumps.\n10. Greyworm killing the slavers and Tyrion consoling the remaining one: Season 6, Episode 9\nPersonally, this is one of my most favourite scene. While Danny is carrying out her business with her kids (read: dragons), the way Tyrion and Greyworm dealt with the Slavers was marvelous. Greyworm killed the two slavers in one go and that move had so much swag, that even the remaining Slaver was dumbstruck because he couldn't believe that he was still alive! The cherry on the cake was the way Tyrion patted on his back.\n11. Samwell killing a white walker: Season 3, Episode 8\ntwitter\nTo protect Gilly and the baby, Sam without even thinking struck the dragon-glass in the White Walker and to see the walker shattering into million tiny pieces was such a delight!\n12. Jon killing a walker: Season 5, Episode 8\nvia GIPHY\nJust when we thought that Jon Snow had made it to the boat to flee from the army of the Walkers, he was confronted by a wight. When he struck the walker with his Valyrian steel Sword, many of the walkers dropped dead. It was later on revealed that if the wight who created other white walkers is killed all his creations are finished along with him. But the scene itself was nothing short of a visual treat!\n13. Arya killing Ser Meryn Trant, Season 5, Episode 10\nIf you thought Oberyn Martell's death was gory, this one was the baap of all deaths! We are not even kidding! When Arya takes the face of an innocent girl who is presented as an option to Trant, the minute she revealed her true identity, most of us knew that Trant was over. The way she jumped and struck a dagger in his eyes was so both horrifying and satisfying at the same time, don't you think?\n14. Tyrion killing Tywin: Season 4, Episode 10\nI for one, always found Tywin's personality very dynamic. Having said that, the way he treated Tyrion definitely made him hateable as the show progressed. Therefore, it was only fair that Tyrion killed him. The best part about this murder was that Tyrion chose to murder his father in his weakest moment - when he was in the toilet. Gotcha!\n15. Brienne killing Stannis: Season 5, Episode 10\namino apps\nBrienne's loyalty toward Renly Baratheon was something that was very pure. Now, when she got the opportunity to seek revenge on Renly's behalf she didn't let anyone down. The way Stannis resigned to the fact that no amount of coaxing will make him escape death and the clean stroke of Brienne's sword had a calming effect on most of the viewers.\n16. Hodor killing Locke: Season 4, Episode 5\nZimbio\nHodor's character had no dialogues but he was still one of the most loved characters of the show. Now, when Bran warged into Hodor's brain and made him mercilessly kill Locke, it was nothing short of a proud moment, don't you agree?\n17. Arya killing Walder Frey: Season 6, Episode 10\nArya's character post training was something that none of us anticipated. She was swift and brutal. The way she killed her enemies was very fulfilling. When she fed Walder Frey's sons to him in the form of minced meat pie and then slit his throat, we knew that she is a force to reckon with. Period.\n18. Myrcella confessing that she knew Jaime was her father: Season 5, Episode 10\nvia GIPHY\nThis one moment was an emotional one for not just the characters but even for the viewers. When Myrcella confessed that she knew Jaime was her father, we envisioned a happy reunion between Cersei, Jaime, Tommen and Myrcella. However, all our dreams were shattered when she died in her fathers arms due to the poisonous kiss by Ellaria Sand.\n19. Jon and Sansa's reunion: Season 6, Episode 4\nvia GIPHY\nWhen Sansa returned to Winterfell with Brienne and there was an eerie silence, that's when Jon dismounted from his horse and the two ran towards each other and hugged! In that every moment, it felt like we were a part of the Stark family.\n20. Jon’s past revealed: Season 6, Episode 10\nvia GIPHY\nAll that humiliation and indifference for nothing! Yes, DB Weiss and David Benioff left us with the biggest cliffhanger in season 6 when Jon's true heritage was revealed. It was an awakening for all the Jon Snow's fans!\n21. Lynna defending Jon Snow: Season 6, Episode 10\nvia GIPHY\nAt the crossroads where Jon Snow's capabilities as a leader are tested, little Lynna Mormont stood up and spoke so fiercely that we couldn't help but not get inspired! Her fearless stance and unyielding attitude convinced everyone so much that everyone declared Jon Snow, the King in the North. However, from that moment onward little Lynna became the badass lady for all the fans.\n22. Arya wiping off the Frey house: Season 7, Episode 1\nThe way the makers opened the previous season is something that nightmares are made of. Walder Frey inviting all the brave men from his house for a party and then offering expensive wine which turns out to be poisonous was horrifying to watch. On top of that, when Arya removed Frey's face and mouthed the dialogue the North remembers, most of us had goosebumps!\n23. Olenna Tyrell's badass confession: Season 7, Episode 3\nvia GIPHY\nTruth be told, season 7 had a lot of jaw-dropping moments, but Lady Olenna's confession about Joffrey's death kicked everyone's behind and how! The way she told Jaime - 'Tell her, tell Cersei it was me'. If that didn't give you in-explainable pleasure then trust me, nothing else will!\n24. Little Finger's Execution by Arya: Season 7, Episode 7\nLittle Finger aka Lord Baelish was one character that most of us loved to hate. Agreed that he came to Jon's rescue during Battle of the Bastards, but let's not forget that slimy man had so many hidden agendas that we couldn't keep up with them. Little did he know that his scheme to pit the two Stark sisters will backfire so bad that it would make his lose his own life. Talk about delayed gratification!\n25. Cersei's constipated face after her introduction to a White Walker: Season 7, Episode 7\nThe final episode of Season 7 kept us on the edge of our seats. However, one moment that stood out was when The Hound freed the White Walker from the box and he ran for blood right towards Cersei! The way her whole body language shifted from arrogant to bat-shit scared was so soothing, wasn't it?\nBONUS: Call it a personal bias or anything else, every scene of Peter Dinklage gave utmost satisfaction. The man is a pleasure to watch and i for one, am rooting for him to sit on the Iron Throne in the end!\nvia GIPHY\nThe season finale of Game Of Thrones will premiere on April 14.", "title": "25 Most Satisfying Moments From Game Of Thrones That Still Make Us Say 'Hell Yeah' Despite Numerous Re-Runs!", "date_publish": "11/04/2019, 16:08:41", "description": "f you haven’t been counting the days for Game Of Thrones last and final season, then I'm sorry to tell you but STOP calling yourself a true fan! I mean seriously, at this very moment in time with just 5 days left for season 8, most of the true-blue fans are freaking out and waiting with bated breath for it to begin. It goes without saying that it’s a bittersweet feeling for almost everyone. On one", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/25-most-satisfying-moments-from-game-of-thrones-that-still-make-us-say-hell-yeah-despite-numerous-re-runs-365113.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_1554796687_800x420.jpg"}