{"text": "In Bollywood, weight is something that really matters. No, we are not talking about Bollywood divas' obsession with size zero. We are talking about the weight in the characters that they play, or the weight in the costumes that they don for their roles.\nFrom Madhuri Dixit's eye-catching purple saree in Hum Aapke Hai Koun to Deepika Padukone’s extravagant lehengas in Bajirao Mastani, do you know that some of these costumes are crazily heavy?\nWhen the fire broke down on the sets of Sanjay Leela Bhansali’s Padmaavat, a lot of costumes along with the sets were burned. For a layman like us, that wasn’t a big damage, right? But those who have watched Sanjay Leela Bhansali’s movies would know about his penchant for larger than life sets and costumes. That was a huge loss for him.\nHere are 8 Bollywood stars who wore super heavy costumes and took our breaths away, literally!\n#1 Sanjay Dutt to wear an armour weighing a whopping 35 kgs!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn his forthcoming movie, a period drama titled Panipat, Sanjay Dutt will reportedly be seen wearing the armour which weighs 35 kgs. To prep-up for his role further, he is reportedly also going to set up a make-shift gym for himself in Jaipur, where the shooting of the movie is going on. The movie stars Arjun Kapoor in lead role. Dutt will be playing the role of Afghan King Ahmad Shah Durrani.\n#2 Amitabh Bachchan almost fainted donning his majestic Thugs Of Hindostan costume that weighed over 20 kgs!\nTwitter\nAmitabh Bachchan was in pain because of the heavy costumes, revealed Jaya Bachchan. “Amitji is fine. He has pain in the back and neck. The costumes are very heavy, so, there's some pain. Otherwise, he is fine,” she had told IANS.\n#3 Loved Deepika Padukone’s lehengas in Padmaavat? Here’s how much they weighed!\nTwitter\nFor those of you who don’t know 400 kg of gold went into the making of Deepika Padukone’s Rani Padmaavat's 30 Kg legenga. What’s more? Deepika shot for 12-14 hours straight for about 100 days in those costumes. It took 200 craftsmen, 400 kgs of gold and 600 days of hard work to create the jewellery that she donned in the movie.\n#4 Sridevi worn a 25kg dress for Roop Ki Rani Choron Ka Raja\ntosshub.com\nFor the song titled Dushman Dil Ka Wo Hai, Sridevi wore a costume that weighed 25 kg. The shooting of the song stretched to 15 days, and the actress wore the same heavy gown for all those days.\n#5 Madhuri danced to the epic number Kaahe Chhed Mohe in Devdas wearing a costume that weighed a whopping 30kgs.\nbollywoodbubble.com\nThe list would have been incomplete without the ever charming diva Madhuri Dixit. She donned a 30kg lehenga for the mesmerizing song she performed Kathak on.\n#6 Aishwarya Rai in Jodha Akbar!\nJodha Akhbar was one visually appealing movie, right? Aishwarya looked like a dream, didn’t she? But do you know it took 200 craftsmen and their 600 days of hard work to only design her heavy jewelries in the Ashutosh Gowariker's historical romance film Jodha Akbar? Her Ghaghra Cholis were quite heavy too!\n#7 Amitabh Bachchan’s Shahenshah costume weighed 14 kilos.\nbookmyshow.com\n“Rishte main hum tumhare baap hote hain, naam hai Shahenshah”. Yeah, for that film, Big B wore a crazily heavy costume.\n#8 Do you remember Vivek Oberoi in Krrish 3? If you do, his costume in the movie weighed around 28kgs.\nTwitter\nAbout 7-8 guys had worked on his outfit.", "title": "30 Kg-Costumes To 400 Kgs Of Jewellery, 8 Times Celebs Sported Heavy Costumes For Their Roles", "date_publish": "23/03/2019, 13:15:19", "description": "From Madhuri Dixit eye-catching purple saree in Hum Aapke Hai Koun to Deepika Padukone’s extravagant lehengas in Bajirao Mastani, do you know that some of these costumes are crazily heavy? Here are the times when Bollywood stars wore crazily heavy costumes and took our breaths away, literally!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/30-kg-costumes-to-400-kgs-of-jewellery-8-times-celebs-sported-heavy-costumes-for-their-roles-363935.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/heavy_bollywood_costumes_1552979616_800x420.png"}