{"text": "Love is not a feeling, it's a place. A place where you feel safe and magical. For Shibani Dandekar and Farhan Akhtar, cupid struck a year ago and today, they are celebrating 365 days of being together, in love.\nFarhan Akhtar and Shibani Dandekar have never opened up about their relationship but as they say: sometimes silence is the loudest language.\nThey are travel partners, best friends and the pictures that they post on social media prove that when they're together, they need no one else.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nInstead of shying away from the media, both Farhan and Shibani are very comfortable in posing for media and they made an official confirmation on the same when they arrived at DeepVeer reception in Mumbai holding hands.\nWedding bells?\nReports have time and again hinted at the very fact that the couple has decided to take the plunge and seal the deal with a private wedding ceremony in the first quarter of the year. Their friends spoke to media on the condition of anonymity and told DNA,\n\"They are extremely serious about each other and Farhan's kids have also warmed up to Shibani, so this looks like the most obvious step for the two.\"\nOn Valentine's Day, Farhan Akhtar dedicated a sweet post for Shibani. He wrote:\n\"I don't know if you find love or love finds you, either way, it's a gift from the universe. So be grateful. Every. Single. Day\"\nThe couple is currently in Mexico on a vacay. Here are a few pictures that show how they are making the most of their time together.", "title": "Farhan Akhtar And Shibani Dandekar Celebrate A Year Of Togetherness", "date_publish": "22/02/2019, 13:28:39", "description": "Instead of shying away from the media, both Farhan and Shibani are very comfortable in posing for media and they made an official confirmation on the same when they arrived at DeepVeer reception in Mumbai holding hands.For Shibani Dandekar and Farhan Akhtar, cupid stuck a year ago and today, they are celebrating 365 days of being together, in love.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/365-days-of-bliss-lovebirds-farhan-akhtar-shibani-dandekar-celebrate-a-year-of-togetherness-362595.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/farhan_akhtar_and_shibani_1550820466_800x420.jpg"}