{"text": "In his career spanning over 45 years, Kader Khan had spread across laughter and happiness. Known for his comic roles in the ‘90s, Kader Khan passed away at the age of 81 at a hospital in Toronto, after being hospitalised for about four months.\nBCCL\nRecently, he had developed breathing issues after which he was transferred from a regular ventilator to BiPAP ventilator. The actor, who was suffering from progressive supranuclear palsy, a degenerative disease that causes loss of balance, dementia, and difficulty in walking, had slipped into coma.\nAmong other actors who grieved the death of the veteran star was Govinda, who has worked with Kader Khan in many films. They shared an amazing camaraderie and together, they tickled our funny bones too. Bidding him goodbye, Govinda paid a heartfelt tribute to Kader Khan. Here’s what he wrote:\nDon't Miss 247 SHARES 2.2 K SHARES 12.5 K SHARES\nRIP Kader Khan Saab.\nHe was not just my \"ustaad\" but a father figure to me, his midas touch and his aura made every actor he worked with a superstar. The entire film industry and my family deeply mourns this loss and we cannot express the sorrow in words.#ripkaderkhansaab🙏🏻 pic.twitter.com/NISPM1UMs1 — Govinda (@govindaahuja21) January 1, 2019\nFans were left emotional after reading this!\n#1\nOne of the Best bollywood Jodi\nRip pic.twitter.com/OkGBcR8Ecu — राजू (@rakjeshjaisawal) January 1, 2019\n#2\nkya jodi thi aapdono ki behad sandar pic.twitter.com/cV9JpK4Nb5 — AnuragRoopam (@Mohitra39081617) January 1, 2019\n#3\nThis end of an era Govinda sir you two were such great actors together your movies with kader Khan sir will always remain legendary I miss THERI ARE no words to express how I feel he was like your father figure rip kader Khan sir may Allah Grant you the highest place in jannat — Syed Mujtaba Safvi (@SafviMujtaba) January 1, 2019\n#4\nThis is most Amazing Pair I Ever Seen 😍👍👌🙌🙏 #Rip #KaderKhan Sir — #RakulPreetFc_10 (@RakulPreetFc_10) January 1, 2019\n#5\nGovindaji and kadar khansab ki Jodi was one of the best. In all entertainers #1 titled movies it was excellent performance by both legends — D K Jain (@D84569572) January 1, 2019\n#6\nBahut films aap dono ne sath kiya usme se kuch meri favourite comedy movies dulhe raja Raja babu hero no1 joru ka ghulaam etc 😓😓😓 — Manu Tripathi 🇮🇳 🇮🇳 (@ManuTri29320215) January 1, 2019\n#7\nLegendary Combo — Ashish Sinha ⚔🔱🚬 (@GabbarBrothers2) January 1, 2019\n#8\nThanks for making our childhood awesome as a kid of 90s I enjoyed many mores films of urs, u r great legend of Acting and Comedy this new year first day actually very sadfull due to ur death 🙏❤️ #ripkaderkhansaab pic.twitter.com/HVUORiTHhx — Vicky (@iamVkDC) January 1, 2019\n#9\nYou both had the best comic Pair.\nJust like how Akshay Kumar n Paresh raval have today 👏👏 — SYED (@Sfaisalmech) January 1, 2019", "title": "41 Films & A Father-Son Relationship, Govinda Pays A Heartfelt Tribute To His Ustaad Kader Khan", "date_publish": "02/01/2019, 18:05:02", "description": "Among other actors who grieved the death of the veteran star was Govinda, who has worked with Kader Khan in many films. They shared an amazing comradelier and together, they tickled our funny bones too. Bidding him goodbye, Govinda paid a heartfelt tribute to Kader Khan. Here’s what he wrote.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/41-films-a-father-son-relationship-govinda-pays-a-heartfelt-tribute-to-his-ustaad-kader-khan-359718.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/41_films__infectious_camaraderie_govinda_pays_a_heartfelt_tribute_to_his_ustaad_kader_khan_1546432011_800x420.png"}