{"text": "Let's start this article by mentioning that I am a big movie buff and hardly miss out on any big or small films that release in India. From a Manikarnika, Thackeray, A Quiet Place, Bohemian Rhapsody to now the Green Book, this year has kick-started with a plethora of great blockbusters.\nWhile Indian cinema was harping on political driven films like The Accidental Prime Minister or a Thackeray, Hollywood movies have been upping their game by making movies inspired by true lives.\nAnd this is why it's important to talk about a film that is relevant across all age groups and every era. Green Book is a movie about an African American pianist who is world class at that. But his life is not easy as he's what some parts of the world still say 'Negro' with an Italian chauffeur and the difficulties they find along their way.\nYoutube/screengrab\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 151 SHARES\nA dramatic comedy, Green Book is a film that needs to be out there for people to see and for them to learn. I have seen the film and without giving much spoilers, let me take you through reasons why this movie is an unmissable one\n1. Storyline - America's long standing history with racism\nYoutube/screengrab\nA fun spin on America's problematic history of racism. The story is set up in 1962 where African Americans and the rest of the America were not the best of friends. Don Shirley (Mahershala Ali), is a world class pianist who has a concert planned in deep South. He's looking for a chauffeur to take him through the tour and gets New York city bouncer Tony (Viggo Mortensen), who is an Italian. They embark on this journey where they learn about each other and about the world apart from music. Don takes on the challenging tour knowing what he shall face. Tony takes it up despite his colleagues reminding him that he could stay back and get thrice as much paid. Why? Because a white guy cannot be a driver to the black.\n2. Don and Tony - The unlikely pair\nYoutube/screengrab\nTo begin with, just see the trailer and you'll know what we're talking about. One is a super tall, lean black guy Don Shirley. Tony, the driver on the other hand, is a stout white guy who is unapologetic about his choices or thoughts. Their banter starts when Tony gets on the job and they begin to face clashes. Tony has funny habits like smoking all the time and eating Kentucky Fried Chicken in the car while driving which drives Don Shirley nuts. Don is refined, non-chatty, prefers alone time, but is clearly unsuccessful during the 2 month tour. What happens next is how they stand up sticking for each other when time demands and end up becoming friends. Because in the end it doesn't even matter.\n3. Breaking the stereotype\nYoutube/screengrab\nThe movie address two very important issues. Despite being set up in the most powerful country, it shows how culturally misfit African-Americans were considered. An issue which somewhere still exists. It breaks the norm that white and black can be friends or more so, it's okay for a black guy to be rich enough to hire a white man as his driver. The movie shows how they are both looked down upon, the black guy for his race and Tony, for working for him.\nThat's not all, there was also a subtle presence of homosexuality in the film and how it was tackled back then. To be honest, we're still facing the same issues and it's a problem pan world and continues to break hearts. The way Green Book tackles and breaks the shackles of typical stereotypes is a learning for all of us. Don't judge is a lesson that needs to be told to us everyday and this movie conveys exactly that.\n4. Sweeped in Oscar nominations 5 major categories\nYoutube/screengrab\nThe movie premiered at the Toronto Film Festival and opened to positive reviews. Since then, there has been no looking back for the film. The movie has so far minted 100 million dollars worldwide and continues to make more money. Green Book was also chosen as one of the top 10 films of the year by the American Film Institute. The film won the Producers Guild of America Award for Best Theatrical Motion Picture and the Golden Globe Award for Best Motion Picture – Musical or Comedy. Well, that's not all, the it has been nominated at the 91st Academy Awards under five categories, including Best Picture, Best Actor (Mortensen) and Best Supporting Actor (Ali).\n5. Based on a true story\npopsugar\nWould you believe if we tell you that this road trip drama is a real life story of how two people who came together to change the way the world looks at them. Yes, that it's okay to have an inter-racial friendship. Although, as expected the film ran through troubled waters where people cited inaccuracies about the friendship and the state of the country, but the truth is that real life Don and Shirley remained friends until they died within months of each other. Now isn't that a goosebumps fact.\nThe movie ends on a happy note with a very strong message. If you want to achieve something, you will because it doesn't take a genius but courage to do so.", "title": "5 Reasons Why You Absolutely Must Watch Oscar-Nominated Film Green Book Before The Ceremony", "date_publish": "13/02/2019, 17:44:42", "description": "Let's start this by mentioning that I am a big movie buff and hardly miss out on any big or small films that release in India. From a Manikarnika, Thackeray, A Quiet Place, Bohemian Rhapsody to now the Green Book, this year has kick-started with a plethora of great blockbusters.Let's start this by mentioning that I am a big movie buff and hardly miss out on any big or small films", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/5-reasons-why-you-absolutely-must-watch-oscar-nominated-film-green-book-before-the-ceremony-362081.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/green_book_1550046730_800x420.jpg"}