{"text": "PARTNER\nBollywood has a favourite baba in town and no, it’s not Baba Ramdev. It’s Ranveer Singh. He is a bundle of energy that not just oozes out of him on-screen but off-screen as well, leaving people wondering what’s his secret jadibuti. But all jokes aside, this man holds his own. He is not only funny but also owns his attitude like a boss and these are just a few of the many things that make him the bright funky and energetic ambassador of fun!\nBesides his charm, good looks and his mind-blowing acting, Ranveer can outwit anyone and that’s a big plus in our funny book. Here’s what makes him double the fun than your regular Joe.\n1. He is not afraid to poke fun at himself.\nYoutube\nThe number of times that Ranveer has been criticized for his looks is something that even he can’t keep a track of. Instead of getting offended at the critics, he often joins them to mock his taste and style, but in spite of that, he is unapologetically him at every red carpet event. Even marriage didn’t make him compromise on his fun sense of style. In fact, the man showed up at his various receptions in the wackiest of the looks.\nAnd that’s not all. He even participated in the AIB Roast giving a chance to comedians to openly mock him. Taking it all in good stride, his participation made the event go down in comedy history in India.\n2. He is spontaneous and crazy AF\nAaj Tak\nAt an event, Ranveer Singh got on stage with Baba Ramdev and challenged him to push-ups. Now if that’s not spontaneous, what is? Unfortunately, he couldn’t outdo the yoga guru and was humble enough to accept defeat.\n3. He even gels with his wife’s ex-boyfriend\nStar World\nIf you thought getting Ranveer Singh on the same couch as Ranbir Kapoor could make him uncomfortable, you were wrong. This man can get friendly with just anyone! What the hell, he even broke into a fun song and dance with Ranbir on the Koffee with Karan couch. The duo have also been seen chilling together at Ranbir’s house with their respective partners.\n4. He’s fun even with the paparazzi around\nFilmfare\nRanveer Singh defies ‘normal’. His paparazzi clicks always have him sporting a big smile, jumping around or giving the photographers the best candid clicks.\n5. He has the best taste in brands!\nJust like his movies, his choice of brands is also eccentric and cool. Recently Ranveer was spotted going all out promoting the new bunless burger in town. Yup, that's right. There is a burger without the bun!\nKFC has recently launched the Double Down - chicken bunless burger. His unapologetic excitement on finding out about the Double Down burger is absolutely contagious. And understandably too, I mean, KFC is taking the crispiness (and chicken-ness!) of their burgers a notch higher by completely removing the bun. Have a look.", "title": "5 Reasons Why Ranveer Singh Means Double The Fun Always", "date_publish": "16/02/2019, 20:09:32", "description": "Bollywood has a favourite baba in town and no, it’s not Baba Ramdev. It’s Ranveer Singh. He is a bundle of energy that not just oozes out of him on-screen but off-screen as well, leaving people wondering what’s his secret jadibuti. But all jokes aside, this man holds his own. He is not only funny but also owns his attitude like a boss and these are just a few of the many things that make him the b", "authors": ["Nupur Khanna"], "url": "https://www.indiatimes.com/entertainment/5-reasons-why-ranveer-singh-means-double-the-fun-always-362222.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1550226435_800x420.jpg"}