{"text": "With the digital medium coming in, the world has become smaller. Netflix and Amazon have brought the finest content together on OTT platforms enriching the experience of the viewers who enjoy interesting pots and turns. But the newest one on the block which has paved way into the Indian market and shook the above is Hotstar. From acquiring the rights of Game of Thrones to getting real time series, Hotstar is exploding with enthralling shows and movies.One such show is Criminal Justice.\nInspired by the British series, the show is about giving justice to criminals who may or may not have committed the crime. The buzz around the Indian version proves Criminal Justice will see many more episodes. But before that, here's taking a look at why this should be your show for this season.\n1. Vikrant Massey\nThe man who stunned you with his performance in Dil Dhadakne Do, Lootera, Mirzapur and A Death In The Gunj is back with another mega show. The series, Criminal Justice, revolves around Vikrant's character who was charged with murder after consuming drugs. The series takes you through his life in jail and how he will get out of the trappings of the legal system if proven innocent.\nDon't Miss 1.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nVikrant has had a remarkably career growth. From making a debut with Balika Vadhu to a gripping show like Criminal Justice, Vikrant Massey definitely is making us proud with his choices.\n2. Pankaj Tripathi\nHotstar/screengrab\nNeedless to say, the makers have handpicked some of the choicest actors. From one stellar actor to another. Pankaj Tripathi is seen playing the role of a lawyer who tries to help Vikrant Massey. Called as Madhav Mishra, Pankaj Tripathi floors you with his layered performance and powerful dialogues. His ole is the best part of the show.\n3. Jackie Shroff\nHotstar/screengrab\nFor all Jackie dada fans, Bhidu has made a comeback with this extraordinary show. Playing the role of one of the inmates, Jackie is thrilled to be a part of the digital medium. In one of the interviews, Jackie was asked why we should watch Criminal Justice and he replied, 'If my wife, who sleeps early, watched the series at one go, then everyone should watch it. I am sure the suspense element will make viewers stay hooked to the series. Watch the series for the performances and hard work that each one has put.'\nWell, it will be a delight to see the show with such underrated spectacular actors in one space.\n4. Storyline\nThe story revolves around a taxi driver who has a one night stand with one of his passengers. When he wakes up the next day, Vikrant Massey witnesses his passenger's dead body next to him. The whole story is nail biting and will keep you wanting for more. Internet has already declared this as one one-go watch show and we can't help but agree.\n5. Murder-mystery-drama - A genre we all need\nKeeping the best for the last. This is a genre no one has really tapped on. Badla was one such film in Bollywood but Criminal Justice will surprise you in ways more than one. Vikrant Massey gets into the skin of the character. From showing emotional scenes to nudity, there are some portions from the jail that will jolt you up. The show is a perfect potboiler for a weekend binge. Directed by Tigmanshu Dhulia, who has given us cults like Paan Singh Tomar and Saheb Biwi Aur Gangster, the show promises to be one of a kind.\nThe show is already live on Hotstar and has opened to positive reviews.", "title": "5 Reasons Why You Should Binge-Watch Vikrant Massey's Criminal Justice This Weekend", "date_publish": "12/04/2019, 16:44:07", "description": "Inspired by the British series, the show is about giving justice to criminals who may or may not have committed the crime. The buzz around the Indian version proves Criminal Justice will see many more episodes. But before that, here's taking a look at why this should be your show for this season.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/5-reasons-why-you-should-binge-watch-vikrant-massey-s-criminal-justice-this-weekend-365346.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/criminal_justice_1555067980_800x420.jpg"}