{"text": "50 Cent Buys 200 Seats Of Ja Rule Concert To Make It Look Empty And It's Both Hilarious & Sad!\n50 Cent Buys 200 Seats Of Ja Rule Concert To Make It Look Empty And It's Both Hilarious & Sad!\nThe bigger their paycheques, the bigger their egos. Aren’t celebrities just like us? They also keep grudges, don’t they? I mean, leave a bunch of them in a room and they’ll punch each other. How can you forget Nicki Minaj and Cardi B’s physical brawl, where Cardi B apparently hurled a shoe at her?\nMannnn Idk if cardi b and Nicki Minaj got into a fight but I know SOMEBODY hit cardi look at her eye 😳😳 pic.twitter.com/JwZYZYyDBC — Zay 💪🏽 (@alightskinnigga) September 8, 2018\nTaking craziness to another level, 50 Cent just fuelled up his fallout against Ja Rule. He bought 200 tickets of his concert in order to make it look empty. He even posted about it on social media. However, he deleted it later.\nAnd that didn't end there. Ja Rule then shared a few photos where he edited 50 Cent to make him look like a woman. He also hinted that Cent needs to get a hobby.\nThis beef is a JOKE to everyone except this lil ape looking bitch... she mad mad!!! 😡 😂🤣😭 pic.twitter.com/l1nxY9e7GK — Ja Rule (@Ruleyork) October 28, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhat's more? 50 Cent had also posted a photoshopped picture of him being present at Ja Rule's concert.\nAnd in his reply, Ja Rule photoshopped this picture of 50 Cent by adding sex toys.\nIt all started after 50 Cent claimed that Ja Rule incorrectly accused him of stealing jewelry and brought it to Murder Inc. Records' founder Irv Gotti's attention. On the other hand, according to Ja Rule, their fallout kickstarted during a video shoot in Queens, NYC.\nWell, it's not getting over anytime soon.", "title": "50 Cent Buys 200 Seats Of Ja Rule Concert To Make It Look Empty And It's Both Hilarious & Sad!", "date_publish": "29/10/2018, 16:03:02", "description": "Taking craziness to another level, 50 Cent just fuelled up his fallout against Ja Rule. He bought 200 tickets of his concert in order to make it look empty. He even posted about it on social media. However, he deleted it later. The bigger their paycheques, the bigger their egos. Aren’t celebrities just like all us? They also keep grudges, don’t they?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/50-cent-buys-200-seats-of-ja-rule-concert-to-make-it-look-empty-and-it-s-both-hilarious-sad-355657.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/amid_their_feud_50_cent_buys_200_seats_at_ja_rule_concert_to_make_it_look_empty_1540806929_800x420.png"}