{"text": "When it comes to talking and sharing life experiences, no one does it better than King Khan. No wonder, he is one of the most reliable orators and people look up to him for advice and lessons. He recently received his third honorary doctorate in the UK recently when The University of Law (London) honored him in Philanthropy.\nHe already has honorary doctorates from The University of Bedfordshire and The University of Edinburgh. In his recent interview with BBC, Shah Rukh Khan, who was once known as India's biggest romantic hero, confessed that now he is ready to play a ‘sexy father’\nAgencies\nIn case this statement has left you asking for more, here are our top six golden lines by Shah Rukh Khan that proves he's one actor who is witty, reliable and relevant! He has his heart in the right place and that's just one of the many reasons why fans love and admire him. Read on about his latest interview!\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 612 SHARES\n1. SRK said that as an artist, he will do whatever his fans want him to.\n2. He gave his two cents on how the dynamics of the film industry is changing for women. And we are so glad\n3. He had the most valid thing to say about the endless tussle between filmmakers and India’s Central Board of Film Certification (Censor Board)\n4. As a nation, SRK believes, we need to accept the diversity and respect people's choices\n5. He wants to change lives with his art and films\n6. He gave a solid statement on how the shelf life of actresses is seeing a positive change.\nWatch the video interview right here!\nBollywood superstar @iamsrk has just received an honorary doctorate from the University of Law in London.\nIn an exclusive interview with @ShabnamMahmood he spoke about the #MeToo movement, film censorship in India and #Brexit. pic.twitter.com/gciiA4Ttjr — BBC Asian Network (@bbcasiannetwork) April 5, 2019", "title": "6 Golden Lines From SRK's Recent Interview That Proves There Can't Be Anyone Like Him. Ever!", "date_publish": "06/04/2019, 17:07:21", "description": "In case this statement has left you asking for more, here are our top six golden lines by Shah Rukh Khan that proves he's one actor who is reliable, relevant and witty! He has his heart in the right place and that's just one of the many reasons why fans love and admire him. Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/6-golden-lines-from-srk-s-recent-interview-that-proves-there-can-t-be-anyone-like-him-ever-365002.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_1554553670_800x420.jpg"}