{"text": "6 Tricks And Tips People Are Following To Avoid 'Avengers: Endgame' Spoilers And You Should Too!\n6 Tricks And Tips People Are Following To Avoid 'Avengers: Endgame' Spoilers And You Should Too!\nSome people take their movies very seriously! I mean come on, if you are passionate about something, why would you ever let anyone ruin it for you? Well, a Marvel Cinematic Universe (MCU) fan knew just how he wanted to watch Avengers: Endgame, and so he set some rules and regulations for his girlfriend for their theatre date.\nThe story of the fan named Cyrille is going viral on social media. He warned his girlfriend, Kamilla Rose, not to ruin his cinematic experience by taking popcorn or toilet breaks while watching the film.\nKamilla posted a screenshot of her boyfriend’s ‘list’ on Twitter. The list reads: “We will not be queuing to buy popcorn, please make prior arrangements. You are not permitted to consume and food during the film (including end credits)... I will not be moving to allow you to pass for a toilet break - find an alternative rule.”\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\nIt further said, “In case of any emergency relating to our son, I give you full authority to leave and take control. I will join you after the film (inc end credits) ends.” The list also mentioned they will have a 30-minute debrief session and another “period of self reflection”.\nShe was also asked not to communicate with him during the trailers or duration of the film. Reacting to such rules, Kamilla tweeted: “My boyfriend sent me a very sternly worded note about our cinema trip to see ‘Avengers: Endgame’. Mad because I thought it was just date night.”As the tweet went viral, many Avengers fans supported the boyfriend and found him “reasonable” and “justified”.\nMy boyfriend sent me a very sternly worded note about our cinema trip to see #AvangersEndgame tomorrow. Mad because I thought it was just date night 😩🤷🏽‍♀️ pic.twitter.com/ZWfsCwRqV7 — Kamilla Rose (@KamillahRose) April 24, 2019\nOne social media user wrote: “Lol, not gonna lie I may have to just pass this message on to mine. He is a legend for this.” Another netizen said Cyrille deserves an award for his honesty.\nThat's not all. In fact, a few days ago, Filmmaker duo Anthony and Joe Russo appealed to the fans, asking them not to reveal spoilers from the upcoming film Avengers: Endgame for other people, hours after five-minute footage of the Marvel tentpole was leaked on social media.\nThe brothers on Wednesday started a campaign, #DontSpoilTheEndgame, on Twitter and posted a letter, addressed to the \"greatest fans in the world\".\nWell, this is just one case and instance that shows what people can do to avoid movie spoilers. If you are someone who can trade anything in the world to avoid spoilers, here are a few tricks!\n1. Use that Mute! Mute Important Key-phrases from the movie from your Twitter Timeline\n2. Avoid Comment Section from news articles and stories related to Avengers Endgame on Social media\n3. Stay away from movie-reviews! Come on. This is for starters!\n4. Tell every Avenger Fan who's close to you and warn them to not reveal anything that could possibly be the spoiler!\n5. Take help of browser Extensions: Spoiler Protection 2.0 and Unspoiler are two free browser extensions that can definitely help you stay away from everything that could steal the fun out of your movie-watching experience.\n6. Use Video-Blocker: This extension will not just keep you away from all the spoilers on YouTube but will help you block videos, comments and even channels based on the keywords you choose. Easy, isn't it? Last, but not the least: Watch the film or AT LEAST BOOK your tickets in advance!\nDirected by Russo brothers, Avengers: Endgame is the culmination of over 20 Marvel movies. It stars actors like Robert Downey Jr, Chris Hemsworth, Chris Evans and Scarlett Johansson. It was released in India on Friday.\n(With agency inputs)", "title": "6 Tricks And Tips People Are Following To Avoid 'Avengers: Endgame' Spoilers And You Should Too!", "date_publish": "26/04/2019, 16:52:06", "description": "Some people take their movies very seriously! I mean come on, if you are passionate about something, why would you ever let anyone ruin it for you? Well, a Marvel Cinematic Universe (MCU) fan knew just how he wanted to watch Avengers: Endgame, and so he set some rules and regulations for his girlfriend for their theatre date.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/6-tricks-and-tips-people-are-following-to-avoid-avengers-endgame-spoilers-and-you-should-too-366153.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_1556280693_800x420.jpg"}