{"text": "7 Bollywood Celebrities Speak About Their Achievements That Most People Might Find Really Weird\n7 Bollywood Celebrities Speak About Their Achievements That Most People Might Find Really Weird\nBollywood celebrities are a constant source of inspiration. Whether it's their style and demeanor or their achievements, stars have their way of providing us comfort and light in more ways than one.\nEveryone wants a piece of them and wish to live their lives for a day but celebrities divulge how their routine is a struggle. From staying fitter, looking food, dabbling relationships to waiting every Friday for a success for them, it's not easy to reach the top and continue being there.\nHere are 7 Bollywood stars who graced the red carpet of Filmfare Style and Glamour awards and swayed us with their presence. These celebs proved that they not only have a quirky sense of fashion but a quirky side to them. Take a look at these A-listers as they reveal their coolest achievements that people may find weird.\nApart from that, they also spoke about their favourite fashion era, favourite Bollywood wardrobe and it a little Valentine message too. Listen in.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n1. His personal achievement was donating sperms in 2004 but it scarred and raised many eyebrows.\n2. Did you know, Ali Fazal is the youngest member of the Academy Awards team and people think it happened too 'SOON' for him.\n3. Karisma Kapoor's personal achievement is not that she's gorgeous but the fact that she's Taimur's maasi\nWe're not sure if we find that weird but we are definitely jealous.\n4. Kartik Aaryan has realised there is a crazy hashtag #PoseLikeKartik which is going viral on Instagram and he finds it fascinating yet weird.\n5. Do you know, Ishaan can eat insane amounts of food and overwhelming amounts of cereal in one sitting and our correspondent just couldn't keep calm.\n6. Newest debutante of Bollywood, Ankita Lokhande speaks about how she personally finds red carpet looks weird.\n7. Urvashi Rautela loves her gymnastics and is not leaving it anytime soon even if people find it weird. Fair Enough!", "title": "7 Bollywood Celebrities Speak About Their Achievements That Most People Might Find Really Weird", "date_publish": "13/02/2019, 12:53:48", "description": "9 Bollywood Celebrities Speak About Their Achievements That Most People May Find Weird9 Bollywood Celebrities Speak About Their Achievements That Most People May Find Weird9 Bollywood Celebrities Speak About Their Achievements That Most People May Find Weird9 Bollywood Celebrities Speak About Their Achievements That Most People May Find Weird", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/7-bollywood-celebrities-speak-about-their-achievements-that-most-people-might-find-really-weird-362059.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1550048547_800x420.jpg"}