{"text": "7 Photos Of Bollywood Celebrities Bumping Into Each Other That’ll Make You Wish You Were There\n7 Photos Of Bollywood Celebrities Bumping Into Each Other That’ll Make You Wish You Were There\nDo coincidences signal that it’s meant to be? Isn’t it a pleasant surprise to be bumping into an old friend/acquaintance after years? It’s even more pleasing when it’s about randomly meeting a celebrity.\nBut have you imagined how it would be like when stars bump into other celebs? Just like all of us, they pose for a picture and make memories. That’s what these stars did.\nTake a look at the pictures of stars who bumped into each other unexpectedly.\n#1 Aamir Khan had a fanboy moment meeting Telugu superstar Chiranjeevi Garu in Japan.\nThe two met at Kyoto Airport in Japan. Aamir Khan almost had a fan moment as he wrote, “Ran into one of my favourite actors, Superstar Chiranjeevi Garu at Kyoto airport! What a pleasant surprise :-) . Discussed his new project about freedom fighter Uyyalawada Narasimha Reddy. You are always such an inspiration sir. Love.”\n#2 Ranveer Singh gave a kiss of love to Anil Kapoor!\nTwitter\nDon't Miss 185 SHARES 468 SHARES 544 SHARES 161 SHARES 411 SHARES\nThe father and son duo of Dil Dhadakne Do had flights to catch around the same time at the airport. They were clicked by the paps while exchanging pleasantries.\n#3 Madhuri Dixit's Jhakaas moment with Anil Kapoor at airport!\nIsn't that a perfect Dhak Dhak moment too?\n#4 Kiara Advani Bumps Into ‘Arjun Reddy’ Vijay Deverakonda!\n#5 Farhan Akhtar’s ex-wife Adhuna Bhabani bumped into his current girlfriend Shibani Dandekar!\nThis one was awkward. They are not even looking at each other.\n#6 Varun Dhawan has a fan moment with Sunny Deol post rehearsals.\nTwitter\nPost his dance rehearsals Varun Dhawan was on his way to home, when he met Sunny Deol.\n#7 Urvashi Rautela met Rajinikanth and she couldn't stop blushing.", "title": "7 Photos Of Bollywood Celebrities Bumping Into Each Other That’ll Make You Wish You Were There", "date_publish": "07/04/2019, 17:51:43", "description": "But have you imagined how it would be like when stars bump into other celebs? Just like all of us, they pose for a picture and make memories. That’s what these stars did. But have you imagined how it would be like when stars bump into other celebs? Just like all of us, they pose for a picture and make memories. That’s what these stars did.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/7-photos-of-bollywood-celebrities-bumping-into-each-other-that-ll-make-you-wish-you-were-there-365037.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/7_amazing_photos_of_bollywood_celebrities_who_unexpectedly_bumped_into_each_other_1554636590_800x420.png"}