{"text": "Ever since OTT platforms made way into our country, we have been flooded with some 'break the gender stereotype' shows. The '90s witnessed Sex And The City, which was about four fashionistas trying to figure out their imperfect lives.\nInstagram\nWhile people usually enjoy slapstick comedy featuring men, it was difficult to introduce the same with ladies. But then, all thanks to Lipstick Under My Burkha and Veerey Di Wedding, we had four Indian characters to associate with.\nAnd now, we have yet another fantastic show, Four More Shots Please, to lift our spirits up and make us feel liberated. How is it different from a film, you ask! Well, the film and series is totally different; primarily because of its format in terms of the time, which means you get to elaborately see the journey of all the four characters and the people who walk into their lives over a period of ten episodes.\nscreengrab\nI have seen the show and without giving you any spoilers, I'll tell you why this is your perfect weekday binge-watch. Yeah, if you start tonight, we promise you'll end the show tonight. It is insane.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n1. Storyline\nscreengrab\nThe show is out there. You can like these girls, hate them or criticise them for their bold choices of men, work or outfits. Four More Shots Please has been directed, edited and written by women. Moreover, the protagonists are all women too. The result is rewarding and you see in how women are portrayed on-screen. The show is about four imperfect women who met at a bar and went on to develop the most perfect friendship.\n2. The show normalises words like 'vagina' and 'sex'\nscreengrab\n... because it's okay to normalise words that are a part of you. A lot of these words and concepts are taboos and we don't say some things out loud. But with this show, the writers and the cast have tried to make it a part of everyone's daily vocabulary. There is a scene in the film where these four girls are screaming 'vagina' out loud and it just makes you feel free and fearless. The show might just teach you to live life your way, easy breezy.\n3. Kriti Kulhari and Sayani Gupta\nscreengrab\nThese two have already proved their mettle in Bollywood. Sayani was seen in SRK's Zero while Kriti was seen in Uri and Pink. But you will see a different version of these two in Four More Shots Please. They are glamourous, flawed and loving it, and they enjoy shots of tequila every now and then. They break the stereotype that ambitious and family oriented women can't have too many girlfriends or a live a fancy life beyond their office or home.\n4. Bani J's debut\nscreengrab\nShe was first seen on Roadies and then rose to fame with Bigg Boss. People saw her up, close and personal in the reality show where she ended up winning many hearts, if not the trophy. But after that, she took a break from the entertainment industry. And now after many years, Bani J made her mark with this amazing web series. In the show, she is sassy, unapologetic and the kind of best friend/personal trainer everyone wants in their lives. Considering she has only done reality shows, her skillful acting will take you by surprise. Her smile has always been the USP and continues to be in the show.\n5. Prateik Babar, Milind Soman and Lisa Ray's comeback\nThis is by far the best part about the show. Hosanna actor Prateik Babbar stole everyone's heart with his adorable performance in 2012. And since then, he has come a long way. He did a few cameos in Baaghi 2 and Mulk but this series gives him more screen time. He plays the role of an easy going bar tender who falls in love with one of the girls. His cafe is an important part of the show and you'll know why once you watch it.\nNeedless to say, Milind Sonam is the icing on the cake. This series will make you long for him like never before. Their choice of men in the show is the highlight of the show. They are good looking, liberal, open to love, and more evolved than the regular Joe.\nLisa Ray is a breath of fresh air. After watching her in this new avatar, you'll wonder why you didn't see her earlier. From Kasoor to Four More Shots Please, the leggy lass is only getting better. We're rooting to see more of her post this.\n6. The music\nThis is the beautiful part about the web series. Unlike other TV shows which usually use Bollywood inspired songs or web series that don't use many songs, this one has a beautiful collection of songs which is a perfect fit for the countless different situations. The playlist is a beautiful blend of romance and fun, which will make you want to download the music. My personal favourite is, 'Water Under The Bridge.' The original music is currently available on Prime Music.\n7. Not every Hindi show needs to have a happy ending\nscreengrab\nDon't worry, we're not giving the story away but by now you also know it's not a typical four-girls-running-for-the-same-man-or-falling-in-love kind of show. There's no big send off in the sunset. The series shows its characters dealing with their own share of ups and downs but the masterstroke comes with the last episode: it is hands down most moving one. It's the kind of the show you should start on a Monday evening and finish by midnight.\nAnd, may be, watch one more time again...", "title": "7 Reasons Why Bani J & Kriti Kulhari's 'Four More Shots Please' Is The Perfect Web Series For Binge-Watching", "date_publish": "28/01/2019, 18:40:03", "description": "Ever since OTT platforms made way into our country, we have been flooded with some 'break the gender stereotype' shows. The 90s witnessed Sex And The City, which was about four fashionistas trying to figure out their imperfect lives. While people usually enjoy slapstick comedy featuring men, it was difficult to introduce the same with ladies.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/7-reasons-why-bani-j-kriti-kulhari-s-four-more-shots-please-is-the-perfect-web-series-for-binge-watching-361162.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/four_more_shots_1548665019_800x420.jpg"}