{"text": "The weekend is just around the corner and the list of things to do and things to skip is long! Come on! We all have personal commitments and plans which we wish get cancelled so that we stay at home and binge-watches a new-series.\nBinge-watching is the new trend and almost each one of us are mildly addicted to our TV and laptop screens.\nThanks to the growth and diversity of content that OTT platforms have started providing that we have the luxury of making a choice from several options.\nTo make sure that you have a 'chill' weekend, we made a list of a few relevant shows that you can binge-watch this weekend! Read on.\n1. Kota Factory\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThis Indian web series revolves around a relevant and important topic. The series revolves around the life of a teenager who joins a coaching institute that prepares students for the Indian Institute of Technology entrance examination. As the title suggests- 'Kota'- the The protagonist goes on to dealing with academic pressure. The show has been created by Saurabh Khanna, who was also the brainchild behind TVF's popular web-series Yeh Meri Family.\nWhere can you watch it?\nThe first episode has already been released on the TVFPlay app and YouTube on Tuesday.\n2. Laakhon Mein Ek\nThe second season of the series with the same name on Amazon Prime Video on April 12. Starring Shweta Tripathi as the lead protagonist, this season of the show focuses on the life of a zealous doctor Shreya Pathare (Shweta Tripathi) whose prime aim in life is to try to conduct a cataract camp in the fictional village of Sitlapur in Maharashtra. However, her life takes a different turn as she faces challenges that come in the form of institutionalised corruption and laid back attitude of the government. The show also stars Yashwant Wasnik, Chandrashekhar Dutta, Ketki Narayana, Pravina Deshpande, Arun Nalavade, Ramakant Dayama and Aryan.\nWhere can you watch it?\nThe entire series is now on Amazon Prime Video.\n3. Criminal Justice\nThis Indian series based on Criminal Justice by Peter Moffat and is available on Hotstar. Helmed by Tigmanshu Dhulia and Vishal Furia, the show stars Jackie Shroff, Pankaj Tripathi, Vikrant Massey, Anupriya Goenka and Mita Vashist in lead roles. This drama-series revolves around Vikrant's character Aditya who was charged with murder and as the name suggests, the show later goes on to showcase a dramatic journey on how he undergoes criminal justice system to prove his innocence.\nWhere can you watch it?\nHotstar\n4. Our Planet\nThis British nature documentary series made for Netflix is talk of the internet town and for reasons more than one.\nNarrated by David Attenborough and produced by Silverback Films, the series is headlined by Alastair Fothergill and Keith Scholey, who also created BBC documentary series Planet Earth, Frozen Planet and The Blue Planet, with collaboration with the conservation charity World Wildlife Fund (WWF).\nThe series is an important one as it addresses issues of conservation while featuring these disparate animals in their respective home regions. This is also the first nature documentary by Netflix.\nWhere to watch it?\nNetflix\n5. Hey Prabhu\nYou saw Rajat Barmecha in Udaan a lot of years ago and if the film left you wanting for more, Hey Prabhu . In the series, Barmecha plays the role of a social media influencer Tarun Pabhu. Describing his role in an interview, Barmecha had said,\n\"On the virtual world, he is a social media star with thousands of followers and he is an influence there. While on social media, the world believes that he is living a dream life, in reality, his seniors in office give him a hard time.\"\nWhere to watch it?\nMX Player\n6. Aafat\nFive eligible brides. One Groom. But it isn't as easy-breezy at it appears. The show is not just a comic drama that takes a dig at the society's perception of a perfect bride but it's a social commentary on the hypocrisy that women have to go through. Starring Chitrashi Rawat, Pushtiie Shakti, Nikita Dutta, Anshul Chauhan, Neelam Sivia, Sidharth Bhardwaj and Seema Pahwa in key roles, the web-series is directed by Shanhant Shah.\nWhere to watch it?\nMX Player\n7. Fuh Se Fantasy\nThe name says it all! The series showcases an interesting take on modern relationships and how millennials today are all up to experiment and explore their deepest desires and fantasies. The show stars Karan Wahi, Plabita Borthakur, Naveen Kasturia, Anshuman Malhotra, Gaurav Pandey, and Anupriya Goenka.\nWhere to watch?\nVoot", "title": "7 Relevant Web Shows That You Can Binge-Watch While Relaxing This Weekend", "date_publish": "27/04/2019, 12:30:04", "description": "The weekend is just around the corner and the list of things to do and things to skip is long! Come on! We all have personal commitments and plans which we wish get cancelled so that we stay at home and binge-watches a new-series. : 7 Relevant Web Shows That You Can Binge-Watch While Relaxing This Weekend", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/7-relevant-web-shows-that-you-can-binge-watch-while-relaxing-this-weekend-366064.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/web_shows_1556189712_800x420.jpg"}