{"text": "7 Times Prabhas, Rana Daggubatti & Rajamouli Left Us In Splits With Their Appearance On KWK\n7 Times Prabhas, Rana Daggubatti & Rajamouli Left Us In Splits With Their Appearance On KWK\nIt was a sheer delight to see this terrific trio again and this time on the Karan Johar’s show Koffee With Karan. KJo invited the south superstars Prabhas, Rana Daggubatti, and SS Rajamouli on his show to make some candid confessions and not make any sense about it as his show’s tagline says, 'Stop Making Sense'.\nTwitter\nPrabhas Rana and Rajamouli were totally in a chilled out mood and made some confessions which left the audiences laughing.\n#1 Karan Johar revealed how he had to beg both Prabhas and Rajamouli to be the show. In fact, when KJo spoke to Rana to get them on the show, he said, “It’s never going to happen, they are very shy”. To which Prabhas said, “He was avoiding the show because he feels it’s better to watch him on movies”.\n#2 Prabhas also cleared the air around his ongoing rumours of him dating Anushka Shetty. KJo obviously asked the Baahubali star if he is dating Anushka, to which he very honestly replied, “If anyone works for two years definitely they will link up with them.” Rana immediately vouched for them and confirmed they haven’t been dating. Definitely, the ladies will be super happy with this news\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n#3 Rana who confirmed Prabhas and Anushka aren’t dating, wants his buddy Prabhas to date Katrina Kaif! While he chose Deepika Padukone for himself, well, it’s too late, as our DP is already taken.\n#4 Rajamouli and Prabhas share a great camaraderie and it was evident on the show. The director even revealed how Prabhas is an extremely lazy person, in fact he even said that the actor is lazy to get married, isn’t it hilarious?, “ He is a very lazy person and he is too lazy to get married. It would be too much work for him to find a girl and talk to her parents. That’s why he isn’t getting married”.\n#5 The director even revealed despite being introvert and shy, Prabhas is the most mischievous one but you will never find out about it, soon Rana interrupted and said he gets caught while Prabhas doesn’t.\n#6 This revelation made by Rajamouli about Prabhas was damn hilarious which shows he isn't that shy. Watch the video right here.\nTwitter\n#7 Rana was also asked about his breakup with south actress Trisha, he very honestly spoke about his affair and separation with her, \" She’s been a friend of mine from a decade. We have been friends for very long and dated for a little time. But, I guess, things didn’t work out.\nWell if you missed the show you are clearly missing some great fun. Don’t forget to watch this hilarious episode of Koffee With Karan.", "title": "7 Times Prabhas, Rana Daggubatti & Rajamouli Left Us In Splits With Their Appearance On KWK", "date_publish": "24/12/2018, 11:35:35", "description": "It was a sheer delight to see this terrific trio again and this time on the Karan Johar’s show Koffee With Karan. KJo invited the south superstars Prabhas, Rana Daggubatti and SS Rajamouli on his show to make some candid confessions and not make any sense about it. As his show’s tagline says, Stop Making Sense. Prabhas Rana and Rajamouli were totally in a chilled out mood and made some confession", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/7-times-prabhas-rana-daggubatti-rajamouli-left-us-in-splits-with-their-appearance-on-kwk-359161.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/prabhas_1545632548_800x420.png"}