{"text": "Love is not what you read in your Mills & Boon or watch on the big screen, where Aditya meets Geet, only to fall in love and save each other.\nReal love is about commitment, investing in each other and making promises that are not just about words, but actions.\nEven though the definition of love varies from person to person, the real meaning of it remains pretty much the same-making a promise to stay with each other forever, no matter what life throws at you.\nOne love story that has definitely made many hearts happy is of Ranveer Singh and Deepika Padukone.\nThe year started with a blockbuster for the actors and looks like it is ending with another blockbuster of their real life-their wedding.\nInstagram/Ranveer Singh\nWhile the wedding lasted for three days in Italy as a very private family affair, all of us were connected with them as we collectively gushed over the pictures that had 'love' written all over them.\nThey are not just another power Bollywood couple that you usually talk about. They are two strong individuals who fell in love, dated for six years before solemnizing their affair with a wedding that was nothing short of an epic fairy-tale. But why is the country going gaga over their love? Why their photo-spam from the wedding doesn't feel like one?\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nInstagram\nWe decoded their relationship to find an answer why the #DeepVeer hoopla is much more than what you see on social media.\n1. For gracefully safeguarding and keeping their relationship private (As much as possible) for six years\nViral Bhayani\nEven though they made frequent appearances together and always sparked rumors, the way they gracefully handled their relationship is commendable. Everyone knew that they are a couple but they never confessed or denied their relationship status. Their silence and protective nature for each other was the answer to all the rumors and questions. While everyone knew that #DeepVeer was an actual thing, they were private about their meetings and holidays.\n2. For inspiring and accepting each other-despite being of contrasting nature (Opposites attract? Yes, for sure)\nTwitter\nHe is outspoken, selectively bizarre and expressive. She on the other is poised and graceful. They might not have matching traits but they still made their relationship work out and how. From accepting each other to loving each other in all highs and lows of their career, theirs is a relationship that very rarely exists and sustains in an industry where everything changes every day.\n3. They make each other feel like home. Because relationships are supposed to be like that, no?\nPinterest\nOurs is a generation that heavily depends on apps for ordering a pizza or selecting a date. Our partners change faster than our hair color, proving that we love the luxury of choices. To see a love like that, it makes our hearts so full and happy. In fact, Raveena Tandon took to Twitter to share how during a long flight with DP years ago, she told him how Ranveer makes her feel like 'home'. Today, here we are: celebrating their union and cheering for them.\n4. Even though they belong to the same industry, they are not competitive or egoistic. Rather, they celebrate each other's successes and inspire each other to conquer new heights\nBCCL\nI still remember the day when Deepika and Ranveer won awards for their respective films at Filmfare awards. Ranveer was seen greeting and meeting her family who had accompanied her. The way they showcased their emotions of being proud of each other proved just one thing: This was the kind of love that is meant to last forever.\nThis was followed by something more emotional that happened during IIFA. The couple greeted media and during a long chit-chat, what we saw was Ranveer constantly looking at Deepika like he's seeing her for the first time-emotional and proud. From setting her hair right to revealing how he is mesmerized with the way Deepika talks, they won us all over with their PDA (Not an intended one)\n5. The level of emotional security that they both extend to each other will teach you a thing or two about modern-day relationships and how they should unfold\nLove isn't just about romantic dates and international holidays. Even though with all the madness that tags along in their life with their stardom and star status, we have seen Ranveer being supportive of Deepika and vice-versa. During a recent interview, when Deepika was asked to comment on how her life will change after marriage, she said, \"I am excited but my life wouldn't change.\" In fact, both will resume work soon after completing their marriage rituals and social obligations. So if you meet Deepika, never ask her: So will you continue to work after marriage?\n6. They have redefined couple goals and how! From turning into her bodyguard to taking care of her Saree Pallu, Ranveer Singh is the sort of companion that every woman deserves\nViral Bhayani\nWe live in a world where men think it's not okay to be emotional or cry. Ranveer Singh is a man whose emotions heavily dictates his life and nothing ever has stopped professing him from showcasing his love and admiration for DP.\n6. Their wedding was a private affair but their whole team was invited to Italy to be a part of their big day. From Deepika's bodyguard Jalal (Who she even ties Rakhi on Raksha Bandhan) to their drivers, everyone was a part of their celebrations in Italy.\nApart from Deepika and Ranveer's entourage that consisted of their stylists and Makeup-Hair artists, everyone close to the couple and who made them what they're today were invited.\n7. 'Khaana Kha Ke Jaana'- Ranveer Singh constantly reminded the paps who flew down to Bengaluru to cover their reception to eat before they leave.\nIt was their day. They looked ethereal and royal. Apart from posing for paps and greeting-meeting them, Ranveer Singh was seen repeating the same line to paps-\"Thank you. Please khana kha ke jana' proving that even though he is one of India's most popular stars, he has his feet on the ground. Even Deepika was seen interacting with the paps and asking them where her chocolates are! She greeted and bowed down as she posed for the paps. They are two celebrities who indeed have their hearts in the right place.", "title": "7 Times Power Couple Ranveer Singh And Deepika Padukone Won Our Respect And Affection", "date_publish": "23/11/2018, 11:44:49", "description": "Even though the definition of love varies from person to person, the real meaning of it remains pretty much the same-making a promise to stay with each other forever, no matter what life throws at you. One love story that has definitely made many hearts happy is of Ranveer Singh and Deepika Padukone.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/7-times-power-couple-ranveer-singh-and-deepika-padukone-won-our-respect-and-affection-357150.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542883612_800x420.jpg"}