{"text": "8 'Brides Of Sabyasachi' & Their Magical Outfits That'll Give You All The Inspiration You Need!\n8 'Brides Of Sabyasachi' & Their Magical Outfits That'll Give You All The Inspiration You Need!\nSabyasachi is one of the few designers who Bollywood celebrities swear by. Having the most traditional handiwork with colours so bright, one can't help but fall in love with his outfits. Every Indian girl dreams to be dressed and styled by the designer on their special day.\nInstagram\nSabya started off as a NIFT student who had ideas raring to go in 1999. The minute he was given the opportunity, Sabya launched designs and styles, no one had seen in the market. When brides were being dressed up in nets and chiffons, Sabya introduced hand woven silk, hand dyeing, gota work back then. The designer is known for beautifully blending Indian textiles with a modern touch.\nBollywood A-listers might consider Manish Malhotra for their events and even walk the ramp for him, but when it comes to their D-day, the choice is clear.\nHere's taking a look at 8 Bollywood Sabyasachi brides who totally nailed their look.\n1. Deepika Padukone\nBollywood actress Deepika Padukone is the latest actress to tie the knot. DP married Ranveer Singh in a private ceremony in Italy. And just like any other bride, Deepika opted for Sabyasachi outfits for most of her wedding functions.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nFor her Sindhi wedding, she wore a stunning red lehenga while her husband Ranveer Singh chose a red raw silk sherwani. The reactions of their pictures proved Sabyasachi is the clear winner.\nThe airport looks for the couple were also designed and styled by Sabyasachi.\n2. Anushka Sharma\nPinterest\nThe other high profile wedding that happened overseas was Anushka Sharma's. The actress wore a pale pink lehenga and Virat Kohli wore an ivory raw silk sherwani designed by Sabyasachi on 11 December 2017. Needless to say, the pictures took the internet by storm.\n3. Amrita Puri\nfashion101\nThe Kai Po Che girl Amrita Puri tied the knot in 2017 and stunned everyone with her heavy embellished bridal Sabyasachi lehenga. Just like other Bollywood celebs, Amrita too tied the knot in Bangkok in a hush hush affair. Despite choosing a foreign location, Amrita stuck to her roots and chose the most gorgeous lehenga that left us awestruck.\n4. Bipasha Basu\nTwitter\nIt's a known fact that Sabyasachi is a Bengali's favourite Whether it's Rani Mukerji or Bipasha Basu, they consider Sabya over other fashion designers. While Rani did not release her photos to the world, Bipasha thankfully uploaded snaps with the love her of her life Karan Singh Grover.\nDonning a stunning red and white Sabya lehenga, Bipasha took the Bengali route and teamed it up with heavy embroidered blouse and equally heavy jewellery.\n5. Soha Ali Khan\nWedding bride\nOn her special day, Soha chose a stunning ivory and gold lehenga. Speaking to a leading daily back in 2017, Sabya revealed how Sharmila Tagore insisted on adding some colour to the ensemble. \"Kesariya orange, specifically,\" said Sabyasachi.\n\"Very few women have taste as exquisite as Sharmila Tagore. Both Soha and I benefitted from her mother's vision. Soha looked absolutely glorious on her wedding day. With the addition of kesariya, that lehenga became an instant rage. In years to come, a hundred brides would covet it. The Million Flowers lehenga was our first bridal lehenga in ivory. It is now a Sabyasachi classic,\" he said.\n6. Asin\nFashionlady\nSabyasachi has been winning hearts with A-listers. Asin who got married to the Micromax founder Rahul, opted for a classic Sabyasachi lehenga. She killed the look in her champagne-gold lehenga. She kept her jewellery minimal as she decided the lehenga to make way for her and it sure did.\n7. Sagarika Ghatke\nInstagram/ Sagarika FC\nThe actress married Indian cricketer Zaheer Khan in a simple ceremony. She opted for a court marriage followed by a lavish reception. In both the functions, Sagarika wore a beautiful saree and then a lehenga.\nNeedless to say, she looked every bit magical in her wedding snaps.\n8. Aamna Sharif\nAnyone who saw the Ekta Kapoor's debut on TV could not have missed Aamna Sharif. The actress was one of the most stunning ones on Indian Television who came to limelight with Kahin Toh Hoga.\nShe wore a typical traditional red lehenga and stunned her fans with her D-day look.", "title": "8 'Brides Of Sabyasachi' & Their Magical Outfits That'll Give You All The Inspiration You Need!", "date_publish": "25/11/2018, 12:45:46", "description": "Sabyasachi is one of the few designers who Bollywood celebrities swear by. Having the most traditional handwork with colours so bright, one can't help but fall in love with his outfits. Every Indian girl dreams to be dressed and styled by the designer on their special day. Sabya started off as a NIFT student who had ideas raring to go in 1999.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/8-brides-of-sabyasachi-their-magical-outfits-that-ll-give-you-all-the-inspiration-you-need-357161.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sabyasachi_1542872651_800x420.jpg"}