{"text": "8 Facts About King Of Comedy Kader Khan Which Prove There Is No One Like Him In Hindi Cinema!\n8 Facts About King Of Comedy Kader Khan Which Prove There Is No One Like Him In Hindi Cinema!\nThe curtains are down. The show is over. Every journey comes to an end and for veteran actor Kader Khan, the show of life has ended.\nThe king of comedy, Khan was suffering from supranuclear palsy, a degenerative disease. He was hospitalized on 28 December 2018 complaining of \"breathlessness\" in Canada, where he stayed with his son and daughter-in-law while seeking treatment. His son confirmed the news of his death.\nHis life had many ups and down but he never stopped entertaining his audience. With every role that he took up, he proved that he is on the top of his game.\n1. Kader Khan was performing in a college play when Dilip Kumar saw him and offered and signed him for next film.\nPinterest\n2. Before entering the world of cinema in the early 1970s, he used to teach at M. H. Saboo Siddik College of Engineering, Mumbai as a professor of Civil Engineering.\nPinterest\n3. Kader Khan has also written plays for theatres. He was later offered to write the script of Jawani Diwani. This was the beginning point of his career.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n4. Not many know that apart from acting in over 300 films in Hindi and Urdu, he has written dialogues for over 250 Indian films, from the 1970s up to the turn of the 21st century.\nPinterest\n5. Rajesh Khanna highly recommended Kader Khan after which, Manmohan Desai paid him a handsome amount of one lakh twenty-one thousand for writing dialogues for the film Roti.\nPinterest\n6. His first stint with comedy was with Himmatwala and Aaj Ka Daur. He later ventured and entered into hardcore comedy films including Sikka, Kishen Kanhaiya, Hum, Ghar Parivaar, Bol Radha Bol and continued through the nineties with comedy roles in Aankhen, Taqdeerwala, Main Khiladi Tu Anari, Dulhe Raja, Coolie No.1, Saajan Chale Sasural, Sooryavamsham, Judaai, Aunty No.1 and Bade Miyan Chote Miyan, Raja Babu, Khudaar, Chote Sarkar, Judaai, Aunty No. 1, Gharwali Baharwali, Hero Hindustani, Sirf Tum, Anari No.1.\nAgencies\n7. He was also open to experimentation and in the 2000s he did some of the most memorable roles of his performances including Akhiyon Se Goli Maare, Chalo Ishq Ladaaye, Suno Sasurjee, Yeh Hai Jalwa and Mujhse Shaadi Karogi.\nAgencies\n8. His latest films include Tevar (2015), Lucky: No Time for Love (2006) and Family: Ties of Blood (2006).", "title": "8 Facts About King Of Comedy Kader Khan Which Prove There Is No One Like Him In Hindi Cinema!", "date_publish": "01/01/2019, 11:41:38", "description": "The king of comedy, Khan was suffering from supranuclear palsy, a degenerative disease. He was hospitalized on 28 December 2018 complaining of \"breathlessness\" in Canada, where he stayed with his son and daughter-in-law while seeking treatment. His son confirmed the news of his death.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/8-facts-about-king-of-comedy-kader-khan-which-prove-there-is-no-one-like-him-in-hindi-cinema-359613.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khan_1546324962_800x420.jpg"}