{"text": "Cast: Sanya Malhotra, Ayushmann Khurrana, Surekha Sikri, Neena Gupta, Gajraj Rao, and Sheeba Chaddha\nBadhaai Ho is a film that revolves around the life of a middle-aged man Jeetender Kaushik (Gajraj Rao), who works as a TTE in Indian railways. He is married to Priyamvada (Neena Gupta). However, the entire family lands in an awkward situation when Priyamvada gets to know about her untimely pregnancy.\nJunglee Pictures\nThe entire family juggles between awkwardness, acceptance and moving on in their lives. Will they decide to have a kid?\nThe Film is produced by Vineet Jain, Hemant Bhandari and Aleya Sen under the banner of Junglee Pictures and Chrome Pictures and is written by Shantanu Srivastava.\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nThe big question is if you should spend your Dussehra weekend watching the film, we have eight reasons why the film can make for a compelling watch.\n1. A fresh concept and a progressive storyline\nHow often do you see a film where a family is put into a spot as they have to deal with something like an unforeseen pregnancy? Well, for the first time ever, you will see a family drama that raises some of the most absurd yet relevant questions.\n2. Ayushmann Khurrana- The king of content-driven cinema\nJunglee Pictures\nFrom doing a film that dealt with the topic of sperm donation in India to erectile dysfunction, Ayushmann picks up the most socially relevant topics and manages to ace every role he picks up. 2018 has proved to be a great year for him as after Andhadhun, people are loving him in Badhaai Ho. With a smart choice of films and an enviable success rate, Ayushmann has become one of the most bankable actors in Bollywood currently.\n3. Brilliant supporting cast: From Sanya Malhotra, Neena Gupta to Gajraj Rao, you don't have to think twice before betting your money on it.\nFor a film to work at the box-office, its cast plays a very important role. With Badhaai Ho, you will get to see some of the most talented actors. Ayushmann, Sanya Malhotra are accompanied with Gajraj Rao, Surekha Sikri and Neena Gupta and the trailer itself was proof that with this film, you will sign up for an entertaining ride.\n4. Fresh Pair: Ayushmann Khurrana and Sanya Malhotra make for an unconventional on-screen pair.\nJunglee Pictures\nFor the first time ever, the film will bring together Sanya Malhotra and Ayushmann Khurrana. The trailer was a proof that this unconventional and talented pair will promise you one honest story. As a confused millennial couple, Sanya-Ayushmann bring freshness to this story.\n5. Looks like an emotional-comedy drama: The kind of family tale that'll leave us wanting for more\nWhile the first half promises to keep you hooked with the jokes, the second half of the film takes the emotional route. From making you laugh to making you sob, this is a roller-coaster you all deserve to take with your family!\n6. Movies like these prove how films with good content and good actors win over films with fancy A-listers\nJunglee Pictures\nA film like Badhaai Ho that promises to entertain you. You might not find an A-lister in the film, but this film truly proves that at the end of the day, content is the real king. If you are still confused whether to watch the film or not, watch the trailer.\n7. The Internet has already given a thumbs up to the film. People are showering praises!\nJust watched #BadhaaiHo and have to say @ayushmannk sir again a very brilliant job..as always also I think now every Indian will understand the sweet message from the movie of #savethegirlchild loved it❤️❤️ — Sourav Narayan (@carcrazysourav) October 18, 2018\n@ayushmannk wtf bro are you trying to tell me that #BadhaiHo is better than #Andhadhun\nNai matlab maar hi daloge kya audience ko ab!\nKaise kar lete Ho Bhai. — Anurag (@anuragpathak33) October 17, 2018\n@ayushmannk What A Movie Man.. Tremendous Work...Back To Back Bang On Movies #Andhadhun and Now #BadhaiHo I feel so good that i decided to go for first day first show for both movies 😍A must watch — Aayush Totla (@totlaayush) October 18, 2018\nWhen a film engages you with its utter simplicity minus any drama, you know the director has a great approach and sensitive understanding of the medium and the characters. @iAmitRSharma is the real discovery here.@ayushmannk,#NeenaGupta and #SurekhaSikri charm in #BadhaiHo. — gayatri gauri (@gayatri_gauri) October 18, 2018\n8. The film will definitely start a more mature approach towards couples who conceive at a much later stage in their lives.\nJunglee Pictures\nA lot of times, it's cinema that manages to bring about a positive change for reasons more than one. Films can manage to strike a sensible conversation around a topic and that might not fizzle out easily. With Badhaai Ho, a conversation around couples who conceive kids at a very late stage in their lives can come to the forefront.", "title": "8 Reasons Why 'Badhaai Ho' Isn't Just For Entertainment But Also A Great Topic Of Discussions!", "date_publish": "18/10/2018, 17:25:43", "description": "The Film is produced by Vineet Jain, Hemant Bhandari and Aleya Sen under the banner of Junglee Pictures and Chrome Pictures and is written by Shantanu Srivastava. Well, you will have to watch the film for that. But if the question is if you should spend your Dussehra weekend watching the film, we have eight reasons why the film can make for a compelling watch.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/8-reasons-why-badhaai-ho-isn-t-just-for-entertainment-but-also-a-great-topic-of-discussions-355018.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/badhaai_ho_1539851743_800x420.png"}