{"text": "One of the most anticipated releases of this year is Brahmastra. There is more than one reason for all the excitement that has been surrounding the film. Apart from lovebirds Ranbir Kapoor and Alia Bhatt's first film together, the film marks Dharma's entry into the world of sci-fi romance drama.\nThe film also happens to be Ayan Mukerji's most special projects and this is one of the reasons why he spent three years on conceptualizing the story.\nOn Shivratri, the team dropped the logo of the film and Dharma being Dharma used over 150 drones in Kumbh- which is a tactic that has never been used by any of the filmmakers before.\nWith smart marketing and their hearts in the right place, they also revealed the name of their characters-While Alia plays Isha, Ranbir will play the role of Shiva in the movie.\nInstagram\nWith all the buzz and the hype, we analysed whether the film deserves all of it and we have an observation. There is a reason why some of the smartest minds in the industry have come together for this project.\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES\nFrom Ayan Mukerji to Ranbir Kapoor, the smartest people in the business have collaborated for this movie that promises a 'never-before' experience on the 70 mm. We made a list of all that we know about the film and they could easily evoke the feeling of curiosity! Read on!\n1. This is Ranbir Kapoor and Dharma Productions' most ambitious project till date\nTalking about the project, Ranbir Kapoor once said, \"Apart from being my best friend and my favourite director, Ayan has worked on this film for six years. He is going to spend the next 10 years of his life on this trilogy. So when the first part is complete, the audience will know it's not the end. That is something really exciting for me as an actor.\"\n2. Ranbir Kapoor confirmed that the film is a romantic-fairytale in a supernatural format.\nRanbir said the film is not something which \"doesn’t have truth to it, or which is unbelievable\"\n3. Initially, the film's title was rumoured to be Dragon but was later changed to Brahmastra\nDirector Ayan Mukerji explained that the title 'Brahmastra' \"resonates with the “ancient wisdom, energies and power.\" Film's director Ayan Mukerji added that Brahmastra is a contemporary film with ancient elements.\n4. Shiva's (Ranbir Kapoor) 'Superpower'\nA lot of reports claimed that it will be fantasy film and the story will loosely revolve around a man who has a supernatural ability and can create fire from his palms.\n5. Love is the guiding light of Ranbir-Alia's film\nAyan Mukerji's latest Instagram post hints at the fact that the plot is majorly driven with love. Sharing a throwback picture from London 2016, he wrote, “Ranbir and Alia needed to work as one unit and that relationship was more important than their individual characters because at its heart, our movie is a love story. There has been a lot of love since then.\"\n6. Dharma's magnum opus\nIf reports are to be believed, this fantasy drama has a budget of a whopping 150 crores!\n7. From Rumi to Shiva's-a lot of planning went behind Ranbir Kapoor's character in the film\nIn one of the Instagram posts, Ayan Mukerji had an interesting detail to share about conception of Ranbir's character Shiva. He wrote, \"Rumi. First, he was Rumi. Rumi with long hair. This image is from an early look test for the movie. Rumi said, Love is the bridge between you and everything...’, and that feeling is the foundation we started building the protagonist of this movie on... But then, there was new inspiration, newer thoughts... Dragon became Brahmastra, we gave Ranbir a haircut, and Rumi became... Shiva.\"\n8. Ayan Mukerji once revealed that Ranbir Kapoor was the first person with whom he shared the idea of the film!\nTaking to Instagram, he shared a picture of Ranbir from the sets of the film and wrote: “Director & Actor. Ranbir - The absolute first person to have heard about Brahmastra and the first to have jumped on for the ride! On a writing trip for Yeh Jawaani in May 2011, is where the idea was born... and Ranbir was my very first phone call. There is so much to share about B.astra, but it is fitting that the first team member this Insta journey touches upon is... Ranbir aka Shiva aka Rumi aka Artist aka Soldier! More over the next few... #brahmastra #shivadiaries.”", "title": "8 Reasons That Justify All The Excitement And Hype Around Ranbir-Alia's Brahmastra!", "date_publish": "17/03/2019, 12:11:11", "description": "From Ayan Mukerji to Ranbir Kapoor, the smartest people in the business have collaborated for this movie that promises a 'never-before' experience on the 70 mm. We made a list of all that we know about the film and they could easily evoke the feeling of curiosity! Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/8-reasons-that-justify-all-the-excitement-and-hype-around-ranbir-alia-s-brahmastra-363695.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ralia_1552545769_800x420.jpg"}