{"text": "Zoya Akhtar's film Luck By Chance had an important message that definitely holds true for everyone who dreams of making it big in Bollywood.\nKaamyabi aur nakaamyabi ... insaan khud hi chunta hai (Success or failure- it's only us who make a choice between the two).\nWell, for people who enter the industry with zero contacts, their struggling days is a battleground where you either end up finding your starting point or you exhaust your will to even try. Some hit gold with their first film but for some, that third film after two flops is what changes their life forever.\nInstagram\nWe have these eight incredible women who have seen it all- the highs and lows of stardom and the film industry but they have one thing in common- to have faith and keep trying.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nWhile some faded into oblivion for a large patch of time, some stuck around and kept on taking every small and big opportunity that came their way.\nThese eight women are popular and phenomenal actors but somehow, film industry has failed them.\nThey have still not received their due and more so because they are not offered good roles. Whether the 'n' word is responsible or not is a separate story but these are the women who deserve a better screen time and yes, way better roles! Read on.\n1. Shefali Shah\nShah made her debut with a minor role in 1995 drama Rangeela but she left a great impact. She received critical praise and won the Filmfare Critics Award for Best Actress and a Best Supporting Actress nomination at the 44th Filmfare Awards.\nHer role as Akshay Kumar's mother in Waqt: The Race Against Time (2005) also fetched her a nomination for Filmfare Award for Best Supporting Actress. In 2007, she again received critical acclaim and won the National Film Award for Best Supporting Actress for her performance in The Last Lear. However, in 2015, her role in Zoya Akhtar's Dil Dhadakne Do made her critics' favorite and earned her nominations for Best Supporting Actress. The whole cast won the Screen Award for Best Ensemble Cast for the film. Her Netflix film 'Once Again' with Neeraj Kabi again fetched her appreciation for her strong and powerful role.\nShe can demonstrate multiple emotions with utmost ease and this is just one of the many reasons why we deserve to see more of her on the silver screen.\n2. Neena Gupta\nJust to jog your memory a little, in 2017, she wrote a heart-warming and graceful post asking for work. Neena wrote, \"I live in Mumbai and working. am a good actor looking for good parts to play.\"\nNeena has been active in the industry for more than three decades and has some of the most incredibly memorable roles to her credit. However, stating that filmmakers and producers stopped casting her after she got married. Neena Gupta revived her career and we saw a 2.0 version of her in recent films like Veere Di Wedding, Badhai Ho and Mulk.\nShe is one of the most credible performers and deserves a lot more than she is being offered currently.\n3. Rasika Duggal\nTwitter\nFor some, recognition and stardom comes after a long bumpy ride and Rasika Duggal is one of them. After brief yet powerful roles in TV and films, she totally left the audience spellbound with her performance in films like Kshay , Qissa and Manto. Her role in Mirzapur also impressed the critics and the fans. Duggal's acting skills and heart are both in place and she definitely deserves a lot better.\nOnce during an interview, she shared a beautiful coincidence about signing up Manto. She said,\n\"I had read about it. I had already read a lot of Manto’s writings anyway. And, funnily enough at that time, I was taking Urdu classes, just like that. So, this was like poetic justice in a way. It is amazing how in this industry, sometimes you keep trying for certain things and they never work out and then some miracles just sort of fall into your lap.\" Well, she surely deserves bigger miracles and we hope filmmakers recognize her talent and give her bigger and better roles.\n4. Meher Vij\nTwitter\nMeher Vij needs no introduction. You have seen her in films and TV serials but in 2015, a major turning point came in her life after she played the role of Munni's mother in Bajrangi Bhaijaan. She hit another jackpot (purely with her hard work) as she featured in a musical drama Secret Superstar (2017), for which she even won the Filmfare Award for Best Supporting Actress. Be it comedy or drama, Vij knows how to get into skin of the characters. Somehow, with the amount of determination and talent she has, her best is surely yet to come.\n5. Tanvi Azmi\nShe began her career and played the role of a troubled doctor in the tele-series, Jeevanrekha and as a young widow in telefilm Rao Saheb (1986) directed by Vijaya Mehta. She was also seen in Malayalam film Vidheyan (1993), directed by Adoor Gopalakrishnan. Her supporting role in Akele Hum Akele Tum (1995 fetcher her a nomination for Filmfare Award for Best Supporting Actress.\nIn 2014, she played the role of Radhabai, mother of Bajirao in Bajirao Mastani and was highly appreciated for it. Considering the amount of diversity she has shown over the years, Azmi is someone we would definitely love see her more in films.\n6. Kirti Kulhari\npinterest\nShe played a very small role in Khichdi the movie but in Shaitaan, her portrayal of Tanya is what made her a promising find. She went on to do back to back strong roles in films like Indu Sarkar and Blackmail but Pink became a turning point. Currently, she is basking in the success of her web-series Four More Shots Please and her special appearance in Aditya Dhar's Uri. With the kind of calibre that Kirti has, it's only fair if Bollywood identifies it and offers her better parts.\n7. Shernaaz Patel\nSanjay Leela Bhansali's Black is Hindi Cinema's gem and truly underrated. In the film, Shernaz Patel's strong portrayal of a mother won a lot of hearts. With a strong background of theatre, Shernaaz has acted in both Hindi and English films. Her role in Guzaarish (2010) was received well too.\nShe made her theatre debut with The Diary Of Anne Frank in 1984. Since then, she has acted in several noted productions in Mumbai-based English theatre, and formed RAGE theatre group in Mumbai, with Rahul da Cunha and Rajit Kapur in 1993. Not many know that she is also the voice to the character of Yashoda in the TV series Little Krishna. She was last seen in films like Azhar and Roy but she still remains underutilized in Bollywood. With the smile and screen presence that she has, she surely deserves a powerful role. Agree?\n8. Tisca Chopra\nShe started her acting career with TV and while she was juggling between TV and theater, Tisca Chopra rose to fame with her portrayal of Ishaan's mother in Taare Zameen Par. Her filmography boasts of some credible films and has worked with noted filmmakers including Aamir Khan, Prakash Jha, Madhur Bhandarkar, Abhinay Deo, Nagesh Kukunoor and Anup Singh.\nShe has acted in over 45 feature films in different languages and left a mark with each and every role. She also endorses a lot of brands but when it comes to films, Hindi Cinema still hasn't been able to exploit her capacities well.\nHave we missed any name in the list above? Tell us in the comments below and we will come back with a part two of the same list.", "title": "8 Talented Women In Bollywood Who Deserve Better Screen Time & Good Stories, To Say The Least", "date_publish": "08/02/2019, 17:30:13", "description": "We have these eight incredible women and actors who have seen it all-the highs and lows of stardom and the film industry but they have one thing in common-to have faith and keep trying. While some faded into oblivion for a large patch of time, some stuck around and kept on taking every small and big opportunity that came their way.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/8-talented-women-in-bollywood-who-deserve-better-screen-time-good-stories-to-say-the-least-361734.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/underrated_actors_1549522220_800x420.jpg"}