{"text": "Bollywood is a platform everyone wants to be associated with. The industry comes with a lot of perks like fame, money and fans. No matter what industry you come from, if it's not Bollywood or fashion related, then no one knows you as much.\nOur fashion police Viral Bhayani and Manav Manglani are always out to grab the best celebrity shots which are sold for a lot of bucks. People are celebrity hungry and Instagram is mostly working because of the verified star presence.\nBut there are many others who have worked very hard to get here in Bollywood or the OTT platforms and are now are featuring in prominent roles. As per an episode of Koffee With Karan, Rhea Kapoor said she didn't want to feature in films as she and her father thought she would end up as just a 'heroine ki dost' or 'behan' but these upcoming actors think beyond it.\nHere's taking a look at 9 actors in supporting roles who are ready to conquer 2019 with their power excelling performance.\n1. Ankita Lokhande\nAnkita Lokhande FC\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThe actress is all set to make a debut in Kangana Ranaut's Manikarnika. The movie released this weekend and the actress who rose to fame with Pavitra Rishta on TV has a vital role to play in her upcoming film.\nAnkita plays the role of Jhalkari Bai and her battles and struggles. Although the film is primarily based on Rani Laxmi bai, this role will make the audience aware about another strong woman warrior who was the unsung hero from the Dalit community. Infact, she is still worshiped in some areas of Bundelkhand.\n2. Kriti Kulhari\nscreengrab\nShe rose to fame with Pink but her supporting act in Uri proved she's here to stay. From learning how to shoot a pistol to driving a chopper, Kirti put her 100% to the crucial role. Yes, she plays the role of an army pilot who gets the surgical strike group back to India safe and successful after completion of task.\n3. Mohit Raina\nTwitter\nOMG! If we were looking for good looks, good looks and good looks then Mohit Raina came to our rescue in Uri. He plays the role of Vicky Kaushal's brother in law who dies in the midst of an attack. He is a popular face on television and is known as Mouni Roy's boyfriend but looking after his power performance, we can say he's meant to stay in Bollywood. Lets just say, he's the only actor so far in Bollywood who made our eyes shift from Vicky to him. Now that's something, right!\n4. Kubbra Sait\nShe is the latest breakout star from Netflix (Sacred Games) and we couldn't be more thankful for her debut last year. To further excite us, she's all set pave her into Bollywood with Gully Boy. Calling it a tiny role in the Ranveer Singh-Alia Bhatt starrer, Kubbra plays the role of an TV anchor in the film. So yes, watch out for her.\n5. Ranvir Shorey\nHe's been in the industry for way too long and has played some pivotal roles in the past but this year is most definitely special for him and his fans. He's not only conquering web films but Bollywood as well.\nHis shot film Shame alongside Swara Bhaskar recently released and has been creating waves on social media. Soon after that, Ranvir Shorey will be seen in Sonchariya. He's usually seen tickling our funny bones like in Singh Is King or a Khosla Ka Ghosla but these two films are on a serious side. It's interesting when long term actors broaden their horizon.\n6. Rohit Saraf\nYou saw him first as the adorable baby brother to Alia Bhatt in Dear Zindagi and Hitchki. It was tiny but a heartwarming role and everyone raved about his acting and chocolate boy looks. And now, the young lad is back with the Sky Is Pink. This time he will reportedly play the role of Priyanka Chopra's brother who is a music composer.\n7. Sunil Grover\nEveryone knows him. He's by far the best comedian in the country. The entire country was devastated when Kapil Sharma and Sunil Grover split up and we couldn't see more of him.\nAfter seeing him as a funny performer, we are all set to see him changes genres. Sunil Grover will be seen in a more serious avatar in the Salman Khan starrer Bharat. Although, he has been seen in Ghajini, Gabbar, Baaghi, but this one looks more promising. Hoping there's more screen time for him too.\n8. Siddhant Chaturvedi\nscreengrab\nFirstly, if you have not seen Inside Edge then do that already. One of the best shows on cricket. And if you are among those, who have then you know who Siddhant Chaturvedi is. Yes from an on-screen cricketer in Inside Edge to now rapper in Gully Boy.\nSiddhant Chaturvedi is playing the other rapper apart from Ranveer Singh. If you see the trailer, you can sense he must be the guiding force at introducing Ranveer's character into street rap.\n9. Bani J\nFour imperfect girls in Mumbai with the most special friendship. Promising the web show is different from Veerey De Wedding and The Trip, the series revolves around the lives of four women, each fighting their own individual battles and tackling life as it comes. While Sayani Gupta and Kriti Kulhari are familiar faces, gym freak Bani J is a breath of fresh air. Last seen on Bigg Boss, Bani is usually seen inspiring people to hit the gym and work that body out. But in this one, she puts a glamorous front. It will be interesting to see her act. The show is now available on Amazon\nWho are you for waiting for?", "title": "9 Actors Who Are Hogging The Limelight This Year With Their Supporting Roles", "date_publish": "27/01/2019, 13:41:33", "description": "Bollywood is a platform everyone wants to be associated with. The industry comes with a lot of perks like fame, money and fans. No matter what industry you come from, if it's not Bollywood or fashion related, then no one knows you as much. Our fashion police Viral Bhayani and Manav Manglani are always out to grab the best celebrity shots which are sold for a lot of bucks.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/9-actors-who-are-hogging-the-limelight-this-year-with-their-supporting-roles-360912.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_1548584884_800x420.jpg"}