{"text": "10 Bollywood Celebrities And Their Doppelgangers That Will Make You Wonder If You'll Ever Meet Yours\n10 Bollywood Celebrities And Their Doppelgangers That Will Make You Wonder If You'll Ever Meet Yours\nWe all know or have rather heard during our growing up years how each person in this world has about 6 lookalikes. Some don't believe it, basically people like us who haven't found our doppelgangers but for celebrities it's a lot easier.\nStars are famous and their pictures are up on the internet at all times, for reasons more than one. Their fan clubs are on a perpetual hunt for their best looking photos and in their search, they also end up finding their twins, of course similar looking people.\nHere are 9 Bollywood celebrities and their doppelgangers which may shake the world out of you. Trust me, when you will look at these collages below, you would be going out there finding your twin somewhere.\nCheck it out.\n1. Jacqueline Fernandez\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nMeet long lost sisters Jacqueline Fernandez and Amanda Cerny. The two first connected in September in Los Angeles and were shocked to see how similar they looked. While Jacqueline is a huge star, Amanda too is an American actor and famous social media sensation. And now Amanda is in Mumbai to meet her twin Jacqueline. Jacqueline had earlier captioned her post on Instagram, “We are convinced we have been separated at birth!!! You’ve got to agree the resemblance is quite uncanny!”\n1. Anushka Sharma\nThis is the latest one. Anushka Sharma's doppelganger is no ordinary. She is an American artist by the name of Julia Michaels and she is just as surprised to find her lookalike in a Bollywood actress. She couldn't contain her excitement and tweeted about it and Anushka too found this an OMG moment.\nOMG YES!! 😲 I've been looking for you and the remaining 5 of our dopplegangers all my life 😂 https://t.co/SaYbclXyXt — Anushka Sharma (@AnushkaSharma) February 5, 2019\n2. Alia Bhatt\nAfter Anushka's doppelganger, the Internet found a lookalike of Alia Bhatt. She does not just look like her but also mimicked Alia's dialogue from Gully Boy wearing a similar outfit and might we add, NAILED IT.\nTwitter, since then, has not been calm.\n3. Ranveer Singh\nRanveer Singh, is by far, the craziest Bollywood actor in a very long time. From his antics during the promotions of Gully Boy to showering his love for his new bride, Deepika Padukone, this one is too wild to be tamed.\nAnd in case you were thinking he's one of a kind, then nope. People who have been crushing on Ranveer and were heartbroken when he tied the knot still have some hope. Yes, this Pakistani boy is a splitting image of Ranveer Singh.\n4. Priyanka Chopra\nSpot the difference! Priyanka Chopra found her doppelganger so real that she couldn't help but share the image with her mom. \"Showed this to mom and almost fooled her hahaha! Navpreet Banga, this is uncanny but Mom knows best. Doppelganger,\" she wrote. Well, moms truly know the best. Despite being eerily similar, she figured that it's not her but can you?\n5. Tiger Shroff\nMany doppelgangers have a similar face but Tiger Shroff's lookalike has the same body too. David Saharia, a model from Assam, is breaking the Internet for his uncanny resemblance with the A-lister.\n6. Disha Patani\nWell, Disha's doppelganger is not a common face.It is none other than Penelope Cruz. The Bollywood sensation who has been seen in Kung Fu Yoga, Ms Dhoni and Baaghi 2 was shocked to see the photos. She considers Penelope as he role model and was more than delighted when her fans drew this similarity. But this is crazy how two famous people look like each other.\n7. Emraan Hashmi\nThe actor has found his doppelganger in a Peshawar boy. Mazdak Khan found this little fame 2 years and has been revelling under this news since then. It would be interesting to him in Bollywood in a double role with our very own Cheat India actor.\n8. Esha Gupta\nebuddyblog\nShe made her Bollywood debut with Jannat but she got famous for more than that. The minute she made her mark, people started comparing her to Angelina Jolie, so much so that she was even referred to as the Indian Angelna Jolie. And rightly so, the Bollywood actress has an interesting similarity to the Hollywood actress especially her mouth and jaw line. Sister from another mister?\n9. Salman Khan\nThis video went viral 10 days ago and it has left the internet in a tizz. This lookalike was spotted in Pakistan re-arranging motorbikes. While we have seen many body doubles and his doppelgangers, this one by far is the closest looking to him.\nWhich celebrity look-alike made your jaws drop? Tell us in the comment section below.", "title": "10 Bollywood Celebrities And Their Doppelgangers That Will Make You Wonder If You'll Ever Meet Yours", "date_publish": "27/03/2019, 13:44:39", "description": "we all know or have rather heard during our growing up years how each person in this world has about 6 lookalikes. Some don't believe it, basically people like us who haven't found our doppelgangers but for celebrities it's a lot easier.we all know or have rather heard during our growing up years how each person in this world has about 6 lookalikes. Some don't believe it, basically people like us", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/9-bollywood-celebrities-and-their-doppelgangers-that-will-make-you-wonder-if-you-ll-ever-meet-yours-361673.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1553667870_800x420.jpg"}