{"text": "When we talk about power celebrity couples, it's not only about the amount of popularity they have gained. A lot of other things count including their contribution to their respective fields.\nWhile couples like Deepika-Ranveer, Virat-Anushka make headlines every now and then, there are a few couples who are powerful for reasons more than one.\nLove is all about inspiring each other and being together, these couples from the entertainment industry are giving #SolidRelationship goals and not just for the heck of it. While some have an inspiring struggle story, a few others prove that love indeed conquers all. To give you all a glimpse of what lies beyond stardom for these couples, here is a list of actors and celebrities who found love in each other.\n1. Neil Bhoopalam (Actor) and Nandini Shrikent (Casting Director )\nNeil Bhoopalam (Actor) and Nandini Shrikent are a power couple and for reasons more than one. While Neil has acted in films like Nh-10, Shaitan and No One Killed Jessica, Nandini was an Assistant Director who worked on films including Govind Nihalani’s Thakshak, Karan Johar’s Kabhi Khushi Kabhie Gham... (2001) before she ventured into casting. She has casted for several films including Talaash, Luck By Chance, Dear Zindagi, Yeh Jawaani Hai Deewani, Zindagi Na Milegi Dobara, Ek Main Aur Ekk Tu and Gully Boy among several others.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n2. Paresh Rawal and Swaroop Sampat (Bollywood actors)\nInstagram\nThe couple were last seen together in Uri. While Paresh Rawal played the role of Ajit Doval, Sampat played the role of Vicky Kaushal's mother in the film.\n3. Ayesha Raza and Kumud Mishra (Bollywood actors)\nWhile Ayesha Raza has worked in films like Befikre, Sonu Ke Titu ki Sweety, Veere Di wedding and a few others, Kumud Mishra is fondly remembered for his role as Khatana Bhai in Imtiaz Ali's Rockstar. Kumud Mishra has played pivotal parts in films including Airlift, Sultan, Jolly LLB 2, Tiger Zinda Hai and others)\n4. Sumeet Vyas And Ekta Kaul\nIt's safe to say that Sumeet Vyas changed the fate of web-series in India. Sumeet rose to fame with his character as Mikesh/Miku Bhaiya in Permanent Roommates and there has been no looking back. Apart from writing Tripling 2, Sumeet was also seen as Kareena Kapoor's on-screen husband in Veere Di Wedding. Ekta Kaul on the other hand was Television's sweetheart who became popular after her role as Sahiba in Zee TV's show Rab Se Sohna Isshq.\n5. Manav and Meher Vij (Bollywood actors)\nPinterest\nBoth Manav and Meher are actors and really good at it. While Manav has played some pivotal roles in films like Udta Punjab, Rangoon and Andhadhun and Meher on the other hand earned praises for her character in Bajrangi Bhaijaan as Munni's mother. Her role in Secret Superstar earned her a lot of appreciation and bagged her IIFA for the best actress in a supporting role. It won't be wrong to call them a power couple.\n6. Mahesh Babu and Namrata Shirodkar\nMahesh Babu is an Indian actor, producer, media personality, and philanthropist and is a popular figure in Telugu cinema. On the other hand, Namrata won the Miss India Universe crown and made her Bollywood debut opposite Salman Khan and Twinkle Khanna in 1998. Her third movie was a Telugu film Vamsi and it was during the shoot of this film that they met and fell in love. Their relationship saw a lot of ups and downs but they stuck together and made things work.\n7. Manoj Bajpayee and Shabana Raza (Neha)\nYesteryear actress Neha was seen in some popular films including Kareeb, Rahul and Fiza. She married actor Manoj Bajpayee in 2006. Neha and Manoj Bajpayee first met at the premiere of Satya. The couple connected and became friends and love blossomed in no time. Talking about her marriage, Shabana had once said, “Manoj and I have known each other for 10 years. I met him right after Kareeb was released. And since then we've been together. We're individuals and yet a compatible couple.”\n8. Shweta Tripathi and Chaitanya Sharma (Slow Cheetah)\nMasaan actor Shweta Tripathi needs no introduction. Be it her role in Haraamkhor or her stint in popular web-series The Trip, Shweta has made a significant mark in the entertainment industry. On the other hand, Chaitanya is a rapper and actor (Also known as Slow Cheetah). He has worked with Ranveer Singh (Indian Actor) in a Rap song “Don’t Hold Back” in the year 2017. He has also done songs like “To The Top” and “Make it happen“. He has also starred along with Sumeet Vyas in a song “Kripya Dhyaan De” released on 3rd of April, 2018.\n9. Rubina Dilaik and Abhinav Shukla\nBoth Rubina and Abhinav are television actors and have done some pivotal and popular roles. While Rubina is known for her iconic role in Choti Bahu, Abhinav rose to fame after his stint in Star One's popular show Geet. The couple tied the knot in 2018 in a private ceremony.", "title": "9 Celebrity Couples From The TV And Film Industry You Didn't Know Are Together", "date_publish": "03/02/2019, 11:33:15", "description": "While couples like Deepika-Ranveer, Virat-Anushka make headlines every now and then, there are a few couples who are powerful for reasons more than one. Love is all about inspiring each other and being together, these couples from the entertainment industry are giving #SolidRelationship goals and not just for the heck of it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/9-celebrity-couples-from-the-tv-and-film-industry-you-didn-t-know-are-together-361349.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_couples_1548928960_800x420.jpg"}