{"text": "9 Celebrities Who Silently Worked For A Cause, Not For Limelight But Betterment Of The Society\n9 Celebrities Who Silently Worked For A Cause, Not For Limelight But Betterment Of The Society\nNot all superheroes wear capes!\nKalki Koechlin had once said that if you can’t donate money for the ones in need, the best you can do is spread the word to let the potential donators know how they can help and make a difference, and rightly so.\nCelebrities, especially the ones belonging to the world of showbiz, often find themselves under media scrutiny for not using their star status for the betterment of society.\nIf you have money in your pocket and a name which has a massive fan following, you are automatically considered wise. People believe in you. And if not that, they at least patiently listen to what you say. So, who better than rich, powerful and famous can evoke change in society?\nThe best example of the same is Amitabh Bachchan’s campaign for Polio. Not many people know that Big B didn’t charge a single penny for the campaign that successfully helped eradicate the disease from the nation.\nRead More: Bill Gates Applauds Amitabh Bachchan For Polio Eradication In India, Calls Him A Real-Life Superhero\nBe it the Kathua rape case or the #MeToo movement that took the nation by storm this year, a lot of Bollywood celebrities expressed their opinions and condemned the wrong acts on social media. And then, there were also those who not only tweeted to make a difference but went a step ahead to participate in the activities contributing to change.\nHere’s applauding their efforts, because these celebs used their star power for good and made a difference to the society.\n#1 Amitabh Bachchan\nWhen Amitabh Bachchan falls sick, the entire nation prays for him, and the legendary man that he is misses no opportunity to pay it back to the ones in need.\nDon't Miss 365 SHARES\nThis year, Big B, paid off loans of 1398 UP farmers, gave Rs 1 crore each to the families of those martyred and another Rs. 1.5 crore to waive off loans of farmers. Furthermore, he also donated Rs 50 lakh for buying machinery to help manual scavengers. What’s more? He recently donated 50 lakhs to an NGO for the welfare of senior citizens.\nAlso Read: Amitabh Bachchan Fulfills His Promise, Gifts Machines To BMC For Sewage Cleaning & Wins Hearts\n#2 Randeep Hooda\nOn his birthday (on August 20), Randeep Hooda flew down to Kerela to to join Khalsa aid in the relief work for the victims of the relentless floods, that caused a damage of Rs 40,000 and took more than 450 lives. With his own hands, he served food to the flood-stricken people of Kerela.\nRead More: After Volunteering With Khalsa Aid For Relief Work, Randeep Hooda Praises The Spirit Of Kerala\nAmong other good deeds that he did this year, Randeep Hooda also helped clean Mumbai beaches after Ganpati Visarjan winning hearts and gaining all the deserved respect.\nRead More: A Day After Ganpati Visarjan, Randeep Hooda And Other Bollywood Stars Turn Beach Clean-up Warriors\n#3 Varun Dhawan\nOn World Environment Day, Varun Dhawan joined hands with volunteer group ForWard 69. He not only launched a bottle crushing kiosk, but he also volunteered to clean the Juhu Beach.\nAlso Read: Not Just Beach Cleanup, Varun Dhawan Also Launched A Plastic Recycle Machine On Environment Day\n#4 Actor Vishal\nSouth Indian actor Vishal, who is also the President of Tamil Nadu Film Producers Council and Secretary of Nadigar Sangam, adopted an entire village Karagavayal (located near Thanjavur, Tamil Nadu), which was heavily hit by Cyclone Gaja and is said to have been worst affected areas of the region. Vishal promised to restore the village.\nRead More: Actor Vishal Adopts An Entire Village Hit By Cyclone Gaja In Tamil Nadu, Promises To Restore It\n#5 Dia Mirza\nLeading the #BeatThePlastic Campaign, UN Environment-led global initiative, Dia Mirza, UN Environment Goodwill Ambassador for India, actively participated in the campaign urging fans to avoid using plastic-based products.\n“I’ve completely stopped the use of all single use plastics. So, my day starts with a bamboo toothbrush and plastic earbuds have been replaced by bamboo ones. My sanitary napkin is 100 per cent natural and biodegradable; I didn’t even know till two years ago that my sanitary napkin was largely made of plastics. I say no to straws, and if I have one takeaway coffee, I have my own mug that I carry with me. I carry my own water wherever I go and don’t drink packaged water. I even tried to trend a hashtag called #thetravelingbottle on social media,” she shared.\nAlso Read: https://www.indiatimes.com/entertainment/celebs/dia-mirza-does-it-again-undertakes-a-cleanliness-drive-at-dadar-beach-on-world-earth-day-343986.html\n#6 Shah Rukh Khan\nShah Rukh Khan via his Meer Foundation donated Rs 21 Lakhs for the victims of Kerela Floods. Later, Resul Pookutty, who had won Oscar for Best Sound Mixing for Slumdog Millionaire, revealed how he had reached out to the King Khan personally and thanked him for his prompt action and generosity.\nFurthermore, on International Day of Persons with Disabilities, Shah Rukh Khan donated 50 wheelchairs.\nRead More: 11 Inspiring Acts Of Generosity By Shah Rukh Khan Which Prove He's A True Hero In Every Sense Of The Word!\n#7 Akshay Kumar\nBy contributing to meaningful cinema that has a social message for the audiences, Akshay Kumar has often contributed to starting of conversations on topics including sanitary napkins and toilets. So much so, that inspired by his movie Padman, a Dubai teen adopted 250 tribal girls and donated them sanitary pads.\nAnd not just that, Akshay Kumar also donated Rs 5 lakh to jobless acid attack survivor Laxmi Agarwal.\n#8 Sushant Singh Rajput\nAlong with other Bollywood celebrities, Sushant Singh Rajput also won hearts by donating a hefty sum to Kerala Flood victims. Sushant donated Rs. 1 crore after a fan raised a request to him via Instagram. Without thinking twice, Sushant Singh Rajput instantly extended a helping hand.\nRead More: Sushant Singh Rajput Proves To Be A Good Samaritan, Donates Rs 1 Crore For Kerala Floods\n#9 Priyanka Chopra\nFrom South Africa to Bangladesh, UNICEF’s goodwill ambassador Priyanka Chopra visited several places to meet the refugee kids and spread awareness about violence faced by them. Sharing their stories via her Instagram account, PC became a target of trolls. But keeping all of that aside, she continued with the good work. She revealed how she was heartbroken hearing their stories. Spending quality time and playing with them, she added a pinch of cheerfulness to their lives.\nAlso Read: 9 Bollywood Celebrities Who Are Quietly Making The World A Better Place By Supporting Eco Causes", "title": "9 Bollywood Celebrities Who Worked For A Cause And Not For Social Media Applause In 2018", "date_publish": "26/12/2018, 14:17:54", "description": "Be it the Kathua rape case or the #MeToo movement that took the nation by storm this year, a lot of Bollywood celebrities expressed their opinions and condemned the wrong acts on social media. And then, there were also those who not only tweeted to make a difference but went a step ahead to participate in the activities contributing to change.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/9-celebrities-who-silently-worked-for-a-cause-not-for-limelight-but-betterment-of-the-society-358361.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/9_celebrities_who_silently_worked_for_a_cause_not_for_limelight_but_betterment_of_the_society_1545814833_800x420.jpg"}