{"text": "9 Dialogues From Badhaai Ho That Clearly Makes It One Of The Finest Comedy-Dramas Of This Year\n9 Dialogues From Badhaai Ho That Clearly Makes It One Of The Finest Comedy-Dramas Of This Year\nBadhaai Ho, filmy fans - this year has been a treat for all you movie lovers, thanks to all the good films that came your way.\nFilms like Padmaavat, Raazi, Patakha, Raazi, Sui Dhaaga, Andhadhun, Parmanu, and Satyamev Jayte have proved that content is indeed the king and you can't fool the audience anymore.\nDharma Productions\nThey know how to differentiate between good and bad content. Flying cars and senseless jokes can't be mixed together in order to make a formula that can't guarantee you a commercially successful film.\n2018 has indeed been a good one. Joining the list of films that have managed to impress the audience is Badhaai Ho. It was a film where the lead actors were not the only real stars of the film. Starring Gajraj Rao, Neena Gupta, and Surekha Sikri, this unconventional love story is winning hearts and is currently unstoppable at the box-office. Ayushmann Khurrana, the king of content-driven and low-budget films has once again proved that he is not just good with his crafting but he is stellar when it comes to choosing the right scripts.\nDon't Miss 322 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nJunglee Pictures\nThe film revolves around the lives of a middle-class family that run itself into an awkward spot when a couple who are in their mid-fifties get to know about their unwanted pregnancy. Instead of backing down because of the over-judgemental society, the couple decides to go ahead with the baby and what follows is a laughter riot with the right pinch of drama and emotions.\nJunglee Pictures\n'Badhaai Ho' has proved that with good performances and a good story, a film can never fail to impress. If you are still figuring out what is so special about this family drama, we are listing 9 dialogues from the movie to substantiate our claims of it being a good film.\nJunglee Pictures\nThese hilarious, emotional and full of life dialogues from the film feel straight out of all the real-life drama that happens in any normal Indian household. Read on.\n1. This is one hilarious dialogue that every person who has grown up in a middle-class household could easily relate to. In the film, Ayushmann scolds his younger brother for asking for his independent room because that triggered his parents to have an active sex life, resulting in the unwanted pregnancy.\n2. The film is a journey that shows how kids evolve from being ashamed of their parent's choices to accepting and respecting them. While the first half of the film shows Ayushmann and his younger brother being awkward with their mother's impending pregnancy, the second half transcends into an emotional journey of acceptance and gaining respect for their parents.\n3. Surekha Sikri, who played the role of 'Daadi' didn't just do full justice to her role of being the head of the family but her one-liners were the key highlight of the film. In one of the scenes when the couple breaks the news of their pregnancy to them, she goes on a rant on how her son and daughter-in-law took her joke seriously.\n4. Taking a dig on her own kids and how they forgot Government's lesson of 'Hum Do Humaare Do', Surekha Sikri's rant remains one of the most hilarious scenes of the film.\n5. Written by Akshat Ghildial, this film has some of the most absurd and hilarious punches and this scene where Ayushmann Khurrana confronts his girlfriend and rants about the arrival of a new member in the family is really a funny one.\n6. The real star of the film is Surekha Sikri and this remains to be another gem! She slyly asks her son about his sex life and when he found out time to impregnate her wife.\n7. In this movie, the 'Chota mehman' becomes one of the most dreaded guests that no one is ready for but the film unfolds it making this guest a relevant social issue. The climax of the will make you sob a little because when this 'mehman' arrives, everyone cries because they are really emotional. This film has its heart in the right place, making it an apt family watch.\n8. In one of the scenes from the film Ayushmann Khurrana overhears his girlfriend's mother's conversation about how 'tacky' his family is just because they are expecting a baby at this age. Taking a stand for his family, this scene from the film is one of the most emotional and heartwarming ones.\n9. In India, kids find it awkward to discuss or accept their parents' active sex life and this film manages to raise some really valid questions. Making this a matter of normalcy, this film makes us understand how it's absolutely normal for mid-age couples to have sex or expect a baby.", "title": "9 Dialogues From Badhaai Ho That Clearly Makes It One Of The Finest Comedy-Dramas Of This Year", "date_publish": "25/10/2018, 16:18:05", "description": "Badhaai Ho' has proved that with good performances and a good story, a film can never fail to impress. If you are still figuring out what is so special about this family drama, we are listing 9 dialogues from the movie to substantiate our claims of it being a good film. These hilarious, emotional and full of life dialogues from the film feel straight out of all the real-life drama that happens in", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/9-dialogues-from-badhaai-ho-that-clearly-makes-it-one-of-the-finest-comedy-dramas-of-this-year-355418.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/badhaai_ho_1540456016_800x420.jpg"}