{"text": "In one of the scenes from Gully Boy, an absolutely stunned Murad asks Safeena, \"Tu itni daring kaise hai?\"\nWith a smile on her face and a hopeful heart of achieving great things in life and breaking the shackles of oppression that exists inside her own home, she says: \"Nahi toh itna saara jo life mein chahiye wo milega kaise?\"\nIt's safe to say that Zoya Akhtar's philosophy in life is the same too. As a filmmaker and visionary, Zoya Akhtar is bold and she's someone who doesn't believe in holding back. She is a risk-taker.\nAll her characters struggle with some or the other challenge but each and every character has its own way of breaking the glass ceiling.\nFor Murad's mother, leaving her husband's house and taking a stand against domestic violence is her act of bravery. On the other hand, for Safeena, asking her conservative parents to live life on her own terms is her way of breaking free. Everyone aspires and inspires in this Zoya Akhtar's film but not the way you want them to.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn some of the scenes, even when there is not even a single exchange of words between the two characters, you hear the message behind that silence, loud and clear.\nBe it the scene when Murad drives his 'Madam' to a lavish party and he's seen waiting in the car asking and telling himself \"Apna Time Aayega\" or the scene where Sky and Murad exchange a moment of comfortable silence only to realize that they both can never have a romantic inclination towards each other- Gully Boy has its heart in the right place.\nBut what went behind this brilliant drama that is being touted as the film of the decade?\nWell, there are multiple stories and anecdotes that have been revealed by the cast and crew of the film that prove that there is a lot that went behind making this over-ambitious film a reality-and a beautiful one at that. Read on!\n1. The song on which Siddhant Chaturvedi was dancing when director Zoya Akhtar noticed him was 'Tujhe Mirchi Lagi toh Main Kya Karun'. Akhtar spotted Siddhant at the success party of his web-show.\nTalking about casting Siddhant for the role, Zoya revealed to Film companion: \"He was in Inside Edge as this young, skinny boy so I don’t think anyone even thought that he could be MC Sher so he wasn’t recommended to us. I was 3 weeks away from shoot and I didn’t have an actor for MC Sher and I was panicking. Then I saw him at a party dancing and I couldn’t take my eyes off him he was so good, he had rhythm. So I called him and asked him to come in for an audition and we tested him and he was on. It was that random.\"\n2. There were many special appearances in the film including Rahul Bose, who appears in an uncredited voice-over as a passenger in Murad's car.\nDivine(to whom the film is dedicated) appears as the host of the rap battle finale. Even Nas appears in an advertisement as himself.\n3. Vijay Maurya, who played the role of Murad's uncle in the film has also penned down dialogues for the film.\nThis includes all the 'Gulu gulu' and 'Dhoptungi' lines as well!\n4. A lot of impromptu modifications on the sets went on to become iconic scenes in the film.\nIn an interview, Zoya Akhtar revealed how Moeen (Vijay Varma's scene) came into picture. She said: \"There is a scene like: Moeen [played by Vijay Varma] going wow wow, vade vade in the scene at the Benetton showroom. That happened during the workshop, and we kept it. It was insane, the boys collapsed laughing.\"\n5. The bathroom scene where Murad is seen inside sky's bathroom: both Murad folding the napkin and counting area of the bathroom were a result of improv.\nZoya revealed: \"Murad folds a napkin in the bathroom of Sky’s house [Kalki Koechlin plays Sky, who produces Murad’s music]. We were shooting in an apartment that didn’t actually have any water. That moment was improvised, and it became a layer. But the bit where Murad measures the area of the bathroom with his feet was written.\"\n6. In the film, Zoya managed to create a world where even the slums and the world where Murad lived had a language of its own. Zoya was clear on not building any sets in the film-city as she wanted to shoot at actual locations.\nTalking about shooting in real locations, Akhtar revealed, \"I had worked with production designer Suzanne Caplan Merwanji before. We found a spot in Dharavi and constructed a fixed set within it, which we used for Murad’s house and the street on which he lives. Everything around is Dharavi. If I had built the set at Film City, you wouldn’t have bought it. You may not have realised why, but it would not have been convincing.\"\n7. Zoya Akhtar finally revealed the dynamics behind Ranveer's look in the film and how his tanned look was fitted in.\nIn an interview with Huffington post, she revealed: \"He came from a holiday in Maldives. He came back toasty. So when we started shooting that’s how he was looking but he started fading. Now we had to keep him toasty to keep the consistency. We would shoot from 7am to 7pm so he never even had the chance to swim and keep himself tanned. \"\n8. The man behind the tod-fod dialogues of Gully Boy-Vijay Maurya revealed how Zoya Akhtar and he liked the scene when Sher and Murad have a face to face conversation for the first time.\nMaurya describes: \"My favourite thing is when Sher ko pehli baar milta hai Ranveer. Woh Sher ko puchta hai ki tu usko kab mila pehle. He says, ‘Wilson College ke peeche Shivsagar main. Yeh foreigner log na jaat, joota aur jabaan nahi dekhte, seedha aankh mein dekhte hain. When I wrote this thing, Zoya was very happy with it that thodi philosophy bhi hain, sacchai bhi hain. That’s the artist’s world. Aankh se seedha soul mein utarte hain.\"\n9. Vijay Varma, who played the role of Murad's friend Moeen revealed how he looked for references from his life experiences and borrowed certain character traits from the actors he looks up to -- Jackie Shroff and Amitabh Bachchan.\nTalking to a news agency, he said, \"I have hung around Jackie Shroff a lot and he is a great guy to chat with. The large heartedness of Moeen comes from 'Bhidu' (as Shroff is fondly called by fans), because he is so giving. He always looks after everyone. I used him as a reference point.\"\n(Also read: From Amruta Subhash, Siddhant Chaturvedi To Vijay Verma: Meet The Real Stars Of Gully Boy)\n(Pictures: Excel Entertainment and Tiger Baby Productions)", "title": "9 Facts About Gully Boy That'll Give You Insights On What It Took To Make This Gripping Film", "date_publish": "22/02/2019, 11:22:27", "description": "But what behind this brilliant drama that is being touted as the film of the decade? Well, there are multiple stories and anecdotes that have been revealed by the cast and crew of the film that prove that there is a lot that went behind making this over-ambitious film a reality-and a beautiful one. Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/9-facts-about-gully-boy-that-ll-give-you-insights-on-what-it-took-to-make-this-gripping-film-362549.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/gully_boy_1550753245_800x420.jpg"}