{"text": "9 Instances That Prove The Frenzy For ‘Avengers: Endgame’ Was Too Much For Cinemas To Handle!\n9 Instances That Prove The Frenzy For ‘Avengers: Endgame’ Was Too Much For Cinemas To Handle!\nAfter all, Avengers Endgame was Marvel’s biggest and best ever blockbuster movie that culminated about 11 years of MCU and 22 individual films.\nAFP\nPeople waited for a year to see what fate awaits for Avengers, and when the film, the biggest one of the year, hit the theatre screens, of course the crazy and ardent Marvel fans waited in long queues, virtual as well as real, to book their tickets and have an experience of a lifetime.\nHowever, it was difficult to get things under control and these below mentioned instances just prove that!\nReuters\n#1 A 32-year-old woman in Bengaluru got stitches due to rush at one of the theatres.\nWhile she was entering the cinema hall, people were in so much hurry to go to their seats, that she was pulled and she fell flat on her face and got stitches.\nAFP\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\n#2 A woman postponed her child birth to watch the film.\nThis one was definitely an ultimate one. “I’m having a baby tomorrow but I need to know how it ends. We were offered a C-section earlier in the week, but because we had the Avengers booked we decided to have it later,” said the woman who hails from London.\nAFP\n#3 Fans were welcomed in theatre with Orchestra paying tribute to Marvel superheroes.\nWhat a great surprise to see the America’s orchestra welcoming theatre goers to see “The Avengers” #TeamSISD pic.twitter.com/Cn0EKOKRHw — Rosario Rojas (@RRojas_SHS) April 26, 2019\n#4 A man was beaten outside theatre in Hong Kong for shouting spoilers.\n#6 Avengers: Endgame frenzy has reached political domain as well.\nFrom Samajwadi Party (SP) chief Akhilesh Yadav to PIB, the publicity arm of the Ministry of Information and Broadcasting, the bug has bitten everyone.\nOver the last five years, the BJP has destroyed every pillar of democracy.\nBut the #Endgame has begun. #MahaGathbandhan Sarkar\nComing soon pic.twitter.com/dOIYobwRge — Akhilesh Yadav (@yadavakhilesh) April 26, 2019\n#7 A man set rules for his girlfriend for Avenger: Endgame.\nMy boyfriend sent me a very sternly worded note about our cinema trip to see #AvangersEndgame tomorrow. Mad because I thought it was just date night 😩🤷🏽‍♀️ pic.twitter.com/ZWfsCwRqV7 — Kamilla Rose (@KamillahRose) April 24, 2019\n#8 The minute the sale of tickets began, people in abundance turned up to book their tickets, and websites crashed.\nIn just a day, 1 million tickets were sold in India.\nReuters\n#9 And then, the tickets were costlier than ever.\nIn other parts of the world, the tickets were being resold on eBay and people spent as much as 10 lakhs to buy them. In India as well, Director’s Cut in Delhi sold tickets for 2200 a pop, and for first day, all of them were booked in advance.\nAP", "title": "9 Instances That Prove The Frenzy For ‘Avengers: Endgame’ Was Too Much For Cinemas To Handle!", "date_publish": "29/04/2019, 16:06:19", "description": "Avengers Endgame was Marvel’s biggest and best ever blockbuster movie that culminated about 11 years of MCU and 22 individual films.People waited for a year to see what fate awaits for Avengers, and when the film, the biggest one of the year, hit the theatre screens, of course the crazy and ardent Marvel fans waited in long queues, virtual as well as real, to book their tickets and have an experie", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/9-instances-that-prove-the-frenzy-for-avengers-endgame-was-too-much-for-cinemas-to-handle-366271.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/9_instances_that_prove_the_frenzy_for_avengers_endgame_was_too_much_for_cinemas_to_handle_1556533715_800x420.jpg"}