{"text": "The end of Game of Thrones is inching closer with every passing day! The winter is finally coming and it’s bringing along an end to the most loved fantasy-drama show with it. The finale is going to be “spectacular, inspiring, satisfying,” as David Nutter said.\nGame of Thrones season 8 will air in April 2019 – the date however is yet to be announced. There will only be six episodes in the finale season of the show, but they’ll be longer, “longer than 60 minutes. They'll be dancing around the bigger numbers, I know that for sure,” as Nutter said in a Reddit AMA.\nThere are going to be big twists, bigger than The Red Wedding. “As far as season [eight] compared to the Red Wedding I just have to tell you—hang onto your seat cause it's going to be special.\"\nDon't Miss 161 SHARES 842 SHARES\nBut not everyone will be happy with the end of the show. “I think not everyone's going to be happy, you know, and you can't please everyone. My favorite TV shows are Sopranos, Breaking Bad, and The Wire, and they all ended in a way that…It's never going to satisfy you,\" Kit Harington had told MTV.\nThe cast cried just reading the script of the finale episode. Co-executive producer Bryan Cogman said the end will be “incredibly emotional haunting bittersweet”. So, keep tissues handy when you watch season 8, especially the finale episode.\nIf the wait is making you anxious, here are some interesting Game Of Thrones Season 8 theories that seems convincing enough to us.\nWarning: These could be possible spoilers. Don’t blame us later.\n#1 Wondering who’ll sit on the Iron Throne? Here’s the answer!\nvia GIPHY\nRemember after Maisie Williams AKA Arya Stark wrapped up the shoot of Game Of Thrones season 8, she posted a cryptic message on Instagram. She used the hashtag -- #LastWomanStanding. Well, isn’t that a hint!\nAlso, Ned Stark AKA Sean Bean said that Arya will survive until the end. “Yeah Arya will last—maybe she'll be on the throne,” he said in an interview with Mashable. So, what’s all this hinting at? Arya Stark on the Iron Throne, maybe?\n#2 It was all a lie! Tyrion is not a Lannister.\nTyrion Lannister, anyway, is a misfit in the Lannister family, don’t you think? So, if this theory is to be believed, Daenerys Targaryan is actually Tyrion’s sibling.\nnetdna-ssl.com\nTyrion is not Tywin Lannister's son. He is actually Mad King and Joanna Lannister’s son. The theory has roots to the George RR Martin’s books which revealed that the Mad King and Tyrion's mother Joanna Lannister had some history.\nSo, is that why Tyrion loves staring at fire? And is that why Tywin utterly despised his youngest son?\n#3 Jon Snow is not only a Targaryen but also ‘The Prince That Was Promised’.\nvia GIPHY\nRemember that The Red Witch, Melissandre, would talk about Azor Ahai AKA The Prince That Was Promised – who would emerge as a Messiah and save the world from the bad forces. She said he is the chosen warrior who brought an end to the conflict when he destroyed the Great Others (basically the White Walkers) with his burning sword, the Lightbringer?\nGeorge RR Martin nearly confirmed that Jon Snow is Azor Ahai.\nvia GIPHY\n\"Aegon finally decided to take over Westeros and unify the Seven Kingdoms that existed at the time under one rule. There is a lot of speculation that in some sense he saw what was coming 300 years later, and wanted to unify the Seven Kingdoms to be better prepared for the threat that he eventually saw coming from the north — the threat that we are dealing with in A Song of Ice and Fire,” Matin says in the video, clearly stating that Aegon knew that hundreds of years later, the White Walkers would rise again, which also hints Aegon is Azor Ahai.\nFurthermore, Jon Snow is the son of Rhaegar Targaryen and Lyanna Stark, which means he carries both bloodlines within him – the ice as well as fire.\nAlso Read: Dropping A Major Spoiler For Season 8, George RR Martin Confirms This Popular Game Of Thrones Theory\n#4 Jaime Lannister will kill Cersei and their unborn child.\nvia GIPHY\nJaime Lannister will betray Cersei Lannister in the most brutal way. Jon Snow and Daenerys Targaryen have tried to convince Cersei to fight against the army of the dead, but in the finale of the next season, we saw she didn’t care much about it. Well, that might lead to Jaime Lannister killing her. With that, her fourth child will be killed too.\nAlso, remember in the first episode of the fifth season, Maggy the Frog, a soothsayer from Lannisport answers all questions that Cersei had, but not the one about how many children she’ll have. Perhaps, that’s why the part was cut. Cersei will die will her unborn child.\n#5 Jaime will get himself killed by Bronn.\nvia GIPHY\nAnother theory suggests that in regret and having nothing else to live for, Jaime would ask Bronn to kill himself. Perhaps, this will happen after the battle with White Walkers. He ain’t going so easy!\n#6 Bran is the Night King!\nAnd he is the one who built that wall.\nvia GIPHY\nOKAY! Let’s crack this. Bran is the three-eyed Raven who can travel into past through warging (entering the mind of people), we all know. So, according to this theory, the first time he goes back in time to make the Mad King prepare to fight the White Walkers. Second time, he goes deeper and learns that White Walkers were defeated the first time. The third time, he goes back farther, to the war of First Men and Children Of The Forest, and witnesses the creation of the Night King. He sees the First Man was tied to the tree, when Leaf bites him, after which he transforms into the Night King.\nvia GIPHY\nSo, when Bran goes back into the past for the third time, he is unable to return. He warges into the First Man’s mind, and hence, becomes the Night King!\n#7 Sam is the one narrating the story!\nWho is the narrator of Game of Thrones? Who is telling all of us this story? John Bradley, who plays Sam, is also convinced that it’s him.\nvia GIPHY\n“If you take the logic of the story now, the story of Westeros and the story of the battle for the Iron Throne, it would be a book in that library,” he told Hollywood Reporter.\nAdding to this theory, fans have stated that in one of the scenes when Sam is in Citadel library of Oldtown, he can be seen standing under a gyroscope, which is the one which is shown in the opening credit of the show.\n#8 Wondering who will kill the Night King? Gendry!\nhellogiggles.com\nAnd this theory has got some proof now too. Remember Gendry, a skilled blacksmith and an unacknowledged bastard son of King Robert Baratheon? Four years after he was put in a little boat in Dragonstone, he returned in the season 7, and he might as well play a major role in Game of Thrones season 8.\nGeorge RR Martin's recent book, Fire & Blood, hints that Gendry might kill the Night King. The book, which is set 300 years before the events of Game of Thrones tells the history of Targaryen kings and also of one of the key figures of the Westeros.\nHugh the Hammer was a bastard blacksmith that ended up becoming a lord. His story sounds quite similar to that of Gendry. Though largely untrained in the art of war, his size and strength made him a fearsome foe.\nvia GIPHY\n“His weapon of choice was the warhammer, with which he delivered crushing, killing blows. In battle he rode Vermithor, once the mount of the Old King himself; of all the dragons in Westeros, only Vhagar was older or larger.For all these reasons, Lord Hammer (as he now styled himself) began to dream of crowns. Why be a lord when you can be a king?” he told the men who began to gather round him. The son of a common blacksmith, Hammer was a huge man, with hands so strong that he was said to be able to twist steel bars into torcs. We just hope that the show ends on a satisfying note. We want to sob happy tears at the end. And talk was heard in camp of a prophecy of ancient days that said, ‘When the hammer shall fall upon the dragon, a new king shall arise, and none shall stand before him.’ Whence came these words remains a mystery (not from Hammer himself, who could neither read nor write), but within a few days every man at Tumbleton had heard them.”\nThis suggests that Hugh’s ancestors will end up killing a dragon. Is that going to be the ice dragon? Hugh will rise to be a king. Wait, does that mean he will sit on the Iron Throne?\n#9 You’ll see Ned Stark in the season finale.\nvia GIPHY\nNo, he will not rise from the dead. Neither will he be seen in some flashback. He’ll return in a special episode.\n“It was the last episode, so we all got together… They decided to get all the characters together for a bit for this big show in Belfast and he kind of hosted the evening,” he told The Hollywood Reporter.\nAlso Read: After Getting Brutally Killed In Season 1, Ned Stark Will Return In Game Of Thrones Finale For A Special Episode!\nHave you heard of any other convincing Game of Thrones theory? Share with us in the comments section below.\nMeanwhile, enjoy the first teaser of Game of Thrones season 8 below!", "title": "9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale!", "date_publish": "09/12/2018, 15:37:48", "description": "Here are some interesting and convincing Game Of Thrones Season 8 theories that seems convincing enough to us. This is it – the end of Game of Thrones is approaching! The winter is finally coming and it’s binging along the end to the most loved fantasy-drama show with it. The finale is going to be “spectacular, inspiring, satisfying,” as David Nutter said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/9-insanely-convincing-game-of-thrones-season-8-theories-that-will-pump-you-up-for-the-finale-357760.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/game_of_thrones_1544350116_800x420.jpg"}