{"text": "Aamir Khan - this is one name in the industry that carries a lot of weight. An inspiration to fellow actors and commoners alike, Aamir is someone who is respected by people of all age groups. Why you ask? Well, he is one person who believes in giving his all to everything he picks, movie or a social cause, he believes in giving his 100 percent or even more, if that’s possible.\nindiawords\nEven cricket god Sachin Tendulkar or the iconic Amitabh Bachchan have bad days, but Aamir Khan’s success rate, of late, is almost a cent percent. Before you go all Thugs Of Hindostan on me, here’s some food for thought - One setback doesn’t account for a celeb’s failure! Moving on, let’s not forget that Aamir is probably the only person who has been setting trends for others to follow in Bollywood.\ngfycat\nCredit should be given where it’s due and this man deserves it in abundance. On the occasion of his 54th birthday, let’s contemplate and take a look at his exhilarating career and reasons why there can never be another actor like Aamir Khan in the Hindi film industry.\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n1. He works to entertain his audiences not to get awards or applause\ntwitter\nThere’s more than one way to look at the way he operates. Some call him finicky, control freak and overbearing when it comes to the way he works but what we fail to understand is the fact that he gets involved deeply, only because he cares. He is passionate about everything that he does. He is inquisitive in nature and extremely creative, which is why he like to question and give his inputs.\nCome to think of it, the man in question hardly worries about receiving awards. So much so, that in his more than three-decade long career he has hardly attended any award ceremonies. In several of interviews he has always mentioned that he likes to make films for public, for them to enjoy and get entertained not for any awards or recognition.\n2. He works hard to get into the skin of all the characters that he plays\nofficial poster\nEvery movie that he picks is unique. He likes to play vastly different characters. After the 90's, Aamir Khan started to pick roles very carefully and smartly. Be it a Lagaan, a Dil Chahta Hai or a Fanaa, he handpicked roles and worked hard to make every character look convincing. In fact, he challenged other actors and provoked them to explore their capabilities. Many up and coming actors look up to Aamir and try to follow in his footsteps.\nHow can we forget the jaw-dropping transformation he went through for his film Dangal? To authentically play the role of an aging wrestler he gained a lot of weight. So much so, he had difficulty in breathing for a long time! Later on he, shed those extra kilos like it was a piece of cake. In fact, even for Ghajini he sported the bald look until the shooting wrapped up. More recently, he got his nose pierced for real to look the part in Thugs Of Hindostan.\n4. Satyamev Jayate - No explanation needed!\nyoutube\nMany people credited him for bringing reality in reality TV shows when he launched his show Satyamev Jayate. It was in May 2012, that instead of opting for an easy-peasy game shows like his contemporaries, Aamir chose to do this talk show. This show was so high on emotions and reality that it did not need celebrities to generate TRP. The social topics that were shown addressed the pressing issues of our country. This show did not try to hide the ugly truth. Naturally, it garnered a lot of criticism along side all the praise.\nHowever, this did not deter the actor one bit. He stuck with it till the very end and did not take the easy way out by quitting. Instead he came up with more seasons. If this doesn’t show integrity then i don't know what will! I still remember the song ‘Mujhe Kya Bechega Rupaiya’ which was aired in the episode on the dowry system even today and it manages to give me goosebumps every single time i listen to it. Such was the power of this show!\n5. A visionary director with great insights\ntwitter\nAs if his precision and meticulous acting weren’t enough, Aamir Khan decided to take the plunge into the directorial arena in the year 2007. He turned director with the film Taare Zameen Par which managed to struck the right chord with the audiences.\nRevolving around a little boy Ishaan Awasthi, who has trouble catching up with the abilities of kids his age only because he is dyslexic, this movie shattered the most important stereotype of being in a rat race to excel in academics alone. It not only dealt with dyslexia but it also gave food for thought to all the parents out there who dream about their kids topping their grades. It also focused on the fact that there are several other areas to excel in apart from academics. Being average in studies does not mean that a kid won't be able to make a living for himself/herself in the future.\nTo pick such a sensitive topic and show it with the right emotion, only Aamir Khan could have done that. The movie went on to win the hearts of audiences and critics alike. With a creative genius like him, Aamir Khan is known to share his insights on every movie, even if it isn’t his own. This is one reason why every actor in the Hindi film industry seeks the approval of the perfectionist Khan.\n6. Putting India on the Oscar pedestal\ntwitter\nAamir Khan not only acted in Lagaan but he also donned the producer’s hat because he believed in Ashutosh Gowariker’s brilliant script. In the quest to beat the British in their own game - Cricket, to get the taxes or Lagaan laid off, Aamir Khan won hearts all around the world with his innocence and perseverance. So much so, that this village simpleton’s story bagged a place in the Oscars that year. Despite the film not winning the Academy award, Aamir Khan sure won the respect of everyone. It became quite evident that he is one actor who means business. For him movies were, are and will always be a passion!\n7. Introducing the Rs 100, 200 and 300 crore clubs in Bollywood\ntwitter\nIf you are not able to rack your brains, let me also remind you that it was Aamir who started the trend of Rs 100, 200 and 300 crore clubs in Bollywood. Back in the day when these clubs weren’t even existent, his film Ghajini became the first movie to make Rs 100 crore. Since then, there has been no looking back. With 3 Idiots, PK and Dangal among others, his movies shattered many box office records and how!\n8. From trying out super cool stunts to perfecting his dialect for every character, Aamir Khan puts a lot of effort into each of his films\npinterest\nPersonally, one movie of Aamir Khan that’ll be remembered till eternity is Rang De Basanti. His easy-going attitude mixed with Punjabi ruggedness and then suddenly, the serious persona that he adopted in the course of the movie, DJ was one character that everyone wished for as a friend. So how does he do it? Well, Aamir Khan doesn't just sign a film and start shooting. The man is known for going to extreme lengths to learn new languages, nuances and even body language. For instance, his Bhojpuri accent in PK, perfecting the urdu dialect for Sarfarosh to doing several tapori roles, he is perhaps one of the few actors who have experimented to their heart’s content. Till date, his iconic train sequence in Ghulam is probably the most remembered one by his fans!\n9. Taking up the most loved ancient epic Mahabharata and making it into a trilogy!\ntwitter\nAamir Khan is all set to begin his dream project. As per reports, Khan wants to narrate the story and has been working hard to bring his visions to life. So much so, that he had to let go of another ambitious project - the Rakesh Sharma biopic. What’s more Aamir Khan is likely to play the role of Krishna in this trilogy. Talking about the same in an interview with Filmfare, he had said,\n“My dream project is to make the Mahabharata but I’m afraid of starting the project as I know it will consume at least 15-20 years of my life. My favourite character is Karna, but I don’t know if I’ll be able to play him due to my physique. I may just have to play Krishna. I also liked the character of Arjun. He was the only person who asked Krishna why he had to kill his own people.”\nWell, considering Aamir is working so hard on this one, we are sure it’ll be nothing short of perfection.", "title": "9 Reasons Why Aamir Khan Is A Trendsetter Who Wrote His Own Rules & Inspired Others To Follow", "date_publish": "14/03/2019, 11:48:08", "description": "Aamir Khan - this is one name in the industry that carries a lot of weight. An inspiration to fellow actors and commoners alike, Aamir is one celebrity who is respected by people of all ages. Why you ask? Well, he is one person who believes in giving it all to everything he picks, movie or a cause, he believes in giving his 100 percent or even more, if that’s possible. Even cricket god Sachin Ten", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/bollywood/9-reasons-why-aamir-khan-is-a-trendsetter-who-wrote-his-own-rules-inspired-others-to-follow-363602.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/aamir_khan_1552550390_800x420.jpg"}