{"text": "Ranveer Singh, Alia Bhatt, and Zoya Akhtar\nSounds like a dream team, doesn't it?\nWell, this dream team has come together for a film that is all about people who have to fight against all odds to chase their dreams.\nExcel Entertainment\nLoosely based on the lives of underground rappers from Mumbai – Divine, and Naezy (Naved Shaikh), Gully Boy looks like a great film to begin the first quarter of the year with. The trailer of the film was unveiled today and the film industry is only raving about it. Here are the first reactions.\nKya trailer hai bc!!! I got goosebumps, tears, adrenaline rush, probably a mini orgasm too. All at once. Kudos https://t.co/MQtmdDUN23 — Ayushmann Khurrana (@ayushmannk) January 9, 2019\nHaven’t seen anything like this before in our cinema. Looks like this is going to be a cracker. Good luck, Zoya and team! @FarOutAkhtar @ritesh_sid @RanveerOfficial @aliaa08 #GullyBoy https://t.co/3MjEJ07U2e — Rahul Bose (@RahulBose1) January 9, 2019\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES\nWhat a trailer!!!! What a vibe!!!! W(Raps) you into its world and you watch it with RAPt attention! Congratulations to EXCEL, Ritesh, Farhan, Ranveer, Alia and ZOYA!!! For this new energy film!!! This is a WINNER!!! https://t.co/ZqEGM7K4Q1 — Karan Johar (@karanjohar) January 9, 2019\nHere are 9 reasons why it's going to be a must watch for all the movie buffs:\n1. Alia Bhatt and Ranveer Singh: The power-packed collab\nExcel Entertainment\nWhat happens when two versatile and absolutely brilliant actors collaborate? You end up believing in the power of good cinema. This dream collaboration is one of the reasons why this film is a first potential blockbuster film of 2019.\n2. Apna Time Aayega\nExcel Entertainment\nThis isn't a general tell-all about the real life of Mumbai rappers. The trailer of the film offers a dramatic journey of individuals who strive to break the monotony and overcome their usual life circumstances to achieve the impossible. With Singh and Bhatt headlining the film, Kalki and Vijay Raaz make the cast a powerful one. It is not just a struggle story. It's a film about the indomitable spirit of two individuals who fight it out to break the glass ceiling and stand out.\n3. Zoya Akhtar\nScreengrab\nWell, this is a reason good enough to invest your money on such a film. After films like Luck By Chance and Zindagi Milegi Na Dobara, you know that when Akhtar makes a film, it's not just a usual slice of life sort of a film. There is drama, there is a struggle and there is a feel-good factor that makes you feel extremely close to all her characters.\n4. Alia Bhatt- The master of all trades and shades\nExcel Entertainment\nFrom Raazi to Gully Boy, Alia Bhatt is an actor who is up for all challenges. She takes up a character, slips into the skin and conquers it so effortlessly that you have only praises for the 24-year-old! In the trailer, Alia adds the much-needed dose of laughter with a straight face, mind you, which makes the film a full paisa vasool!\n5. Zoya Akhtar has confirmed that the real gully rappers are a part of the film too.\nExcel Entertainment\nTo retain the authenticity of the story and add that much-needed Bombaiya touch, the real gully rappers were made a part of the film.\n6. The film is a glorious tale of the life story of street rappers Vivian Fernandes aka Divine and Naved Shaikh aka Naezy who are known for their song 'Mere Gully Mein'.\nExcel Entertainment\nIn a first, Zoya Akhtar has taken up the responsibility of sketching a reel story that has several real elements. The film also throws light on the challenges faced by these rappers to sell their talent and get noticed.\n7. After Band Baaja Baraat, Ranveer Singh calls 'Gully Boy' his most dear film\nExcel Entertainment\nRanveer has confessed that Gully Boy is one of the dearest projects for him. Ranveer Singh had earlier said, \"Gully Boy is perhaps the most dearest film. It is one of the closest movies to me after Band Baaja Baaraat. This is a story that means a lot to me.” Well, if an actor feels strongly about a film, you can only believe and be hopeful, and with Singh, you know that this belief will always have a fruitful result.\n8. In a first, a commercial Hindi movie will give a platform and talk about the underground rappers of Mumbai\nExcel Entertainment\nTalking about the project, Zoya said, \"International artists are big because they are promoted. Our artists are big. They have a great following. We need to give them a platform.\"\n9. A film that has its heart in the right place!\nExcel Entertainment\nHow often do you see a film with all the A-listers having its heart and intent in the right place? Be it the trailer of the movie or the interviews where both Ranveer and Alia have time and again reinstated the fact that the film is raw and everyone is at their authentic best to tell the story. With such a star cast and a director like Zoya Akhtar, who has beautifully told us the story of the struggling artists in Luck By Chance, you can only hope the film to release soon. Agree?\nWhy do you wish to watch Gully Boy? Tell us in the comments below.", "title": "9 Reasons Why We Are Eagerly Waiting For The Release Of Ranveer Singh - Alia Bhatt's Gully Boy", "date_publish": "09/01/2019, 18:53:31", "description": "Loosely based on the lives of underground rappers from Mumbai – Divine, and Naezy (Naved Shaikh), Gully Boy looks like a great film to begin the first quarter of the year with. The trailer of the film was unveiled today and the film industry is only raving about it. Here are the first reactions.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/9-reasons-why-we-are-eagerly-waiting-for-the-release-of-ranveer-singh-alia-bhatt-s-gully-boy-360103.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/gully_boy_1547038590_800x420.jpg"}