{"text": "If you call yourself a hardcore movie buff, then i am pretty sure you won’t be able to stop yourself from praising actor Vijay Raaz. Come to think of it, I've never met even one person who doesn’t have the nice things to say about this phenomenal actor.\nsayslife\nWhile big names continued to soar, Raaz made sure to make his presence felt with meaningful roles, no matter how small. It was in the year 2001, when we first noticed him on the big screen in the offbeat film, Monsoon Wedding. With a dark take on weddings, this Mira Nair directorial had the likes of Naseeruddin Shah and Shefali Shah amongst others. Vijay Raaz played the role of a wedding planner fighting his own demons. His eccentricity somehow managed to make a mark in the hearts of the audiences. However, this one film did not fetch him meaty roles. His first film that got him the spotlight was Abhishek Bachchan-starrer Run. More than the film, most people remembered only Vijay Raaz.\nInterestingly, the actor received no formal training in acting. He was a regular at the plays being showcased in the National School Of Drama and it was Naseeruddin Shah who noticed him and saw immense potential. It was Shah who recommended his name for Monsoon Wedding. Of late, Vijay Raaz has become a widely-known name in the entertainment industry. He is probably one of the very few names that are looked upon with respect and appreciation, regardless of the kind of roles he portrays on the silver screen.\nIn fact, the movie where he played the lead hero might not have created a big buzz but Raghu Romeo, fetched Raaz a national award.\nDon't Miss 2.9 K SHARES 531 SHARES\nimdb\nThe man deserves all the appreciation and accolades which is why we decided to reminisce and take a look at some of his phenomenal roles. So here goes:\n1. Monsoon Wedding\ncinemalacrum\nNot your conventional Bollywood film, this movie was a breakthrough for reasons more than one. Not only did it deal with a sensitive subject, but it also dabbled with more than one sub-plot. Vijay Raaz played a small yet significant role of a wedding planner who falls for a christian girl. The wedding in Monsoon Wedding might be between the main couple, but their wedding was something that left everyone elated. He played a complex character so beautifully that the viewers got hooked to his side story equally.\n2. Run\nyoutube\nThis film starring Abhishek Bachchan and Bhumika Chawla is not remembered because of the lead cast or the storyline. Run is still fresh in the minds of the audience only because of Vijay Raaz. His Kauwa Biryani scene was probably the highlight. I doubt there’s hardly a person who isn’t aware about this particular scene. Most of us, still laugh our hearts out watching the snippets of Vijay Raaz’s scenes over and over again. He might not have the conventional look of a hero but he sure knows how to hold our attention with his impeccable comic timing.\n3. Deewane Huye Pagal\nyoutube\nThis movie was hilarious on many levels. However, one character that again managed to outshine several others was that of Vijay Raaz. He did not have many elaborate scenes in the movie but whatever little screen time was allotted to him, he did a mighty fine job at it. Playing Akshay Kumar’s ally/confidant/best-friend, he charmed our socks off with his goofiness. Remember that scene, when the duo was trying to track Rimi Sen and Akshay Kumar gave him the responsibility to fix a mic? It was hard not to laugh at his silliness, right? Well, Vijay Raaz does that to you. His expressions are enough to leave people in splits.\n4. Dhamaal\nyoutube\nA multi-starrer film Dhamaal is an all time favourite comedy film for a lot of people. Given the amazing cast and a fabulous plot, this movie became a tad bit more funny, courtesy Raaz. Playing an emergency service executive, he added spice to the film with his eccentric way of tackling the landing of Boman and his Father Nari’s plane. So much so, that till date, several memes are made on that particular scene in the film when he guides or misguides them on how to land the plane.\nSamne red button dikh raha hai\nhaan dikh raha hai, dikh raha, daba diya.\nOho nahi dabana that!\nRemember? It wasn’t more than a 5-minute role but he did it with so much finesse and dedication that it became one of his most memorable roles.\n5. Welcome\nyoutube\nAnother Akshay Kumar starrer, this time Raaz again played his punter in the film. He played a fake whimsical director who takes it upon himself to keep Uday Shetty busy, so that he can’t commit crimes. He tries his best to engage Nana Patekar and his thugs but in the end loses his cool and gets thrashed up by Majnu Bhai. Not a big role, but this sure added a lot of flavour to this film.\n6. Delhi Belly\ntwitter\nThis movie turned out to be a breakthrough for Vijay Raaz, as he got a long-standing character role of Don Somyajulu, the guy who gets diamonds smuggled and then delivered to himself through a Russian guy called Vladimir. His anger was so hilarious that more than terrifying the audience, it ended up making them laugh their hearts out. From Sir Lundry to yeh toh tatti hai, his dialogues still inspire a meme fest from time to time. I for one, enjoyed the movie more because of Vijay Raaz’s weirdness.\n7. Pataakha\ntwitter\nOne of the more recently released films, Pataakha had Vijay Raaz playing a key role of a father of two daughters who portrayed sibling revelry in its purest form. His acting of a helpless father who is tired of trying to reason with his two daughters was so on point that we couldn’t help but feel for him during the entire film. In the end, it was Raaz alone who not only reunited his two daughters but also made them realise that they can’t ever live happily without each other.\n8. Stree - Shashtri\nofficial poster\nStree was the talk of the town for it was a horror comedy that also dealt with a social evil in its wake. Now, Rajkummar Rao, Pankaj Tripathi and Aparshakti Khurranna might have gotten all the limelight but Vijay Raaz also played a pivotal role in the film. It was his character Shastri, the author of the book O Stree Kal Aana that ends up solving the mystery of Stree’s spirit. It was him, who also delivered a very important message that Stree only desires love and respect and it is haunting the village only because she is in search of these two things. One thing that really needs to be said, is the fact, that Raaz has a very unique way of selecting roles. Despite some of them being really small, he has always made sure that they are significant and not frivolous.\n9. Gully Boy\ntwitter\nThe movie inspired by underground music focused mainly on the rappers but Vijay Raaz’s presence wasn't hard to miss. Playing Ranveer Singh’s abusive father, his transition from an orthodox and controlling head of the family to a proud father, left a lot of people teary-eyed. Especially, the climax scene.\n10. No problem\nyoutube\nThis film did not do too well on the box-office but over the time when people saw it on their TV screens, most of them agreed that it was a fun entertainer. Now, what can be more hilarious than Vijay Raaz playing a bizarre and out-of the box character, right? Just like his Kauwa Biryani gig, in this movie he played a guy who attempted to kill himself several times but in doing so, he ended up creating difficult situations around him. What’s more he is unsuccessful in committing suicide, every. single.time.\n11. Soorma\nyoutube\nIn this Sandeep Singh hockey biopic, Vijay Raaz played the Indian Hockey Coach. Again, his screen time wasn’t much but with one dialogue he left the audiences whistling and cheering for him endlessly. It goes like this - Tamancha kacche mein rakh lo babua, Bihari hain hum, thook ke matha mein chedd kar denge. He once again proved that you don’t require a robust or muscular body to throw your weight over someone, all it takes is intensity and powerful dialogue delivery!\n12. Made In Heaven\namazon\nThe web-series that everyone is talking about these days, also has Vijay Raaz play a role of a money-lender who is a small scale investor. In the scene during the annual meeting where Jim Sarbh - the main investor, is making his point, he did not feel intimidated. Instead, he made his point when he said that - do chaar English ke shab bolne se aap ache vyapari nahi ban jate! Don't know about you but i for one, had a slow clap moment right then and there!\nHis filmography is an inspiring one to say the least, however, as a fan I would love to see more of him and in a variety of roles, be it films or web-series! Tell us about your views in the comments section below.", "title": "12 Roles Of Vijay Raaz That Prove He's Like Fine Clay Which Can Be Molded Into Any Character", "date_publish": "30/03/2019, 18:04:08", "description": "If you call yourself a hardcore movie buff, then i am pretty sure you won’t be able to stop yourself from praising actor Vijay Raaz. Come to think of it, I've never met even one person who doesn’t have the nicest things to say about this phenomenal actor. While big names continued to soar, Raaz made sure to make his presence felt with small yet meaningful roles. It was in the year 2001, when we", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/bollywood/9-roles-of-vijay-raaz-that-prove-he-s-like-fine-clay-which-can-be-molded-into-any-character-362668.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vijay_raaz_1550922016_800x420.jpg"}