{"text": "Chief Minister of Goa, Manohar Parrikar passed away on Sunday after a prolonged battle with pancreatic cancer. 63 year old Parrikar put a brave foot forward and was fighting cancer since February 2018.\nHowever, his health declined since last two days and an official statement from the office mentioned that doctors have been trying their best. This heartbreaking news was revealed by President Ram Nath Kovind, who took to Twitter to condole the death of Goa Chief Minister and former Defense Minister of India.\n(Also read: How's The Josh? Ailing Goa Chief Minister Manohar Parrikar Asks In First Public Speech In Months)\nIn his message, he wrote,\n\"Extremely sorry to hear of the passing of Shri Manohar Parrikar, Chief Minister of Goa after an illness borne with fortitude and dignity. An epitome of integrity and dedication in public life, his service to the people of Goa and of India will not be forgotten.\"\nAs soon as the news of his death spread on social media and mainstream media, several celebrities started pouring condolence messages.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nCalling him 'brave and simple', celebrities summed up their feelings for Parrikar in a dignified way. Read on!\nRIP Shri #ManoharParrikar Condolences and strength to the family in this tragic time of grief. — Swara Bhasker (@ReallySwara) March 17, 2019\nHad the pleasure of meeting Shri #ManoharParrikar .. what a fine man. Condolences to the family and close ones — Tisca Chopra (@tiscatime) March 17, 2019\nA true patriot passes away, RIP #ManoharParrikar ji. A great leader who we will always admire, remember and seek inspiration from. Heartfelt condolences to his family and loved ones. — Vivek Anand Oberoi (@vivekoberoi) March 17, 2019\n#ManoharParrikar A fine example of \"Simple living, High thinking\". A personality that inspired confidence in every position that he served for the Nation! 🙏🙏 RIP Sir 🙏🙏 — KayKay Menon (@kaykaymenon02) March 17, 2019\nGoa ke Mukhya Mantri Manohar Parrikar ji ke nidhan ki vaarta sunkar mujhe bahut dukh hua,unke aur hamare bahut acche sambandh the.Unke jaane se hamare desh ki bahut haani hui hai,ek atyant saccha insaan aur neta desh ne kho diya hai. Ishwar unki aatma ko shanti pradan kare. — Lata Mangeshkar (@mangeshkarlata) March 17, 2019\nAgree with all said below . Loved by all. Not his time to go.. 🕉🙏🏻🕉 #ManoharParrikar https://t.co/VGw6hPzq2W — Raveena Tandon (@TandonRaveena) March 17, 2019\nT 3122 - Manohar Parikar CM Goa, passes away .. a gentleman to the core, simple in demeanour and well respected .. spent few short moments with him .. very dignified .. fought his illness bravely .. prayers and condolences 🙏🙏 — Amitabh Bachchan (@SrBachchan) March 17, 2019\nExtremely sad at hearing about the demise of Sh. Manohar Parrikar Ji. I feel blessed to have had the fortune of meeting and knowing a sincere and good soul as he was. Heartfelt condolences to his family🙏🏻 — Akshay Kumar (@akshaykumar) March 17, 2019\nDeeply deeply saddened to know about the untimely demise of Shri #ManoharParrikar ji. He was one of the most real, dignified, intelligent, warm, down-to-earth & honest person I had met. He had a great quality of inspiring people so effortlessly. Will miss him. Om Shanti.🙏 pic.twitter.com/4i4noSWSDZ — Anupam Kher (@AnupamPKher) March 17, 2019\nSo very Saddened to hear about the sudden demise if Shri. MANOHAR Parrikar Ji. A dynamic and Honorable Soul.. Rest now in peace in Heaven sir .🙏🙏🙏@manoharparrikar — Ranganathan Madhavan (@ActorMadhavan) March 17, 2019\nParty ideologies apart a good and gentle man will always be it. Not even cancer can kill a spirit like @manoharparrikar . Have had the honour of breaking bread with him. As will the Nation, I too will remember him. — Kamal Haasan (@ikamalhaasan) March 17, 2019\n#ManoharParrikar always came accross as one of the more level headed and decent politicians in the country. Rest in Peace sir. — Vir Das (@thevirdas) March 17, 2019", "title": "A Brave Man Who Fought Till The End: Celebrities Pour Condolence Messages For Manohar Parrikar", "date_publish": "18/03/2019, 10:29:53", "description": "As soon as the news of his death spread on social media and mainstream media, several celebrities started dropping condolence messages. Calling him 'brave and simple', celebrities summed up their feelings for Parrikar in a dignified way. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/a-brave-man-who-fought-till-the-end-celebrities-pour-condolence-messages-for-manohar-parrikar-363875.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/manohar_parrikar_1552886562_800x420.jpg"}