{"text": "Social media has reduced the distance between people and all of us are utilizing it well but we can't deny the very fact that there are multiple cons of it too. Celebrities have to face a lot of trolling online and sometimes, things turn into a nightmare for some.\nLike, a recent case has come into limelight and it's terrifying. According to a DNA report, a cab driver from Haryana, who has been identified as Sudhir Rajender Singh was stalking and following TV and film producer Ekta Kapoor.\nTwitter\nThe DNA report further claimed that Singh followed her almost 30 times in the last one month. Apart from wanting to ask her for a job, he also wanted to befriend her. Even when Ekta Kapoor denied his friendship proposal, he didn't stop following her. He went on to take a membership in Ekta's gym. A police officer is quoted in the report saying,\nDon't Miss 185 SHARES 263 SHARES 542 SHARES 12.5 K SHARES 5.5 K SHARES\n\"A few days back, when Ekta had gone to visit a temple in Juhu, Singh followed her there also and tried to approach her but was caught by her personal guards and he was warned to stay away from her.\"\nThankfully, he was arrested on Monday night after a complaint of stalking was lodged against him.\n\"We have registered the complaint under section 354 (D) of the Indian Penal Code and with the help of CCTV and some technical evidences the accused was traced from Andheri west Veera Desai road. The case is under investigation,\" the official added.\nWhile celebrities try to make their social media accounts more and more personal, sometimes revealing too many details about their personal life can backfire and how!", "title": "A Cab Driver Turns Stalker To Harass And Follow Ekta Kapoor For Roles, Gets Arrested!", "date_publish": "21/03/2019, 11:10:03", "description": "Social media has reduced the distance between people and all of us are utilizing it well but we can't deny the very fact that there are multiple cons of it too. Celebrities have to face a lot of trolling online and sometimes, thing turn into a nightmare for some.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/a-cab-driver-turns-stalker-to-harass-and-follow-ekta-kapoor-for-roles-gets-arrested-364069.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ekta_kapoor_1553147015_800x420.jpg"}