{"text": "She has been fond of Kareena Kapoor Khan since her childhood, but little did she know that she will be her step mother soon. Sara Ali Khan doesn’t refer to Kareena as “choti maa” or “Kareena aunty”, they are more like good friends. On her dad Saif’s and Kareena’s wedding, it was her mother who dressed her up. Their family equation might seem complex to outsiders, but they are quite comfortable with this unique bond.\nBe it Saif, Kareena, Sara or Amrita Singh – they all speak so well of each other in public glare. In a recent interview with Filmfare, Sara Ali Khan once again opened up about how big a fan of Kareena she has been. She has been fan-girling over her especially after her role as Poo in Kabhi Khushi Kabhi Gham, she said.\nOn her asked about Poo being her stepmother, she said, “People tell me you’ve willed this to happen. You have been such a die-hard Kareena fan that you have willed her into your life and this is what you get.”\nKareena Kapoor is the second wife of Sara Ali Khan’s father Saif Ali Khan. Saif divorced his first wife Amrita Singh and tied the knot to Kareena in 2012.\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nEarlier on Koffee With Karan, Sara had said, “Everyone has been clear about their dynamics with me. It has never been confusing. Kareena herself says that ‘look you have a mother and a great one and what I want is for us to be able to be friends.’ My father also never said ‘this is your second mother’ or made it any way uncomfortable.”\nThat’s one modern family, isn’t it?", "title": "A Die-Hard Fan Of Kareena Kapoor, Sara Ali Khan Spills Beans About Having Her As A Stepmother", "date_publish": "22/01/2019, 11:45:31", "description": "She has been fond of Kareena Kapoor Khan since her childhood, but little did she know that she will be her step mother soon. Sara Ali Khan doesn’t refer to Kareena as “choti maa” or “Kareena aunty”, they are more like good friends. On her dad Saif’s and Kareena’s wedding, it was her mother who dressed her up. Their family equation might seem complex to outsiders, but seemingly, they are quite comf", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/a-die-hard-fan-of-kareena-kapoor-sara-ali-khan-spills-beans-about-having-her-as-a-stepmother-360813.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/a_diehard_fan_of_kareena_kapoor_sara_ali_khan_spills_beans_about_having_her_as_a_stepmother_1548138394_800x420.jpg"}