{"text": "A Full House And A Standing Ovation: 'Mard Ko Dard Nahi Hota' Is Winning Hearts All Over!\nA Full House And A Standing Ovation: 'Mard Ko Dard Nahi Hota' Is Winning Hearts All Over!\nA lot of good films come to notice only when we hear the buzz around it from social media. Filmmaker Vasan Balas \"Mard Ko Dard Nahi Hota\" premiered in India at the 20th Jio MAMI Mumbai Film Festival and went on to get a standing ovation from the audience and members of the fraternity.\nAfter its grand success at the Toronto International Film Festival the film featuring Abhimanyu Dassani, Radhika Madan, Gulshan Devaiah, Mahesh Manjrekar and Jimit Trivedi, which will travel to a few more countries is set to release next year.\n\"Mard Ko…\" was the opening film for the festival on Friday and was a total sell out.\nProducer Ronnie Screwvala who felt quite wild and wacky after hearing the story, said,\n\"I knew that if anyone can pull it off, Vasan can. Though we planned to release in November, but now after this response, we will make it next year.\"\nWe’re about to begin! Gates opening soon for our opening film “Mard Ko Dard Nahi Hota” and the excitement’s palpable. #ItHappenedAtMAMI #JioMAMIwithStar2018 pic.twitter.com/x48VjJwAHn — JioMAMIwithStar (@MumbaiFilmFest) October 26, 2018\nThe story revolves around a young boy played by Abhimanyu, who makes an unusual debut in Bollywood. He said: \"I really wanted to be part of what Bala was preparing to make. When he narrated the story I was blown away.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nBala said,\n\"Radhika had to be smuggled out of 'Laila Majnu'. As at that time, casting of 'Laila Majnu' and 'Student Of The Years 2' was going on, and I had no options left.\"\nThe 20th Jio MAMI will end on November 1.\n(With agency inputs)", "title": "A Full House And A Standing Ovation: 'Mard Ko Dard Nahi Hota' Is Winning Hearts All Over!", "date_publish": "27/10/2018, 15:49:13", "description": "Filmmaker Vasan Balas \"Mard Ko Dard Nahi Hota\" which premiered in India at the 20th Jio MAMI Mumbai Film Festival got a standing ovation from the audience and members of the fraternity. After its grand success at the Toronto International Film Festival the film featuring Abhimanyu Dassani, Radhika Madan, Gulshan Devaiah, Mahesh Manjrekar and Jimit Trivedi.", "authors": [], "url": "https://www.indiatimes.com/entertainment/a-full-house-and-a-standing-ovation-mard-ko-dard-nahi-hota-is-winning-hearts-all-over-355573.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/mard_ko_dard_nahi_hota_1540638329_800x420.jpg"}