{"text": "A ‘Huge Advocate’ For LGBTQI Rights, Sonam Kapoor Hopes To See The World Without Labels One Day\nA ‘Huge Advocate’ For LGBTQI Rights, Sonam Kapoor Hopes To See The World Without Labels One Day\nBreaking stereotypes, Sonam Kapoor is playing the role of a lesbian character in her next film Ek Ladki Ko Dekha Toh Aisa Laga. With the entire nation celebrating decriminalisation of homosexuality, the movie is perfectly timed.\nA strong supporter of LGBTQI rights, Sonam Kapoor says she is a strong supporter of basic human right – the right to be themselves.\nActress Sonam K Ahuja says she is a \"huge advocate\" for LGBTQI rights, and hopes to see a world without labels one day.\n\"I'm a huge advocate for LGBTQI (Lesbian, gay, bisexual, transgender, queer and intersex). For me, it is one of the most important things that I fight for and I hope for when there is a country and a world without labels,\" Sonam said in a statement.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nYoutube\n\"I'm very happy and proud that India has taken a step forward and people can live and love the way they want to love and that's very important to me. And I think it should be very important to everybody in this world,\" added the actress.\nSonam expressed her views on the issue in an episode of \"Koffee with Karan\" season 6. She joined the chat show with her sister Rhea and brother Harshvardhan. The episode will air on Star World on Sunday.\nYoutube\nOn the work front, Sonam will also be bringing the complexities of being a homosexual in India with her film \"Ek Ladki Ko Dekha Toh Aisa Laga\". A Fox Star Hindi project, the film also features Anil Kapoor, Rajkummar Rao, Juhi Chawla, Abhishek Duhan, Seema Pahwa and Brijendra Kala.\nDirected by Shelly Chopra Dhar, it is co-produced by Vidhu Vinod Chopra and Fox Star Studios. It will release on February 1 next year.", "title": "A ‘Huge Advocate’ For LGBTQI Rights, Sonam Kapoor Hopes To See The World Without Labels One Day", "date_publish": "30/12/2018, 14:04:38", "description": "Breaking stereotypes, Sonam Kapoor is playing the role of a lesbian character in her next film Ek Ladki Ko Dekha Toh Aisa Laga. With the entire nation celebrating decriminalisation of homosexuality, the movie is perfectly timed. A strong supporter of LGBTQI rights, Sonam Kapoor says she is strong supporter of basic human right – the right to be themselves.", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood/a-huge-advocate-for-lgbtqi-rights-sonam-kapoor-hopes-to-see-the-world-without-labels-one-day-359509.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/actress_sonam_k_ahuja_1546157095_800x420.jpg"}