{"text": "A Movie On 26/11 Martyr Major Sandeep Unnikrishnan Is On The Cards, Mahesh Babu To Produce It\nA Movie On 26/11 Martyr Major Sandeep Unnikrishnan Is On The Cards, Mahesh Babu To Produce It\nPopular Telugu actor Mahesh Babu is foraying into production with the film titled Major. The movie will be based on based on the life of Major Sandeep Unnikrishnan, a National Security Guards (NSG) commando who lost his life while saving several hostages from the deadly 26/11 attack. The movie will be released in 2020.\nProminent young actor Adivi Sesh will play the lead. Sesh has also written the film, which will be directed by Goodachari director Shashikiran Tikka. The film is co-produced by Adivi Entertainment and Sharath Chandra and Anurag Reddy's A+S Movies. The production and distribution studio in India and Telugu superstar Mahesh Babu's production house G Mahesh Babu Entertainment (GMB) have closed a deal to produce Major - a Hindi and Telugu bi-lingual film, read a statement.\nThe deal marks Sony Pictures' entry into the Telugu film industry as it expands its regional footprint, as well as GMB's entry into Hindi cinema.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES 151 SHARES 185 SHARES\nLaine Kline, Executive Vice President and Head, Sony Pictures International Productions, added: \"'Major' is a powerful story that will not just inspire Indians but will transcend boundaries. We couldn't have asked for a more inspiring story for our first foray into the Telugu film industry.\"\nVivek Krishnani, Managing Director, Sony Pictures Entertainment in India, added: \"We are excited to partner with Mahesh and Namrata who are such creative forces and are equally thrilled to welcome them in the Hindi film industry.\"\nNamrata Shirodkar Ghattamaneni, Managing Director at G Mahesh Babu Entertainment, said: \"We are excited to be able to tell such a unique and original story about a national hero's life. The honesty of Sesh and Sashi's vision for 'Major's story echoed with us and in Sony Pictures we found the right partners to bring the incredible story on the big screen not only for a Pan-Indian audience, but an international one.\"\nThe shooting will start later this year and it is scheduled to release in 2020.\nWith inputs from IANS", "title": "A Movie On 26/11 Martyr Major Sandeep Unnikrishnan Is On The Cards, Mahesh Babu To Produce It", "date_publish": "28/02/2019, 17:16:37", "description": "Popular Telugu actor Mahesh Babu if foraying into production with the film titled Major. The movie will be based on based on the life of Major Sandeep Unnikrishnan, the brave-heart who saved several hostages from the deadly 26/11 attack. The movie will be released in 2020. A film titled \"Major\", based on the life of Major Sandeep Unnikrishnan, a National Security Guards (NSG) commando who lost his", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood/a-movie-on-26-11-martyr-major-sandeep-unnikrishnan-is-on-the-cards-mahesh-babu-to-produce-it-362951.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/major_sandeep_unnikrishnan_1551354601_800x420.jpg"}