{"text": "A Plea Has Been Filed In The Delhi HC Seeking Ban On Trailer Of ‘The Accidental Prime Minister’\nA Plea Has Been Filed In The Delhi HC Seeking Ban On Trailer Of ‘The Accidental Prime Minister’\nThe year hasn't even begun properly and Bollywood films have already started courting controversies and ban. A petition seeking a ban on trailer of \"The Accidental Prime Minister\" was filed in the Delhi High Court, a lawyer said on Saturday.\n\"The film producers had no authority to violate the mandate of the Constitution of India which provides respect towards constitutional functionaries,\" the petition said.\nTwitter\n\"It seems filmmakers and producers have made an attempt to make commercial gains. The acts of impersonation have been committed deliberately to defame the office of the Prime Minister to hype the excitement among the prospective viewers,\" it added.\n\"The Accidental Prime Minister\" is based on the book of the same name by Sanjay Baru, Manmohan Singh'a media advisor when he was the Prime Minister. Actors Anupam Kher and Akshay Khanna play lead roles in the film.\ninstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe plea was filed by a Delhi-based fashion designer. The petitioner said the trailer violated Section 416 of the Indian Penal Code as impersonation of a living character or persons is impermissible in law.\nThe petitioner has requested the court to issue directions to the Centre, Google, Youtube and Central Board of Film Certification (CBFC) to take steps to stop the exhibition, display of trailer of 'The Accidental Prime Minister'.\n(With IANS inputs)", "title": "A Plea Has Been Filed In The Delhi HC Seeking Ban On Trailer Of ‘The Accidental Prime Minister’", "date_publish": "06/01/2019, 12:04:04", "description": "A petition seeking a ban on trailer of \"The Accidental Prime Minister\" was filed in the Delhi High Court, a lawyer said on Saturday. \"The film producers had no authority to violate the mandate of the Constitution of India which provides respect towards constitutional functionaries,\" the petition said.", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood/a-plea-has-been-filed-in-the-delhi-hc-seeking-ban-on-trailer-of-the-accidental-prime-minister-359927.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/the_accidental_prime_minister_1546756716_800x420.jpg"}