{"text": "A Satisfying Video of Shah Rukh Khan Enjoying Pani-Puri Is Making The Internet Really Happy!\nA Satisfying Video of Shah Rukh Khan Enjoying Pani-Puri Is Making The Internet Really Happy!\nShah Rukh Khan's birthday was an eventful day. From launching the trailer to throwing a bash for his team, King Khan's schedule was jam-packed.\nAgencies\nThe superstar turned 53rd and following the yearly ritual of cutting the cake with the video and interacting, he did the same this year too. But a delightful change that people are loving is how SRK gorged on to some local pani puri.\nAgencies\nAfter launching the trailer, SRK enjoyed pani puri and the video is making everyone happy.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nAnd people couldn't stop gushing.\nScreengrab\nThat was not all. SRK also threw a birthday bash but curtains had to be drawn on late-night after the Mumbai Police knocked the doors of the venue. The 'Zero' actor hosted a party for his close friends from Bollywood at a popular Mumbai restaurant in Bandra, which was going on till 3 am with loud music. While the restaurant shut for the general public at 1 am, it remained open for Shah Rukh Khan's private party. The party had to be stopped after Mumbai Police interrupted the celebration and asked the owners to shut the party.\n(With IANS inputs)", "title": "A Satisfying Video of Shah Rukh Khan Enjoying Pani-Puri Is Making The Internet Really Happy!", "date_publish": "03/11/2018, 15:55:57", "description": "The superstar turned 53rd and following the yearly ritual of cutting the cake with the video and interacting, he did the same this year too. But a delightful change that people are loving is how SRK gorged on to some local pani puri. Just another day in the life of Bollywood's King Khan.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/a-satisfying-video-of-shah-rukh-khan-enjoying-pani-puri-is-making-the-internet-really-happy-355984.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/srk_1541240984_800x420.jpg"}