{"text": "A Video Of A BSF Jawan Singing 'Sandese Aate Hai' From 'Border' Is Winning Hearts On The Internet\nA Video Of A BSF Jawan Singing 'Sandese Aate Hai' From 'Border' Is Winning Hearts On The Internet\nWe as millennial might cry and crib about our 9 to 5 jobs but there are people with real issues, who are working day and night to protect their nation.\nOur jawans at the border risk their lives every day to ensure that we are safe. They are not just away from their families but it's their own group of people and fellow jawans, who make their lives bearable.\nAgencies / Image for representational purpose only\nToday, a video of a BSF Jawaan singing a patriotic song of the '90s is going viral on the internet and for all the right reasons.\nA video shared on Twitter has a BSF jawan singing a song titled 'Sandese Aate Hai' from 'Border'. The video is special also because all his other friends are clapping and rooting for him as he sings.\nDon't Miss 3.9 K SHARES 6.8 K SHARES 6.8 K SHARES 1.5 K SHARES 1 K SHARES\nThis is truly one of the most special things on the internet today. Watch now!\nHe has already garnered fans on Twitter who want him to apply in Indian Idol. Take a look.\ni got goosebump while listening to him...so beautifully he sang that song.. — Sunil Kumar Nayak (@fabsunil) January 12, 2019\nHe would be the TRUE one and his co brothers to have FELT each words they sang! Vande Mataram! — Venky (@Venky3812) January 11, 2019\nTry in Indian Idol , very good voice. Grand Salute to all Security forces — Makeadvice 🇮🇳 (@Makeadvice1) January 11, 2019\nWOW !! Lovely and Beautiful voice, better than compare to most Bwood playback singers too !!! — Navin Srivastava (@navinks) January 11, 2019", "title": "A Video Of A BSF Jawan Singing 'Sandese Aate Hai' From 'Border' Is Winning Hearts On The Internet", "date_publish": "13/01/2019, 15:14:21", "description": "A video shared on Twitter has a BSF jawan singing a song titled 'Sandese Aate Hai' from 'Border'. The video is special also because all his other friends are clapping and rooting for him as he sings. This is truly one of the most special things on the internet today. Watch now!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/a-video-of-a-bsf-jawan-singing-sandese-aate-hai-from-border-is-winning-hearts-on-the-internet-360343.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bsf_1547372785_800x420.jpg"}