{"text": "It's wedding time for Ambani's again!\nThe celebrations for Akash Ambani and Shloka Mehta kick-started on February 20 with a Dandiya night. For the event Gujarati folk singer Falguni Pathak was invited to perform for the guests and the celebrations happened at industrialist Mukesh and Nita Ambani’s residence Antilia.\nIsntagram\nAnd now, the second round of celebrations have begun!\nInside Shloka-Akash's Swiss Celebrations:\nInstagram\nAccording to reports by several wedding portals, multiple venues have been booked to accomodate 300 plus guests. Hotels that have been booked are: Badrutt’s Palace Hotel, Kulm Hotel St. Moritz and Grand Hôtel des Bains. To accommodate and welcome their friends from the film industry and other close friends and relatives, Mukesh Ambani had reportedly booked uber-luxurious private jets. The guests were flown down directly to the Alpine resort.\n#AkuStoleTheShlo:\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nA-listers from the film fraternity are currently enjoying the celebrations at the luxury Alpine resort town of St. Mortiz for a three-day bash.\nAlia Bhatt-Ranbir Kapoor, Vidya Balan, Arjun Kapoor-Malaika-Arora, Aishwarya Rai Bachchan and Abhishek Bachchan, Karisma Kapoor, Karan Johar are just a few names among several others so who left Mumbai to attend the festivities.\nThe pictures and videos from the festivities are on the internet and it proves that Ambani's surely know how to celebrate life and love! Here's a closer look at the celebrations.", "title": "A Winter Wonderland: Inside Akash Ambani-Shloka Mehta's Pre-wedding Swiss Celebrations", "date_publish": "26/02/2019, 12:54:18", "description": "A-listers from the film fraternity are currently enjoying the celebrations at the luxury Alpine resort town of St. Mortiz for a three-day bash.Alia Bhatt-Ranbir Kapoor, Vidya Balan, Arjun Kapoor-Malaika-Arora, Aishwarya Rai Bachchan and Abhishek Bachchan, Karisma Kapoor, Karan Johar are just a few names among several others so who left Mumbai to attend the festivities.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/a-winter-wonderland-inside-akash-ambani-shloka-mehta-s-pre-wedding-swiss-celebrations-362811.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/akash_and_shloka_1551166201_800x420.jpg"}