{"text": "Aamir Chooses Mahabharat Over Saare Jahan Se Accha, Says He’s Happy SRK Is Doing The Film Instead\nAamir Chooses Mahabharat Over Saare Jahan Se Accha, Says He’s Happy SRK Is Doing The Film Instead\nActor Aamir Khan shares a very friendly and close bond with writer Anjum Rajabali and actor Shah Rukh Khan, has said he is really happy that Shah Rukh Khan is doing space film Saare Jahaan Se Accha being written by Anjum Rajabali.\nNot many know, Aamir Khan and writer Anjum Rajabali had earlier collaborated in Ghulam and Aamir Khan was supposed to be a part of Saare Jahaan Se Achha which is based on Indian astronaut Rakesh Sharma.\nAgencies\nAfter Aamir Khan backed out of the film, Shah Rukh Khan will feature in it. Talking about it, Aamir said,\nTwitter\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\n“I think it’s a great and wonderful script. I am a huge fan of Rakesh (Sharma) and it’s a wonderful story. I feel sad that I am not able to do it, which is why I actually called up Shah Rukh and said that it’s a wonderful story and you should hear it’. I am really happy that he liked it and he is doing it so, all my best wishes for their project.”\nSaare Jahaan Se Accha, will be directed by Mahesh Mathai and written by Anjum Rajabali. Ronnie Screwvala will produce the film, along with Siddharth Roy Kapur, under the RSVP films and Roy Kapur Films banners respectively.\nAgencies\nThere were multiple reports that claimed that Bhumi Pednekar has been signed opposite Shah Rukh in the film, but Screwvala recently told media that an official announcement on casting will be made soon.\n(With agency inputs)", "title": "Aamir Chooses Mahabharat Over Saare Jahan Se Accha, Says He’s Happy SRK Is Doing The Film Instead", "date_publish": "27/11/2018, 15:44:36", "description": "Aamir Khan chooses Mahabharat over Saare Jahan Se Accha, says he’s happy Shah Rukh Khan is doing the film instead Saare Jahan Se Accha is the biopic on first Indian man in space, Rakesh Sharma. Aamir Khan gave up the project which later went to Shah Rukh Khan.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aamir-chooses-mahabharat-over-saare-jahan-se-accha-says-he-s-happy-srk-is-a-part-of-it-357476.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_and_srk_1543314443_800x420.jpg"}