{"text": "A lot of A-listers have tried their luck with television but a very few managed to strike the right chords with the audience. One actor, who managed to leave a meaningful impact and create a difference with Television is Aamir Khan.\nAamir Khan's Satyamev Jayate was a show that en-cashed his star-power in an apt manner to raise awareness around some of the least talked-about but relevant social causes.\nAgencies\nBut what went behind making of the show that went on to become a successful show? Well, not many know that the show took a toll on Aamir's mental health. In a recent interview with PTI, Aamir Khan revealed that filming his talk show Satyamev Jayate was such a “traumatic” experience for him he had to consult a doctor by the end of the first season.\nJust to jog your memory a little, the show focuses on sensitive social issues prevalent in the country, from female foeticide, child sexual abuse to honour killings.\nA PTI report quoted the Dangal actor as saying,\nTwitter\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Going through that entire journey of the first season was very traumatic for me. To the extent, I had become emotionally very brittle, I was in very bad shape. At the end of the one year, I could not go out. For absolutely no reason at all, I would just break down.\"\nKhan further added that it troubled him more as he isn’t trained in distancing himself while listening to people’s emotional turmoil. He adds,\nAgencies\n“I was an emotional wreck. I also got some help from a doctor. It was just very... (tough) because I am not trained to listen to emotional issues of people and keep a distance. I am not able to do that.”\nRecalling one of the guests on Satyamev Jayate narrated how he lost his son in a road rage, where he was beaten to death, Aamir said he couldn’t help but think of his son Junaid. Confessing his insecurities and fear as a father, he added,\n“I was thinking what if someone does that to my son, how will I feel? I used to always put myself in that person’s shoes. As a result it took a big toll on me emotionally.”\nHowever, he added that the talk show made him a better person.\nAgencies\n“I saw the country and people in a way I had never seen because I’ve lived a very sheltered life. It was an enriching journey for me. I learnt a lot and met some amazing persons who made me grow as an individual.”\nAamir spoke about the same at a session ‘Giving Matters’ at NASSCOM Technology and Leadership Forum.\n(With PTI inputs)", "title": "Aamir Khan Admits Taking Medical Help For Being An 'Emotional Wreck' Post 'Satyamev Jayate'", "date_publish": "23/02/2019, 11:33:30", "description": "Took doctor’s help to stop being an emotional wreck post Satyamev Jayate, confesses Aamir Khan Aamir Khan said the shooting and working on Satyamev Jayate took an emotional toll on him and he needed the doctor’s help to recover. Read more right here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aamir-khan-admits-taking-medical-help-for-being-an-emotional-wreck-post-satyamev-jayate-362632.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/aamir_khan_1550901031_800x420.jpg"}