{"text": "On one hand, sexual harassment allegations are pouring out on social media in abundance against the rich and the powerful, and on the other, celebrities are standing in unison to protest against sexual predators.\nHrithik Roshan had recently revealed that he doesn’t wish to work with someone who has been accused of misconduct or harassment. Following which, director Vikas Bahl, who was accused of sexual harassment by a former employee of Phanton Films, was reportedly kicked out of Super 30.\nAlso Read: Vikas Bahl Likely To Be Fired From 'Super 30' After Hrithik Roshan Hints He Won’t Work With Him\nMAMI film festival has also dropped AIB’s Chintu Ka Birthday and Rajat Kapoor's Kadakh from the line-up.\nAlso Read: Amid Sexual Harassment Claims, Mumbai Film Festival Drops Rajat Kapoor's Film Kadakh & AIB From Their Line-up\nAFP\nYesterday, Aamir Khan also announced his departure from upcoming project saying that he has been informed of “sexual misconduct” on the part of a collaborator.\nThe case in point is Aamir's forthcoming film Mogul, which is a biopic on Gulshan Kumar. Reportedly, director of the movie, Subash Kapoor, was accused of allegedly molesting a woman by an actress in 2014.\n@TyagiGeetika more power to you. May this end the mental suffering that you've been going through ever since. — Atul Sabharwal (@sabharwalatul) February 18, 2014\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nSubhash Kapoor, on the entire incident, says that he respects Aamir Khan for his decision, and he will prove his point in the court of law.\n“I understand and respect Aamir Khan’s and Kiran Rao’s decision. Since matter is subjudice, I intend to prove my innocence in the court of law. But I do want to raise a question – is secretly filming a crying woman without her consent and knowledge and uploading it on social media not harassment or abuse? Or is it fine if she is related to someone who is “accused” of a misconduct. If your answer is latter then for me it’s nothing less than a khaap panchayat mentality,” he said as quoted by Indian Express.\nAnd now, Ekta Kapoor has also cut all professional ties with the director. According to a report in Mid-day, Ekta has sacked Subhash as the showrunner of her forthcoming web series, The Verdict.\n\"After Ekta came on board as one of the core committee members of the Producers' Guild that aims to address the issue of sexual harassment at workplace, it was brought to her notice that Subhash has an ongoing case against him. Ekta immediately decided to remove him from the show.\" Director Shashwat Shah will manage the production in view of the latest development. \"A new showrunner will be brought on board soon,\" a source revealed to the publication.", "title": "Aamir Khan Opts Out Of Gulshan Kumar Biopic Due To Sexual Abuse Allegations Against Director", "date_publish": "11/10/2018, 12:11:52", "description": "Aamir Khan also announced his departure from upcoming project saying that he has been informed of “sexual misconduct” on the part of a collaborator. The case in point is his forthcoming film Mogul, which is a biopic on Gulshan Kumar. Reportedly, director of the movie, Subash Kapoor, was accused of molesting a woman by an actress in 2014.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-opts-out-of-gulshan-kumar-biopic-due-to-sexual-abuse-allegations-against-director-354578.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/aamir_khan_opts_out_of_gulshan_kumar_biopic_post_sexual_misconduct_allegations_against_director_1539239756_800x420.jpg"}