{"text": "Aamir Khan Asked SRK If He Can Smoke In Front Of Amitabh Bachchan, His Answer Was Hilarious!\nAamir Khan Asked SRK If He Can Smoke In Front Of Amitabh Bachchan, His Answer Was Hilarious!\nWhen it comes to Amitabh Bachchan, not just commoners even Bollywood stars get starstruck or rather intimidated by him. Well, Aamir Khan too was extremely nervous while working with him for the first time in Thugs Of Hindostan. He was concerned about a lot of things including whether he can smoke on sets when Amitabh Bachchan is around or not.\nTwitter\nSo, Aamir went to the right person who could guide him, and that person was none other than Shah Rukh Khan. SRK has done a couple of films with the megastar and so his buddy Aamir decided to seek his advice.\nIn an interaction with us, Aamir revealed he had gone to meet SRK only to ask whether he smokes in front of Amitabh Bachchan or not and his answer and advice to him was hilarious.\nDon't Miss 343 SHARES 814 SHARES 555 SHARES 144 SHARES 263 SHARES\nAamir narrates, \"I smoke, but I was worried if I can smoke in front of Amit ji, so I decided to meet Shah Rukh, I went to meet him and asked , ‘Shah, Do you smoke in front of Amit ji?’. He said, ‘ Yes, there is no problem, I smoke in front of him.’ I asked him, “Did you ever asked him, ‘he is like, No, but he hasn’t stopped me ever’, I questioned him, what if he tells me anything on smoking. He then suggested, “ Pehli din tu thodha door se pee, uske baad thodha thodha nazdik jaa, go smoothly”.\nTwitter\nAamir even revealed how this conversation between him and SRK reached to Amit ji, thanks to photographer Avinash Govarikar,\n“One day after shooting in Malta I went to Amit ji and asked him if we can go and watch a movie together. While walking towards the theatre, he said, “ Aamir, I heard you went to Shah Rukh and asked whether you can smoke in front of me”. I said, ‘Who told you this?’. He said, Avinash, I immediately asked, ‘Sir, what’s your answer’, he said, ‘ you can smoke in front of me, but it’s not good for your health’. I then asked him, sir, you smoke? He said, ‘Yes, I do’ ”.\nCould it get more hilarious than this?\nTwitter\nAamir and Amitabh Bachchan will be seen together on the silver screen for the very first time in Thugs Of Hindostan. It also features Katrina Kaif and Fatima Sana Shaikh in the pivotal roles. The film will be releasing on this Diwali, November 7, 2018.", "title": "Aamir Khan Asked SRK If He Can Smoke In Front Of Amitabh Bachchan, His Answer Was Hilarious!", "date_publish": "05/11/2018, 13:52:42", "description": "When it comes to Amitabh Bachchan, not only layman even Bollywood stars get nervous or rather intimated by him. Well, Aamir Khan too was extremely nervous by Mr. Bachchan as he was working with him for the first time in Thugs Of Hindostan. He was concerned of a lot of things to work with him including if he can smoke on sets when he is around.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-asked-srk-if-he-can-smoke-in-front-of-amitabh-bachchan-his-answer-was-hilarious-356076.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shah_rukh_khan_1541404408_800x420.jpg"}