{"text": "1. 9 Reasons Why Aamir Khan Is A Trendsetter Who Wrote His Own Rules & Inspired Others To Follow\nAamir Khan - this is one name in the industry that carries a lot of weight. An inspiration to fellow actors and commoners alike, Aamir is someone who is respected by people of all age groups. Why you ask? Well, he is one person who believes in giving his all to everything he picks, movie or a social cause, he believes in giving his 100 percent or even more, if that’s possible.\n2. Troll Calls Arbaaz Khan ‘Khula Saand’ After Divorce & He Agrees, Says There’s Some Truth In It!\n“Arre bhai, 21 years ka relationship khatam hua. Kuch hadd tak iski baaton mein sachchai hai isliye mujhe bura bhi nahi laga. Ek time aa gaya tha, after making my efforts at reconciliation or whatever...We both tried, didn't happen. After a time, I had to move on in life,” he said.\n3. Akshay Kumar Felt Ashamed Of Doing Similar Roles, Says Reinventing Himself As An Actor Was Fun\n“There was a time in my career when I used to feel ashamed of myself because I was doing similar kind of films which involved action. So once I got opportunity to dabble into various genres, I started enjoying my work. Since the last 12 years, I have got a chance to keep on changing my image as an actor. So, I feel it is not a tough thing for me.”\nDon't Miss 389 SHARES 468 SHARES 174 SHARES\n\"The day of this photoshoot, I was so weakened by an abusive relationship. I was emaciated, severely depressed, and could barely stand. I fell into a pool of tears and was sent home for the day,\" she said.\n5. South Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of Women\n\"I filmed women without their consent and shared it in a chatroom, and while I was doing so I didn't feel a great sense of guilt,\" he added in a statement released late Tuesday (Mar 12).", "title": "Aamir Khan Turns 54, Troll Calls Arbaaz Khan ‘Khula Saand’ After Divorce & More From Ent", "date_publish": "14/03/2019, 18:17:35", "description": "Aamir Khan - this is one name in the industry that carries a lot of weight. An inspiration to fellow actors and commoners alike, Aamir is someone who is respected by people of all age groups. Why you ask? Well, he is one person who believes in giving his all to everything he picks, movie or a social cause, he believes in giving his 100 percent or even more, if that’s possible.", "authors": [], "url": "https://www.indiatimes.com/entertainment/aamir-khan-turns-54-troll-calls-arbaaz-khan-khula-saand-after-divorce-more-from-ent-363737.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/aamir_khan_turns_54_troll_calls_arbaaz_khan_khula_saand_after_divorce__more_from_ent_1552566031_800x420.png"}