{"text": "Foes turned friends Aamir Khan and Shah Rukh Khan share a good camaraderie. So much so, that when Aamir Khan was offered Rakesh Sharma biopic, he called up Shah Rukh Khan to take up the role because he thought he would fit in the role better.\nAlso Read: On Failing To Meet Him, Die-Hard Shah Rukh Khan Fan Slits His Throat Outside The Actor’s House\nReportedly titled Saare Jahaan Se Achcha, the film was first offered to Aamir and Priyanka Chopra. It was Priyanka who had confirmed Aamir's name for the biopic earlier. When asked the reason of giving up the project, Aamir said he had his reasons.\n\"It is a great script. I loved the script and the story of Mr Sharma is fascinating. It is true that I called up Shah (Shah Rukh). I said, 'Shah you should hear the script, it is fantastic. It will be right for you, if you like it' I am glad he liked the script and he is doing it,\" he said in an interview here.\ninstagram\nDon't Miss 468 SHARES 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES\nMahesh Mathai will direct the film from Anjum Rajabali's script. The film will be produced by Siddharth Roy Kapur and Ronnie Screwvala under their banners Roy Kapur Films and RSVP Films, respectively. There were reports that Bhumi Pednekar has been signed opposite Shah Rukh in the film, but Screwvala recently told PTI that an official announcement on casting will be made soon. The makers will start work on the biopic early next year.\nYoutube\nRecently, Shah Rukh revealed Salman Khan suggested his name for Zero. The film was initially offered to Salman. And Aamir believes this is how things should work in the film industry where actors suggest each other's name for respective projects.\n\"... I am certainly not competitive and I have not felt that with Shah Rukh and Salman,\" he added.\nAamir's next is Thugs of Hindostan, in which he stars with Amitabh Bachchan, Katrina Kaif and Fatima Sana Sheikh. The film is slated to release on November 8.\nWith inputs from PTI", "title": "Aamir Khan Recommended Shah Rukh Khan's Name When He Was Offered Astronaut Rakesh Sharma's Biopic", "date_publish": "05/11/2018, 12:47:42", "description": "Foes turned friends Aamir Khan and Shah Rukh Khan share a good camaraderie. So much so, that when Aamir Khan was offered Rakesh Sharma biopic, he called up Shah Rukh Khan to take up the role because he thought he would fit in the role better, he revealed recently.", "authors": [], "url": "https://www.indiatimes.com/entertainment/aamir-khan-recommended-shah-rukh-khan-s-name-when-he-was-offered-astronaut-rakesh-sharma-s-biopic-356059.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shah_rukh_khan_1541397295_800x420.jpg"}