{"text": "When it comes to being determined for a role and giving all it takes, no one is as sincere as Aamir Khan. He knows how to get into the skin of the characters. Be it losing or gaining weight, Aamir has always surprised and won hearts with his drastic transformations.\nBe it Ghajini or Dangal, Aamir's determination has always won our respect. At a recent media interaction, Aamir was quizzed by the media about what he does when he attends lavish parties. Aamir had an interesting anecdote to share. Talking about it, Aamir said,\nTwitter\n\"I carry my own tiffin. If you ever meet Shah Rukh ask him about it, he will tell you an interesting story. When Tim Cook visited SRK's home, he invited all of us for dinner. Gauri (Khan) told me to have dinner and I told her I will definitely eat and go. She went on to say dinner is served, so I replied 'I have got my own tiffin'.\"\nHe added that when his diet food was served, everyone was taken aback by the quantity.\nTwitter\nHe added that SRK cracked a joke saying he was confused whether Aamir is gaining weight or losing it. This incident happened when he was prepping for Dangal.\nDon't Miss 468 SHARES 343 SHARES 555 SHARES 263 SHARES 449 SHARES\nAamir added that since he is always prepping for some or the other role, he prefers to carry his own meals in tiffin boxes.\nNot many know that for his upcoming film Lal Singh Chaddha, Aamir will lose 20 kgs.\n(Image credits: Pinterest)", "title": "Aamir Khan:Aamir Khan Has A Funny Take On Why He Refused To Eat At SRK's House Party!", "date_publish": "28/03/2019, 12:41:02", "description": "He added that SRK cracked a joke saying he was confused whether Aamir is gaining weight or losing it. Aamir revealed that after seeing his food Shah Rukh asked him if he was gaining weight or losing it. This incident happened when he was prepping for Dangal.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aamir-khan-shares-a-funny-anecdote-about-refusing-to-eat-food-at-shah-rukh-khan-s-house-party-364455.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shah_rukh_khan_1553755241_800x420.jpg"}