{"text": "Thugs of Hindostan’s failure at the box office was perhaps one of the major highlights of the year 2018 – of course, after #MeToo.\nWho would have imagined that this most ambitious project starring Amitabh Bachchan, Mr. Perfectionist Aamir Khan, Katrina Kaif and Fatima Sana Shaikh – that amplified the excitement level of fans for so long – would be shredded to bits in just a few days after its release.\nBecause of the hype around the movie and full-fledged promotions of the movie – that included Aamir Khan’s character coming alive on Google maps instead of the navigation arrow/car – the movie minted Rs 100 crore at the box office in just three days after its release. But soon the negative word of mouth, memes and articles started floating across on social media, and thereafter nothing could save Thugs Of Hindostan from sinking.\nWhen Salman Khan’s Tubelight had failed miserably at the box office, he paid compensation to the distributors.\nIn rare gesture,SalmanKhan to refund approx Rs 35 crore today to distributors & exhibitors as compensation for losses suffered in Tubelight — Komal Nahta (@KomalNahta) August 11, 2017\nDon't Miss 468 SHARES 814 SHARES 555 SHARES 144 SHARES 699 SHARES\nAamir Khan, who was also facing a similar situation, apologised and took all the blame upon himself.\n\"I would like to say that I take full responsibility for Thugs Of Hindostan not working with the audience. I think we went wrong. I would like to take full responsibility for that. You can be sure we tried our level best,” he had earlier said.\nNow, Katrina Kaif has also addressed the elephant in the room. She says she is hurt but disappointment is what wakes you up.\n“I know Aamir has spoken on the matter and it has really hurt deeply and personally. Disappointment is always good as it wakes you up little bit again. In case of 'Thugs…' it was not for lack of trying, something just went wrong in case of 'Thugs of Hindostan'. You need to have guts and urge to try things and be prepared it may or may not work,” she was quoted as saying by PTI.\nTwitter\nIt is also said that Amitabh Bachchan is upset with the makers of Thugs Of Hindostan after they failed to explain the loopholes in the movie to Big B.\nFun Fact: Thugs Of Hindostan was first Amitabh Bachchan’s movie that crossed Rs 100 crore, say reports.\nWe are sure after having tasted failure, Aamir Khan will revive himself in the industry and outshine with yet another film.", "title": "Katrina Kaif:Aamir Khan Said Sorry, Katrina Kaif Is Hurt", "date_publish": "17/12/2018, 14:01:41", "description": "Katrina Kaif has also addressed the elephant in the room. She says she is hurt but disappointment is what wakes you up. Who would have imagined that this most ambitious project starring Amitabh Bachchan, Mr Perfectionist Aamir Khan, Katrina Kaif and Fatima Sana Shaikh – that amplified the excitement level of fans for so long – would be shredded to bits in just a few days after its release.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-said-sorry-katrina-kaif-is-hurt-thugs-of-hindostan-cast-addresses-film-s-failure-358751.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/katrina_kaif_is_hurt__thugs_of_hindostans_cast_addresses_why_it_shredded_to_bits_1545033788_800x420.jpg"}