{"text": "Aamir Khan Is Looking Forward To His Son's Bollywood Debut, Says Junaid Can Even Pull Off His Biopic\nAamir Khan Is Looking Forward To His Son's Bollywood Debut, Says Junaid Can Even Pull Off His Biopic\nAamir Khan is an excited father as he is looking forward to his eldest son Junaid's Bollywood debut.\nWhile Junaid has been someone who has always consciously made an efforts to stay away from the spotlight, not many know that he has been studying acting for a long time.\nTwitter\nAamir Khan had invited journalists on Sunday at his residence in Mumbai to talk about his production venture Rubaru Roshni. Helmed by Svati Chakravarty Bhatkal, the documentary will revolve around three unbelievable and compelling stories of forgiveness.\nAgencies\nTalking to media, Aamir Khan was quizzed about upcoming plans for his son to which he said,\nAgencies\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“He has studied acting and has been doing theatre for more than a year. But I believe in the power of screen test. So Junaid would have to go through the grind and prove himself. As a father, my only advice to him is that he should play leads but only those that are characters. This is a rule I follow and really believe in. More than being a hero, you need to live a character on screen. That’s the joy of acting.”\nHe further added that he's proud of the fact that he has pulled off characters that have managed to stay in the hearts of people. He added,\n“In my three decades in the industry, no fan has ever called out to me by my name in public. It has always been the last character that I have played on screen. I really feel good about it. That shows that my characters have left a mark.\"\nDuring the interaction, Aamir was asked if we will ever get to see a biopic on his life to which he had an interesting reply. Talking about the possibilities of who could reprise his role in his biopic, he took his son Junaid's name. He said, “I think Junaid (his son) can do it. He might be a good choice.”", "title": "Aamir Khan Is Looking Forward To His Son's Bollywood Debut, Says Junaid Can Even Pull Off His Biopic", "date_publish": "28/01/2019, 10:40:47", "description": "Aamir Khan had invited journalists on Sunday at his residence in Mumbai to talk about his production venture Rubaru Roshni. Helmed by Svati Chakravarty Bhatkal, the documentary will revolve around three unbelievable and compelling stories of forgiveness. Talking to media, Aamir Khan was quizzed about upcoming plans for his son.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aamir-khan-is-looking-forward-to-his-son-s-bollywood-debut-says-junaid-can-even-pull-off-his-biopic-361142.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aamir_khan_1548652853_800x420.jpg"}