{"text": "‘Aamir Khan, We Forgive You for Thugs & Dhoom’, Say Fans After Watching ‘Rubaru Roshni’\n‘Aamir Khan, We Forgive You for Thugs & Dhoom’, Say Fans After Watching ‘Rubaru Roshni’\nWhat would you do with a culprit? Seek revenge or get him punished, right? In Aamir Khan’s documentary, families took an unimaginable step. They forgave them.\nTwitter\nOn the 70th Republic Day, Aamir Khan treated fans with a documentary film titled Rubaru Roshni which is produced by Aamir Khan and Kiran Rao. Not long ago, he had disappointed fans with Thugs of Hindostan, but Aamir Khan is back with what he does the best. Winning the audiences over again, Aamir Khan’s Rubaru Roshni gets a big thumbs-up from fans.\nTwitter\nThe tele-short film had three different stories that revolved around forgiveness and forgiving oneself. The movie aired on Star Network in seven languages. It is said that Netflix had approached Aamir Khan to acquire the rights of the movie, but Aamir wanted to reach a wider audience, and hence, chose to release the movie on TV.\nDon't Miss 468 SHARES 282 SHARES 1.1 K SHARES 263 SHARES 12.5 K SHARES\nThe tales of emotion, loss and forgiveness not only had the audiences shook, but it also made them cry.\nIt will move you to tears... #RubaruRoshni — Sandeep (@Sandeep01629728) January 26, 2019\n@aamir_khan #RubaruRoshni is an amazing creation by you and Kiran... Must Watch in Full... Forced to think on Forgiveness... Kabhi nhi socha iss tarah maafi dene ko iss tarah...\nLuv u sir for sonderful creation.... — Nikunj Mohatta (@nikunjmohatta) January 26, 2019\nDrop everything and watch #RubaruRoshni now. The best thing you can do on #RepublicDay2019. It's a must watch. Very very brave. Teaches you forgiveness. Aamir Khan, we forgive you for Thugs of Hindustan — Rashid (@iamrashidaftab) January 26, 2019\n#RubaruRoshni A complex thing expressed so simply, so beautifully. Thank you Svati and @aamir_khan for reminding us of our best selves. A very Happy Republic Day indeed 🙏 — Kausar Munir (@KausarMunir) January 26, 2019\nThank you @aamir_khan sir for giving a gem like #RubaruRoshni not a fan of documentaries but this film made me realise what moving on actually means .... forgiveness is above anything ... it guarantees us mental peace — Aashna (@Aashna_Sh) January 26, 2019\n@aamir_khan thnk u so much for #RubaruRoshni ....I'm very touched and I'm really now believe with what u teach to me via #RubaruRoshni ... I didn't change my tv channel during this documentary ... Thank to dub this in #tamillanguage also ... I spend my time for more valuable — Balavignesh M (@balavignesh_m) January 26, 2019\nThnx sir fr made good though by #rubaruRoshni...sir u r really great person n Ur work spread positivity in world.. really I appreciate Ur hunger for making positive world...🙏 — pankaj (@pankaj1012k) January 26, 2019\nThere is no limit of kindness. Never thought if human hearts can be so big! #RubaruRoshni is a must watch for every humankind on earth. Huge respect for the team for making this beautiful piece and @aamir_khan sir for producing and supporting the film. #Respect #Love — Pradeep Singh (@Prady1092) January 26, 2019\nRubaru Roshni’s “three unbelievable true stories” were helmed by Svati Chakravarthy Bhatkal. In case you missed it, you can watch it on Hotstar for free.", "title": "‘Aamir Khan, We Forgive You for Thugs & Dhoom’, Say Fans After Watching ‘Rubaru Roshni’", "date_publish": "26/01/2019, 18:14:50", "description": "On the 70th Republic Day, Aamir Khan treated fans with a documentary film titled Rubaru Roshni was produced by Aamir Khan and Kiran Rao. Not long ago, he had disappointed fans with Thugs of Hindostan, but Aamir Khan is back with what he does the best. Winning the audiences over again, Aamir Khan’s Rubaru Roshni gets a big thumbs-up from fans.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-we-forgive-you-for-thugs-dhoom-say-fans-after-watching-rubaru-roshni-361100.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aamir_khans_rubaru_roshni_tugs_on_fans_heartstrings__they_just_cant_stop_raving_about_it_1548505561_800x420.png"}