{"text": "Aamir Khan does only one film in a year but it is always a masterpiece which is remembered for years. His movies like 3 Idiots and Dangal had set several records in the nation as well as abroad. However, his recent release Thugs Of Hindostan has failed to work its magic. The movie from the day it was released has received pathetic reviews. So much so, that people are comparing it to Race 3 and Mela.\nAlso Read: Thugs Of Hindostan Open To Pathetic Audience Reviews, Fans Compare The Film To Aamir's Mela!\nYRF\nNevertheless, Aamir Khan's ardent fans are looking forward to what’s in store for them after this. For the uninitiated, Aamir Khan is planning to make a series on Sanskrit epic Mahabharata, which will apparently be made on a budget of Rs 1000 crore and will be bankrolled by Mukesh Ambani, as per reports.\nAlso Read: Rumour Has It, Mukesh Ambani Likely To Produce Aamir Khan’s Rs 1000 Crore Film Mahabharata\nAFP\nWhat’s more? Revealing more information, a source close to the project told Bollywood Hungama that it will be a seven-part web-series. Aamir Khan will reportedly play the role of Lord Krishna in the magnum opus. Each series will have a different director, the report stated.\nDon't Miss 4.3 K SHARES 468 SHARES 447 SHARES 2.1 K SHARES\nRest of the cast of the movie has reportedly been not decided as of yet. The project is going to a big, for sure. Are you all excited?", "title": "Aamir Khan’s Rs 1000 Cr Mahabharata Will Be A 7-Part Series & He’ll Reportedly Play Lord Krishna", "date_publish": "11/11/2018, 12:55:13", "description": "Aamir Khan is planning to make a series on classic Sanskrit epic Mahabharata, which will apparently be made on a budget of Rs 1000 crore and bankrolled by Mukesh Ambani, it is said. What’s more? Revealing more information, a source close to the project told Bollywood Hungama that it will be a seven-part web-series. Aamir Khan will reportedly play the role of Lord Krishna in the magnum opus. Each s", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-s-rs-1000-cr-mahabharata-will-be-a-7-part-series-he-ll-reportedly-play-lord-krishna-356436.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_khans_rs_1000_crore_mahabharata_will_be_a_7part_series_in_which_hell_play_lord_krishna_repo_1541919329_800x420.png"}