{"text": "Aamir Khan Likely To Take Up Gulshan Kumar Biopic After Subash Kapoor Steps Down As Director\nAamir Khan Likely To Take Up Gulshan Kumar Biopic After Subash Kapoor Steps Down As Director\nGulshan Kumar biopic titled Mogul has been making headline since quite a long time now. It all started after director of the movie Subhash Kapoor was accused of assault, in the wake of the #MeToo movement, he had to opt out of the project which was in the pre-production stage.\nTwitter\nAamir Khan had also released a statement that he wouldn’t work with someone who has been accused of sexual harassment and hence chose to step away from the project.\n“As creative people, we have been committed to foregrounding and finding solutions to social issues, and at Aamir Khan Productions we have always had a zero tolerance policy towards sexual misconduct and predatory behaviour of any kind. We strongly condemn any act of sexual harassment, and equally we condemn any and all false accusations in such cases,” Aamir who was also co-producing the movie wrote in a statement.\nRead his entire statement below:\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nNow, as per the reports, since director Subhash Kapoor soon walked out of the project, Aamir Khan will soon join back the project. At the same time, the makers of the movie haven’t yet revealed as to who will replace Subhash as the director of Mogul.\nAlso Read: Aamir Khan Opts Out Of Gulshan Kumar Biopic Due To Sexual Abuse Allegations Against Director", "title": "Aamir Khan Likely To Take Up Gulshan Kumar Biopic After Subash Kapoor Steps Down As Director", "date_publish": "22/10/2018, 16:43:03", "description": "Gulshan Kumar biopic titled Mogul has been making headline since quite a long time now. It all started after director of the movie Subhash Kapoor was accused of assault, in the wake of the #MeToo movement, he had to opt out of the project which was in pre-production stage.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-likely-to-take-up-gulshan-kumar-biopic-after-subash-kapoor-steps-down-as-director-355235.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/after_subhash_kapoor_steps_down_as_director_aamir_khan_is_back_in_gulshan_kumar_biopic_1540206845_800x420.jpg"}