{"text": "Ever since the trailer of Aamir Khan and Amitabh Bachchan-starrer Thugs Of Hindostan has come out, people have been drawing parallels between Aamir Khan’s character Firangi and Captain Jack Sparrow played by Johnny Depp in Pirates of the Caribbean.\nHowever, the movie’s production designer has strongly denied using the reference from the Hollywood movie.\n“It never came to our mind. Our life was much simpler, we know the period, we know the ships. We are talking about Andalusia, we know those ships and people know there are replicas of those ships floating in the water. So... I never take reference from films,” Sumit Basu had told Times Now.\nBut still, as hard as the makers are trying to play it down, Twitter has just refused to believe it. When Aamir Khan was recently asked about the same, he said, he hoped that people forget Jack Sparrow after watching Thugs of Hindostan.\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\n“Intrinsically, they are both similar characters because dono badmaash hai (both are naughty). I personally feel and hope that when you see Firangi then you will forget Jack Sparrow. I don't think Victor wrote it based on Jack Sparrow.”\nAamir Khan said this has been his toughest role so far. Also starring Fatima Sana Shaikh, Thugs of Hindostan is releasing on November 8.", "title": "Aamir Khan Hopes People Will Forget Jack Sparrow After Watching His Character In Thugs Of Hindostan", "date_publish": "05/11/2018, 18:05:47", "description": "Since the time the trailer of Aamir Khan and Amitabh Bachchan starrer Thugs Of Hindostan has released, people have been drawing similarities between Aamir Khan’s character Firangi and Captain Jack Sparrow played by Johnny Depp in Pirates of the Caribbean.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-hopes-people-will-forget-jack-sparrow-after-watching-his-character-in-thugs-of-hindostan-356116.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_khan_hopes_people_will_forget_jack_sparrow_after_watching_his_character_in_thugs_of_hindostan_1541417538_800x420.png"}