{"text": "One of the finest actors in the tinsel town, Aamir Khan is hailed as Mr. Perfectionist. From 3 Idiots to Taare Zameen Par, Aamir Khan has always chosen subjects that strike a chord with the audiences. But did you know the troubled story of eight-year-old dyslexic child Ishaan was the directorial debut of Aamir Khan?\namazon.com\nApart from showcasing his impeccable acting skills, Aamir Khan has often donned a producer’s and director’s hat. And when he did that, he realised, he has an inclination towards filmmaking. Aamir Khan says he would want to become a full-time director, but once he does that, he will quit acting.\ncinestaan.com\n“I am inclined towards filmmaking and I coincidentally directed Taare Zameen Par. I have been in love with filmmaking and acting and I can't alienate the two but what I can say right now is that I began my career as an actor and it excites me. The moment I become a full-fledged filmmaker I will stop acting. Right now, I don't want to stop acting, that's why I am holding back the director inside me,\" Aamir was quoted as saying by PTI.\ncinestaan.com\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAs a producer, Aamir Khan has bankrolled movies including Lagaan, Taare Zameen Par, Jaane Tu Yaha Jaane Na, Peepli Live, Dhobi Ghat, Delhi Belly, Talaash, Dangal and Secret Superstar. He says he doesn’t want to make money but his aim is to support good scripts.\nYouTube\n“I had not thought at what pace I will make films. Usually, people make films with their production houses for business. That is not our first agenda. Creativity is our agenda. Till the time we don't get a good script, we don't make it into a film.”\nyoutube\nAamir Khan is already one of the most sought after actors in Bollywood. When asked if he is looking forward to work in Hollywood, he said he would work in any part of the world if he gets good opportunities.\nvideowave.in\n“For me, as an actor, what is important is what the film is all about and what it is trying to say. It should excite me as an actor. It is not important that it should have a social message. It does not matter which part of the world it originates from. If someone from Japan or Africa offers me something and if I get excited, I will do it. But I don't have a fascination for Hollywood.”\npinimg.com\nAamir Khan had recently announced his next project, an official adaptation of Tom Hanks' 1994 film Forrest Gump. He is also in talks for a Netflix series on spiritual leader Rajneesh, popularly known as Osho, but he said the script has not been finalised yet.", "title": "Aamir Khan Is Looking Forward To Become Full-Time Director, Will Quit Acting Once He Does That!", "date_publish": "16/03/2019, 13:24:41", "description": "Apart from showcasing his impeccable acting skill, Aamir Khan has often donned a producer’s and director’s hat. And when he did that, he realised, he has an inclination towards filmmaking. Aamir Khan says he would want to become a full time director, but when he will do that, he will quit acting.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-is-looking-forward-to-become-full-time-director-will-quit-acting-once-he-does-that-363804.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/aamir_khan_is_looking_forward_to_become_a_fulltime_director_will_quit_acting_when_he_does_that_1552722070_800x420.jpg"}