{"text": "It’s been almost 25 years since the epic film Forrest Gump's release, but those who have watched it still remember everything about it. The tear-jerking movie in which Tom Hanks played the titular character – a man that had child-like innocence who unwittingly influences several historical events in 20th century USA, was an epic drama romantic-comedy film based on the 1986 novel of the same name by Winston Groom.\ngq-images.condecdn.net\nOn his 54th birthday, Aamir Khan announced that he is remaking the epic film in Hindi. The movie will be called Laal Singh Chaddha and Aamir, who is also producing the movie, will star in the titular role Laal Singh. He will be sporting a turban for some part in the movie, which will be released in 2020.\nTwitter\nAamir, known for his perfection, will reportedly shed 20kgs for the role. “It is a wonderful story. It is a feel-good film. It is a film for the whole family.”\n“My next film is finalised it is called 'Laal Singh Chaddha'. It is being made by Viacom18 Motion Pictures and Aamir Khan Productions together. It will be directed by Advait Chandan. It is an adaptation of Hollywood film 'Forrest Gump'. We have bought the rights from Paramount. I am playing the lead role of Lal Singh,” he said while making the announcement.\nimages.in.com\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nForrest Gump was directed by Robert Zemeckis. The movie was released in 1994. It won six Oscars including best picture, best director and best actor for Hanks.", "title": "Aamir Khan Announces His Next Film ‘Laal Singh Chaddha’ - A Remake Of Tom Hanks' Forrest Gump!", "date_publish": "14/03/2019, 17:56:40", "description": "It’s been almost 25 years since the epic film Forrest Gump had released, but those who have watched it still remember everything about it. The tear-jerking movie in which Tom Hanks played the titular character – a man that had child-like innocence who unwittingly influences several historical events in 20th century USA, was an epic drama romantic-comedy film based on the 1986 novel of the same nam", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aamir-khan-announces-his-next-film-laal-singh-chaddha-a-remake-of-tom-hanks-forrest-gump-363736.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/aamir_khan_announces_laal_singh_chaddha_a_remake_of_oscarwinning__tom_hank_starrer_forrest_gump_1552565306_800x420.png"}