{"text": "Aamir Heads Out For Brunch With Daughter Ira, Says He's Getting Back In Shape For His Next Film\nAamir Heads Out For Brunch With Daughter Ira, Says He's Getting Back In Shape For His Next Film\nAamir Khan is one actor who goes to any and every extent to get into the skin of his characters. Be it bulking up for Dangal and Ghajini to getting back in shape for Thugs Of Hindostan, there is no role that he can't convincingly pull off.\nAlmost all his fans know that he loves to alter his looks according to what his films demand.\nAnd now, he says he is now on a strict diet to get in shape for a project. Aamir interacted with the media at a Sunday brunch at Mia Cucina in Mumbai.\nAsked about how his usual Sunday brunch, he said,\nInstagram\n“Earlier, I used to do so many things but now I am on very strict diet for my new film. So, I have started getting back into shape.”\nRefusing to disclose the name of the film for which he has started training, Aamir said: “I cannot tell you which one it is but it’s for my new film.”\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHe was out for a brunch with his daughter Ira Khan. Aamir’s last big screen appearance was in Thugs Of Hindostan.\nReports strongly hint that Aamir is all set to play the role of Lord Krishna in Mahabharata. The news was out and all thanks to his friend Shah Rukh Khan who let the secret slip at a recent event.\nOn being asked about what kind of role he would like to play during a chat with DNA, Shah Rukh replied ‘Krishna from Mahabharata’ but went on to add “Krishna from Mahabharata has already been taken by Aamir so I will not be able to do that.”", "title": "Aamir Heads Out For Brunch With Daughter Ira, Says He's Getting Back In Shape For His Next Film", "date_publish": "07/01/2019, 17:02:13", "description": "Aamir Khan is one actor who goes to any and every extent to get into the skin of his characters. Be it bulking up for Dangal and Ghajini to getting back in shape for Thugs Of Hindostan, there is no role that he can't convincingly pull off. Almost all his fans know that he loves to alter his looks according to what his films demand.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aamir-heads-out-for-brunch-with-daughter-ira-says-he-s-getting-back-in-shape-for-his-next-film-359999.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aamir_khan_1546861272_800x420.jpg"}