{"text": "When the most beautiful woman in the world Aishwarya Rai Bachchan tied the knot to one of the biggest stars of Bollywood Abhishek Bachchan, the entire nation gushed about the match made in heaven.\nThe power couple still gives relationship goals to people. Their ever-charming personalities leave people swooning and gushing about the true love that they share. But did you know how it all began?\nhdnicewallpapers.com\nRemembering how Abhishek Bachchan proposed to her on the sets of Jodha Akbar, Aishwarya bared her heart on the surreal moment of her life in a recent interview.\naishwaryaweb.com\n“Ashutosh is like ‘you are engaged’ and I am like ‘yeah,’” Aishwarya said revealing that Hrithik Roshan too gave her an excited thumbs up. “We’re doing Khawja Mere Khwaja, sitting as a bride, and I am like, oh my god this is surreal, all happening on-screen, off-screen, this is bizarre,” she said.\nDon't Miss 3.1 K SHARES 353 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAishwarya Rai Bachchan and Abhishek Bachchan had made their relationship official in 2007 after they got engaged. Post their wedding, they were invited to the Oprah Winfrey Show, as they were said to be as famous as Brad Pitt and Angelina Jolie. Undoubtedly, they are one of the most popular couples in the world of showbiz, don’t you agree?", "title": "Abhishek Bachchan Proposed Aishwarya On Jodha Akbar Sets & Hrithik Roshan’s Reaction Was Epic!", "date_publish": "03/01/2019, 11:52:29", "description": "Remembering how Abhishek Bachchan proposed to her on the sets of Jodha Akbar, Aishwarya bared her heart on the surreal moment of her life in a recent interview. The power couple still gives relationship goals to people. Their ever-charming personalities leaves people swooning and gushing about the true love that they share. But did you know how it all began?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/abhishek-bachchan-proposed-aishwarya-on-jodha-akbar-sets-hrithik-roshan-s-reaction-was-epic-359738.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aishwarya_rai_recalls_how_abhishek_bachchan_proposed_to_her_on_jodha_akbar_sets_hrithik_roshans_re_1546496148_800x420.jpg"}