{"text": "AbRam Is Convinced That Amitabh Bachchan Is His Grandfather, Keeps Wondering Why He Doesn't Live With Him\nAbRam Is Convinced That Amitabh Bachchan Is His Grandfather, Keeps Wondering Why He Doesn't Live With Him\nChildren are beautiful. These innocent souls always bring a smile upon our faces, don’t they?\nSo last year when Shah Rukh Khan’s little munchkin AbRam had met with Amitabh Bachchan on Aaradhya Bachchan’s birthday, he was mesmerised with the legendary star. So much so, that he evidently enjoyed his company, and he even thought Big B was his grandfather, as revealed by Shah Rukh Khan.\nThank u sir. This is a moment he will always cherish. By the way he thinks u r my ‘papa’ when he sees u on TV. https://t.co/2WUiFPAEWy — Shah Rukh Khan (@iamsrk) November 20, 2017\nAmitabh Bachchan who has played Shah Rukh Khan’s father in Kabhi Khushi Kabhi Gham had a wonderful time meeting the tiny tot again on Aaradhya Bachchan’s birthday this year as well.\nSharing a picture in which AbRam with his starry-eyed is looking at him, Amitabh Bachchan revealed that he is “convinced beyond any doubt” that he is his grandfather. So much so, that he even wonders why Amitabh Bachchan doesn’t like with him. Take a look at what Amitabh Bachchan posted below.\nDon't Miss 159 SHARES 343 SHARES 814 SHARES 555 SHARES 144 SHARES\nIt’s time we want to see Amitabh Bachchan and Shah Rukh Khan sharing screen space with each other yet again, do you?", "title": "AbRam Is Convinced That Amitabh Bachchan Is His Grandfather, Keeps Wondering Why He Doesn't Live With Him", "date_publish": "18/11/2018, 16:58:43", "description": "Sharing a picture in which AbRam with his starry-eyed is looking at him, Amitabh Bachchan revealed that he is “convinced beyond any doubt” that he is his grandfather. So much so, that he even wonders why Amitabh Bachchan doesn’t like with him. Take a look at what Amitabh Bachchan posted below.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/abram-is-convinced-that-amitabh-bachchan-is-his-grandfather-keeps-wondering-why-he-doesn-t-live-with-him-356907.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/amitabh_bahchchan_revealed_in_a_post_that_shah_rukh_khans_son_abram_thinks_he_is_his_grandfather_1542539820_800x420.png"}