{"text": "'Ace Of Space' Contestants Break Down As Vikas Gupta Shares The News Of Danish Zehen's Death\n'Ace Of Space' Contestants Break Down As Vikas Gupta Shares The News Of Danish Zehen's Death\nOne of the saddest news that came in December was the unfortunate demise of 'Ace of Space' contestant and popular blogger Danish Zehen. He succumbed to injuries after a car accident near Mumbai on December 20.\nReports claim that Danish was driving back home after attending a wedding when he lost control of his car and hit a roadside wall. This news has left a lot of people from the industry absolutely crestfallen. This list also includes the contestants and the host of Ace of Space, host Vikas Gupta.\nA clip shared by Vikas shows how difficult it was for him to share the news with the contestants.\nContestants including Fizah Khan, Varun Sood, and Faizy Boo broke down as they heard the news and were inconsolable.\nScreengrab\nThis was a moment that was really emotional for the team. Vikas shared the video and he wrote,\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"No one can prepare us for some truths like this #AceOfSpace #DanishZehen #Houseguests.\"\nThis news also left Actress Sara Ali Khan in shock as she had met Danish on the sets of Ace of Space, where she was present to promote her upcoming movie. Sara too shared a clip where Danish had dedicated a special performance for her.\nRannvijay Singha shared a picture of Danish Zehen and wrote, \"I pray that u rest in peace brother @danish_zehen 1997- \"", "title": "'Ace Of Space' Contestants Break Down As Vikas Gupta Shares The News Of Danish Zehen's Death", "date_publish": "22/12/2018, 17:43:31", "description": "Reports claim that Danish was driving back home after attending a wedding when he lost control of his car and hit a roadside wall. This news has left a lot of people from the industry absolutely crestfallen. This list also includes the contestants and the host of Ace of Space, host Vikas Gupta.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ace-of-space-contestants-break-down-as-vikas-gupta-shares-the-news-of-danish-zehen-s-death-359094.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/danish1_1545476530_800x420.jpg"}