{"text": "1. Actor Vishal Adopts An Entire Village Hit By Cyclone Gaja In Tamil Nadu, Promises To Restore It\nSouth Indian actor Vishal, who is also the President of Tamil Nadu Film Producers Council and Secretary of Nadigar Sangam, has adopted an entire village Karagavayal.\n2. With Only A Few Days Left For The D-Day, Bride-To-Be Priyanka Chopra’s Mumbai House Is All Decked Up\nAnd just like how NickYanka is beaming with happiness, Priyanka Chopra’s Mumbai house is all lit up too. The festivities are about to begin. After Deepika Padukone and Ranveer Singh, it’s time for Priyanka Chopra and Nick Jonas to tie the knot.\n3. After Filing Rape Case Against Alok Nath, Vinta Nanda Says Onus Is On Her To Prove Her Story\n“I have to go for a physical medical test now, twenty years later. I read in the paper today where they've said I have to undergo a medical check and only then they will be able to proceed with the case,” she added.\nDon't Miss 527 SHARES 7.6 K SHARES\n4. From Visiting A Psychiatrist Post Badlapur To Wanting A Debut With Anurag Kashyap, Varun Dhawan Bares It All\nVarun Dhawan is one of the most successful stars of Bollywood. From just another “star kid”, he is now one of the most bankable stars of Bollywood. In his career spanning over seven years, the actor has given zero flops.\n5. Farhan Akhtar Feels Guilty For Not Knowing Sajid Khan's Deeds Before #MeToo Details Came Out\n\"It was surprise, disappointment and strangely, because when it's a member of your family, you also feel a certain level of guilt. It's happened to all of us in the past when we hear something like this and say 'but how come someone so close to him didn't know.'", "title": "Actor Vishal Adopts A Village, Priyanka Chopra’s House Is Lit Up Ahead Of Wedding & More From Ent", "date_publish": "26/11/2018, 18:15:27", "description": "From actor adopting a village of Tamil Nadu affected by Cyclone Gaja and promising to restore it, to countdown for Priyanka Chopra and Nick Jonas’ beginning with PC’s Mumbai house being lit up and Sophie turner and Joe Jonas arriving in India, here’s all that rocked the world of entertainment.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/actor-vishal-adopts-a-village-priyanka-chopra-s-house-is-lit-up-ahead-of-wedding-more-from-ent-357425.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/actor_vishal_adopts_a_village_priyanka_chopras_house_is_lit_up_ahead_of_wedding__more_from_ent_1543235601_800x420.png"}