{"text": "Actor Vishal Adopts An Entire Village Hit By Cyclone Gaja In Tamil Nadu, Promises To Restore It\nActor Vishal Adopts An Entire Village Hit By Cyclone Gaja In Tamil Nadu, Promises To Restore It\nWith great power comes great responsibly. For a country which is obsessed with cinema, movie stars often cast a long-lasting impact on the audiences, especially when they contribute to a social cause.\nA lot of times, a lot of celebrities have used their star power to make this world a better place. Remember Randeep Hooda flew down to Kerela to extend a helping hand for the flood victims on his birthday.\nJoining the bandwagon, South Indian actor Vishal, who is also the President of Tamil Nadu Film Producers Council and Secretary of Nadigar Sangam, has adopted an entire village Karagavayal.\nTwitter\nLocated near Thanjavur (Tamil Nadu), village Karagavayal was heavily hit by Cyclone Gaja. It is said that the village was worst affected regions of the area.\nVishal has adopted the village and has promised to restore it, he told his fans in tweet below.\nThis village is mine. #kaarkavaiyaI thanjavur district. I swear I will bring back this village to normality and this will be my responsibility forever. Model village on the way.i luv u group #socialarchitects to help me achieve this.god bless — Vishal (@VishalKOfficial) November 24, 2018\nDon't Miss 527 SHARES 7.6 K SHARES 893 SHARES\nChoreographer-turned-actor Raghava Lawrence said that he would build 50 houses to help the Gaja affected victims.\n“Recently, I saw a family stranded in the streets in the delta region. It was devastating to see them in such a pathetic situation. I'm planning to build 50 huts to the needy people to the victims of Gaja cyclone,” he said in a press statement.\ntoptamilnews.com\nMany more celebs including Kamal Haasan, Rajinikanth and Vijay have contributed money for the victims of Cyclone Gaja. It is said that the villagers are moved by his gesture. Cyclone Gaja has killed 45 people and had also destroyed the crops.", "title": "Actor Vishal Adopts An Entire Village Hit By Cyclone Gaja In Tamil Nadu, Promises To Restore It", "date_publish": "26/11/2018, 11:49:20", "description": "South Indian actor Vishal, who is also the President of Tamil Nadu Film Producers Council and Secretary of Nadigar Sangam, has adopted an entire village Karagavayal. Located near Thanjavur (Tamil Nadu), village Karagavayal was heavily hit by Cyclone Gaja. It is said that the village was worst affected regions of the area. Vishal has adopted that village and has promised to restore it, he told his", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/actor-vishal-adopts-an-entire-village-hit-by-cyclone-gaja-in-tamil-nadu-promises-to-restore-it-357382.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/vishal_has_adopted_a_village_in_tamil_nadu_and_has_promised_to_restore_it_after_cyclone_gaja_1543211969_800x420.png"}