{"text": "Actor Siddharth Hilariously Tears Apart The Trailer Of Modi Biopic For Glorifying Him\nActor Siddharth Hilariously Tears Apart The Trailer Of Modi Biopic For Glorifying Him\nFor actors, being courageous and absolutely unfiltered with their words is not a very favorable trait, considering how it can backfire. With everyone having an opinion on everything on social media, stars have to face a lot of flak for their opinions.\nBut one actor who doesn't give even a smallest damn about it all is Actor Siddharth.\nAs politically aware and satirical he always has been, this time he took a dig at the trailer of Narendra Modi's biopic, PM Narendra Modi. Apart from laughing at the audacity of filmmakers of glorifying politicians, Siddharth tweeted sarcastically how the films misses a very important point: Of showing how Modi won India's independence by 'single-handedly wiping out the British empire.\nAs witty as it could get, his next part is what makes it all the more funny! He added,\nTwitter\n“Looks like another trick by the sickular, libtard, commie, naxals, and of course that Nehru (sic).”\nAfter Modi, his next day was at filmmakers, who have totally taken the audience for granted by being reckless about making biopics of politicians like Modi and former Tamil Nadu Chief Minister Jayalalithaa. He added,\nDon't Miss 6.8 K SHARES 828 SHARES\n“My mind boggles at how much goldwashing is going to happen in the many Jayalalithaa based films coming our way. It's forgivable to not know your history, unforgivable if you try to change it,” he tweeted.\nIn series of tweets, Siddharth took a jibe at the makers of Modi biopic for glorifying him.\n#PMNarendraModiTrailer does not show how #Modiji won India's Independence by single handedly wiping out the British Empire. Looks like another cheap trick by the sickular, libtard, commie, naxals and of course that Nehru. #IstandwithModi — Siddharth (@Actor_Siddharth) March 21, 2019\nSeeing the honesty of our film makers when making these \"Biopics\" like #PMNarendraModi, my mind boggles at how much goldwashing is going to happen in the many #Jayalalithaa based films coming our way. It's forgivable to not know your history, unforgivable if you try to change it! — Siddharth (@Actor_Siddharth) March 21, 2019\nStarring Vivek Oberoi in the title role, the film is all set to release on April 5.", "title": "Actor Siddharth Hilariously Tears Apart The Trailer Of Modi Biopic For Glorifying Him", "date_publish": "21/03/2019, 12:42:24", "description": "As politically aware and satirical he always has been, this time he took a dig at the trailer of Narendra Modi's biopic, PM Narendra Modi. Apart from laughing at the audacity of filmmakers of glorifying politicians, Siddharth tweeted sarcastically how the films misses a very important point: Of showing how Modi won India's independence by 'single-handedly wiping out the British empire.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/actor-siddharth-hilariously-tears-apart-the-trailer-of-modi-biopic-for-glorifying-him-364074.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/modi_biopic_1553152545_800x420.jpg"}