{"text": "Actress Saira Khan who played the lead role in Kamasutra 3D is no more. The actress who shot to fame after having replaced Sherlyn Chopra in the controversial 2013 film died following a cardiac arrest on Friday morning, according to reports.\ncineeye.xyz\nRupesh Paul, who directed her in the movie, feels she was a great artiste who needed more recognition than she got. Surrounded in grief, Rupesh said that he was even more upset to know that the news of her passing away went unnoticed in the industry. And so he decided to release a statement in the same regard.\ntownnews.com\n“I found out about the news and was shocked. Later, I noticed that nobody had reported it and that was even more shocking. She deserved to be recognised for her performance and to remain unknown even after the brilliance she had is even more hurtful. It’s a mourning time for us and I hope she Rests in Peace,” he said in a statement as quoted by DNA.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\ndailyhunt.in\nFurthermore, Rupesh Paul revealed how difficult it was for him to cast Saira Khan in the movie as she belonged to a conservative family. He said her journey wasn’t easy in the industry.\n“It was difficult for Saira to sign the film because she came from a very conservative Muslim family and to make a debut with such a bold film after all the fuss in the media about it was in itself challenging. It took us months to finally get her on board but the wait was worth it as nobody else could’ve done justice to the movie unlike her.”\nSaira Khan had done a few regional movies before making her Bollywood debut with Kamasutra 3D.", "title": "Actress Saira Khan Of 'Kamasutra 3D' Fame Passes Away Following A Cardiac Arrest!", "date_publish": "21/04/2019, 11:32:58", "description": "Actress Saira Khan who played the lead role in controversial film Saira Khan is no more. The actress who shot to fame after having replaced Sherlyn Chopra in the controversial film, according to reports, died following a cardiac arrest on Friday morning. Rupesh Paul, who directed her in the movie, feels she was a great artiste who needed more recognition than she got.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/actress-saira-khan-of-kamasutra-3d-fame-passes-away-following-a-cardiac-arrest-365827.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kamasutra_3d_actress_saira_khan_dies_of_cardiac_arrest_1555824777_800x420.png"}