{"text": "Actress Nafisa Ali Reveals She Has Stage 3 Cancer By Sharing A Pic With Friend Sonia Gandhi\nActress Nafisa Ali Reveals She Has Stage 3 Cancer By Sharing A Pic With Friend Sonia Gandhi\nThe end is near, they say. And why wouldn’t you want to believe that? Natural calamities are taking many lives every now and then – just recently California wildfire killed about 76. The air that we are all breathing is hazardous. And deadly diseases like cancer are no more a rarity.\nCancer is the most dreaded disease for sure. And it is now spreading its wings encompassing many, including adults, kids and elderly.\nIrrfan Khan, Sonali Bendre, Tahira Kashyap – all were diagnosed with cancer in recent times. And now, veteran actress Nafisa Ali has also revealed that she has been diagnosed with Stage 3 cancer.\nDon't Miss 322 SHARES 237 SHARES 197 SHARES 2.5 K SHARES 17.1 K SHARES\nPost a smiling picture with her politician fiend Sonia Gandhi, Nafisa Ali made the revelation. “Just met my precious friend who wished me luck & to get well from my just diagnosed stage 3 cancer. 😍,” she wrote in the caption. \"\nNafisa Ali is married to Col RS Sodhi and has three children Armana, Pia and Ajit. She has worked in many Bollywood movies including Metro, Junoon, Major Saab and Yamla Pagla Deewana among others. She also contested Lok Sabha elections on Samajwadi Party ticket in 2009 from Lucknow. She had rejoined the Congress party in the same year.", "title": "Actress Nafisa Ali Reveals She Has Stage 3 Cancer By Sharing A Pic With Friend Sonia Gandhi", "date_publish": "18/11/2018, 12:14:00", "description": "Irrfan Khan, Sonali Bendre, Tahira Kashyap – all were diagnosed with cancer in the recent times. And now, veteran actress Nafisa Ali has also revealed that she has been diagnosed with Stage 3 cancer. Post a smiling picture with her politician fiend Sonia Gandhi, Nafisa Ali made the revelation. “Just met my precious friend who wished me luck & to get well from my just diagnosed stage 3 cancer. \"", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/actress-nafisa-ali-reveals-she-has-stage-3-cancer-by-sharing-a-pic-with-friend-sonia-gandhi-356878.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nafisa_ali_posts_a_picture_with_sonia_gandhi_as_she_reveals_she_has_cancer_1542522387_800x420.png"}