{"text": "Bollywood filmmaker Sajid Khan is one of the most renowned celebrities. The man has made some popular hits like Housefull franchise and given some major flops like Himmatwala and Humshakals.\nInstagram\nBut nothing had changed his stature or his reputation until today. Ever since the #MeToo movement has gained speed in Bollywood, Sajid Khan has appeared on the radar. From facing accusations from Saloni Chopra for sexually harassing her, now another actress has come ahead and spoken about his 'casting' ways.\nRachel White, who was in Ungli, explains how Sajid once called her home for auditions and lead her straight to the bedroom and asked her to strip. In a series of tweets, the actress has lashed out at the director. Take a look.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nI believe you @redheadchopra I was sent by my agency then to meet Sajid Khan during Humshakals. Right after my agency told me about the meeting Sajid called me within the next 5 mins and said the meeting would be at his house opp iskon Juhu. — Rachel White (@whitespeaking) October 11, 2018\nI said I was not comfortable meeting at home and to that he said “don’t worry I live with my mom and she’ll be around” I felt reassured and agreed. When I went to his house the maid directed me to his room and the drawing room was empty!! It was his bedroom — Rachel White (@whitespeaking) October 11, 2018\nI stood like an idiot in one corner of the bedroom wondering where to sit and he was on one side on the treadmill. I clearly rem this episode. When he saw me walk in he goes “pls come this side” all smiling . I walk up towards the treadmill . He was directly staring down at me — Rachel White (@whitespeaking) October 11, 2018\nI was in a white vest and blue denims and still felt I was standing nude with that gaze. What happens next is that he finishes his cardio and walks up to me asking me about my boobs and making that kind of conversation. I didn’t bother to answer to anything. — Rachel White (@whitespeaking) October 11, 2018\nFinally he goes “listen no one has a problem with these things” (and obviously named people) and that if I could seduce him in 5 mins the role was mine.\nHow this ended was me saying that I didn’t come mentally prepared for this and I left his house! — Rachel White (@whitespeaking) October 11, 2018\nSajid has not personally addressed the issues one by one but has stepped down as the director of Housefull 4. He further says that this in no ways means he admits the charges but has left the mid way as there is immense amount of pressure on his family.\nMore power to the women, who have come out and spoken against these bollywood biggies.", "title": "Actress Rachel White Shares Her Horrific #MeToo Story, Reveals Sajid Khan Asked Her To Strip", "date_publish": "12/10/2018, 15:58:33", "description": "Bollywood filmmaker Sajid Khan is one of the most renowned celebrities. The man has made some popular hits like Housefull franchise and given some major flops like Himmatwala and Humshakals. But nothing had changed his stature or his reputation until today. Actress Rachel White Shares Her Own Horrific #MeToo Story, Reveals Sajid Khan Asked Her To Strip", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/actress-rachel-white-shares-her-horrific-metoo-story-reveals-sajid-khan-asked-her-to-strip-354667.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bollywood_1539338309_800x420.jpg"}