{"text": "Shah Rukh Khan dropped a surprise for his fans on his birthday by revealing the trailer of his upcoming movie 'Zero', in which he plays the lead role of a dwarf along with Anushka Sharma and Katrina Kaif as leading ladies.\nHowever, a fake tweet is doing rounds over the social media which claims to reveal the climax of the much-awaited film.\nA screenshot of the fake tweet in the name of singer Adnan Sami states that Anushka Sharma's character dies at the end, and Shah Rukh Khan becomes an astronaut to fulfill her wish.\nscreen grab/youtube\n\"Anushka Sharma will die due to paralysis disease at the end of film 'Zero' and SRK will become an astronaut just to fulfill Anushka's wish. The end. Don't tag anyone to ruin their movie [sic],\" the tweet read.\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES 555 SHARES\nAt the end of the trailer of 'Zero', it appears that Shah Rukh Khan actually sets off to space in a rocket. This is the reason why the genuine-looking tweet has gone viral, with many people questioning why the singer has done such a heinous job.\nAdnan Sami himself took to Twitter to clarify about the fake tweet that has troubled the much-concerned fans.\nThis is a fake tweet! — Adnan Sami (@AdnanSamiLive) November 6, 2018\nThe Shah Rukh Khan starer 'Zero' is set to be a Christmas release which portrays the story of a dwarf played by SRK who comes across a physically-disabled woman played by Anushka Sharma and Katrina Kaif who plays the role of a popular film star.\nDirected by Anand L Rai, 'Zero' is set to hit the theaters on December 21.\nInputs From TNN", "title": "Adnan Sami Clarifies After A Fake Tweet Revealing Climax Of Shah Rukh Khan's 'Zero' Goes Viral", "date_publish": "07/11/2018, 14:55:32", "description": "Shah Rukh Khan dropped a surprise for his fans on his birthday by revealing the trailer of his upcoming movie 'Zero', in which he plays the lead role of a dwarf along with Anushka Sharma and Katrina Kaif as leading ladies. However, a fake tweet is doing rounds over the social media which claims to reveal the climax of the much-awaited film. A screenshot of the fake tweet in the name of singer Adna", "authors": [], "url": "https://www.indiatimes.com/entertainment/adnan-sami-clarifies-after-a-fake-tweet-revealing-climax-of-shah-rukh-khan-s-zero-goes-viral-356229.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/fake_tweet_revealing_climax_of_shah_rukh_khan_zero_goes_viral_1541582936_800x420.jpg"}