{"text": "“Aye mamu….jadoo ki jhappi de daal aur baat khatam”\nofficial poster\n15 years ago, Jadoo Ki Jhappi became a catchphrase for every commoner. The ‘Dude’ used to be ‘Mamu’ back then. Bhaigiri used to be a fad. Munnabhai MBBS released a decade and a half ago on this very day and changed the face of cinema. When movies like Footpath, Company and Ghulam paved a wave for dark gangster movies, it was Sanjay Dutt who made the audiences believe that a gangster can be affable too!\npinterest\nIt also marked the debut of filmmaker Rajkumar Hirani, who is now one of the most sought after director in the business. From newcomers to A-listers, everyone aspires to work with him at least once in their career. It also revived Sanjay Dutt’s flailing career and gave him a second innings as an actor.\nTo celebrate the cult film on it’s 15th anniversary, let’s take a walk down memory lane and relive some memorable throwback moments:\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n1. The term bromance came into being, thanks to Munna and Circuit\ntwitter\nMunna and circuit are incomplete without each other. They made people pine for a ‘Bhai’. Circuit, ek kaam kar - There’s was nothing Sarkeshwar wouldn’t do for his Munna bhai. Remember how Munna aka Murali Prasad Sharma asks Circuit to arrange a body for him to learn surgery in the medical college and our punter obliges without even blinking twice. To say that Munna-Circuit coined the term bromance, especially on the big screen would be an understatement. It's endearing how even till date, every time these two are snapped together, people address them as Munna and Circuit!\n2. Dr Asthana and his laughter therapy\nTwitter\nBoman Irani came into limelight after playing the eccentric role of Dr Asthana in this film. Even though he played a negative role (Well, sort of), there were moments when viewers couldn’t help but adore him. One scene that stood out from the rest was when he says - main uski watt laga doonga and then gets pissed off and screams what am i saying followed by his funny laughter.\n3. Nawazuddin Siddiqui’s blink-and-miss role as a pickpocket\ngiphy\nHad someone told you that this rugged looking lanky thief would become a Ganesh Gaitonde of Sacred Games or do a Gangs of Wasseypur and bring mafia genre on top, you would have laughed it off, right? At the time of the release of this film, no one even noticed the guy who steals Sunil Dutt’s wallet and gets thrashed by the janta and then Munnabhai's goons as well. It was only after Nawazuddin Siddiqui made a name for himself did people realise that he played a minuscule role in this cult film.\n4. The uptight Doctor Rustom and his larger-than-life Puppa\npinterest\nCarrom ramvaanu, juice pivanu, mazza ni life!\nThe whole Rustom giving the exam in lieu of Munnabhai track was hilarious. What’s more the camaraderie that Munna and his gang shared with his Parsi Papa was so adorable. The carrom angle and Puppa saying Rani Toh Papa Ni struck a chord with audiences.\n5. Every character role was carved with finesse and precision\ntumblr\nFrom the coma guy Anand bhai to the janitor/sweeper Maqsood bhai who got the first jadoo ki jhappi, every character was so beautifully portrayed. Every little character had an important part to play, so much so, that the all of them made a place for themselves in the audience's heart them. Jimmy Shergill aka Zaheer battling cancer and relying on Munna to save him despite knowing that he is not even a doctor, made people shed buckets of tears. Even the item song - Dekh le wasn’t just a frivolous attempt to jazz up the movie, it was ingrained in the plot meaningfully.\n6. THE jadoo ki jhappi feat Sunil Dutt and Sanjay Dutt\ntwitter\nThe whole strict father and tumultuous relationship with the son resonated with many. It was the reason why Munna had to keep up the facade that he is a doctor and runs a nursing home. However, that one scene in the climax when he spreads his arms for Munna and tells him to give him the jhappi is probably the highlight of the film.\nNot many know that this particular scene was very hard for senior Dutt to shoot. According to Hirani, Sunil Dutt couldn’t lift his shoulder and was in extreme pain. When he got to know about this, he called for a wrap. But Dutt being the professional actor that he was, told them to not to. He took a short break, drank a cup of tea and gave the shot.\ngiphy\nHowever, Hirani later said that whenever you see that scene remember that Sunil Dutt was in extreme pain.\n7. Swami and the ragging scene\ngiphy\nEvery time i think of Munna’s roommate Swami the first thing that comes to mind is - What is the procedure to change the room please? Apart from the geek, another scene that is always a fun watch is the ragging bit. Come on, Munna made ragging look fun, didn’t he? When he forces the seniors to rag him as well, that fearful look on the face of those doctors was so satisfying to watch!\n8. That moment when it was revealed that the narrator of the story was Anand Bhai\nThe climax shows Anand Bhai sitting on the wheelchair and telling the story of Munna to kids. It was so heartwarming to see that he was out of coma and doing well for himself. What’s more, that moment when he gets up from the chair felt like a double bonanza!\n9. The epic classroom scene where Dr Asthana tells Munna to get out\ntwitter\nRight from Munna offering channas to Swami to irritating Dr Asthana with his 21 questions, this entire sequence was hilarious. Especially that look on Asthana’s face when Munna asks him - Woh bahar casualty mein koi marne ki halat mein raha to usko form bharna zaruri hai kya? That helpless look on his face was something that tickled everyone’s funny bone. This scene was loved by audiences so much that Hirani recreated it with Ranbir Kapoor in Dutt’s biopic Sanju!\nTwitter\nI’m sure after this, you won’t be able to stop yourself from watching Munnabhai MBBS for the 17785388274 time! Make some popcorn, tuck yourself in a cozy blanket and let Munna lift your mood.", "title": "Ae Mamu! Munna Bhai MBBS Clocks 15 Years & These 9 Golden Moments Still Make Our Hearts Happy", "date_publish": "19/12/2018, 17:29:11", "description": "15 years ago, Jadoo Ki Jhappi became a catchphrase for every commoner. The ‘Dude’ used to be ‘Mamu’. Bhaigiri used to be a fad. Munnabhai MBBS released a decade and a half ago on this very day and changed the face of cinema. When movies like Footpath, D-Company and Ghulam paved a wave for dark gangster movies, it was Sanjay Dutt who made the audiences believe that a gangster can be affable too!!!!", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/bollywood/ae-mamu-munna-bhai-mbbs-clocks-15-years-these-9-golden-moments-still-make-our-hearts-happy-358924.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/munna_bhai_1545218421_800x420.jpg"}