{"text": "After Doing Two Films In Her Debut Year, Sara Ali Khan Now Wishes To Try Other Genres\nAfter Doing Two Films In Her Debut Year, Sara Ali Khan Now Wishes To Try Other Genres\nThis year has been a year of refreshing change in Bollywood. With a lot of new entrants making their debut, we got to see a breath of fresh air. One debutante who has received a warm welcome into the world of films is Sara Ali Khan.\nInstagram\nDaughter of Saif Ali Khan and Amrita Singh made her debut with Kedarnath and her second film Simmba has just hit the theatres.\nSara isn't a frivolous 20-year old but there is much more to her that has made her enter into the favorite list of critics and the audience. She might be just two film old but her larger than life dreams prove that she has plans to conquer the world of films.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nIn her recent interview with Filmfare, when she was quizzed about the kind of roles she's looking forward to, she didn't hide her subtle greed of 'trying everything'. The Simmba actress was quoted as saying,\nInstagram/Sara Ali Khan\n“I want to try each and every genre. Aisa koi genre nahi hai jo Sara nahi kar sakti. I need to do more work, I need to do better work, and I need to work harder. Because your battle keeps changing. And that’s life. Every time there are new challenges.\"\nTalking about her future plans, she added,\n\"I have worked very hard, I tried my level best with Kedarnath. I deserve 80% of the praise which I am getting. 20% is a combination of good karma and people genuinely liking me. Now I am going to work doubly hard. Right now you all like me as a person and I know that.”\nCurrently, Sara and Ranveer Singh starrer Simmba is running in the theatres and the collections of the film look promising.", "title": "After Doing Two Films In Her Debut Year, Sara Ali Khan Now Wishes To Try Other Genres", "date_publish": "29/12/2018, 17:09:34", "description": "This year has been a year of refreshing change in Bollywood. With a lot of new entrants making their debut, we got to see a breath of fresh air. One debutante who has received a warm welcome into the world of films is Sara Ali Khan. Daughter of Saif Ali Khan and Amrita Singh made her debut with Kedarnath and her second film Simmba has just hit the theatres.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-doing-two-films-in-her-debut-year-sara-ali-khan-now-wishes-to-try-other-genres-359488.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_ali_khan_1546085178_800x420.jpg"}