{"text": "After Her Tough Fight With Cancer And A Long Break, Sonali Bendre Is Excited To Return To Work\nAfter Her Tough Fight With Cancer And A Long Break, Sonali Bendre Is Excited To Return To Work\nSonali Bendre's way of dealing with cancer deserves an applause. After spending several months in a limbo in the U.S for her treatment, she returned to India and with a broad smile.\nEven during her treatment in the U.S, Sonali was active on social media and used to share updates about her health regularly. And now that she is back, she is doing all it takes to bring her life back to normalcy.\nInstagram\nSonali is ready to face the camera as she is back in action, shooting for her upcoming film.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAfter a tough battle with cancer, Sonali is happy to resume work and face the camera. She took to Instagram to pen down her feelings. She wrote,\n\"Being back on a set after a major sabbatical – one that has been testing in many ways on so many levels – is a surreal feeling.\nAfter all this, I sort of feel an additional sense of purpose and meaning and I'm so grateful to be back in action. I don’t think words would do justice to how beautiful it feels to be back at work...to face the camera again and portray the range of emotions required.\nGiven that my emotions have been running high for the last couple of months, it feels good to give into the emotions that the job requires. It's just the kind of day that helps me #SwitchOnTheSunshine\"\nSonali has received great support from her husband Goldie Behl and son Ranveer and her friends from the fraternity too were always there for her.", "title": "After Her Tough Fight With Cancer And A Long Break, Sonali Bendre Is Excited To Return To Work", "date_publish": "03/02/2019, 16:52:34", "description": "Even during her treatment in the U.S, Sonali was active on social media and used to share updates about her health regularly. And now that she is back, she is doing all it takes to bring her life back to normalcy. Sonali is ready to face the camera as she is back in action, shooting for her upcoming film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-her-tough-fight-with-cancer-and-a-long-break-sonali-bendre-is-excited-to-return-to-work-361518.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sonali_bendre_1549194978_800x420.jpg"}