{"text": "Looks like, Kangana Ranaut is not done with Karan Johar yet. The actress who started the nepotism debate after appearing on his talk show is now slamming him for not speaking on the current and biggest issue in Bollywood- The #MeToo Movement.\nTwitter\nIn a media interaction, Kangana called out KJo by saying,\n“I have been speaking about it every day. But, now, more significantly, more people need to come out and talk about it. It's just not one person to talk about it. It's important for people like... Where are people like Karan Johar, Shabana Azmi, they should also come out and talk. Karan Johar always has views about gym looks, airport looks, he tweets ten times about it, what about this?\nThis is their identity, this is their bread and butter, Film Industry when it's going through such an important shift, where are they? It's important that other people also now join this movement”.\nNot on only did she slam him but she also dissed his upcoming talk show and even commented on the promo of the show which has Alia Bhatt and Deepika Padukone. She said, “ I was seeing the promo that they have launched of his talk show, wherein again those frivolous talks have been going on. This one is sleeping with this one, that one is sleeping with that one. You know making girls look like Barbie dolls. This is not done and why men who change women like clothes are glorified. Has there been a woman who has been glorified like that?”.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nTwitter\nKangana even questioned why her contemporaries are not sharing their experiences,\n“When the Industry is going through such a shift why are these A-list actresses not sharing their stories? I am the only one, you guys come to every day. I don't know who calls you but honestly, I have spoken a lot, it's not for one person to talk.”\nTwitter\nKangana is surely one fearless actress and she has proved it time and again.", "title": "After Nepotism, Kangana Ranaut Calls Out Karan Johar For Not Speaking Up About #MeToo Movement", "date_publish": "15/10/2018, 12:40:58", "description": "In a media interaction, Kangana slammed at KJo saying, “I have been speaking about it every day. But, now, more significantly, more people need to come out and talk about it. It's just not one person to talk about it. It's important for people like... Where are people like Karan Johar, Shabana Azmi, they should also come out and talk. Karan Johar always has views about gym looks, airport looks, he", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-nepotism-kangana-ranaut-calls-out-karan-johar-for-not-speaking-up-about-metoo-movement-354796.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kangana_1539587012_800x420.jpg"}