{"text": "After Gaining Stardom, Siddhant Chaturvedi AKA Gully Boy's MC Sher Says He Always Wanted To Be Loved\nAfter Gaining Stardom, Siddhant Chaturvedi AKA Gully Boy's MC Sher Says He Always Wanted To Be Loved\nGully Boy was a film that turned out to be lucky for newbie Siddhant Chaturvedi. In his recent interview, Siddhant said that he wanted to be loved by people and has taken a vow to always handle his own social media. \"I always wanted people to love me. I am happy that's happening now,\" Siddhant said.\nTiger Baby\n\"I'll always handle social media by myself. I'll not have a team,\" he said. Siddhant came into the spotlight with Zoya Akhtar's latest film, where he portrayed MC Sher, mentor to Ranveer Singh's budding rapper Murad. \"I am happy, at peace, loving everything. But people don't know much about me,\" he said.\nfacebook/Siddhant Chaturvedi\nThe actor also recounted his strangest audition for the role of a stripper. \"It was Aditya Dhar's film. It also had Fawad Khan and Katrina Kaif. The film never got made.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHe had a stalker too. Siddhant said, \"He was a 65-year-old man. He sent gifts, I went to his house for dinner. But after that, it became a bit too much and I cut him off.\"\nfacebook/Siddhant Chaturvedi\nThe actor feels Ranveer is the sexiest actor and said he would like to date actress Deepika Padukone.\nInputs From IANS", "title": "After Gaining Stardom, Siddhant Chaturvedi AKA Gully Boy's MC Sher Says He Always Wanted To Be Loved", "date_publish": "19/04/2019, 14:41:12", "description": "Gully Boy was a film that turned out to be lucky for newbie Siddhant Chaturvedi. In his recent interview, Siddhant said that he wanted to be loved by people and has taken a vow to always handle his own social media.Gully Boy was a film that turned out to be lucky for newbie Siddhant Chaturvedi. In his recent interview, Siddhant said that he wanted to be loved by people", "authors": [], "url": "https://www.indiatimes.com/entertainment/after-gaining-stardom-siddhant-chaturvedi-aka-gully-boy-s-mc-sher-says-he-always-wanted-to-be-loved-365753.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/siddhant_1555666276_800x420.jpg"}