{"text": "Remember the popular 'kauwa biryani' scene from movie Run? Pankaj Tripathi made an unnoticed appearance with Vijay Raaz in that scene. The actor came to Mumbai in search of work in 2004, but only gained recognition in the industry in 2012 with Anurag Kashyap's Gangs of Wasseypur. And since then, there has been no looking back.\nWith films like Stree and web-series like Mirzapur, Pankaj Tripathi is on a roll in the industry. He played a small role of the mysterious Guruji in the first season of much-hyped Netflix series Sacred Games. Will fans see more of him in season 2? He might as well play one of the main roles, he hints.\nTwitter\n“I don’t know if my character will be a main one in the next season. I got a call last night that I have to meet Varun Grover (the writer), so the team is trying to get our busy schedules matched. We may be in the clear about the role by next week, hopefully.”\nTwitter\nDon't Miss 2.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nHe added that Guruji was supposed to be kept a secret initially.\n“My character was kind of kept hidden. I shot for the series for just one day after the main shooting was over. They thought ‘Let’s bring this character into the light’. Initially, that was not the plan. Something happened that they didn’t announce this differently and I am not someone who likes tom-tomming. It was a small role in the beginning, so we did not promote it as if it were a main one in the first season,” he added.\nWell, fans want to see more of Pankal Tripathi AKA Guruji in Sacred Games season 2.\nWith inputs from PTI", "title": "After Mirzapur, Pankaj Tripathi Gives A Hint About Guruji's Fate In 'Sacred Games 2'", "date_publish": "25/11/2018, 18:09:08", "description": "With films like Stree and web-series like Mirzapur, Pankaj Tripathi is on a roll in the industry. He played quite a small role of mysterious Guruji in the first season much-hyped Sacred Games. Will fans see more of him in season 2? He might as well play one of the main roles, he hints.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-mirzapur-pankaj-tripathi-gives-a-hint-about-guruji-s-fate-in-sacred-games-2_-357362.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/after_mirzapur_pankaj_tripathi_tells_if_hell_play_the_main_role_in_sacred_games_2_as_well_1543148370_800x420.png"}