{"text": "After the honorary doctorates from The University of Bedfordshire and The University of Edinburgh, superstar Shah Rukh Khan has received an honorary doctorate in Philanthropy by The University of Law, London. Shah Rukh Khan received the merit during a graduation ceremony for more than 350 students on Thursday.\nAs always, he managed to impress everyone present in the audience with his moving speech. In his speech, Khan said,\nInstagram/SRK\n“I believe that charity should be done in silence and with dignity. One cannot speak about their charitable acts because it loses its purpose. I have been privileged to be able to use my status as a public personality to champion causes close to my heart. I actively participate with the causes of women empowerment, rehabilitation of the underprivileged and basic human rights.\"\nHe added,\n“I firmly believe that I have to give back to the world that has given me so much. I am humbled with this Honorary Doctorate bestowed upon me and would like to thank everyone involved for choosing me.\"\nOver the years, he has established himself as a successful actor, film producer, television host, philanthropist, and entrepreneur. Apart from being one of the biggest superstars in the world, Shah Rukh Khan has also earned love for championing human rights in India.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 612 SHARES\n(Also read: SRK Gives A Pep Talk To Acid-Attack Survivors Before Their Corrective Surgeries & It's Gold!)\nHe has lent support to the Indian government's campaigns, including Pulse Polio and National Aids Control Organization.\nHave a look at the pictures and videos from the ceremony right here.\nHe has worked closely with several charitable foundations, including the Make-a-Wish Foundation. Shah Rukh's non-profit organization Meer Foundation primarily works with acid attack victims and aims to initiate change at the ground level to build a world that empowers women. He was honored with the Crystal Award for his work towards acid attack survivors at the World Economic Forum 2018 held in Davos.\n(With IANS inputs)", "title": "After Receiving Honorary Doctorate By London University, SRK Gives A Moving Speech On Kindness!", "date_publish": "05/04/2019, 11:14:46", "description": "After the honorary doctorates from The University of Bedfordshire and The University of Edinburgh, superstar Shah Rukh Khan has received an honorary doctorate in Philanthropy by The University of Law, London. Shah Rukh Khan received the merit during a graduation ceremony for more than 350 students here on Thursday.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-receiving-honorary-doctorate-by-london-university-srk-gives-a-moving-speech-on-kindness-364908.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_1554444029_800x420.jpg"}