{"text": "After Vicky Kaushal Confirms He Is 'Ekdum Single', Harleen Sethi Writes A Heartfelt Note On Her Breakup\nAfter Vicky Kaushal Confirms He Is 'Ekdum Single', Harleen Sethi Writes A Heartfelt Note On Her Breakup\nVicky Kaushal is the current heartthrob right now, all thanks to his outstanding performances in Sanju, Raazi and Uri, after giving back to back hits, he has become the most bankable actor.\nAfter becoming a star, every move of Mr. Kaushal is being tracked especially his personal life. There were rumours that he was dating Harleen Sethi, but looks like with fame, their relationship went sour and they parted ways. Does this not remind you of Sushant and Ankita Lokhande's tragic love story?\nYes, the actor confirmed at an award show he is ekdum single. So much so, that they have both unfollowed each other on Instagram.\nThe Broken and Beautiful actress kept her mum over her entire link up and break up with the Uri star. But now she wrote an indirect post which screams she is not affected by her breakup.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHer heartfelt note on breakup is winning internet’s heart and how. Have a look to what the actress has written.\n“From where I started. To where I've come. I didn't design this path. His will was welcome. Fearlessly hustling. Energetic and bustling. I found who I was. A small fish in a big pond .\nI enjoyed the eccentricities. Performances and anxieties. Feeling alive everyday. Making a mark in my own way. Link ups don't build me.\nBreakups don't break me. Wins don't fill me. Failures don't kill me. I feel complete. I feel sufficient. I have my own swag. I am my own tag. #iammyowntag #harleensethi”.\nClearly, Harleen has made a mark on her own and she is here to survive no matter what.", "title": "After Vicky Kaushal Confirms He Is 'Ekdum Single', Harleen Sethi Writes A Heartfelt Note On Her Breakup", "date_publish": "19/04/2019, 15:11:17", "description": "Vicky Kaushal is the current heartthrob right now all thanks to his outstanding performances in Sanju, Raazi and Uri, after giving back to back hits he has become the most bankable actor. After becoming a star his every move has been written including his personal life. There were rumours that he is dating Harleen Sethi, but of late he confirmed at an award show he is ekdum single. Before him conf", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-vicky-kaushal-confirms-he-is-ekdum-single-harleen-sethi-writes-a-heartfelt-note-on-her-breakup-365759.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vicky_kaushal_and_harleen_sethi_1555667752_800x420.jpg"}