{"text": "After Anushka Travels With Virat To New Zealand, BCCI Calls Touring With Families A ‘Headache’\nAfter Anushka Travels With Virat To New Zealand, BCCI Calls Touring With Families A ‘Headache’\nEven before Virat Kohli had married Anushka Sharma, a lot of people used to troll her for her presence at the stadiums. Some would even blame her for Virat’s low score and India losing matches. Has that ended post their wedding? Apparently not!\nVirat Kohli is currently holidaying with Anushka Sharma in New Zealand after successfully leading the team in 3 out of the 5 ODIs against the country.\nBut it wasn’t long ago that Anushka Sharma was trolled for travelling with the team when they had landed in Auckland for the ODI series with New Zealand. “BCCI adopted Anushka Sharma or what,” asked trolls.\nBCCI adopted Anushka Sharma or what — KampilyaWasi🇮🇳 (@KampilyaW) January 20, 2019\nAnd this kick-started the debate on players’ families travelling along with them for overseas assignment, and hence, bothering the BCCI. Not only the wives, a lot of times, cricketers take along their children as well.\n“If the team is travelling with less number of members, it is easier to manage. It's easy for BCCI staff to make off-field arrangements. Right from booking tickets to rooms, the entire management of handling the arrangement is with BCCI,” a source close to BCCI told TOI.\nDon't Miss 3.4 K SHARES 837 SHARES 518 SHARES\n“It would be a logistical nightmare if this arrangement - of families travelling with the players - continues to be there in England for the entire duration of the World Cup,” said that official adding that it’s not the question of money but the “logistical headache” is something that the management hasn’t been able to sort out as of yet. \"", "title": "After Anushka Travels With Virat To New Zealand, BCCI Calls Touring With Families A ‘Headache’", "date_publish": "02/02/2019, 17:52:27", "description": "Virat Kohli is currently holidaying with Anushka Sharma in New Zealand after successfully leading the team in 3 of the 5 ODIs against. And this kick-stared the debate on players’ families travelling along with them for overseas assignment, and hence, bothering the BCCI. Not only the wives, a lot of times, cricketers take along their children as well.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-anushka-travels-with-virat-to-new-zealand-bcci-calls-touring-with-families-a-headache-361473.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/after_anushka_sharma_travels_with_virat_kohli_to_new_zealand_bcci_admits_to_touring_headache_1549107983_800x420.jpg"}