{"text": "After The Release Of GoT Season 8's Kickass Trailer, It’s Raining Memes & Jokes On The Internet\nAfter The Release Of GoT Season 8's Kickass Trailer, It’s Raining Memes & Jokes On The Internet\nIt came late but it was worth the wait. Finally, after a wait for two long years, HBO unveiled the Game Of Thrones season 8 trailer. There’s going to be a huge battle, and all your favourite characters are already prepping up for it. It’s going to be a battle between the dead and the living.\nvia GIPHY\n\"Our enemy doesn't tire, doesn't stop, doesn't feel,\" says Jon Snow in the trailer. He is indeed talking about the Night King, whose glimpse wasn’t even shown in the trailer. Yet, it had a lot for Game Of Thrones fans to ponder on.\nvia GIPHY\nWe have watched the trailer a dozen times already. Can you get over it? Well, looks like no one can. Now, fans have turned the trailer into jokes and memes, and it couldn’t have got more hilarious. Take a look!\n#1\nit's been almost two years since season 7 and Cersei didn't finished her glass of wine yet! #GameOfThrones pic.twitter.com/UTtw8zcrjp — Tariq|طارق (@TqAnazi) March 5, 2019\n#2\n#3\nMe after watching Daenerys painfully closing her eyes#GameOfThrones pic.twitter.com/r1KQitjXtO — higher further faster (@narry_dreamer) March 5, 2019\nDon't Miss 161 SHARES 842 SHARES\n#4\n“how many times have you watched the #GameOfThrones trailer today”pic.twitter.com/7J0QquDmf9 — Melissa Pitchford (@meesathebear) March 5, 2019\n#5\nMe calling up the Lord of Light if Arya dies #GameofThrones⁠ ⁠ pic.twitter.com/etQJCu6vws — Free Folk Memes (@FreeFolkMemes) March 5, 2019\n#6\nI figured it out. Cersei knows Arya is alive and has sent The Mountain to kill her. She is running from Gregor and he is just about to end her then The Hound steps in to save her. Cleganebowl begins. Hype. #GameofThrones pic.twitter.com/VfQmg46vM2 — Lady Stoneheart (@LSHNorthAF) March 6, 2019\n#7\ncersei drinking wine and chilling in king's landing while everyone is fighting for the future of humankind and life itself in winterfell is such a mood what an icon pic.twitter.com/cffm2LwCLI — sharon tate's ghost (@oscarwiIding) March 5, 2019\n#8\n#9\n#10\nexcuse me sir, where can I find the road to Winterfell?\n#GameOfThrones #ajax pic.twitter.com/F8RZ0kzVrb — Dog Of Humour (@dogofhumour) March 5, 2019\n#11\nOh my god the GOT final trailer😭😭😭😭😭😭😭😭 all my faves are going to die yoh this is tew much 😟😭😭😭😭😭😭 #GameOfThrones pic.twitter.com/rmI4pyVk6l — Mamacitttaaa (@theeunknownzo) March 5, 2019\n#12\nMe: I hope all #GameofThrones plot lines resolve themselves in a satisfying manner, and that none of my favourite characters die.\nGeorge RR Martin: pic.twitter.com/YdaCIxQBSR — JR (@JermaineRowe) March 5, 2019\n#13\nQyburn almost looked like he was appalled by her, which is freaking saying something.\nWhen the mad scientist thinks a line has been crossed, you know deep shit is coming#GameofThrones pic.twitter.com/ldFGXDwkET — The Great War Is Here (@iAintUrBro) March 5, 2019\n#14\n#15\nQyburn almost looked like he was appalled by her, which is freaking saying something.\nWhen the mad scientist thinks a line has been crossed, you know deep shit is coming#GameofThrones pic.twitter.com/ldFGXDwkET — The Great War Is Here (@iAintUrBro) March 5, 2019\nGame of Thrones season 8 will hit the TV screens on April 14.", "title": "After The Release Of GoT Season 8's Kickass Trailer, It’s Raining Memes & Jokes On The Internet", "date_publish": "07/03/2019, 12:38:36", "description": "Game of Thrones memes and jokes are all over the internet. It came late but it was worth the wait. Finally, after a wait for two long years, HBO unveiled the Game Of Thrones season 8 trailer. There’s going to be a huge battle, and all your favourite characters are already prepping up for it. It’s going to be a battle between the dead and the living.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-the-release-of-got-season-8-s-kickass-trailer-it-s-raining-memes-jokes-on-the-internet-363297.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/after_the_release_of_amazing_game_of_thrones_trailer_its_raining_memes__jokes_on_internet_1551941423_800x420.png"}