{"text": "There are some losses in life that never let you recover fully. Losing a loved one to death is certainly one of them. For Boney Kapoor and his family, life turned upside down with the tragic loss of Sridevi.\nAgencies\nThe veteran actress passed away in Dubai after the accidental drowning in the hotel bath-tub. The entire Kapoor clan came together to mourn this loss. This sudden loss extremely terrible for the entire family, especially her kids. Till today, neither the kids nor her husband Boney Kapoor has recovered fully from it.\nViral Bhayani\nIn fact, we have seen him tear up and break down at several public events. Recently, the filmmaker was in Goa with daughter Janhvi Kapoor, where he again mentioned his wife and spoke about the loss that still feels heavy in the heart. Talking about the phase in life where he had no option but to bounce back to life, he said,\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I was going through a phase where I didn’t know what was happening.\"\nThe only consolation that became the medicine to his grief was seeing all his children uniting. This tragedy brought all his children including Arjun Kapoor, Janhvi Kapoor, and Khushi Kapoor together and that became his strength to overcome it all. He added,\nAgencies\n\"The children coming together gave me a lot of strength to cope up with the situation we were facing. I couldn’t have asked for more. For a parent, children come first and seeing all my 4 children together was….kind of a balming effect after the tragedy.\"\nBoney Kapoor was present at IFFI Goa, along with daughter Janhvi Kapoor who made her debut with Dhadak this year. Watch their entire conversation right here.", "title": "After The Tragic Loss Of His Wife Sridevi, Boney Kapoor Found Strength In His Children's Reunion", "date_publish": "24/11/2018, 11:55:22", "description": "“I was going through a phase where I didn’t know what was happening.\" The only consolation that became the medicine to his grief was seeing all his children uniting. This tragedy brought all his children including Arjun Kapoor, Janhvi Kapoor, and Khushi Kapoor together and that became his strength to overcome it", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-the-tragic-loss-of-his-wife-sridevi-boney-kapoor-found-strength-in-his-children-s-reunion-357291.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/boney_kapoor_1543041874_800x420.jpg"}