{"text": "After Shooting An Action Sequence With Randeep Hooda In Ahmedabad, Chris Hemsworth Returns To Mumbai\nAfter Shooting An Action Sequence With Randeep Hooda In Ahmedabad, Chris Hemsworth Returns To Mumbai\nAussie superstar Chris Hemsworth aka Thor from Avengers is currently in India, where he is shooting for his upcoming film on Netflix, Dhaka.\nReports claim that in the film, Chris will be seen playing the role of a mercenary who is hired for rescuing a kidnapped child. The film will also star actor Randeep Hooda, who will be playing the role of a gangster. Chris is completely enjoying his stay in India and we've seen enough proofs.\nHe was recently in Ahmedabad, where he shot for an extensive action sequence with Randeep Hooda.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nAfter completing the schedule, he has flown back to Mumbai. Reports claim that Chris landed in Mumbai during the wee hours of the morning.\nHe will be shooting in the locations of Dharavi and Byculla in Mumbai.\n(Also read: Chris Hemsworth-Tom Hiddleston Turn Desi As They Extend Heartiest Diwali Wishes To Their Fans!)\nNot many know that a fan broke into his gym in Ahmedabad during his workout session and that's the reason why his stay in Mumbai will include tight security.", "title": "After Shooting An Action Sequence With Randeep Hooda In Ahmedabad, Chris Hemsworth Returns To Mumbai", "date_publish": "17/11/2018, 11:58:56", "description": "Reports claim that in the film, Chris will be seen playing the role of a mercenary who is hired for rescuing a kidnapped child. The film will also star actor Randeep Hooda, who will be playing the role of a gangster. Chris is completely enjoying his stay in India and we've seen enough proofs.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-shooting-an-action-sequence-with-randeep-hooda-in-ahmedabad-chris-hemsworth-returns-to-mumbai-356837.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/chris_1542436447_800x420.jpg"}