{"text": "Even though Ned Stark died in the first season of Game of Thrones, he remains to be one of the most important and loved characters of the show. Known to be honourable, fair and loyal, Ned Stark’s death ended up being the catalyst of all the major things that have happened on the show so far.\nThe fact that he is gone is still heartbreaking for fans. If his character would have been alive, the story of Game of Thrones would have been different altogether. But what if we tell you that he is making a comeback on Game of Thrones season 8.\nfanpop.com\nYes, you read that right. You will get to see Sean Bean AKA Ned Stark on the show yet again for one last time. But wait, there’s a catch.\nimgix.net\nWondering how his dead character will return on the show? Well, he will not exactly be a part of the story of season 8, and rather he will return for the reunion episode.\nfanpop.com\nDon't Miss 161 SHARES 896 SHARES\nNed Stark recently revealed that the makers of Game of Thrones season 8 are shooting for a special reunion episode, and he will be a part of it.\n“It was the last episode, so we all got together… They decided to get all the characters together for a bit for this big show in Belfast and he kind of hosted the evening,” he told The Hollywood Reporter.\nGame of Thrones season 8 will premiere in “first half” of 2019. While the makers haven’t yet revealed the release date for the finale season, fans think that the show will be aired in April.", "title": "After Getting Brutally Killed In Season 1, Ned Stark Will Return In Game Of Thrones Finale For A Special Episode!", "date_publish": "22/10/2018, 14:19:39", "description": "Even though Ned Stark died in the first season of Game of Thrones, he remains to be one of the most important and loved characters. Wondering how his dead character will return on the show? Well, he will not exactly be a part of the story of season 8, and rather he will return for the reunion episode.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-getting-brutally-killed-in-s1-ned-stark-will-return-in-got-finale-for-a-special-episode-355206.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sean_bean_aka_ned_stark_will_return_in_game_of_thrones_season_8_in_a_special_reunion_episode_1540197138_800x420.png"}