{"text": "After His Comment On Pulwama Attack, Navjot Singh Sidhu Gets Sacked From The Kapil Sharma Show\nAfter His Comment On Pulwama Attack, Navjot Singh Sidhu Gets Sacked From The Kapil Sharma Show\nJust yesterday, #BoycottSidhu was trending on Twitter, and looks like he has indeed been sacked from The Kapil Sharma Show.\nWhile the entire nation condemned the Pulwama terror attacks, Navjot Singh Sidhu said that it was not proper to blame the entire country (Pakistan) for a “a handful of people.”\n“For a handful of people, can you blame the entire nation and can you blame an individual?,” he had said adding, “It (the attack) is a cowardly act and I condemn it firmly. Violence is always condemnable and those who did it must be punished.”\nHis comments had left people fuming, and soon after hashtags #BoycottSidhu, #BoycottKapilSharmaShow and #BoycottSonyTV started to trend on Twitter.\n@SonyTV @KapilSharmaK9 We request you to expel @sherryontopp from The Kapil Sharma Show & show courtesy to nation where you earn revenue. Removing him would be great tribute to our martyrs of Pulwama,else we would boycott this show henceforth \"Kapil Sharma\" — Hitesh Vyas (@vyashit) February 15, 2019\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n@KapilSharmaK9 remove @sherryontopp from your show. Or we will boycott #TheKapilSharmaShow . I request everyone to start campaign against Siddhu and against The Kapil Sharma Show. @SonyTV — chandan kumar (@krchandan20) February 15, 2019\nThrow Out Sidhu From The Kapil Sharma Show Or Els We #Boycott The Kapil Sharma Show..!!@SonyTV @KapilSharmaK9 — Soumya Roy (@SamRoy_) February 15, 2019\nIndia can forgive Chetan Sharma for that sixer off his last ball, but it will never forgive #NavjotSinghSidhu for being Pakistan’s 12th man at the nation’s darkest hour.#boycottsidhu — Abhijit Majumder (@abhijitmajumder) February 15, 2019\nNow, according to a report on Times Now, the channel has indeed sacked Navjot Singh Sidhu.\n“The channel has told the production house to sack Sidhu. It’s not a temporary thing. They are going to get him out. In fact, even in the past, during the MeToo movement, when there were allegations against Anu Malik, the channel took a stand. The channel has shot a couple of episodes with Archana Puran Singh and most probably, she will be the one replacing Sidhu,” a source told the publication.\nAlso Read: To Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17", "title": "After His Comment On Pulwama Attack, Navjot Singh Sidhu Gets Sacked From The Kapil Sharma Show", "date_publish": "16/02/2019, 15:55:36", "description": "Just yesterday, #BoycottSidhu was trending on Twitter, and looks like he has indeed been sacked from The Kapil Sharma Show. While the entire nation condemned the Pulwama terror attacks, Navjot Singh Sidhu said that it was not proper to blame the entire country (Pakistan) for a “a handful of people.”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-his-comment-on-pulwama-attack-navjot-singh-sidhu-gets-sacked-from-the-kapil-sharma-show-362270.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/after_his_comments_on_pulwama_attack_navjot_singh_sidhu_gets_sacked_from_the_kapil_sharma_show_1550311862_800x420.png"}