{"text": "After Marrying The Love Of Her Life Nick Jonas, Priyanka Chopra Is The Happiest She’s Ever Been\nAfter Marrying The Love Of Her Life Nick Jonas, Priyanka Chopra Is The Happiest She’s Ever Been\nFrom childhood, we have been hearing fairy tales, in which the prince charming arrives at the right time to sweep the princess off her feet and turn her miserable life into a perfect dream. That’s how we have all imagined our wedding day to be like, right?\nIt’s the best day of her life, some say, a beginning of a new happy phase. You plan it, love it and live every bit of it. The would-be-bride and the groom-to-be are high on happiness on their D-day, we have all seen.\nReuters\nAlso Read: To Shower Blessings Upon The Newlyweds, PM Modi Arrives At Priyanka-Nick's Delhi Reception\nThat’s exactly how our desi girl Priyanka Chopra is feeling at the moment. Everyone including celebrities, friends and family members are pouring out their good wishes to the lovebirds, including PM Modi who blessed the couple. And Priyanka says she is the happiest at the moment.\nA heartfelt thank you to our Hon'ble Prime Minister Shri @narendramodi ji for gracing us with your presence. Touched by your kind words and blessings. @nickjonas pic.twitter.com/ktGguBra0N — PRIYANKA (@priyankachopra) December 5, 2018\nAlso Read: PM Modi Gifted PC-Nick The Exact Same Thing He Gave Virat-Anushka - Two Beautiful Red Roses!\n“On a scale of 1 to 10 in happiness, I’m on 12,” she told IANS at her wedding reception party at the Taj Palace Hotel in New Delhi yesterday.\n“And forever starts now,” she wrote posting her wedding pictures.\nDon't Miss 264 SHARES 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nThe party isn’t over yet. Priyanka Chopra and Nick Jonas are yet to throw another wedding reception in Mumbai for their friends from the B-Town. The duo is yet to announce the date.\nAlso Read: 75-Foot Veil & 18-Foot Cake! Priyanka-Nick’s Wedding Pictures Cause A Meme Storm On Internet", "title": "After Marrying The Love Of Her Life Nick Jonas, Priyanka Chopra Is The Happiest She’s Ever Been", "date_publish": "05/12/2018, 17:23:26", "description": "That’s exactly how our desi girl Priyanka Chopra is feeling at the moment. Everyone including celebrities, friends and family members are pouring out their good wishes to the lovebirds, including PM Modi who blessed the couple. And Priyanka says she is the happiest at the moment.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-marrying-the-love-of-her-life-nick-jonas-priyanka-chopra-is-the-happiest-she-s-ever-been-358006.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_marrying_the_love_of_her_life_nick_jonas_priyanka_chopra_is_the_happiest_shes_ever_been_1544010220_800x420.jpg"}