{"text": "India is finally ready to listen to the sexual harassment stories of people and believe in them too. Men have been sexually harassing women from ages, and the fact that India is one of the most dangerous countries for women is no longer a secret, is it?\namazon.com\nThe #MeToo movement has finally taken a shape in India giving courage and confidence to people who are now calling out their sexual predators. The list of those accused is long and is constantly getting updated. Recently, the name that has joined the bandwagon is Anu Malik.\nAfter singer Sona Mohapatra accused him of sexual misconduct, another singer Shweta Pandit, who debuted in the world of Bollywood with Yash Raj Film's Mohabbatein, recounted what happened with her when she 15 years ago. In her Twitter post, she revealed Anu Malik told her he would give her work if she would kiss him.\nHad to go back to my worst memory as a teenage girl today to write this and speak up - its now or never. This is my #MeToo and have to warn young girls about #AnuMalik & let you know your #TimesUp @IndiaMeToo\nThank you @sonamohapatra for speaking up about him & supporting this pic.twitter.com/e261pGQyEq — Shweta Pandit (@ShwetaPandit7) October 17, 2018\nDon't Miss 193 SHARES 362 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nDenying allegations put against him by Sona Mohapatra, Anu Malik in a statement said that he had never met her and nor had he worked with her.", "title": "After Sona Mohapatra, Singer Shweta Pandit Accuses 'Paedophile' Anu Malik Of Sexual Harassment", "date_publish": "18/10/2018, 11:39:29", "description": "After singer Sona Mohapatra accused him of sexual misconduct, another singer Shweta Pandit, who debuted in the world of Bollywood with Yash Raj Film's Mohabbatein, recounted what happened with her when she 15 years ago. In her Twitter post, she revealed Anu Malik told her he would her work if she would kiss him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-sona-mohapatra-singer-shweta-pandit-accuses-paedophile-anu-malik-of-sexual-harassment-354994.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/after_sona_mohapatra_singer_shweta_pandit_accuses_paedophile_anu_malik_of_sexual_harassment_1539841570_800x420.png"}