{"text": "In a rather shocking turn of events, Cricketer-turned-politician, Navjot Singh Sidhu has been sacked from the The Kapil Sharma Show. This came after his comments on unfortunate Pulwama terror attack.\nA lot of objections were raised after his comments after which he was removed from the show. During Sidhu's recent media interaction after the Pulwama attack, he had stated,\nAgencies\n\"For a handful of people, can you blame the entire nation and can you blame an individual? It (the attack) is a cowardly act and I condemn it firmly. Violence is always condemnable and those who did it must be punished.”\nHe received backlash for his comments after which people demanded his exit from the show. If reports are to be believed, Archana Puran Singh has been roped in for now and she has even shot for a few episodes.\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nA report quoted Archana Puran Singh saying,\n\"I had shot for TKSS on the 9th and 13th of February, a day before the unfortunate attacks happened. I was called in by the channel because Sidhu wasn't available for those days for some personal work/ I agreed to shoot for the dates as I have done the same before. I think people are joining the wrong dots that I am replacing Sidhu because of the backlash. Well, also if that is true, I haven't received any confirmation or information on the same from the channel yet.\"\nShe further added,\n\"If I am truly needed for TKSS, then I will have to actually figure out how to adjust the dates because I am already shooting for 'My Name Is Lakhan' with Shreyas Talpade and also for another movie. I can only give clarity when I get it myself. Whether I would want to go ahead with TKSS or not is not the question, but will I be able to go ahead or not is the point. Let's see.\"", "title": "After Being Sacked From The 'Kapil Sharma Show', Archana Puran Singh Replaces Navjot Sidhu", "date_publish": "17/02/2019, 17:05:07", "description": "In a rather shocking turn of events, Cricketer-turned-politician, Navjot Singh Sidhu has been sacked from the The Kapil Sharma Show. This came after his comments on unfortunate Pulwama terror attack. A lot of objections were raised after his comments after which he was removed from the show.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-being-sacked-from-the-kapil-sharma-show-archana-puran-singh-replaces-navjot-sidhu-362318.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/navjot_singh_sidhu_1550403474_800x420.jpg"}