{"text": "If you don’t go out and cast the vote, you will lose the right to complain in future. Polling for Lok Sabha elections is already going on, and it’s time to pick your leaders. It’s time to go out and vote.\nFor the longest time we have been complaining sitting behind our computer screens, now is the time to make a difference. And hence, everyone is appealing to the citizens of the nation to vote, including Bollywood celebs like Aamir Khan, Saif Ali Khan and Shah Rukh Khan.\nAamir Khan, who is the national icon of the Election Commission Of India, in a video, said, “World's largest democracy, one more time, will choose a new government for itself. Every citizen will get the opportunity to become a part of this process. We often forget that in order to deliver this right to vote to us, our ancestors had sacrificed a lot. So, let's remember them and take an oath that we will definitely cast our vote. For our country, we will fulfil our important responsibility. Jai Hind.”\nNot voting isn’t an option, said Saif Ali Khan.\n“Yes... the act of voting in the largest democracy in the world is obviously a very unifying thing. Voting is the most important thing that you can do as a citizen of this country. Young people notoriously do not vote and I think that is the reason we have been brought here today is to speak at this forum to try and influence and point out the importance of that vote.\"\nDon't Miss 638 SHARES 182 SHARES 468 SHARES 175 SHARES 275 SHARES\n“Living in a democracy, that voice you have and that importance you have to effect change is the most important thing. I think that unity and that awareness of that democracy is why we are here. Every vote is important and I think not voting should not be an option. You can really affect positive change and I think one of the things that any government or any leader should fear and be really aware of is the power of unity, of union, in this country.”\nA few days ago, Shah Rukh Khan had also urged people to cast their vote in a rap video.", "title": "After Shah Rukh Khan, Aamir And Saif Urge People To Cast Their Vote In The Lok Sabha Elections", "date_publish": "25/04/2019, 11:51:46", "description": "Aamir Khan, who is the national icon of the Election Commission Of India, in a video, said, “World's largest democracy, one more time, will choose a new government for itself. Every citizen will get the opportunity to become a part of this process. We often forget that in order to deliver this right to vote to us, our ancestors had sacrificed a lot. So, let's remember them and take an oath that we", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-shah-rukh-khan-aamir-and-saif-urge-people-to-cast-their-vote-in-the-lok-sabha-elections-366054.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/after_shah_rukh_khan_aamir_and_saif_urge_people_to_cast_their_vote_in_this_lok_sabha_elections_1556172583_800x420.png"}