{"text": "Before you question why Taimur is so important – let us tell you that his single picture is sold for Rs 1,500 by paparazzi. Also, he is one of the top 10 newsmakers of the year, according to Yahoo, competing against PM Modi who topped the list. And if you didn’t know it already, his nanny’s salary is more than that of the prime minister of the nation. He is two-years-old but he is a big star already.\nWe know it’s highly arguable if he became popular because of media or did the media followed his popularity, but what we know is that the little munchkin’s stardom is going out of control.\nFor those of you who don’t know, there’s his look-alike doll that is being sold online. Cute or creepy, we leave it on you to decide.\nAlso Read: Saif Ali Khan Is Stunned Seeing Taimur’s Doll, Feels He Should Trademark His Son's Name\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 707 SHARES\nAnd it’s not only the common people, but even celebrities including Alia Bhatt, Ranveer Singh and Deepika Padukone can’t get enough of Taimur’s cuteness. On Koffee With Karan, Ranveer Singh had revealed that he is fond of him that he can’t wait to play his father in his future films. No, we are not kidding.\nRead More: Ranveer Singh Is So Obsessed With Taimur That He Can't Wait To Work With Him In The Future\nAnd now that Ranveer is busy promoting his upcoming film titled Simmba with Sara Ali Khan, guess what he was greeted with on the sets of Sa Re Ga Ma Pa? Taimur’s Doll!\nPeople on the sets of Sa Re Ga Ma Pa are quite obsessed with Taimur. The last time Sara had visited the sets, they gave her a Taimur Doll too.", "title": "After Sara, Ranveer Singh Meets Taimur Doll & As Expected, He Couldn't Contain His Excitement!", "date_publish": "11/12/2018, 11:43:03", "description": "Ranveer is busy promoting his upcoming film titled Simbba with Sara Ali Khan, guess what he was greeted with on the sets of Sa Re Ga Ma Pa? Taimur’s Doll! On Koffee With Karan, Ranveer Singh had revealed that he is fond of him that he can’t wait to play his father in his future films. No, we are not kidding.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-sara-ranveer-singh-meets-taimur-doll-as-expected-he-couldn-t-contain-his-excitement-358318.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wanting_to_play_his_father_in_future_films_ranveer_singh_beams_with_joy_after_meeting_taimur_doll_1544508230_800x420.png"}