{"text": "After A Really Long Wait, Here Are The First Pics Of Newlyweds Ranveer Singh & Deepika Padukone!\nAfter A Really Long Wait, Here Are The First Pics Of Newlyweds Ranveer Singh & Deepika Padukone!\nEven a million reasons to gush over them are not enough. Ranveer Singh and Deepika Padukone tied the knot as per Sindhi rituals today. On Wednesday, the couple married in a traditional Konkani ceremony in Italy’s Lake Como.\nUnlike other celebrity weddings that are turned into live hashtagged events, this one was phenomenal too, but for various other reasons. The couple took some special measures to protect their privacy.\nViral Bhayani\nAccording to reports, the measures included sealing and taping the lens of the phone cameras of all the guests to make sure no pictures are taken.\nSLB Films\n(Also read: DeepVeer To Enter The Bond Of Holy Matrimony In Konkani Ceremony Today. Here Are All The Deets!)\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nPinterest\nThe couple is very particular about what photos from the wedding goes public. The Wedding Filmer, who also covered Anushka Sharma and Virat Kohli's wedding in Italy has been appointed to cover all the wedding ceremonies.\nPinterest\nAccording to a report by Timesnow, the couple bought a royal vintage boat worth Rs 4 crore. A clip of Baraatis singing and dancing while making their grand entry is doing rounds on social media.\nWell, after all the grainy pictures and leaked photos from the venue, we finally have official pictures shared by the couple on their social media handles. As promised, Ranveer and Deepika themselves took to social media to give their fans and everyone a special glimpse of their wedding.\n#WATCH: Latest visuals from Villa del Balbianello at Lake Como, the wedding venue of Deepika Padukone & Ranveer Singh, in Italy's Lombardy. pic.twitter.com/kICPHl4sxE — ANI (@ANI) November 15, 2018\nLet's have a look at the pictures and sulk a little more about being single.\nDeepika and Ranveer will head back to India and will host three wedding receptions in the country. They will head to Bangalore first, on November 21 and two receptions are scheduled to happen in Mumbai on November 28 and December 1.", "title": "After A Really Long Wait, Here Are The First Pics Of Newlyweds Ranveer Singh & Deepika Padukone!", "date_publish": "15/11/2018, 20:37:56", "description": "As promised, Ranveer and Deepika themselves took to social media to give their fans and everyone a special glimpse of their wedding. Let's have a look at the pictures and sulk a little more about being single. Well, after all the grainy pictures and leaked photos from the venue, we finally have official pictures shared by the couple on their social media handles.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-a-really-long-wait-here-s-the-first-pic-of-newly-weds-ranveer-singh-deepika-padukone-356720.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1542292708_800x420.jpg"}