{"text": "After A Much-Talked About Bollywood Comeback, Bobby Deol Set To Make His Digital Debut With SRK\nAfter A Much-Talked About Bollywood Comeback, Bobby Deol Set To Make His Digital Debut With SRK\nBollywood actor Bobby Deol has been in the industry for more than two decades but took a break after his stint in Thank You and Dostana. After almost 6-7 years, Bollywood's godfather Salman Khan revived his career with Race 3 and he couldn't be more thankful.\nRace 3/Screengrab\nAnd now Bobby Deol has been juggling with events, movies, red carpet appearances and airport looks. From wrapping up the shoot of Houseful 4 to participating in Celebrity cricket league, Bobby Deol is back in action like never before.\nAfter his successful comeback with Race 3, Bobby Deol is ready to collaborate with yet another Khan on a digital platform.\nDon't Miss 862 SHARES 346 SHARES 812 SHARES\nInstagram/Bobby Deol\nYes, as per reports in Pinkvilla, Bobby has signed up for an original film with SRK’s production house Red Chillies Entertainment. This will be the first time we would see the dynamic duo come together to create an interesting project in the digital world.\nProduced by Shah Rukh Khan, the film will be one of the anticipated projects to watch out for. Deols and Khans have always maintained friendly relations, so much so, that SRK had even promoted Yamla Pagla Deewana back in 2011.\nIt will be interesting to see what genre of movie the duo will create. SRK and Bobby Deol will last seen together for Om Shanti Om for their popular title track.", "title": "After A Much-Talked About Bollywood Comeback, Bobby Deol Set To Make His Digital Debut With SRK", "date_publish": "17/04/2019, 12:46:43", "description": "After a successful stint with Salman Khan during Race 3, Bobby Deol is all set to collaborate with Shah Rukh Khan.After a successful stint with Salman Khan during Race 3, Bobby Deol is all set to collaborate with Shah Rukh Khan. And now Bobby Deol has been juggling with events, movies, red carpet appearances, airport looks.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-a-much-talked-about-bollywood-comeback-bobby-deol-set-to-make-his-digital-debut-with-srk-365602.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bobby_deol_1555482858_800x420.jpg"}