{"text": "The Khans are losing their charm. After Race 3 and Thugs Of Hindostan, Shah Rukh Khan’s much-awaited film Zero also fell flat at the box office. Talking in the same concern, Tigmanshu Dhulia in an IANS interview said that even big budget films need good scripts now. Interestingly, Tigmanshu Dhulia has played the role of Shah Rukh Khan’s father in Zero.\nHis directorial career includes National Award winning film Paan Singh Tomar and Saheb Biwi Aur Gangster and his acting prowess was captured brilliantly in projects like Manjhi - The Mountain Man and Gangs of Wasseypur.\"\nActor-writer-director Tigmanshu Dhulia, who is now playing the role of Shah Rukh Khan's father in Zero, feels that even big budget films need a good script now.\nHe also emphasised that after 1960s the respect for a content writer went down significantly and that must change now.\nDon't Miss 5.1 K SHARES 468 SHARES 153 SHARES 343 SHARES 2.4 K SHARES\nBCCL\n\"Big budget films have started to face this challenge of just being big budget and loaded with stars. But even big budget films need a good script now. Look at 'Thugs of Hindostan'. The stars delivered what they promised because the first day collections were phenomenal. So people went to see Amitabh Bachchan and Aamir Khan, but from the second day the collections sank,\" he said.\n\"So, whether it's a big budget film or not, content is the king. The audience is smart and the type of things that are coming up online has given a good exposure to the audience to quality content,\" Timangshu added.\nTwitter\n\"I think after 1960's the respect for a content writer went down significantly and that must change now,\" Dhulia told IANS over an e-mail when asked that how one should take care of both commercial imperatives and creative ambition in today's time of filmmaking?\nHe was present at a grand scale theatrical play of Mahabharata from the point of view of Gandhari, Kunti and Draupadi, by students of Mount Litera School International. Following its inquiry-based learning methodology, the play aimed to imbue Indian values in the students and showcase human frailties, character flaws and highlight follies of the great and good of society.\nBCCL\nHaving grown up in Allahabad in Uttar Pradesh, the filmmaker says he tries to incorporate his small-town experience in his cinematic presentation. His films including \"Haasil\", \"Charas\" and \"Shagird\", though did an average business at the box- office, but is still alive in the minds of moviegoers inspite of having no big stars in it.\nWhen asked if Indian cinema was moving away from the fascination of Khan era with new faces taking the lead, he said cinema is now addressing a larger audience.\n\"Earlier, multiplexes were present only in big cities, but we see them now in smaller towns as well. Hence cinema is also addressing characters from small towns. Look at Ayushmann Khurrana and Rajkummar Rao -- their characters are from small towns,\" he said.\n\"The Khans of the industry typically played glamorous roles and not these roles. Also, these smaller towns are contributing significantly to the revenues hence that is also another reason these characters from small towns are considered,\" said Dhulia.\nDirected by Anand L. Rai, \"Zero\" was released on Friday and got a mixed reaction at the box-office with some critics calling the narrative weak, while some tagging the film as best coming from King Khan. The film also stars Anushka Sharma, Katrina Kaif, Mohammed Zeeshan Ayub, Abhay Deol, Sheeba Chaddha and Bijendra Kala.\nBCCL\nSo what made Dhulia say yes to the film and how was it working with Shah Rukh?\n\"Shah Rukh and I worked together during 'Dil Se' for which I had written the dialogues. Our friendship goes way back. In terms of 'Zero', there were twoo or three reasons for me to take it up. One -- The role was really different and unique and not like what I played in 'Ganges of Wasseypur',\" he said.\n\"Secondly Anand L. Rai is a dear friend who was making this technically heavy film with special effects. I was curious to see how he was making the film and learn more on the sets. And thirdly, one is always exited to work with Shah Rukh,\" he said.\nDhulia, who feeds his creative hunger through newspaper, books, travel and meeting new people, can see the future of entertainment moving to web.\n\"Most content would move to the web and the cinema theatres would only see big movies like Bhabhuli playing,\" he said.", "title": "After Thugs Of Hindostan’s Failure, Tigmanshu Dhulia Says Big Budget Films Need Good Scripts", "date_publish": "25/12/2018, 12:37:05", "description": "His directorial career includes National Award winning film \"Paan Singh Tomar\" and \"Saheb Biwi Aur Gangster\" and his acting prowess was captured brilliantly in projects like \"Manjhi - The Mountain Man\" and \"Gangs of Wasseypur\". Actor-writer-director Tigmanshu Dhulia, who is now playing the role of Shah Rukh Khan's father in \"Zero\", feels that even big budget films need a good script now.", "authors": [], "url": "https://www.indiatimes.com/entertainment/after-thugs-of-hindostan-s-failure-tigmanshu-dhulia-says-big-budget-films-need-good-scripts-359223.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/about_thugs_of_hindostans_failure_tigmanshu_dhulia_says_big_budget_films_need_good_scripts_1545720809_800x420.jpg"}