{"text": "After Sandhya Mridul and Vinta Nanda, actress Deepika Amin has come forward with her horrifying account of being harassed by Alok Nath. The actress who recently worked with Alok Nath in Sonu Ki Titu Ki Sweety has shared harrowing details from years ago.\nTaking to Twitter, Deepika wrote, \"Everyone in the industry knows that #AlokNath is an obnoxious drunkard who harasses women. Years ago on a telefilm outdoor shoot he tried to barge into my room. He slobbered over women, drunk and created a scene. The unit rallied around me and made sure I was safe. #metoo\nEveryone in the industry knows that #AlokNath is an obnoxious drunkard who harasses women. Years ago on a telefilm outdoor shoot he tried to barge into my room. He slobbered over women, drunk and created a scene. The unit rallied around me and made sure I was safe. #metoo — Deepika Amin (@amindeepika) October 10, 2018\nDeepika even wrote that while working for Sonu Ke Titu Ki Sweety, she found him quiet and subdued.\nFacebook/Deepika Amin\nDon't Miss 193 SHARES 862 SHARES 346 SHARES\nSeeing the number of allegations against the veteran actor, the Indian Film and Television Directors' Association (IFTDA) has issued a notice to him seeking his stand.\nSpeaking at a press conference, IFTDA president Ashok Pandit said, \"The entire federation supports the #MeToo movement. We have already drafted a notice which is to be issued to Alok Nath because Vinta Nanda is also a very respectable member of IFTDA.\"", "title": "After Vinta Nanda & Sandhya Mridul, Deepika Amin Accuses Alok Nath Of Harassment, IFTDA Issues Notice", "date_publish": "11/10/2018, 12:32:22", "description": "Alok Nath Now Accused By Deepika Amin Of Sexual Harassment, IFTDA Issue Notice After Allegations. After Sandhya Mridul and Vinta Nanda, actress Deepika Amin has come forward with her account of being harassed by Alok Nath. The actress who recently worked with Alok Nath in Sonu Ki Titu Ki Sweety has shared horrific details from years ago.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-vinta-nanda-sandhya-mridul-deepika-amin-accuses-alok-nath-of-harassment-iftda-issues-notice-354579.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bollywood_1539239656_800x420.jpg"}