{"text": "After DeepVeer's Wedding, Preparations Begin For Priyanka Chopra And Nick Jonas In Jodhpur\nAfter DeepVeer's Wedding, Preparations Begin For Priyanka Chopra And Nick Jonas In Jodhpur\nWhile fans still are not over Deepika Padukone and Ranveer Singh’s wedding, another big fat Bollywood wedding is around the corner. Priyanka Chopra and Nick Jonas will be tying knot this December and the preparations are already in full swing.\nThere are reports that Priyanka will walk down the aisle in queen style in Jodhpur. The actress has booked the Umaid Bhawan palace for her D-day. And now pictures and videos of Priyanka's mom from Jodhpur have left the fans elated. PeeCee’s mom was also seen talking to the paparazzi, where she refused to divulge any details about the wedding.\nIt is also reported that Priyanka will be joining her fiancée Nick Jonas' mom for the wedding shopping. The wedding will reportedly be taking place on December 2. 2018 including Sangeet and Mehendi ceremony. Well, we cannot contain our excitement for another fairytale wedding.\nBefore her wedding, Priyanka enjoyed her bachelorette like a true diva in Amsterdam with sister Parineeti, sister in law Sophie Turner and many friends.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nUnlike DeepVeer's wedding who got married in Italy, Priyanka's wedding is in India and hopefully we should be able to get real time pictures of the power couple.", "title": "After DeepVeer's Wedding, Preparations Begin For Priyanka Chopra And Nick Jonas In Jodhpur", "date_publish": "16/11/2018, 17:43:29", "description": "While fans still are not over Deepika Padukone and Ranveer Singh’s wedding, another big fat Bollywood wedding is on its way, Priyanka Chopra and Nick Jonas will be tying knot this December and the preparations are already in full swing. There are reports that Priyanka will walk the aisle in queen style in Jodhpur. The actress has booked the Umaid Bhawan palace for her big fat wedding. And now pict", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-deepveer-s-wedding-preparations-begin-for-priyanka-chopra-and-nick-jonas-in-jodhpur-356819.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_1542370877_800x420.jpg"}