{"text": "We are sure you know who Taimur Ali Khan is?! The two-year old’s popularity must have reached you, even if you have been living under a rock.\nvia GIPHY\nBut are you also aware that “Asia's Largest Online Shopping Store for kids & baby products” First Cry has a doll who looks like Taimur and is also named after him?\nSara Ali Khan, who is Taimur's sister, once got it as a gift on the sets of a reality TV show.\nAnd also, Ranveer Singh, who wants to play his father in his future films, was greeted with a Taimur doll on the same reality TV show. The obsession is quite huge, you see.\nSo, after Katrina Kaif, who was the first Bollywood icon to be crafted in the form of Barbie Doll, Taimur’s doll is actually a reality.\npinimg.com\nThe little one is a celebrity. His one picture costs Rs 1500. Now you know why paparazzi run after him. According to Yahoo, he is one of the top ten searched people in 2018, competing against PM Modi who bagged the top spot on the list. And his nanny’s salary is more than that of the PM. We sure can’t get over these facts. He is just two years old, after all.\nNow, according to a report on Pinkvilla, Madhur Bhandarkar who is known for making films such as Fashion and Page 3, has apparently registered a film title, which is Taimur. Is he actually making a movie on Kareena-Saif’s little cherub? Well, that’s what fans are wondering.\nDon't Miss 155 SHARES 2.5 K SHARES 263 SHARES\nTaimur Ali Khan is perhaps the best example of a born star, right?", "title": "After A Doll, A ‘Taimur’ Named Movie Is On Cards & Madhur Bhandarkar Has Registered The Title!", "date_publish": "16/12/2018, 14:40:33", "description": "Madhur Bhandarkar who is known for making films such as Fashion and Page 3, has apparently registered a film title, which is Taimur. Is he actually making a movie on Kareena-Saif’s little cherub? Well, that’s what fans are wondering. The little one is a celebrity. His one picture costs Rs 1500. Now you know why paparazzi run after him. According to Yahoo, he is one of the top ten searched people i", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-a-doll-a-film-called-taimur-is-in-the-works-madhur-bhandarkar-has-registered-the-title-358703.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_a_doll_a_taimur_named_movie_is_on_cards__madhur_bhandarkar_has_registered_the_title_1544947989_800x420.png"}