{"text": "2019 is proving to be a happy year for Emraan Hashmi. Apart from his exciting work projects, there is another development in his personal life that has brought him a huge relief. Hashmi took to his social media platform to share the news of his 9-year-old son Ayaan, who has finally been declared cancer free.\nTwitter\nEmraan, who is definitely a happy father today wrote a note, where he mentioned,\n\"Today, 5 years after his diagnosis, Ayaan has been declared cancer free. It has been quite a journey. Thank you for all your prayers and wishes. Love and prayers for all the cancer fighters out there, hope and belief go a long way. You can WIN this battle !!! #thekissoflife\"\nTo jog your memory a little, last five years has been a difficult one for the entire family as in February 2013, the first child of Emraan and wife Parveen Shahani, was diagnosed with first stage cancer.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n(Also read: After Battling Cancer, Emraan Hashmi's 6 YO Son Is Sending Thank You Notes To B-Town Actors In The Most Adorable Way!)\nInstagram\nAfter this jolt, Emraan Hashmi shared his story with the world in order to raise awareness about the disease. He got his first book The Kiss of Life: How A Superhero and My Son Defeated Cancer published, that documented the real story of his career, family, the birth of his son, cancer and treatment.\n(Also read: After A Book On Son’s Cancer, Emraan Hashmi Now Inaugurates India's 1st Cashless Cancer Hospital)", "title": "After A Battle Of Five Years, Emraan Hashmi's 9-Year-Old Son Finally Declared Cancer Free", "date_publish": "14/01/2019, 13:19:18", "description": "2019 is proving out to be a happy year for Emraan Hashmi. Apart from his exciting work projects, there is another development in his personal life that has brought him a huge relief. Hashmi took to his social media platform to share the news of his 9-year-old son Ayaan, who has finally been declared cancer free.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-a-battle-of-five-years-emraan-hashmi-s-9-year-old-son-finally-declared-cancer-free-360378.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hashmi_1547453620_800x420.jpg"}