{"text": "Bollywood actor Ranveer Singh is not just like any other A-lister. Ever since, he's made a debut, Ranveer has always been a little extra. From his appearances, his choice of clothes, his constant PDAs with then girlfriend Deepika Padukone, Ranveer Singh is nothing like a conventional star.\nTwitter\nThis is also one of the main reasons why we love to love him. He was also one of the progressive actors to take up a condom brand for endorsements. Yes, a mainstream Bollywood actor endorses a condom brand to an Indian audience for the past 5 years now is GUTS.\nAnd he openly celebrated sex and normalised this conversation in the country. From print ads, campaign to fun commercials, Ranveer Singh was all out promoting Durex. But looks like we won't see him endorsing the condom brand anymore\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nIf reports are to be believed, the reason behind this might be his marriage with actress Deepika Padukone. The actor married his co-star and longtime girlfriend Deepika Padukone in November last year.\nInstagram\nHowever, the report also suggests that the actor is demanding a higher fee for the endorsement and this could be a major reason for the end of this collaboration.\nDurex had in fact even wished the newly wed couple also around their wedding.\nBut looks like this didn't really convince Deepika to give a go ahead to Ranveer Singh.", "title": "After His Wedding To Deepika Padukone, Ranveer Singh Won't Be Endorsing Condom Brands Anymore", "date_publish": "03/04/2019, 16:59:31", "description": "If reports are to be believed, the reason behind this might be his marriage with actress Deepika Padukone. The actor married his co-star and longtime girlfriend Deepika Padukone in November last year.If reports are to be believed, the reason behind this might be his marriage with actress Deepika Padukone. The actor married his co-star and longtime girlfriend Deepika Padukone in November last year.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-his-wedding-to-deepika-padukone-ranveer-singh-won-t-be-endorsing-condom-brands-anymore-364803.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_singh_1554278257_800x420.jpg"}