{"text": "After Judwaa 2, Daddy David Dhawan Is All Set To Cast Varun Dhawan In The Remake Of 'Coolie No 1'\nAfter Judwaa 2, Daddy David Dhawan Is All Set To Cast Varun Dhawan In The Remake Of 'Coolie No 1'\nAfter the grand success of Judwaa 2, Daddy David Dhawan is all set to direct the remake of his 1995 classic Coolie No.1. It doesn't come as a surprise that the filmmaker has roped in his son Varun Dhawan to reprise the role that was originally played by Govinda.\nThe news was confirmed by Varun Dhawan himself as he spoke to BBC. He added that the remake would be directed by his father, veteran Director David Dhawan, who had directed the original film. The film also starred Karisma Kapoor.\nWhen he was quizzed if Alia would be seen reprising Karisma Kapoor's role, Varun Dhawan refuted the rumour. He added,\n“I can’t do every film with Alia Bhatt...That you will know soon, I don’t want to say it now but Alia and me are not working. We’ll do something..after...we’ll give a little break to people because I think for everyone it is like ‘oh, they are back again’.”\nOn the professional front, Varun Dhawan has had a great first innings in the film industry. After making his debut with Student of the Year, the actor has a success rate of 100% with impressive films like Humpty Sharma Ki Dulhania, Badlapur and Badrinath Ki Dulhania.\nDon't Miss 207 SHARES 814 SHARES 416 SHARES 12.5 K SHARES\nHe is currently all geared up for the release of Dharma Productions' Kalank, that also stars Madhuri Dixit, Sonakshi Sinha, Aditya Roy Kapoor, Varun Dhawan and Sanjay Dutt in pivotal roles.", "title": "After Judwaa 2, Daddy David Dhawan Is All Set To Cast Varun Dhawan In The Remake Of 'Coolie No 1'", "date_publish": "11/03/2019, 12:26:09", "description": "On the professional front, Varun Dhawan has had a great first innings in the film industry. After making his debut with Student of the Year, the actor has a success rate of 100% with impressive films like Humpty Sharma Ki Dulhania, Badlapur and Badrinath Ki Dulhania.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-judwaa-2-daddy-david-dhawan-is-all-set-to-cast-varun-dhawan-in-the-remake-of-coolie-no-1_-363501.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/varun_dhawan_1552287872_800x420.jpg"}