{"text": "Controversy's child Rakhi Sawant is out of control these days. She has been conducting press conferences, one after the other right after Tanushree Dutta opened up about being harassed by Nana Patekar on the sets of 2008 movie Horn Ok Pleasss. If you are still trying to figure out the connection between the two, here’s a quick recap.\nIt was Sawant who replaced Tanushree after she decided to walk out of the film. Instead of backing up the actress or even trying to get to the bottom of the incident, Rakhi Sawant ended up levying absurd charges on Dutta. From calling her a man and a lesbian to alleging that she got raped by Tanushree, Rakhi Sawant has been going on and on about how she was wronged by the actress but she chose to keep mum for her sake.\nyoungisthan\nAs if all this hoopla wasn’t enough, to spice things up even more, the item girl decided to hit the ring. She was performing at a Continental Wrestling Entertainment match in Panchkula when she decided to challenge a wrestler to a bout. No, we are not kidding!\nNo points for guessing that she couldn’t sustain in the ring for even a minute and was left knocked out by the wrestler. What followed next is sad and hilarious at the same time. The actress complained of stomach and back ache, so much so, that she couldn’t even get up. She was immediately rushed to the hospital. According to reports, she is said to be stable now.\nDon't Miss 7 K SHARES 307 SHARES 12.5 K SHARES 5.5 K SHARES\ntwitter\nHowever, the deed is now done. The internet caught hold of a clip from the wrestling event which is now going viral for reasons we all know. In the clip, Rakhi Sawant is seen being escorted out of the ring by female police officer and some helpers.\nHere’s the clip:\nLike always, we don’t know how to react to this piece of unwanted information.", "title": "After The Tanushree Fiasco, Rakhi Sawant Challenges A CWE Wrestler To Bout, Gets Knocked Out!", "date_publish": "12/11/2018, 16:37:59", "description": "Controversy's child Rakhi Sawant is out of control these days. She has been conducting press conferences one after the other, after Tanushree Dutta opened up about being harassed by Nana Patekar on the sets of 2008 movie Horn Ok Pleasss. If you are still trying to figure out the connection between the two then,here’s a quick recap. It was Sawant who became the replacement after Tanushree decided t", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/after-the-tanushree-fiasco-rakhi-sawant-challenges-a-cwe-wrestler-to-bout-gets-knocked-out-356515.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/rakhi_sawant_1542021047_800x420.jpg"}