{"text": "'Take your broken heart and make it into art'\nFor artists all around the world, heartbreak and grief has mysteriously played an important role in shaping up their career. The struggle to cope up with mental issues is real. However, while not many artists are vocal about their issue, Lady Gaga has always been an exception.\nAgencies\nFor Lady Gaga, last night turned into an epic one as she took home three Grammys.\nAgencies\nApart from delivering a yet another memorable performance of her hit song \"Shallow\" from her movie A Star Is Born.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBut what caught everyone's attention last night was how she dedicated her award acceptance teach to strike a meaningful conversation around mental health issues. While collecting her third award of the night, Gaga said,\nAgencies\n\"If I don't get another chance to say this, I just want to say I'm so proud to be a part of a movie that addresses mental health issues. They're so important. A lot of artists deal with that. And we gotta take care of each other. So if you see somebody that's hurting, don't look away. And if you're hurting, even though it might be hard, try to find that bravery within yourself to dive deep and go tell somebody and take them up in your head with you. I love you, thank you so much.\"\nThe audience cheered her on as drops of tears rolled down her cheeks.\nVideo: Lady Gaga gives an inspirational and emotional speech collecting the award for \"Shallow\" for Best Duo Performance! #GRAMMYs #AStarIsBorn pic.twitter.com/kKy7OJRyzG — Ryan | Lady Gaga 🏳️‍🌈 (@ryanleejohnson) February 11, 2019\nJust to jog your memory a little, Gaga had opened up about her own \"mental health crisis\", last year in November while collecting patron award from the SAG-AFTRA Foundation. She had said,\nAgencies\n“I began to notice that I would stare off into space and black out for seconds or minutes.... These were also symptoms of disassociation and PTSD and I did not have a team that included mental health support.”\nWhat's ahead for Gaga?\nHer song \"Shallow\" has a Best Original Song nomination at the forthcoming Oscars and if reports are to be believed, Gaga and Cooper are all set to perform the duet at the ceremony on February 24.", "title": "After Winning Her Third Grammy Last Night, Lady Gaga Gave A Moving Speech On Mental Health", "date_publish": "11/02/2019, 12:50:56", "description": "After Winning Her Third Grammy Last Night, Lady Gaga Gave A Moving Speech On Mental HealthAfter Winning Her Third Grammy Last Night, Lady Gaga Gave A Moving Speech On Mental HealthAfter Winning Her Third Grammy Last Night, Lady Gaga Gave A Moving Speech On Mental Health", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/after-winning-her-third-grammy-last-night-lady-gaga-gave-a-moving-speech-on-mental-health-361937.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/lady_gaga_1549870808_800x420.jpg"}