{"text": "Singer Anu Malik might have brushed off the sexual harassment allegations put against him but two more women have now accused him. The music composer's name came in the spotlight after singers Sona Mohapatra and Shweta Pandit accused him of his inappropriate behavior towards them.\nAccording to a Mid Day, one woman who shared her #MeToo story revealed that she met Malik in 1990 at Mehboob Studios to record a song. She recalled how Malik rubbed his body against her and had also offered her a meek apology when he found her shaken by his advances.\nShe further recollected how when she met him for the second time for a fundraiser event, he again tried to make inappropriate sexual advances towards her. She was quoted as saying,\n“He simply unzipped his pants and asked me to lick him. I told him no and urged him to let me go, but he pulled me by my hair and stuffed my face in his lap, hurling abuses as he did so.\"\nAnother victim recollected her struggling days in the music industry. She added how Malik during their second meeting at Sahara Studios in Goregaon asked her if she had a boyfriend. When she said no, he said 'you must be so lonely'. She added how Malik asked her to wear a chiffon saree next time they meet. She added,\nDon't Miss 362 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nAgencies\n\"When I tried to leave, he grabbed me and hugged me while running his hands over my body. We were in a soundproof recording studio hence I could not even scream. I pushed him away which is when he said that 'I am happy with my wife, I am a sensitive man'.\"\nMalik is yet to comment on the fresh allegations put on him.", "title": "After Sona Mohapatra & Shweta Pandit, 2 More Women Accuse Anu Malik Of Sexually Harassing Them!", "date_publish": "20/10/2018, 13:02:45", "description": "According to a Mid Day, one woman who shared her #MeToo story revealed that she met Malik in 1990 at Mehboob Studios to record a song. She recalled how Malik rubbed his body against her and had also offered her a meek apology when he found her shaken by his advances. She further recollected how when she met him for the second time for a fundraiser event.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-sona-mohapatra-shweta-pandit-2-more-women-accuse-anu-malik-of-sexually-harassing-them-355120.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anu_malik_1540020867_800x420.jpg"}