{"text": "After Dilbar, Tiger Shroff Shows Off His Killer Dance Moves On Shahid Kapoor’s Urvashi!\nAfter Dilbar, Tiger Shroff Shows Off His Killer Dance Moves On Shahid Kapoor’s Urvashi!\nTiger Shroff is hailed as the best action hero in the country. With a chiseled physique and killer dance moves, he has often floored the audiences.\nThe man has a massive fan following. The reviews of his film Baaghi might not be outstanding, but he is always welcomed with a thunderous response. That is one of the reasons why after two instalments, Baaghi 3 is also in the works.\nFans love Tiger Shroff for his killer dance moves too. He often shares his dance videos on Instagram. Remember some time ago, he danced to Nora Fatehi’s Dilbar and fans couldn’t stop raving about it.\nThis time, Tiger Shroff grooved to Shahid Kapoor’s Urvashi and fans were left swooning.\nDon't Miss 1.1 K SHARES 3.1 K SHARES 3 K SHARES 12.5 K SHARES 5.5 K SHARES\nFor the uninitiated, Tiger Shroff will next be seen shaking a leg with Hollywood star Will Smith. If you haven’t seen it yet, here’s the glimpse.\nAlso Read: Hailed As The ‘Best Action Hero’, 9 Reasons Why Tiger Shroff Is Shining Bright In The Industry", "title": "After Dilbar, Tiger Shroff Shows Off His Killer Dance Moves On Shahid Kapoor’s Urvashi!", "date_publish": "26/12/2018, 16:29:35", "description": "Fans love Tiger Shroff for his killer dance moves too. He often shares his dance videos on Instagram. Remember sometime ago, he danced to Nora Fatehi’s Dilbar and fans thought couldn’t stop raving about it. This time, Tiger Shroff grooved to Shahid Kapoor’s Urvashi and fans were left swooning.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-dilbar-tiger-shroff-shows-off-his-killer-dance-moves-on-shahid-kapoor-s-urvashi-359312.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_nora_fatehis_dilbar_tiger_shroff_shows_off_his_dance_moves_on_shahid_kapoors_urvashi_1545820907_800x420.png"}