{"text": "Bollywood actress Sara Ali Khan ended the year 2018 with a bang. She made a debut on Koffee With Karan and took everyone by surprise with her graceful answers and poised nature.\nShe won people's hearts during Simmba promotions and proved she's down to earth just like all of us. And then her movies arrived with Kedarnath and Simmba. The actress created fireworks with her performance and the audience has welcomed her into the world of Bollywood.\nWith New Year, Sara Ali Khan has more films in her kitty. As per reports, Sara has been offered a film opposite Varun Dhawan. Yes, she has been considered as the replacement to Katrina Kaif for ABCD.\nTwitter\nDon't Miss 207 SHARES 12.5 K SHARES 5.5 K SHARES\nEarlier Shraddha Kapoor and Kirti Sanon were being considered for the role, however, looks like Sara Khan just might be the chosen one. As per a source in leading daily,\n\"With Shraddha on board, it would be a reunion of the ABCD 2 trio, along with Varun and Remo. They have an equation and that would help in their collaborating on another dance flick. The other strong contender for the role is Sara Ali Khan. She has proved her acting chops in Kedarnath and has been appreciated in Simmba too. Signing her would also mean a fresh new onscreen pair. And Varun and Sara together are bound to generate tremendous buzz for this dance movie. So yes, the makers are definitely looking at the advantage of casting Sara for the film.\"\nOn Koffee With Karan, Sara Ali Khan had expressed her desire to work with Varun Dhawan and looks like her dream might come true soon.", "title": "After Katrina's Exit, Sara Ali Khan Reportedly Roped In Opposite Varun Dhawan In A Dance Film", "date_publish": "02/01/2019, 14:29:06", "description": "On Koffee With Karan, Sara Ali Khan had expressed her desire to work with Varun Dhawan and looks like their dream will come true.On Koffee With Karan, Sara Ali Khan had expressed her desire to work with Varun Dhawan and looks like their dream will come true.On Koffee With Karan, Sara Ali Khan had expressed her desire to work with Varun Dhawan and looks like their dream will come true.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-katrina-kaif-s-exit-sara-ali-khan-reportedly-roped-in-opposite-varun-dhawan-in-a-dance-film-359685.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/varun_1546417397_800x420.jpg"}