{"text": "After Rani Jhansi, Kangana To Play Jayalalithaa & Fans Think She’ll Get A National Award For It\nAfter Rani Jhansi, Kangana To Play Jayalalithaa & Fans Think She’ll Get A National Award For It\nA movie star with a sure-shot success formula in her early phase of career and a politician who was best described as the queen of Tamil politics, Jayalalithaa enjoyed the love and affection of millions of her supporters. When she died, she left the nation mourning.\ndbsjeyaraj.com\nNow, a biopic on the life of the Amma, as Jayalalithaa was fondly called, is in the works, and finally the mystery as to who will play the lead role in the movie has been solved. Hailed as the Queen of Bollywood, Kangana Ranaut has bagged the lead role.\nawaaznation.com\nHappy to have bagged this opportunity, Kangana Ranaut said, “Jayalalithaaji is one of the biggest female success stories of this century. She was a superstar and went on to become an iconic politician, it’s a great concept for a mainstream film. I am honoured to be a part of this mega project.”\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nThe movie will be penned by Baahubali and Manikarnika: The Queen of Jhansi fame KV Vijayendra Prasad. The film will be made in two languages. While the Tamil version will be called Thalaivi, the biopic in Hindi will be called Jaya. The biographical film will be directed by Vijay, who is known for his works in films including Madrasapattinam and Deiva Thirumagal.\n“Jayalalithaa madam was one of the most prominent leaders of our country. Making a film on her life is a big responsibility and we are going to do it with utmost care and honesty. I am proud and happy that a talented actress like Kangana Ranautji will portray the dynamic role of this dynamic leader,” director Vijay was quoted as saying.\nTwitter\nAnd fans are excited!\nQueen will slay in this role ! 👏 — Zeeshan (@Being_Zeeshaan) March 23, 2019\nOne more national award 💥💥💥 — B. Rohith Kumar (@boywithguts_) March 23, 2019\nFinest actor of our nation\nVery proud of her as an actor and as a strong women\nWho speak at her heart — Abhiraaj chaudhary (@AbhiraajC) March 23, 2019\nThis would be huge 😍 — प्रांजल अग्रवाल (@pranjal2018) March 23, 2019\nOne more powerful performance ✌ — shruti. (@megh_____) March 23, 2019\nOh woow !! She is the proof that one can succeed without even buttering the people like Kjo....huge takeaway for new entrants in bollywood...More power to her @Rangoli_A — amaresh kumar (@amaresh2212) March 23, 2019\nThe announcement was made on her birthday today. After Manikarnika: The Queen Of Jhansi, Kangana Ranaut will bring the story of the most loved actor-turned politician on the big screens. Are you all excited?", "title": "After Rani Jhansi, Kangana To Play Jayalalithaa & Fans Think She’ll Get A National Award For It", "date_publish": "23/03/2019, 12:55:19", "description": "Now, a biopic on the life of the Amma, as Jayalalithaa was fondly called, is in the works, and finally the mystery as to who will play the lead role in the movie has been solved. Hailed as the Queen of Bollywood, Kangana Ranaut has bagged the lead role.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-rani-jhansi-kangana-to-play-jayalalithaa-fans-think-she-ll-get-a-national-award-for-it-364170.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_to_play_jayalalithaa_in_her_biopic_1553324359_800x420.png"}