{"text": "“I held her close to me with my eyes closed, wondering if anything in my life had ever been this perfect and knowing at the same time that it hadn't. I was in love, and the feeling was even more wonderful than I ever imagined it could be.”\nThe cinematic adaptation of Nicholas Sparks' novel 'A Walk To Remember' went on to become a cult hit. The romantic drama made us cry and smile at the time time. Landon and Jamie's heartbreaking story wasn't just about love.\nTwitter\nIt was about true friendship, admiration and how one needs to stick around during turbulent times too.\nBoth Mandy Moore and Shane West became a hit pair among people and now, after seventeen years, our Landon and Jamie reunited and for a very special reason.\nAgencies\nMandy Moore, star of NBC's award-winning show \"This Is Us,\" was honored with a star on the Hollywood Walk of Fame on March 25, 2019. Shane West, who co-starred with Moore in the 2002 romantic drama “A Walk to Remember,” joined her during the speech at the 11:30 a.m. ceremony at 6562 Hollywood Boulevard.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMandy was the 2,658th since the completion of the Walk of Fame in 1961 with the first 1,558 stars. In her speech, Mandy says,\nAgencies\n\"Reflecting back on that time [on A Walk to Remember], my first leading role, I can't help but think of my poor, sweet co-star Shane, explaining the basics of filmmaking to me, like how to hit my mark and when and how to deliver my lines.\"\nThe pictures from this special reunion are all over the internet and it'd make you scream for a sequel to their hit film. Have a look at the pictures right here!\nAgencies\nAgencies\nAgencies\nAgencies\nAgencies\nThat's not all. Her 'This Is Us' team too joined her to extend support and be with her on her important day.\nAgencies\nMoore had also received a Golden Globe nomination in 2016 for her portrayal of family matriarch Rebecca Pearson on the same show.", "title": "After 17 Years, Mandy Moore Reunites With 'A Walk To Remember' Co-Star And We Are All Hearts!", "date_publish": "26/03/2019, 11:54:09", "description": "Both Mandy Moore and Shane West became a hit pair among people and now, after seventeen years, our Landon and Jamie reunited and for a very special reason. Shane West, who co-starred with Moore in the 2002 romantic drama “A Walk to Remember,” joined her in speaking at the 11:30 a.m. ceremony at 6562 Hollywood Boulevard.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-17-years-mandy-moore-reunites-with-a-walk-to-remember-co-star-and-we-are-all-hearts-364304.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/mandy_moore_1553581735_800x420.jpg"}