{"text": "After Hardik Pandya, Ranveer Singh Faces Flak As Internet Digs Up His Sexist Remarks On Koffee With Karan\nAfter Hardik Pandya, Ranveer Singh Faces Flak As Internet Digs Up His Sexist Remarks On Koffee With Karan\nThe controversy stirred up by Hardik Pandya and KL Rahul is refusing to die down. Even after Hardik Pandya’s public apology, BCCI has imposed a temporary ban on the cricketer. While the sexist and misogynistic comments were passed by Hardik Pandya, KL Rahul laughed them off as 'jokes'. Of course, that gave rise to a massive outrage that no one’s forgetting anytime soon.\nNow, the internet has dug up an old video of Ranveer Singh on the same show, Koffee With Karan, in which he is making some cringe-worthy remarks. And yet again, Karan Johar is laughing his heart out at them. Take a look!\n“You want your ass pinched? I’m right here,” he says in one of the videos.\n\"You want your ass pinched? I'm right here\" IS THIS YOUR HERO? Also look at how Kjo is laughing. BOLLYWOOD IS FULL OF SCUMS pic.twitter.com/nZbEWiTlp8 — babu bisleri (@PUNchayatiii) January 10, 2019\n“I went from child to boy while watching Kareena (Kapoor) swim,” he says in another one.\nWhat did Ranveer mean by \"I went from child to boy while watching Kareena swim?\" 💦 pic.twitter.com/muAx3jZujF — babu bisleri (@PUNchayatiii) January 9, 2019\nDon't Miss 112 SHARES 185 SHARES\nThe episode was shot in 2011 after Ranveer Singh appeared on the show along with his Band Baaja Baarat co-star Anushka Sharma.", "title": "After Hardik Pandya, Ranveer Singh Faces Flak As Internet Digs Up His Sexist Remarks On Koffee With Karan", "date_publish": "12/01/2019, 16:09:42", "description": "The controversy against Hardik Pandya and KL Rahul hasn’t yet died down. Even after Hardik Pandya’s public apology, BCCI has imposed a temporary ban on the cricketer. While the sexist and misogynistic comments were passed by Hardik Pandya, KL Rahul laughed them off as “jokes”. Of course, that gave rise to a massive outrage that no one’s forgetting anytime soon.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-hardik-pandya-ranveer-singh-faces-flak-as-internet-digs-up-his-sexist-remarks-on-koffee-with-karan-360304.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_hardik_pandya_ranveer_singh_faces_flak_as_internet_digs_up_his_sexist_remarks_on_koffee_with_1547289797_800x420.jpg"}