{"text": "The moment you hear Adhyayan Suman’s name it reminds you of his infamous interview on Kangana Ranaut for which he was severely backlashed, but today he has moved on and says that chapter is absolutely over for him.\nTwitter\nToday, Adhyayan is a changed man and wants to do something with his life, he is back with his popular song Soniyo with a new version which is being highly appreciated and accepted. Indiatimes had a chat with Adhyayan where he spoke about his career, life and everything in between.\nInstagram\nWe questioned him on how he manages to be so positive despite all the backlashes he has faced in past to which he said, “ I have been called a loser and a failure. I have faced it all, I accepted it and moved on. I knew my craft and it was just about getting the right opportunity and waited and waited for it and then I realised that I have to do something for myself and then I thought of YouTube where there is no middle person it’s just you and the audience and we all know right now it’s the best time to invest and be in digital market, but even in this people will like you or just reject you, of course I was worried about all the rejection but I did it because it was a big deal for me.”\nDon't Miss 336 SHARES 542 SHARES 12.5 K SHARES 5.4 K SHARES\nHe further added, “I just want to say that you should just believe in yourself and do it, and I am not talking out of overconfidence, but I learned this through my failures. The more people have abused me, I've fought harder and the more they abuse I will fight even more, but I feel they will not abuse me this time and like my work”.\nTwitter\nThen we questioned him if he has regrets about doing that interview on Kangana Ranaut as it changed his life and made him miserable, he said,\n“I absolutely respect my decision. I don’t take anything back in my life, truth has to be told but once and I did it, I never called a press conference or spoke on news channel panels. If I was publicity hungry which people portrayed me back then, I would have had a press conference, on every news channel and talk about it over and over, but I didn’t.\n\"Now people tell me, we should have believed you, we believe you, but for me, it doesn’t matter you believe me or not, I just wanted to say my side of my story. Period. Full Stop!”\nTwitter\nWe also quizzed Adhyayan if he was afraid to be accepted again, he agreed and said; “I was very scared that what if I do this and fail, then what? Where do I go next? I will be very honest with you the last couple of years when I was sitting at home, lot of TV shows came my way from big production houses but I didn’t do it because I felt, I will not do full justice to it. I just felt that I cannot do regressive stuff five times a week. Full respect to those who do it but that’s something that I felt I couldn't do it at this point of my life, so what's next?\nI am not getting the kind of films or web series I want, so I started my music channel which sort of became a do or die for me. Unfortunate part is I didn’t have money to invest in a big youtube channel so for me my first song ‘Aaya Na Tu’ was a litmus test and if that would not be successful I would be done, I would be gone, but within 40 days it crossed 3 million and I was like a huge set of audience will accept you if you are sincere and that is what I am trying to do. And now Soniyo 2.0 song is also being loved and I am very glad that I am being accepted.”\nClearly nepotism hasn’t worked in Adyayan’s favour, he talks about the struggle despite being Shekhar Suman’s son, “Even though I am Shekhar Suman’s son, people don’t know my struggle, they don’t know how I have come here and they don’t even want to listen until I become successful because if you are not successful your story will be boring, who wants to know my struggle unless I become star. The day I become a star, trust me on this, when I will tell about my genuine story they will listen to it, I know how hard I have struggled to come here, it’s not that easy as people may think he is somebody’s son and he may be getting this or that opportunity easily, or he has the money to make what he wants, but it’s not about the money, it’s about the journey and failures from which you learn. My story has been genuine. I have been hurt, I have been abused on national television for something you haven’t even done but you just go to be strong and keep a hold on.”\nAll we can say is that this man deserves a second chance.", "title": "After His Infamous Interview On Kangana Ranaut In 2016, Adhyayan Suman Says He's A Changed Person Now", "date_publish": "03/05/2019, 11:00:00", "description": "The moment you take Adhyayan Suman’s name it reminds you about his interview infamous interview on Kangana Ranaut for which he was backlashed, but today he has moved on and said that chapter is absolutely closed for him. Today Adhyayan is a changed person and wants to do something with his life, he is back with his popular song Soniyo with a new version which is been appreciated and accepted. Indi", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-his-infamous-interview-on-kangana-ranaut-in-2016-adhyayan-suman-says-he-s-a-changed-person-now-366499.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/adhyayan_suman_1556798821_800x420.jpg"}