{"text": "After Pulwama Attack, Nawazuddin Siddiqui Says He Doesn’t Want His Film 'Photograph' To Release In Pakistan\nAfter Pulwama Attack, Nawazuddin Siddiqui Says He Doesn’t Want His Film 'Photograph' To Release In Pakistan\nIndian film industry is standing in solidarity with the martyrs of Pulwama attack. The industry has decided to completely ban Pakistani artistes, a move which was applauded by Home Minister Rajnath Singh. Not only that the filmmakers are also deciding not to release their films in Pakistan.\nAjay Devgn, whose film Total Dhamaal released this weekend, had announced soon after the Pulwama attack that the movie won’t be released in Pakistan.\nIn light of the current situation the team of Total Dhamaal has decided to not release the film in Pakistan. — Ajay Devgn (@ajaydevgn) February 18, 2019\nPost this, Producer Dinesh Vijan had announced that he has also cancelled a contract with Pakistan distributor of the films and that his banner Maddock Films will not be releasing Kartik Aaryan starrer Luka Chuppi and Diljit Dosanjh's starrer Arjun Patiala in Pakistan.\nytimg.com\nNow, Nawazuddin Siddiqui, whose film Photograph is making all the waves abroad after multiple screenings, has also stated that he doesn’t want the movie to be released in Pakistan.\nDon't Miss 837 SHARES 862 SHARES 346 SHARES\n“I don’t want my film Photograph to release in Pakistan,” said Nawazuddin Siddiqui who has a great fan base in Pakistan.\nTwitter\nBollywood trade analyst Taran Adarsh had earlier stated that Indian films have great viewership in Pakistan but the collection from the country does not contribute much to the worldwide box office numbers of Hindi films. He, however, believes it would be detrimental to the earnings of distributors in Pakistan.\n\"There are about 150 screens in Pakistan. Like us, they also love Hindi movies. They make very few films. Also, you cannot show Hollywood films round-the-clock. Indian films are a big addiction. It is going to be tough for them as it is a small market for us,\" Adarsh told PTI.", "title": "After Pulwama Attack, Nawazuddin Siddiqui Says He Doesn’t Want His Film 'Photograph' To Release In Pakistan", "date_publish": "24/02/2019, 14:27:09", "description": "Now, Nawazuddin Siddiqui, whose film Photograph is making all the waves abroad after multiple screenings, has also stated that he doesn’t want the movie to be released in Pakistan. “I don’t want my film Photograph to release in Pakistan,” said Nawazuddin Siddiqui who has a great fan base in Pakistan.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-pulwama-attack-nawazuddin-siddiqui-says-he-doesn-t-want-his-film-photograph-to-release-in-pakistan-362696.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/after_pulwama_attack_nawazuddin_siddiqui_says_he_doesnt_want_his_film_to_release_in_pakistan_1550999230_800x420.jpg"}