{"text": "After Sharing Her #MeToo Story, Kaneez Surka Says She Won’t Let Internet Dictate When To Speak\nAfter Sharing Her #MeToo Story, Kaneez Surka Says She Won’t Let Internet Dictate When To Speak\nWhen sexual harassment allegations against men were pouring out in abundance on social media, comedian Kaneez Surka was the first woman to have levied #MeToo accusations against her fellow woman comedian.\nShe accused Aditi Mittal of forcefully kissing her -- on stage, in front of an audience. Following this incident, Aditi Mittal indeed issued an apology clarifying that it was all meant to be a joke.\nAlso Read: In A First, A Woman Comedian Has Been Accused Of Sexually Harassing Another Woman Comedian\nAnd apparently, the matter was closed there and then. It has been over a week but Kaneez hasn’t spilled more details on the incident, especially after an apology was issued.\nTalking on the #MeToo movement which is taking the country by a storm and discussing about the sexual harassment allegations against comedian in particular, here’s what Kaneez Surka told news18.com.\nDon't Miss 623 SHARES 365 SHARES 7.5 K SHARES\n“I am processing all of this. It’s so new. It literally happened days ago, for me and other people. I don’t want to comment right now. I can’t articulate my thoughts right now and I don’t want to say something again which people will hold me to at a later stage. I should allow myself to have time. That’s a big learning for me where I am not going to let internet dictate how fast I grow or when I need to answer. I should get to have control over my life.”\nAlso Read: Comedian Aditi Mittal Issues Apology For 'Jokingly' Kissing Kaneez Surka Without Her Consent", "title": "After Sharing Her #MeToo Story, Kaneez Surka Says She Won’t Let Internet Dictate When To Speak", "date_publish": "17/10/2018, 13:39:49", "description": "When sexual harassment allegations against men were pouring out in abundance on social media, comedian Kaneez Surka was the first woman to have levied #MeToo accusations against her fellow woman comedian. She accused Aditi Mittal of forcefully kissing her -- on stage in front of the audience. Following this incident, Aditi Mittal indeed issued an apology clarifying that it was all meant to be a j", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-sharing-her-metoo-story-kaneez-surka-says-she-won-t-let-internet-dictate-when-to-speak-354947.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/as_metoo_gains_force_in_india_kaneez_surka_says_she_wont_let_internet_dictate_when_to_speak_1539762032_800x420.jpg"}