{"text": "After Firecrackers Hoopla, PETA Slams Priyanka Chopra - Nick For Using Elephants & Horses At Their Wedding\nAfter Firecrackers Hoopla, PETA Slams Priyanka Chopra - Nick For Using Elephants & Horses At Their Wedding\nPriyanka Chopra and Nick Jonas didn’t share their wedding pictures, but when people saw fireworks at Umaid Bhawan in the night sky, they knew the lovebirds have tied the knot.\nAnd soon after, with the congratulatory posts, a lot of people also lambasted Priyanka Chopra. What for? UNICEF goodwill ambassador who is also an asthmatic has been campaigning for cracker free Diwali. Fans called her out for bursting crackers at her own wedding.\nAlso Read: After Rooting For Cracker Free Diwali, Priyanka Chopra Gets Trolled For Fireworks At Her Own Wedding\nNow, People for the Ethical Treatment of Animals (PETA) has slammed the newlyweds Priyanka Chopra and Nick Jonas for using elephants and horses at their wedding.\nPETA India took to Twitter to slam the couple. With that, PETA also shared its video from four years ago, highlighting the woes of the animals, titled, 'Captive Elephants in Jaipur: PETA India's 2014 Inspection'.\nDear @priyankachopra and @nickjonas. Eles 4 weddings live n chains & horses r controlled w whips, spiked bits. Ppl r rejecting ele rides: https://t.co/Gea5jvP6LP & having horse-free weddings. Congrats, but we regret it was not a happy day for animals. pic.twitter.com/p9FFeJ969B — PETA India ❤️❤️ (@PetaIndia) December 3, 2018\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 151 SHARES 12.5 K SHARES\nThe wedding has been quite controversial, it seems.", "title": "After Firecracker Hoopla, PETA Slams Priyanka Chopra", "date_publish": "03/12/2018, 18:06:30", "description": "People for the Ethical Treatment of Animals (PETA) has called out the newlyweds Priyanka Chopra and Nick Jonas for using elephants and horses at their wedding. PETA India took to Twitter to slam the couple. With that, PETA also shared its video from four years ago, highlighting the woes of the animals, titled, 'Captive Elephants in Jaipur: PETA India's 2014 Inspection'.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-firecrackers-hoopla-peta-slams-priyanka-chopra-nick-for-using-elephants-horses-at-their-wedding-357850.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_firecracker_row_peta_slams_priyanka__nick_for_using_elephants__horses_at_their_wedding_1543839018_800x420.png"}