{"text": "After 9 Years, Akshay Kumar & Katrina Kaif Are Back With Their Irresistible Chemistry In Rohit Shetty’s Sooryavanshi\nAfter 9 Years, Akshay Kumar & Katrina Kaif Are Back With Their Irresistible Chemistry In Rohit Shetty’s Sooryavanshi\nAkshay Kumar and Katrina Kaif simply are one of the hit onscreen couples of the 2000s. There have been fireworks on the big screen each time they have come together. From films like Singh Is Kinng, Humko Deewana Kar Gaye to Namaste London, Tees Maar Khan, Welcome and De Dana Dan, each time the duo has appeared, they have created magic.\nAnd now, after nine years, they reuniting on the big screen in a Rohit Shetty movie titled Sooryavanshi and fans are skittering away in excitement.\nThe film will reportedly have cameos by Ajay Devgn (Bajirao Singham) and Ranveer Singh (Simmba). So, it’s going to be Katrina’s first film with Ajay Devgn and Ranveer Singh. That’s interesting, right?\nDon't Miss 814 SHARES 699 SHARES 1.2 K SHARES 18.3 K SHARES 1.1 K SHARES\nAfter Akshay-Katrina romancing in Namaste London’s Yahi Hota Pyaar to them both dancing in Singh Is Kinng’s Teri Ore and their crackling chemistry in Tees Maar Khan’s Sheila Ki Jawani, heir candour and honest performances have caught our fancies always.\nNow, fans just can’t wait for Sooryavanshi.\n@akshaykumar & #Katrinakaif after 9 years. Damn this is huge !! Time to rejoice 😄😄😄😄😄😄😄 — Jaipal Metai (@jaimetai) April 22, 2019\nCan't wait to see this beautiful pair of love again. Literally waiting to listen beautiful love song from this film featuring both @akshaykumar and #KatrinaKaif ,like namste london and etc. 🌹🌹🌹😘🌹😘😘😘😘😘😘😘😘#Sooryavanshi #RohitShetty — Rajat Vaishnav 🙏 (@Rajat07lover) April 22, 2019\npic 1 : what they want to show us\npic 2 : what we wanna see 😌#Sooryavanshi pic.twitter.com/ls59tb6czg — Cinderella🌸 (@ViratAnushka18) April 22, 2019\nAtlast Katrina doing a commercial masala film 😍 it's rohit shetty film so songs will be good and hoping Katrina doesn't hav stupid ass kicking 😑 #KatrinaKaif #Sooryavanshi — Bollyboy (@bollywoodcurves) April 22, 2019\nRohit Shetty is creating a cop universe with films Akshay Kumar, Ajay Devgn and Ranveer Singh. Sooryavanshi is Dharma Productions film and is slated to release in 2020. Are you excited?", "title": "After 9 Years, Akshay Kumar & Katrina Kaif Are Back With Their Irresistible Chemistry In Rohit Shetty’s Sooryavanshi", "date_publish": "22/04/2019, 14:36:38", "description": "Akshay Kumar and Katrina Kaif simply are one of the hit onscreen couples of the 2000s. And now, after nine years, they reuniting on the big screen in a Rohit Shetty movie titled Sooryavanshi and fans are skittering away in excitement. And now, after nine years, they reuniting on the big screen in a Rohit Shetty movie titled Sooryavanshi and fans are skittering away in excitement.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-9-years-akshay-kumar-katrina-kaif-are-back-with-their-irresistible-chemistry-in-rohit-shetty-s-sooryavashi-365880.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/akshay_kumar_and_katrina_kaif_rohit_shettys_sooryavanshi_1555922047_800x420.png"}