{"text": "If there’s one filmmaker who has cracked the recipe for success, then it’s none other than Rohit Shetty. For the uninitiated, Simmba was his eight consecutive film that crossed Rs 100 crore mark at the box office. Why wouldn’t he be hailed as the man with hit formula, or the undisputed king of the 100-crore club?\nTwitter\nKnown for his flamboyant style of over-the-top comedy and action, Rohit Shetty films are ‘entertainment packages’ in true sense. They are filmy, larger-than-life, massy and bursting with energy.\nTwitter\nHe has his own cinematic universe – not of superheroes like Marvel, but of police officers, the men in Khakhi. After Singham and Simmba, he is all set to make another cop drama with Akshay Kumar. The movie is titled Sooryavanshi, a glimpse of which was teased at the end of Simmba.\nAnd if you have noticed, the supporting cast of his films is all the same – mostly actors hailing from the Marathi film industry. Looks like Rohit Shetty is developing his own Avengers (or Khaki) army.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 6.8 K SHARES\nPinterest\nHis latest venture, Simmba, which is receiving all the love from audiences and critics alike, is a tale of a dishonest and immoral cop named Sangram Bhalerao (Ranveer Singh), who has always inspired to become a corrupt police officer. He is a bribe-hungry hoodlum who totally believes that to live an ideal life, corruption is indispensable.\nHowever, there’s a twist.\nWhen a woman who he thinks of as a sister is raped and brutally killed, Sangram Bhalerao AKA Simmba undergoes a major transformation. He unexpectedly becomes an honest cop and fights for justice trying every hook and crook to get the culprits punished.\nIn a Hindi film, when a dishonest man turns into an honest one – an ideal figure – what do you expect? Whistles, right? That’s apparently what makes Simmba a blockbuster story!\nInstagram\nBut does that change the fact that it’s a tale of an openly unscrupulous cop, whose motive in life for the longest time is to carry out beimaani with full imaandaari?\nWhen Rohit Shetty met with Prime Minister Narendra Modi recently – along with other young icons of the Hindi film industry that included Alia Bhatt, Ranveer Singh, Vicky Kaushal, Karan Johar and Ashwiny Iyer Tiwari among others – to discuss how the entertainment industry can contribute to nation building, he was praised by the PM for making films on the police force.\nBut what does his latest film reflect? Police force being “corrupt and dishonest until a tragedy strikes”?\nSo simmba is that movie that really states true face of our cops in India corrupt and dishonest until a tragedy strikes — H&M (@Redfire450) December 28, 2018\nTowards the end of the movie, there’s also a scene in which the cops were trying to provoke the rapists by mocking their manhood and calling them “impotent”. That’s indeed a strange morality of being a corrupt cop, don’t you think?\nBut when Rohit Shetty gets praised for making films on the police force – one of which is about a dishonest and immoral one – that’s quite a “cool feeling”, right?", "title": "After Simmba, Tale Of A Dishonest Cop, PM Modi 'Praises' Rohit Shetty For Making Films On Police", "date_publish": "11/01/2019, 15:02:19", "description": "When Rohit Shetty met with Prime Minister Narendra Modi recently – along with other young icons of the Hindi film industry that included Alia Bhatt, Ranveer Singh, Vicky Kaushal, Karan Johar and Ashwiny Iyer Tiwari among others – to discuss how the entertainment industry can contribute to nation building, he was praised by the PM for making films on the police force.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-simmba-tale-of-a-dishonest-cop-pm-modi-praises-rohit-shetty-for-making-films-on-police-360236.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_simmba_a_tale_of_dishonest_cop_pm_modi_praises_rohit_shetty_for_making_films_on_police_1547199172_800x420.png"}