{"text": "After Padmaavat, Sanjay Leela Bhansali's Next Is 'Hira Mandi' Based On Gangubai Kothewali\nAfter Padmaavat, Sanjay Leela Bhansali's Next Is 'Hira Mandi' Based On Gangubai Kothewali\nSanjay Leela Bhansali's movies might court controversies but the films end up doing phenomenally great at the box-office. With larger than life and grand sets, Bhansali is a man who believes in crafting perfection.\nHis last magnum opus ‘Padmaavat’ didn't just get critical acclaim and appreciation, but the film broke several records. After the release of the film, Bhansali opted for a voluntary break, after which he is back in business, researching for his next film.\nTwitter\nAccording to reports, Bhansali's next will be based on the life of notorious female gangster Gangubai Kothewali. Several reports hint that Bhansali is interesting in roping Priyanka Chopra for the project.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe film is tentatively called ‘Hira Mandi’. The film will revolve around the iconic life of Gangubai Kothewali, who was also known as the Madam of Kamathipura, who ran several brothels in Mumbai years ago.\nHer popularity till today remains unfazed and her idols till today are found across Kamathipura.", "title": "After Padmaavat, Sanjay Leela Bhansali's Next Is 'Hira Mandi' Based On Gangubai Kothewali", "date_publish": "30/10/2018, 12:20:43", "description": "His last magnum opus ‘Padmaavat’ didn't just get critical acclaim and appreciation, but the film broke up several records. After the release of the film, Bhansali opted for a voluntary break, after which he is back in business, researching for his next film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-padmaavat-sanjay-leela-bhansali-s-next-is-hira-mandi-based-on-gangubai-kothewali-355701.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bhansali_1540882404_800x420.jpg"}