{"text": "After Rooting For Cracker Free Diwali, Priyanka Chopra Gets Trolled For Fireworks At Her Own Wedding\nAfter Rooting For Cracker Free Diwali, Priyanka Chopra Gets Trolled For Fireworks At Her Own Wedding\nUNICEF Goodwill Ambassador Priyanka Chopra rooted for a cracker free Diwali and better quality air in many campaigns. In one of those, she even declared that she is asthmatic and appealed to people to celebrate Diwali with “lights and laddoos and love, and not pollution”.\nInstagram\nHowever, at her own wedding day, skies over Umaid Bhawan in Jodhpur lit up with fireworks. But little did they know that the sparks would fly all over the nation through social media turning into protests.\nIt all came to limelight after ANI shared a video of fireworks at the venue.\n#WATCH: Fireworks at Umaid Bhawan Palace in Jodhpur, Rajasthan, after Priyanka Chopra and Nick Jonas tied the knot as per Christian rituals. pic.twitter.com/XpzYtGZG2G — ANI (@ANI) December 1, 2018\nFans called out Priyanka Chopra for her hypocrisy. Some of them even wondered if they were “herbal” crackers.\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 12.5 K SHARES 186 SHARES\nThese people from Bollywood are just about the living epitome of true unbridled holier than thou hypocrisy https://t.co/VAf4dT2dL4 — Rishi Bagree 🇮🇳 (@rishibagree) December 1, 2018\nPriyanka Chopra's dog is scared of crackers on Diwali but not on her wedding? — Ankur Singh (@iAnkurSingh) December 1, 2018\nNow animals are enjoying by hearing such a peaceful sounds of firecrackers on PicNic's wedding ceremony. — Suraj Das (@SurajDa37056754) December 2, 2018\nHey @nickjonas first congratulations for your marriage. Now pls watch this carefully& explain how you subjected your asthametic wife to polluted atmos by having fireworks at wedding?\nYour wife preaching Hindus to have crackerless diwali here👇\npic.twitter.com/UJ36Z8jMbI — Debjani Chatterjee 🇮🇳 (@devyanidilli) December 1, 2018\nThese crackers were only exploding ... The explosion was creating the pollution to get disbursed which we see as smoke... The crackers were smokeless...\nSpecially manufactured in USA for her marriage... May be😃 — Murali Krishna🇮🇳 (@MuralikrishnaE1) December 2, 2018\nI think #PriyankaChopra should be awarded with Bharat Ratna to invent environment friendly and dog friendly crackers for #NickyankaKiShaadi #NationalPollutionControlDay pic.twitter.com/U3inYsUYxH — Salman Abdi (@SalmanAabdi) December 2, 2018\n#PriyankaChopra If you want to give out a message to your fans to not burst crackers on Diwali bec it affects the environment, animals, asthma patients then the same rules apply to your wedding. It's important to practice what you preach! https://t.co/T3ZWph66pY — Rohit Khilnani (@rohitkhilnani) December 2, 2018\nWhy cracker has been burst in the wedding.\nPriyanka hypocrisy has been exposed.\nShe was the one who r preaching ppl not to crack cracker to control pollution now where is the morality??\nPriyanka shd apologize pic.twitter.com/CIFqJvcKfJ — Being_Stranger (@Being_Stranger) December 1, 2018\nBursting Crackers In Diwali Makes Priyanka Chopra Breathless, Bursting Crackers In Wedding Gives Her Fresh Air By Releasing Oxygen. 👏🙏 pic.twitter.com/02aqtcQpkT — Sir Jadeja (@SirJadeja) December 2, 2018\nMy whole town doesn't burst these many crackers on a single night and this is just a 1 minute clip. — AK (@AgniveerAbhi) December 1, 2018\nMadam #PriyankaChopra, in Diwali crackers did pollute the air,But I want to know that in your marriage ceremony does crackers \"Purifies\"\nthe Air? Where do you got this herbal #FireCracker😬😬😬 pic.twitter.com/aVlMcxrn1M — soham panja (@PanjaSoham) December 2, 2018", "title": "After Rooting For Cracker Free Diwali, Priyanka Chopra Gets Trolled For Fireworks At Her Own Wedding", "date_publish": "03/12/2018, 11:07:36", "description": "UNICEF Goodwill Ambassador Priyanka Chopra rooted for a cracker free Diwali and better quality air in all campaigns. In one of those, she even declared that she is asthmatic and appealed to people to celebrate Diwali with “lights and laddoos and love, and not pollution”. However, at her own wedding day, skies over Umaid Bhawan in Jodhpur lit up with fireworks. But little did they know that the sp", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-rooting-for-cracker-free-diwali-priyanka-chopra-gets-trolled-for-fireworks-at-her-own-wedding-357809.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_rooting_for_cracker_free_diwali_priyanka_chopra_gets_trolled_for_fireworks_on_her_own_wedding_1543815500_800x420.png"}