{"text": "After Twinkle Khanna Wins Best Author, Akshay Kumar Feels It Could Be The Beginning Of Abhimaan 2\nAfter Twinkle Khanna Wins Best Author, Akshay Kumar Feels It Could Be The Beginning Of Abhimaan 2\nWe have all seen the cult movie Abhimaan which featured Amitabh Bachchan and Jaya Bachchan back in 1973. The film revolves around hero's jealousy when his wife becomes more successful than him.\nTwitter\nWhile that was reel life, these things have been witnessed in real life as well. However, in due course of time, things have changed over the years. Today, husbands are not jealous of their partner's achievements rather proud. And the classic example is our Bollywood A-lister Akshay Kumar.\nTwitter\nAK’s wife Twinkle Khanna recently won the best author award. Being her witty best, Twinkle Khanna took a sly dig at husband while accepting the reward.\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nWe are delighted to announce that Pyjamas are Forgiving by @mrsfunnybones is Nielsen BookScan’s top selling title by a woman author in 2018! pic.twitter.com/yIBopCDYTT — Juggernaut Books (@juggernautbooks) December 27, 2018\nDirecting the tweet to Akshay, Twinkle tweeted, “Now if anyone bothers me when I am at my desk-to find missing socks, a missing phone or even a missing child I have a valid reason to say - Talk to the hand:) #PyjamasAreForgiving”.\nNow if anyone bothers me when I am at my desk-to find missing socks, a missing phone or even a missing child I have a valid reason to say - Talk to the hand:) #PyjamasAreForgiving https://t.co/pwPJEg1REy — Twinkle Khanna (@mrsfunnybones) December 27, 2018\nSoon enough her hubby Akshay replied, “And this seems to be the beginning of Abhimaan Part 2. On a more serious note...I’m so so proud of you”.\nAnd this seems to be the beginning of Abhimaan Part 2😜\nOn a more serious note...I’m so so proud of you ❤️ https://t.co/QgkwYZDj7t — Akshay Kumar (@akshaykumar) December 27, 2018\nWell, looks like Twinkle's humour is being rubbed off on Akshay Kumar. The husband certainly is super proud of his wife and one more time this witty couple has given us marriage goals.\nTwitter", "title": "After Twinkle Khanna Wins Best Author, Akshay Kumar Feels It Could Be The Beginning Of Abhimaan 2", "date_publish": "28/12/2018, 12:05:27", "description": "Now who can forget Amitabh Bachchan and Jaya Bachchan’s Abhimaan film, that film showed that we still live in a patriarchal society. But hey, things have changed a bit over the years. Today’s husband is not jealous rather proud of their wives achievement. And the classic example is Akshay Kumar.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-twinkle-khanna-wins-best-author-akshay-kumar-feels-it-could-be-the-beginning-of-abhimaan-2_-359398.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/akshay_kumar_1545982390_800x420.jpg"}