{"text": "Known for his brilliant comic timing and performances in films like Maalamaal Weekly, Bhool Bhulaiya and Hungama, Rajpal Yadav was sentenced to six months in jail for failing to pay the loan of Rs 5 crore he had taken from Delhi-based entrepreneur MG Agarwal in 2010 at the time of his directorial debut Ata Pata Laapata.\nHe was arrested in Nov 2018, and came out of jail in Feb this year. After having served his jail term, he says some people misused his trust.\nRajpal Yadav will soon starting working on a film called Time To Dance alongside Sooraj Pancholi and Isabelle Kaif. He says he is healed, happy and excited to go back to a film set.\n“I will soon start the shooting of the film Time To Dance alongside Sooraj Pancholi and Isabelle Kaif. We shot the film abroad. A small part of it remains. We will finish that. It could have been finished before,” he told IANS.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“...but I am really thankful to the producers and directors who waited for me to come back,” he continued, adding “Apart from that, I am also wrapping up Jaako Raakhe Saaiyan. I am also in talks to work with David Dhawan and Priyadarshan. I can't wait to go back on a film set now.”\nInstagram\nAbout his jail sentence for non-payment of loan that his company had taken to produce a movie in 2010, he said, “I think the law is equal for everyone and no one is immune from the law of the nation, the legal system. So I followed the court's decision as a law abiding citizen.”\n“I think I trusted a few people who later misused my trust. But I do not want to comment much on that. I want to move forward as I know life has a lot to offer,” he added.\nTOI\nThere was news that he had also performed during a cultural programme held for the prison inmates. About that he said, “There was a lot of discipline that we all had to follow. But I always tried to engage my mind with something or the other. I used to interact with the fellow prisoners during recreation activity; I used to conduct an interactive session that we named Rajpal Ki Paathshala.”\nTwitter\n“I gave a motivational speeches. Did exercise in the morning. We had access to the library and I used to sit there and read,” he added.\nRajpal Yadav had spent 10 days in Tihar jail, in the same case earlier.\nRead More: Rajpal Yadav Sentenced To Six Months Jail Term In Loan Recovery Case, Granted Bail\nWith inputs from IANS", "title": "After Spending Three Months In Jail, Rajpal Yadav Says People Misused His Trust", "date_publish": "28/03/2019, 11:40:11", "description": "Rajpal Yadav was arrested in Nov 2018, and came out of jail in Feb this year. After having served his jail term, he says some people miused his trust. Rajpal Yadav will soon starting working on a film called Time To Dance alongside Sooraj Pancholi and Isabelle Kaif. He says he is healed, happy and excited to go back to a film set.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-spending-three-months-in-jail-rajpal-yadav-says-people-misused-his-trust-364441.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/after_his_jail_term_rajpal_yadav_will_soon_starting_working_on_a_film_called_time_to_dance_1553752942_800x420.jpg"}