{"text": "After a long hiatus, Bollywood actor Emraan Hashmi came back with Cheat India which had a powerful message about the education system of India. The movie soon got embroiled into controversies after many raised objection towards the title of the film.\nScreengrab\nSoon enough, film and trade analyst, Trade Adarsh took to Twitter to announce the new name of the film, Why Cheat India. The movie released this Friday to lukewarm response and poor performance at the box office.\n#WhyCheatIndia is a non-starter... Needs miraculous growth over the weekend to post a decent total... Fri ₹ 1.71 cr. India biz. — taran adarsh (@taran_adarsh) January 19, 2019\nWhile some touted the subject line boring, some thought Emraan didn't fit into the role very well. But looks like there is a prime reason why the movie didn't make the kind of money t should have.\nDon't Miss 8.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nWhy Cheat India has become the latest victim to piracy. Tamilrockers, the torrent website, have uploaded the copy of the film and many people have got their hands on it. This is not the first time, Tamilrockers have done this.\nLast week only, Uri also fell prey to piracy among many other Bollywood films. It's ironic how a film like 'How Cheat India' where Emraan Hashi plays the role of a Conman has got into a similar set up.\nThe illegal movie website keeps changing its extension URL the minute their current one is reported.", "title": "After Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By Tamilrockers", "date_publish": "21/01/2019, 17:09:56", "description": "After Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By TamilrockersAfter Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By TamilrockersAfter Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By TamilrockersAfter Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By TamilrockersAfter Uri, Emraan Hashmi's Latest 'Why Cheat India' Leaked Online By Tamilro", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-uri-emraan-hashmi-s-latest-why-cheat-india-leaked-online-by-tamilrockers-360790.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/emraan_hasmi_1548070956_800x420.jpg"}