{"text": "After Meeting PM Modi, Twitter CEO Jack Dorsey ‘Knocks’ On Shah Rukh Khan’s Door To Meditate Together\nAfter Meeting PM Modi, Twitter CEO Jack Dorsey ‘Knocks’ On Shah Rukh Khan’s Door To Meditate Together\nBefore Shah Rukh Khan flew to Italy for Ranveer Singh and Deepika Padukone’s wedding, he met with Twitter CEO Jack Dorsey in Mumbai.\nFor the uninitiated, Jack Dorsey is on his maiden trip to India. He addressed a townhall at IIT-Delhi on Monday, after which he met with Prime Minister Narendra Modi, Tibetan spiritual leader Dalai Lama, Congress President Rahul Gandhi and also Shah Rukh Khan.\nThank you Prime Minister @narendramodi for having us today. I enjoyed our conversation about the importance of global conversation. Also: thanks for the ideas for Twitter! pic.twitter.com/aelfOEZ65v — jack (@jack) November 13, 2018\nBeing the polite guest he is, he tweeted to Shah Rukh Khan first to make sure he was up.\nShah Rukh Khan and Jack Dorsey had quite an amusing banter on Twitter. So much so, that taking a dig at the issue of fake news, which is one of the primary topics of Dorsey’s meetings in India, he tweeted “if anybody has warned u about my tardiness they r just spreading ‘fake news’”.\nUp and Ready. And shockingly on time...if anybody has warned u about my tardiness they r just spreading ‘fake news...’ https://t.co/LE9ybOyJ3K — Shah Rukh Khan (@iamsrk) November 14, 2018\nDon't Miss 402 SHARES 566 SHARES 185 SHARES 343 SHARES\nThirty minutes later, Jack Dorsey landed up at Shah Rukh Khan's home Mannat.\nToday @jack made me realise with his calm demeanour & composed, nearly meditative mindset...’that all Work and no Pray, would make Jack a dull boy.” Thx for dropping in & also team @Twitter for a lively evening. Have a happy stay in India. pic.twitter.com/melFfe8NKJ — Shah Rukh Khan (@iamsrk) November 14, 2018\nAnd so, Shah Rukh Khan once again proved that he is the King of wit!", "title": "After Meeting PM Modi, Twitter CEO Jack Dorsey ‘Knocks’ On Shah Rukh Khan’s Door To Meditate Together", "date_publish": "15/11/2018, 14:28:54", "description": "Shah Rukh Khan and Jack Dorsey had quite an amusing banter on Twitter. So much so, that taking a dig at the issue of fake news, which is one of the primary topics of Dorsey’s meetings in India, he tweeted “if anybody has warned u about my tardiness they r just spreading ‘fake news’”.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-meeting-pm-modi-twitter-ceo-jack-dorsey-knocks-on-shah-rukh-khan-s-door-to-meditate-together-356725.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/after_meeting_pm_modi_twitter_ceo_jack_dorsey_knocks_on_shah_rukh_khans_door_to_have_an_amusing_1542271237_800x420.png"}