{"text": "After Taking Internet By Storm, #10YearChallenge Gets A Hilarious Twist & It’ll Crack You Up\nAfter Taking Internet By Storm, #10YearChallenge Gets A Hilarious Twist & It’ll Crack You Up\nBe it the Ice Bucket Challenge or the Kiki Challenge – through the years, a lot of challenges have gone viral on internet. They are so much fun to watch, and sometimes perform, too, right?\n2019 has just begun, and the challenge that has taken the social media by storm, all over the world, is the #10YearChallenge.\nThe Best Photo that caught my eye on social media during the ongoing#10yearchallenge ☺️☺️@AnilKapoor pic.twitter.com/Ef9FCM5HML — Chandra Mohan Mittal (@er_sonu) January 17, 2019\nDo you also feel like not much has changed in all these years? If you look at your pictures from the past, you’ll realise there has been a significant change. That’s what the challenge is all about -- 2009 VS 2019.\nOur social media feeds are flooded with side-by-side photos of nostalgic throwback pictures. Celebrities have joined the bandwagon too.\nAnil Kapoor from India doesn't need to participate in the #10YearChallenge ... pic.twitter.com/vT2Fzs3p3v — tahauddin (@realtahauddin) January 16, 2019\nDon't Miss 623 SHARES 1.3 K SHARES 547 SHARES\nWhat happens when something trends on social media? The creative minds almost always turn them into memes, right? That’s what happened with this one as well. These #10YearChallenge memes are hilarious. Take a look!\nSaw everyone posting these 2009 vs 2019 pics so here's mine pic.twitter.com/nIn5TU7zNE — Sam Thorne (@Strippin) January 13, 2019", "title": "After Taking Internet By Storm, #10YearChallenge Gets A Hilarious Twist & It’ll Crack You Up", "date_publish": "17/01/2019, 13:17:10", "description": "2019 has just begun, and the challenge that has taken the social media by storm, all over the world, is the #10YearChallenge. Do you also feel like not much has changed in all these years? If you look at your pictures from the past, you’ll realise there has been a significant change. That’s what the challenge is all about -- 2009 VS 2019. Our social media feeds are flooded with side-by-side phot", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-taking-internet-by-storm-10yearchallenge-gets-a-hilarious-twist-it-ll-crack-you-up-360567.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_taking_internet_by_storm_10yearchallenge_gets_a_hilarious_twist__itll_crack_you_up_1547711293_800x420.png"}