{"text": "After Naseeruddin Shah expressed his concerns on the recent cases of mob lynchings, he once again became the soft target of trolls and political activists.\nTalking about poison and lynchings, he had said that “poison has already spread” and it will now be difficult to contain it.\n“In many areas we are witnessing that the death of a cow is more significance than that of a police officer… I feel anxious for my children because tomorrow if a mob surrounds them and asks, 'Are you a Hindu or a Muslim?' they will have no answer. It worries me that I don't see the situation improving anytime soon.”\nHis name was once again embroiled in a controversy thereafter. So much so, that just for his statement, he was being called a traitor. He says such words doesn’t affect him but it is definitely not comforting to hear chants of “Shoot the traitor!”, he told The Hindu an interview.\nThe controversy fuelled up so much that the organisers of Ajmer Literature Festival on Friday called off an event, which was to be addressed by Naseeruddin Shah. Protests were being held out by right-wing activist outside the venue. One of them even hurled ink at Naseeruddin Shah’s poster. Because of the protests, the show was called off.\nDear @SushmaSwaraj ji facilitate #NaseeruddinShah with one way ticket to peaceful neighbor country as he don't fill safe here.. — Hiren Goswami (@goswamihrn) December 21, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nWhile he faced a lot of backlash, actress Richa Chadda came out in support of him on Twitter. She says actors are tax paying voters and they have every right to express, and rightly so.\nPeople ask actors why they don’t speak out... well, cuz this happens when they do ! Actors are tax-paying voters ... they have every right to express. https://t.co/F5LqXP4KB7 — TheRichaChadha (@RichaChadha) December 22, 2018\nOn the other hand, Anupam Kher lashed out at him asking him how much freedom he needs.\n“There’s so much freedom in the country that you can abuse the army, badmouth the air chief and pelt stones at the soldiers. How much more freedom do you need in a country? He (Shah) said what he felt like, it doesn’t mean it’s the truth,” Anupam Kher told ANI.", "title": "After His Controversial Remarks, Naseeruddin Shah Gets Threats, Richa Chadha Extends Support", "date_publish": "23/12/2018, 16:25:43", "description": "After Naseeruddin Shah expressed his concerns on the recent cases of mob lynchings, he once again became the soft target of trolls and political activist. The controversy fuelled up so much that the organisers of Ajmer Literature Festival on Friday called off an event, which was to be addressed by Naseeruddin Shah. Protests were being held out by right-wing activist outside the venue. One of them", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-his-controversial-remarks-naseeruddin-shah-gets-threats-richa-chadha-extends-support-359130.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/naseeruddin_shah_gets_threats_on_his_controversial_remarks_richa_chadha_extends_support_1545556123_800x420.png"}