{"text": "After Rejecting Vicky Kaushal's Role In Lust Stories, Badshah To Make A Debut Alongside Sonakshi Sinha\nAfter Rejecting Vicky Kaushal's Role In Lust Stories, Badshah To Make A Debut Alongside Sonakshi Sinha\nAfter revealing about his inclination towards acting on Koffee With Karan, Badshah has finally bagged his debut movie. He will be seen alongside Sonakshi Sinha.\nbollywoodmantra.com\n“I am extremely nervous. However, now that I have taken the leap, I will give it my best. Bhushanji and Mrigh both kept convincing me on how perfect the role is for me. It's a film which is so unique and different,” he said.\nThe movie also stars Kulbhushan Kharbanda, Nadira Babbar Varun Sharma and Annu Kapoor. Producers Bhushan Kumar and Mahaveer Jain have joined hands with director-turned-producer Mrighdeep Singh Lamba for the yet untitled film.\nTwitter\nDid you know that Badshah was offered films in the past as well! He was offered Vicky Kaushal’s role in Lust Stories. Not just that, he was also offered a role in a Karan Johar film starring Kareena Kapoor Khan and Akshay Kumar. However, things didn’t work out for reasons unknown and the role went into Diljit Dosanjh’s kitty.\n“Good News'... the one that Diljit Dosanjh is doing with Akshay Kumar, was offered to me. I was offered Vicky Kaushal's role in Lust Stories, which I had declined. I have got other offers too. My focus was on my album,” Badshah told IANS.\nBadshah is excited about his acting debut, what about you?\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES", "title": "After Rejecting Vicky Kaushal's Role In Lust Stories, Badshah To Make A Debut Alongside Sonakshi Sinha", "date_publish": "12/02/2019, 12:50:59", "description": "After revealing about his inclination towards acting on Koffee With Karan, Badshah has finally bagged his acting debut movie. He will be seen alongside Sonakshi Sinha. The movie also stars Kulbhushan Kharbanda, Nadira Babbar Varun Sharma and Annu Kapoor. Producers Bhushan Kumar and Mahaveer Jain have joined hands with director-turned-producer Mrighdeep Singh Lamba for the yet untitled film.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-rejecting-vicky-kaushal-s-role-in-lust-stories-badshah-to-make-a-debut-alongside-sonakshi-sinha-362000.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/after_rejecting_vicky_kaushals_role_in_lust_stories_badshah_to_make_debut_alongside_sonakshi_sinha_1549956154_800x420.png"}