{"text": "She might be one of the most controversial stars in the Hindi film industry but her credibility and sincerity as a performer are unquestionable. Well, it isn't a tough nut to crack that the woman we are referring to here is Kangana Ranaut.\nTwitter\nShe is a firecracker and mincing words is not her strong suit. She runs into controversies every now and then but that doesn't stop her from being honest about her opinions. Currently, Kangana is prepping her for her upcoming film Panga, which will be helmed by Bareily Ki Barfi director Ashwini Iyer Tiwari.\nInstagram\nTo give everyone a glimpse of how the team is preparing for the film, director Ashwini Iyer Tiwari shared three new pictures from Kangana’s training session. Captioning the picture as:\nTwitter\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n“A dream. The lovely rockstar is making it happen #Pangastories #Panga #KanganaRanaut @RichaChadha @foxstarhindi #Kabaddi #gameofIndia.\", here are the pictures that were shared.\nAshwini had also shared a still from the film that could be easily called the first look.\nIt was in August last year that Ashwini had confirmed the film.\nMy existing reality is a reflection of my dear ones’ belief in me. From the team backed by its families. Presenting #PANGA with #KanganaRanaut, @jassi1gill @Neenagupta001 . Produced by @foxstarhindi | In Cinemas | 2019 😀 pic.twitter.com/XEEDIa8oFT — Ashwiny Iyer Tiwari (@Ashwinyiyer) August 21, 2018\nPanga will release on January 24, 2020, and the film will star Richa Chaddha, Neena Gupta and Jassie Gill in pivotal roles.\n(Also read: After The Success Of Manikarnika, Kangana To Focus On Making More Films On Female Warriors!)", "title": "After Horse-Riding For Manikarnika, Kangana Ranaut Trains In Kabaddi For Upcoming Film 'Panga'!", "date_publish": "31/03/2019, 12:16:08", "description": "She is a firecracker and mincing words is not her strong suit. She runs into controversies every now and then but that doesn't stop her from being honest about her opinions. Currently, Kangana is prepping her for her upcoming film Panga, which will be helmed by Bareily Ki Barfi director Ashwini Iyer Tiwari.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-horse-riding-for-manikarnika-kangana-ranaut-trains-in-kabaddi-for-upcoming-film-panga-364623.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_1554014872_800x420.jpg"}