{"text": "Amid sexual harassment allegations in Bollywood, director Sajid Khan is also now facing the heat. TV actress Saloni Chopra has come forward to reveal the shocking details of her encounter with Sajid Khan.\nTwitter\nShe penned down the blog divulging at how he exposed himself to her when she was assisting him on the film many years ago.\nInstagram/Saloni Chopra\nMore people have come out about their unpleasant experiences with Sajid on social media on in the wake of the #MeToo movement.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nNow filmmaker Sajid Khan on Friday said he is stepping down as director of \"Housefull 4\" amid allegations the he indulged in sexual misconduct with multiple women.\nIn response, Sajid wrote on Twitter: \"In the wake of the allegations against me and the pressure being put on my family, my producer and the stars of my film 'Houseful4', I must take the moral responsibility of stepping down from my directorial post, till the time I can allay the allegations and prove the truth... I request my friends in the media to kindly not pass judgment till the truth is out.\"\nThe film Housefull 4 also features Nana Patekar, who too is accused of sexual misconduct by actress Tanushree Dutta.\nAkshay Kumar, the star of \"Housefull 4\", has called off the film's shooting until \"further investigation\".\nHis wife Twinkle Khanna too took to Twitter to take a firm stance on the filming of the movie.\nAppalled hearing multiple incidents of harassment and it is truly horrific to hear what these women have been through. Everyone involved in Housefull needs to take a firm stance on this issue. This cannot go on. — Twinkle Khanna (@mrsfunnybones) October 12, 2018\nWe're yet to see the fate of the film, if it will release anytime soon.", "title": "After Saloni Chopra's Allegations, Sajid Khan Steps Down As Director Of 'Housefull 4'", "date_publish": "12/10/2018, 15:16:39", "description": "Filmmaker Sajid Khan on Friday said he is stepping down as director of \"Housefull 4\" amid allegations the he indulged in sexual misconduct with multiple women. At least two actresses and a female journalist came out about their unpleasant experiences with Sajid on social media on Thursday in the wake of the #MeToo movement.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-saloni-chopra-s-allegations-sajid-khan-steps-down-as-director-of-housefull-4_-354659.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sajid_khan_1539335569_800x420.jpg"}