{"text": "#Metoo movement has resulted in many starts and performers leaving the big projects they were involved in. It all started when Tanmay Bhatt and Gursimran Khambha stepped down from AIB after shocking claims of sexual harassment.\nWhat followed next took the entertainment industry by storm. Many actresses and writers came out in Bollywood and spoke about actors and filmmakers and accused the, of rampant sexual misconduct.\nTwitter\nAfter Saloni Chopra, Rachel White and a journalist called out director Sajid Khan for misbehaving with them, he stepped down as the director of Housefull 4. But people wondered about Nana Patekar because of whom the whole movement started.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThe 'Welcome Back' star has been accused by Tanushree Dutta of harassing her on the sets of 'Horn Ok Pleasss'. Earlier this week, a First Information Report (FIR) was filed against Patekar at the Oshiwara Police Station over the sexual harassment allegations made by Tanushree.\nSo, the actor who was working for the upcoming film Housefull 4, has quit the project. His son Malhar Nana Patekar announced the veteran actor's decision of \"stepping out of the project\" and the reason behind it.\n\"Nana saheb thought of the convenience of everybody as he wishes the best for the producer and the crew and hence felt that stepping out of the project would be an appropriate thing to do at this point of time,\" read the statement.\nNana saheb thought of the convenience of everybody as he wishes the best for the producer & the crew & hence felt that stepping out of the project would be an appropriate thing to do at this point of time: Malhar Nana Patekar, son of #NanaPatekar — ANI (@ANI) October 12, 2018\nMeanwhile, Akshay Kumar, without mentioning any name, had urged the producers of 'Housefull 4' to cancel the shoot until further investigation.", "title": "After Sajid Khan, Nana Patekar Leaves 'Housefull 4' Following Allegations Of Sexual Harassment", "date_publish": "13/10/2018, 17:09:55", "description": "Nana Patekar, who allegedly harassed Tanushree Dutta, has quit under-production film 'Housefull 4'. His son Malhar Nana Patekar on Friday announced the veteran actor's decision of \"stepping out of the project\" and the reason behind it. Meanwhile, Akshay Kumar, without mentioning any name, had urged the producers of 'Housefull 4' to cancel the shoot until further investigation", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-sajid-khan-nana-patekar-leaves-housefull-4-following-allegations-of-sexual-harassment-354724.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/nana_1539426345_800x420.jpg"}