{"text": "Aksay Kumar is known for delivering phenomenal hits year after year, with thought provoking messages. And his upcoming film, Kesari is no different. His latest film is based on the famous battle of Saragarhi.\nyoutube/screengrab\nIt's about an army of 21 soldiers (of the British Indian contingent) who fought against 10,000 Afghan invaders. Akshay Kumar plays a vital role of Havildar Ishar Singh and leads his team.\nThe trailer has been garnering praises from all the corners. While some are calling it explosive and real, others are saying it's the best thing on the internet today. Yes, the minute the trailer released online, it made its way into the world of memes.\nTake a look.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nEven after 15 years, the concept of sardar for bollywood hasn't changed.\n#KesariTrailer pic.twitter.com/RayAEyWZOI — Satya Vuchan (@SatyaVuchan) February 21, 2019\nPublic Reaction after one more PC of Rahul Gandhi on Rafale #KesariTrailer pic.twitter.com/DNHiPJRILs — Tea Cup Puppy (@TeaCupPuppie) February 21, 2019\n10k Afghan invaders : we will destroy the British raj from India\n21 kesariya British soldiers : instead of saying stfu 👇🏼#KesariTrailer pic.twitter.com/nDFQjOueF4 — Kesariya Vilayti (@muni_narad_) February 21, 2019\nwhen a political person promises something\nme:\n#KesariTrailer pic.twitter.com/Auo8R8Tymv — aditya yadav (@digitaladitya) February 21, 2019\nPeople in your girl's DM vs People in your DM. #KesariTrailer pic.twitter.com/zrCJ4Bq3BO — Kishan Jhunjhunwala (@Jjworiginal) February 21, 2019\nMoney left in the account and number of days left in the month. #KesariTrailer pic.twitter.com/i8rN4zCzF4 — GRV (@MildlyClassic) February 21, 2019\nAs per some of the celebrities, if the trailer or a teaser catches the meme fever, then they know it's here to make an impact. And looks like Kesari is going to be one of those films which will be another blockbuster of this year.\nThe movie is slated to release on 21st March and features Parineeti Chopra in the lead as well.", "title": "After Akshay Kumar's Kesari Trailer Stirs A Storm, Internet Lights Up With Giggle-Worthy Memes!", "date_publish": "21/02/2019, 18:17:46", "description": "After An Intense Trailer Of Akshay Kumar's Kesari, Internet Lightens It Up With Hilarious MemesAfter An Intense Trailer Of Akshay Kumar's Kesari, Internet Lightens It Up With Hilarious MemesAfter An Intense Trailer Of Akshay Kumar's Kesari, Internet Lightens It Up With Hilarious MemesAfter An Intense Trailer Of Akshay Kumar's Kesari, Internet Lightens It Up With Hilarious MemesAfter An Intense Tra", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-akshay-kumar-s-kesari-trailer-stirs-a-storm-internet-lights-up-with-giggle-worthy-memes-362560.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kesari_1550753191_800x420.jpg"}