{"text": "The taste of victory is sweeter when you have the love of your life by your side to support. Ranveer Singh, who is winning all the awards of the season for Padmaavat is on cloud nine.\nApart from marrying his love Deepika Padukone last year, there are several reasons to celebrate. Last evening, Ranveer Singh went down on his knee to receive his the Best Actor award from wife and actor Deepika Padukone at the 64th Filmfare Awards. A video that is going viral on the internet has Ranveer Singh on his one knee as wife Deepika hands him the trophy. He says,\nInstagram\n“This Black Lady (award) is very special to me, but this lady (Deepika) is the most special lady to have ever happened to me, I love you, are you proud of me?”\nHe kissed his wife as he took the trophy with pride. Ranveer won the award for playing Alauddin Khilji in Sanjay Leela Bhansali’s Padmaavat. Singh dedicated his award to his grandmother. Talking about the same, Ranveer said,\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n“I dedicate this award to my nani as it was my nani as favourite character. One day I called my sister and asked what nani is doing, she said that nani is on terrace doing her favourite thing that is watching Padmavaat.”\nHave a look at the videos here.\nAfter the glorious win, everyone celebrated their victory together. Wife Deepika shared an adorable picture after the awards and it had Ranveer, Ranbir Kapoor and Vicky Kaushal partying together after the event.\nShe captioned the picture as: “All my favs in one frame.\"\n(Also read: 'I Love You', Alia Bhatt's Winning Speech For Raazi Was All About Love And Ranbir Kapoor!)", "title": "After Winning His Award For Padmavat, Ranveer Goes Down On One Knee For Deepika!", "date_publish": "24/03/2019, 15:16:35", "description": "Apart from marrying his love Deepika Padukone last year, there are several reasons to celebrate. Last evening, Ranveer Singh went down on his knee to receive his the Best Actor award from wife and actor Deepika Padukone at the 64th Filmfare Awards. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-winning-his-award-for-padmavat-ranveer-goes-down-on-one-knee-for-deepika-364225.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/deepika_padukone_1553421748_800x420.jpg"}