{"text": "Social workers make a difference to the world and not the smiling celebrity faces, Amitabh Bachchan had said earlier this year insisting that more than celebrities, social workers should be lauded.\nAmitabh Bachchan is one of the few celebrities who is using his star power for the good. From paying off farmer’s debt to aiding martyr’s families, Amitabh Bachchan has used his celebrity status to make a difference. From Polio To Swachch Bharat Abhiyan, he has attempted to evoke a change with social campaigns too.\nTwitter\nAnd once again, the man is making headlines for his good deeds. The legendary star recently donated Rs 50 lakhs for the welfare of senior citizens to a Gurgaon-based NGO, The Earth Saviours Foundation, which is situated in Bandhwari Village.\nThe founder of the NGO, Ravi Kalra, had recently participated on Amitabh Bachchan’s show Kaun Banega Crorepati. Big B was moved after Ravi Kalra narrated the stories of the elderly who are abandoned by theory children. So much so, that he promised to donate, and he indeed did.\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 1.7 K SHARES 12.5 K SHARES\nPTI\n“It was a most moving experience for me and indeed all present during the KBC Karmveer programme that you honoured us with, some days back. Hearing you narrate your stories, was a most horrifying moment for all,” Bachchan said in a letter to Kalra.\nAFP\n“As committed during the programme I am attaching herewith my contribution towards the noble cause that you undertake for the deprived. May you continue to bring succor and happiness in the lives of the abandoned. Shall be grateful for your acknowledgement,” he added.\nRavi Kalra said that the money donated by Amitabh Bachchan would be used for the treatment, medicine and food of the 450 senior citizens that stay in NGO. They are also planning to build a hospital in the village.\nWith inputs from IANS", "title": "After Paying Off Loans Of 1398 Farmers, Amitabh Bachchan Donates Rs 50 Lakh For Welfare Of Senior Citizens", "date_publish": "09/12/2018, 11:40:33", "description": "Amitabh Bachchan recently donated Rs 50 lakhs for the welfare of senior citizens to a Gurgaon-based NGO, The Earth Saviours Foundation, which is situated in Bandhwari Village. The founder of the NGO, Ravi Kalra, had recently participated on Amitabh Bachchan’s show Kaun Banega Crorepati. Big B was moved after Ravi Kalra narrated the stories of the elderly who are abandoned by theory children. So mu", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-paying-off-loans-of-1398-farmers-amitabh-bachchan-donates-rs-50-lakh-for-welfare-of-senior-citizens-358215.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_paying_off_loans_of_1398_farmers_amitabh_bachchan_donates_rs_50_lakh_for_welfare_of_senior_ci_1544334788_800x420.png"}