{"text": "In conversation with us, Preity Zinta declared that she has made up her mind to make a comeback in films. The actress left her fans highly disappointed by quitting films, but now she has decided to focus only on films.\nTwitter\nTalking about the same to us, Preity Zinta revealed how she was rejected at the beginning of her career and how today she has the choice of doing films without thinking of money and several other factors.\nPreity is making a comeback with Sunny Deol’s film Bhaiaji Superhit as Sapna Dubey, a loud desi character which she has never done before. Those who have watched the trailer will definitely have a question why is she making a comeback with a film like Bhaiaji Superhit.\nDon't Miss 7.9 K SHARES 881 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nHere’s her answer to it,\n“When this film was offered to me, I had stopped working in films. I have been in cricket for all this while, and when I heard this script - I was like this is so not me, ‘ye toh mai bilkul hi nahi karungi’. If you look at my career graph, I started it with Kya Kehna. Dil Se released first, Soldier, Mission Kashmir, Sangharsh, Armaan, Dil Hai Tumhara, every role was character driven, maybe one or two films I did to build a house, or someone forced me to do for a relationship otherwise every film I have done is for a story or a character. So, at one stage of my life I went to filmmakers who are my friends and asked why ain’t they casting me in a desi role, they were like no, that’s not your personality and I was like I am an actor, and that was probably I thought now I want to do something else, because when you are up there, been there, done that, and you have even worked with Yash Chopra you want to experiment, but that time was not of experiment, whenever I wanted to do some desi role, they used to say no Rani Mukerji will do it well.\"\nShe further added, \"And then I thought all my life I was looking for a desi role and now that I have got one I am saying no to it, this film has all that I haven’t done before, it was sindoor, saree, all my life I have done this modern role, but in my heart I am the biggest desi, so I said ok, I will do this role. Also, thanks to this movie, that I decided I want to do more movies because I actually forget how much fun it was to do movies. \"\nLeft Acting For My Financial Stability\nTwitter\nPreity confessed how she needed financial stability and didn't want to work her full life only for money, \" I never missed acting all these years, but when I was doing this film then I realised I missed it a bit. Also, I was offered films over the years, I have also sat on somethings and even liked it but things didn’t work and other actors did that film and even won awards. Also, I was always seduced by this business world, I wanted a lot of money, of course, actors get money, but they have money till they work, but I wanted a lot of money as my lifestyle was different. So I decided to do something else, even I was at the peak of my career I left acting and switched to cricket, people thought I am crazy, but I wanted financial stability for the rest of my life and in a big way, and thank god I even succeeded in this.\"\nMade My Career In Films Only For Money\nTwitter\nThe actress clearly said she joined Bollywood only for money, \" I have been very true to myself, I never knew I am going to be an actor because it was not possible for me because I was one mundu- a tomboy, every boy in town knew me, every boy in town loved me because my best friends were always the prettiest girls. Nobody wanted to be my friend; they always wanted to use me as Stephanie to reach my friends, so that kid would never think of becoming an actress. It was not even in my dreams. I was studying criminal psychology, I got a chance of working in films, I knew that it will pay me more than what I am doing now so I did it.\"\nHad Courage To Say NO To Hero Driven Films\nPreity adds how despite being an outsider she had the courage to choose her script and say no to films which didn't excite her, \" I have always done things for myself but even within that I had very strong guidelines, I am not going to wear bad clothes, I am not going to do cheap films, somebody came to me with a film and said, ‘4 gaane hai and so and so hero hai,’ I was like sorry I am not doing this film. I needed a script not because I thought I am better than anybody else, but I knew I wasn’t prepared or good as anybody else so, I had to work harder and for that, I needed a good script for a base. When I had entered films, lots of people told, ‘isko kaha se utha ke laaye ho?’ Yeh kaha se khadi hogi, Saroj ji used to scold me like anything, khadi bhi nahi ho sakti, yeh kya karegi, but I learned everything. I have only done 2 films in 90’s and 30 films were done in 2000, I am saying this because 90 was a different era, you never had content based films, 80’s and 90’s wore about the heroes and 4 gaane. When I had come to the films, my friends made a lot of fun of me, they were like oh my you will also wear white saree and dance in the rain and all that, because I didn’t want to make a fool out of myself in front of the world and I was a criminal psychology student, I wanted to do a character driven story, so there is something fresh if you are an outsider, you haven’t gone through film condition. Film conditioning is cinematic liberty, non film conditioning is unless it doesn’t make sense it doesn’t fly, so for me it has to make sense, so anything that I felt was little vulgar and awkward I used to say I am not doing it, I was lucky that I had got success at the beginning of my career, so people never asked me to shut up when I demanded a change.\nNever Got Attached With The Word 'Star''\nTwitter\n\"I never had the attachment of this STAR word, I always feel you are a star because somebody writes an amazing dialogue for you, there are 200 people working on you, right from, costumes, lights, make up, hair and lot of things, you are the reflection of that 200 people’s vision and if you start believing that you are star you are a cuckoo, because in this industry the highs are very high and the lows are very low, so I always tried to be very neutral, touchwood, I had more of highs and very few lows, which made me learn to keep myself very grounded.\"\nMost Daring Film In My Career Is Chori Chori Chupke Chupke\nTwitter\nPreity played a prostitute in this Salman Khan film and got the most appreciation for it, \" My most daring film as a character was Chori Chori Chupke Chupke, but then I was acting with the head of the Censor Board in it,- Salman Khan, if there were any cheap dialogues or dress he used to change it, I was very happy with it, he is very old school in his way of thinking, he always wants decency in his films. Also I was an army kid and I didn’t want to embarrass my family by doing anything vulgar in films. I was also very honest to say no to the script, if I didn’t liked it I used to say no on face, I never did all the nakras, ‘oh dates nahi hai and all that’. My honesty worked for me.\nToday I Will Work In Films To Challenge Myself As An Actor\nPreity is clear what kind of films she wants to do in her second innings, \" Back 10 or 15 years I was working to feed myself, but today I am doing films only because I want to challenge myself as an actor and I want to do something that maintains relevance to me. What I am trying to say is if something excites me I will happily do it even if it is a play, and if something that doesn’t excite me and even if a big filmmaker is making it I won’t do it. Earlier I was not doing films because I only had cricket in my mind. It needed for me, but now it has become autopilot, I have a CEO to look after, it doesn’t need me more. Like when a child is born it needs a lot of care and conditioning but when they grow they don’t need their mums, I will always keep my eye on cricket but it doesn’t demand my entire focus.\nThe Word ‘No’ Is A Very Important Aspect In My Life\nTwitter\nBefore ending the interview, Preity shared the mantra of the success of her life which we all must follow, \"In life, you always have better choices when you have the choice of no, you are very limited when you have no choices or no, say NO is very important aspect of your life, as long as you have the choice of saying no life is great and the moment you don’t have the option of NO, life is not great, that’s one thing I learned in my career.\"\nTwitter\nWe are glad Preity is back in movies. She is definitely one of the finest actors we have in Bollywood.", "title": "After Taking A Sabbatical From Movies, Preity Zinta Is Ready To Make A Comeback & Stay For Good", "date_publish": "15/11/2018, 16:03:24", "description": "Preity Zinta declared in our interview that finally, she had made her mind to make a comeback. The actress left her fans hugely disappointed by quitting, but now she is finally decided to focus only on films. In an exclusive conversation with Indiatimes Preity Zinta spoke her heart out like never before, she revealed how she was rejected at the beginning of her career and how today she has the c", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-taking-a-sabbatical-from-movies-preity-zinta-is-ready-to-make-a-comeback-stay-for-good-356728.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/preity_zinta_1542271054_800x420.jpg"}