{"text": "After Dhadak, Karan Johar Ropes In Janhvi Kapoor To Play The Role Of IAF Pilot Gunjan Saxena In His Next\nAfter Dhadak, Karan Johar Ropes In Janhvi Kapoor To Play The Role Of IAF Pilot Gunjan Saxena In His Next\nJahnvi Kapoor is on a roll and how! No wonder she is called Karan's favourite after Alia Bhatt. Post her debut film Dhadak, she had signed two films of Karan Johar - Takht, and Kalank both period dramas.\nInstagram\nAnd now the latest report is she has signed Karan Johar's fourth film. There is a huge buzz that Jahnvi might play the role of IAF pilot Gunjan Saxena in his next.\nTwitter\nReportedly, Karan is supremely inspired by the Indian Air Force Pilot Gunjan Saxena’s life who was extremely active during Indian army’s presence at the Kargil War. He has decided to make a biopic on her life casting Janhvi in the lead role.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nInstagram\nAccording to a source cited by Bollywood Hungama, “Karan Johar thinks Janhvi has the right posture and attitude to play Gunjan Saxena. No, Janhvi won’t actually fly a helicopter in the film. But she is going to learn how the helicopter works”.\nJanhvi’s first film left everyone impressed and it will be interesting to see how she manages to play the role of a real-life hero Gunjan Saxena.", "title": "Janhvi Kapoor To Play The Role Of IAF Pilot Gunjan Saxena In Karan Johar’s Next", "date_publish": "19/11/2018, 17:37:00", "description": "Jahnvi Kapoor is on a roll and seems like have become the favourite star kid of Karan Johar. Why we say so? After making a smashing debut with Dhadak film under Dharma Productions, she signed KJo’s multi starrer film Kalank. And now the latest report is that she might play a role of IAF pilot Gunjan Saxena in his next.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/after-dhadak-karan-johar-ropes-in-janhvi-kapoor-to-play-the-role-of-iaf-pilot-gunjan-saxena-in-his-next-356966.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/janhvi_1542625820_800x420.jpg"}