{"text": "After The Crazy Trailer Of 2.0 Was Released, It’s Raining Jokes & Memes On Social Media\nAfter The Crazy Trailer Of 2.0 Was Released, It’s Raining Jokes & Memes On Social Media\nThe much-awaited trailer of 2.0 starring Akshay Kumar and Rajinikanth was released a couple of days ago, and it seems it is going to be the craziest superhero movie of the year.\nThere has been a lot of buzz around it, especially because it involves years of hard work. Furthermore, the fact that it has been made on a budget of Rs 600 crores is making people look forward to it even more.\nScreengrab\nHowever, after the trailer was out, in no time, it inspired a meme-fest on Twitter. From slamming its visual effects to comparing it to MSG, fans couldn’t stop wondering what all the fuss was about. If you haven’t yet watched the trailer, you can watch it below.\nDon't Miss 282 SHARES 117 SHARES\nAnd so, another trailer became a butt of jokes!\n#1\n#2\n#3\nCouples when the see bajrang dal on Valentine's day. #2Point0Trailer pic.twitter.com/iqA9OkcHYg — Mask Ishan (@Mr_LoLwa) November 3, 2018\n#4\n#5\nWhen Salman takes his car for a drive#2Point0Trailer pic.twitter.com/RW0d7S67lP — Ambarish Awale (@AmbarishAwale) November 4, 2018\n#6\n#7\nXiaomi phones, when you charge them for 2 hours. #2Point0Trailer pic.twitter.com/v06kryMh30 — Bollywood Gandu (@BollywoodGandu) November 3, 2018\n#8\n#9\n#10\n#2Point0Trailer\nHow #Indiansparents check their children wheather they r drunked or not...After late night parties..😂😂 pic.twitter.com/iDSFOUobvT — नादान परिंदे🇮🇳 (@Gauri_doonite) November 3, 2018\n#11\n#2Point0Trailer - cell phone ho rahe gayab\npagal hui bheed ....confusion me hai police\nindian mom's right now pic.twitter.com/X3d9NFcZHl — abhay (@Abhays03) November 3, 2018\nThe movie is all set to be released on November 29.", "title": "After The Crazy Trailer Of 2.0 Was Released, It’s Raining Jokes & Memes On Social Media", "date_publish": "05/11/2018, 18:21:21", "description": "The much-awaited trailer of 2.0 starring Akshay Kumar and Rajinikanth was released a couple of days ago and it seemed it was going to be the craziest superhero movie of the year for Bollywood. The much-awaited trailer of 2.0 starring Akshay Kumar and Rajinikanth was released a couple of days ago and it seemed it was going to be the craziest superhero movie of the year for Bollywood.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-the-crazy-trailer-of-2-0-was-released-it-s-raining-jokes-memes-on-social-media-356120.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/after_the_breathtaking_trailer_of_20_has_been_released_its_raining_jokes_on_social_media_1541421929_800x420.png"}