{"text": "We all had been waiting for a FRIENDS reunion for the longest time. And just when we least expected it, Ellen DeGeneres gave us a surprise. When FRIENDS star Courteney Cox went on her show to promote her new Facebook Watch docu-series titled 9 Months, she surprised her with a mini FRIENDS reunion.\nTwitter\n\"I wish Lisa Kudrow was here, because that would be fun,\" Ellen DeGeneres casually commented while sipping her coffee and that's when Lisa Kudrow AKA Phoebe walked in.\nTwitter\nSeeing Phoebe walking in, Monica exclaimed, “You're here! This is a shock...This is my first Instagram post? You came here, thank you.”\nCourteney Cox appeared on the show to take her first Instagram photo. She explained that she has just started her account with handle name @courteneycoxofficial. DeGeneres had then revealed to her they have recreated Central Perk, the iconic coffee shop from the show in order to give Courteney Cox a setting for her first post.\nNot long ago, Courteney Cox and Lisa Kudrow were spotted enjoying a lunch date proving to the world that they are indeed friends for real.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMeanwhile, if you haven’t realised how old the show is, Matt LeBlanc AKA Joey recently revealed that the new generation of FRIENDS fans call him Joey’s daddy and he just shoos them away. Can you believe it?", "title": "After A Lunch Date, Courteney-Lisa Went On Ellen’s Show & It's FRIENDS Season All Over Again!", "date_publish": "30/01/2019, 11:44:53", "description": "We all had been waiting for a FRIENDS reunion for the longest time. And just when we least expected it, Ellen DeGeneres gave us a surprise. When FRIENDS star Courteney Cox to promote her new Facebook Watch docu-series titled 9 Months with Courteney Cox, she surprised her with a mini FRIENDS reunion. \"I wish Lisa Kudrow was here, because that would be fun,\" Ellen DeGeneres casually commented whi", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-a-lunch-date-courteney-lisa-went-on-ellen-s-show-it-s-friends-season-all-over-again-361272.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/courteney_coxlisa_kudrow_aka_monicaphoebe_had_a_surprise_friends_reunion_on_ellens_show_1548827778_800x420.png"}