{"text": "Bollywood is becoming better with content driven cinema. Whether it's star cast, fresh directors or locations, gone are those days when Khans carried the burden of big budget movies or foreign locations justified the box office collection. Now the audience is evolving and even smaller gives are giving big numbers. We also know how Bollywood takes inspiration from Hollywood but there are a lot of filmmakers who take their own Indian cinema very seriously.\nSouth Indian cinema is known for their innovative plot and interesting story-line, so here are 9 South Indian movies that created an impact in Bollywood. Well, some became popular with powerful scripts, some fizzle out with duplication. Let's analyse on South Indian movie remakes that made the cut in Bollywood and how successful they really became.\n1. Kabir Singh\nThe latest entrant to join the South Indian remakes in Shahid Kapoor. And might we add, this is the coolest Sasha has looked in so many years. He is fierce and has nailed is role brilliant. Some people are already anticipating this Shahid's best role so far.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAfter the success of the Telugu film Arjun Reddy (2017), its writer and director Sandeep Vanga wanted to remake it in Hindi with Ranveer Singh. When it did not work out, he approached Shahid Kapoor.\nThe same director has also made Kabir Singh, \"When I made Arjun Reddy, I wasn't sure where to draw the line in terms of representation of certain things. I don't think I'd have to restrict myself when it comes to the Hindi version. I believe I'll have more freedom in Bollywood.\"\nAnd looking at the trailer, we are mighty impressed with what's to come already.\n2. Ghajini\nIt is a Bollywood remake of Murugadoss's own 2005 Tamil film of the same name, which in turn was inspired by the film Memento (2000). Breaking stereotype, this movie proved that if the plot is good, even a remake will work wonders. Ghajini became the highest-grossing Indian film of 2008, and the first Indian film to cross the ₹100 crore mark domestically, creating the 100 Crore Club.\n3. Wanted\nThis revived Sallu bhai's career and got him back on the map as the movie became second highest-grossing Bollywood film of the year 2009. An official remake of Telugu film, Pokiri. This was not the first remake of the original film. Prabhudeva, also the director of the previous Tamil remake, Pokkiri.\n4. Drishyam\nThe film is a remake of Jeethu Joseph's 2013 Malayalam film Drishyam. When it comes to suspense and thriller, no one does like South films. The movie down south are definitely more realistic and heart touching than the song and dance routine Hindi cinema had earlier seen. Made on a small budget, Drishyam was a breath of fresh air so much so that the film was declared tax free in Uttar Pradesh.\n5. Singham\nThis introduced the concept of a masala cop drama with flying cars and dollops of action. Singham is a remake of the 2010 Tamil film Singam featuring Suriya and Anushka Shetty. This movie kick-started the career of Rohit Shetty as it began the Singham franchise. The movie was followed by Singham Returns, Simmba and Sooryavansham\n6. Rowdy Rathore\nIt is an official remake of 2006 Telugu film Vikramarkudu featuring Ravi Teja and Anushka Shetty. Starring Sonakshi SInha and Akshay Kumar,the movie is a frame by frame copy of the original film. Having seen both, I can tell the director played safe and did not pull off any innovative scenes or stunts for this one. Maybe which is why, this was declared a blockbuster.\n7. Yuva\nkoimoi\nDirected by Mani Ratnam and released in 2004, the filmmaker tried a spectacular mix of language. He was one of the few directors who shot the Hindi and Tamil version simultaneously. While Aaytha Ezhuthu gained recognition over the years, becoming a classic and a cult film in Tamil cinema, Yuva recieved a mix response among the Hindi audience.\n8. Saathiya\nThe only movie Vivek Oberoi is remembered by, apart from the current battle with Modi biopic that is yet to witness the release, is Saathiya. It is a remake of the Tamil film Alaipayuthey whose climax was reported to be inspired by the 1998 movie Sliding Doors. Saathiya was decalred a massive hit, not only sound track, the acting, chemistry ad plot were appreciate by critics as week as audience. Additionally, the film won six Filmfare Awards which was proof enough that Vivek Oberoi and Rani are here to stay until Salman Khan happened.\n9. Kick\nIt is an official remake of the 2009 Telugu movie of the same name. Not just that, the screenplay was adapted by Nadiadwala and Chetan Bhagat. The film features Salman Khan, Jacqueline Fernandez, and Randeep Hooda in the lead roles and Nawazuddin Siddiqui portraying the main antagonist of the film. The film was also remade in Tamil as Thillalangadi.\nThe whole point of remaking South Indian into Bollywood is that the choice of the audience is clear. People are moving on from rom-coms and prefer thriller, drama and political related movies. Bollywood is expanding and exploring with their choices.\nThey can now tell the audience is intelligent and is seeking meatier content. And this kind of collaboration between South Indian languages and Hindi is great because it is only getting the country closer. Stories are being heard, irrespective of what language it is being made. Thanks to the filmmakers, we have varied choices in content, artists and storyline and we aren't heavily dependent on the West.", "title": "After Kabir Singh Gets A Shout-out From Fans, Here's A Look At 9 Bollywood Remakes Of South Indian Films", "date_publish": "13/04/2019, 17:06:50", "description": "South Indian cinema is known for their innovative plot and interesting story-line, so here are 9 South Indian movies that created an impact in Bollywood. Well, some became popular with powerful scripts, some fizzle out with duplication. Let's analyse on South Indian movie remakes that made the cut in Bollywood and how successful they really became.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-kabir-singh-gets-a-shout-out-from-fans-here-s-a-look-at-9-bollywood-remakes-of-south-indian-films-that-changed-the-fate-of-bollywood-365205.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shahid_1555153699_800x420.jpg"}