{"text": "Ranbir Kapoor and Deepika Padukone may have had a past but professionally, they're rock-solid. Be it making appearances together in professional capacities or personally being cordial at parties, they have always been graceful and dignified.\nFrom walking the ramp together and making heads turn to cross-promoting each other's films, Ranbir and Deepika prove that exes can be supportive and good friends without a doubt. In case you are wondering what we are talking about, have a look at the pictures.\nInstagram\nInstagram\nDon't Miss 460 SHARES 247 SHARES 699 SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nRecently, they shot an ad together and fans were more than happy to see the Yeh Jawaani Hai Deewani pair reunite!\nAsian Paints\nAnd now, fans have another reason to be happy. If reports are to be believed, Ranbir Kapoor and Deepika Padukone have been locked in for Anurag Basu's next film. According to a BollywoodLife report, Ranbir and Deepika are already in talks with Basu for the film and if all goes well, the deal will indeed be sealed.\nWhile Ranbir and Basu have a history of working together in films like Barfi and Jagga Jasoos, it will be DP's first stint with Anurag Basu. After films like Bachna Ae Haseeno, Yeh Jawani Hai Deewani, and Tamasha, it's safe to say that when Deepika and Ranbir come together for a film, our expectations are sky-high!", "title": "After 4 Years, Deepika Padukone-Ranbir Kapoor To Finally Reunite For Anurag Basu's Next", "date_publish": "26/04/2019, 11:28:03", "description": "Ranbir Kapoor and Deepika Padukone may have had a past but professionally, they're rock-solid. Be it making appearances together in professional capacities or personally being cordial at parties, they have always been graceful and dignified. From walking the ramp together and making heads turn to cross-promoting each other's films, Ranbir and Deepika prove that exes can be supportive and good fri", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-4-years-deepika-padukone-ranbir-kapoor-to-finally-reunite-for-anurag-basu-s-next-366119.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/deepika_and_ranbir_1556258381_800x420.jpg"}