{"text": "The curious case of protests against the release of Kangana Ranaut’s Manikarnika: The Queen of Jhansi and Karni Sena’s involvement in it has left everyone puzzled. First, reports suggested that Karni Sena is opposing the release of the movie because they fear it will show the queen in bad light and distort history. Then, Kangana hit back at the organisation saying that the film has been certified by CBFC, and if it will continue to harass her, she will destroy “each one of them”.\nDr Himanshu, Karni Sena’s national spokesperson and ex-major, then went on to rubbish the reports and said that the group’s name is being used for personal vested interests.\nAjay Singh Sengar, president of Maharashtra Karni Sena soon told ANI, “If she continues to threaten the members of our outfit, we will not let her walk freely in Maharashtra and will burn her film sets.” He also claimed that if the film insults the queen of Jhansi, the Hindu society will not forgive her.\nInstagram\nKangana Ranaut recently said that she will not apologise for her comments.\n“I will not apologize to anybody. I have never apologized whenever I haven’t made a mistake. We have promised that we haven’t shown anything wrong about Rani Lakshmibai in the film so, they should support us. Rani Lakshmibai is not my relative and I feel she is daughter of the entire country so, we all should support the film. Shri Rajput Karni Sena should not play their ego card with me because I am not here to say sorry to anyone,” she was quoted as saying by IANS.\nNow, it is said that Karni Sena is protesting outside Kangana Ranaut’s house in Mumbai. In a video doing the rounds on social media, Karni Sena members can be seen raising slogans while the police officials try to control the scenario. Take a look!\nDon't Miss 106 SHARES 126 SHARES 1.4 K SHARES 336 SHARES\nAhead of the release of Manikarnika: The Queen of Jhansi on Jan 25, security at Kangana Ranaut’s house has been beefed up.", "title": "After Kangana Ranaut Refuses To Apologise, Karni Sena Protests Outside Her House In Mumbai", "date_publish": "24/01/2019, 11:34:53", "description": "The curious case of protests against the release of Kangana Ranaut’s Manikarnika: The Queen of Jhansi and Karni Sena’s involvement in it has left everyone puzzled. Kangana Ranaut recently said that she will not apologise for her comments. Now, it is said that Karni Sena is protesting outside Kangana Ranaut’s house in Mumbai. In a video doing the rounds on social media, Karni Sena members can be se", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-kangana-ranaut-refuses-to-apologise-karni-sena-protests-outside-her-house-in-mumbai-360956.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_kangana_ranaut_refuses_to_apologise_karni_sena_protest_outside_her_house_in_mumbai_1548308927_800x420.png"}