{"text": "After Stree’s Success, Rajkummar Rao To Star In Another Horror-Comedy With Varun Sharma\nAfter Stree’s Success, Rajkummar Rao To Star In Another Horror-Comedy With Varun Sharma\nBollywood horror movies haven’t been able to whet the appetite of Indian horror movie buffs. Atop this, the trend of horror comedy brought in a lot of excitement. A lot of films including Chamatkar, Bhool Bhulaiyaa and Golmaal Again have been loved by the audiences in the past, but Stree was relatively different from the cliché masala movie.\nIt was a risk, for sure, but there are no doubts to the fact that Rajkummar Rao and Pankaj Tripathi won the hearts of the audiences. So, after the magnificent success of Stree, Rajkummar Rao is all set to join hands with producer Dinesh Vijan for another horror-comedy.\nFukrey star is also a part of the venture, and looks like he is quite excited for the movie.\nSpilling details on the movie, producer Dinesh Vijan said, “Rajkummar plays a small-time goon whose plans go haywire when he discovers that he might be in store for some supernatural encounters. You can be sure he will be as riveting as ladies' tailor in 'Stree', chasing after a ghost,” he said.\n“The film will be shot in Moradabad, Uttar Pradesh. We will start the recce now and we are looking at rolling it next year.”\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIt’s not a sequel to Stree, Dinesh has confirmed. Furthermore, he said that the female lead is yet to be decided. The yet-to-be titled film will be released in 2020. There’s going to be a long wait!", "title": "After Stree’s Success, Rajkummar Rao To Star In Another Horror-Comedy With Varun Sharma", "date_publish": "17/12/2018, 18:48:59", "description": "After the grand magnificent of Stree, Rajkummar Rao is all set to join hands with producer Dinesh Vijan for another horror-comedy. Fukrey star is also a part of the venture, and looks like he is quite excited for the movie. Spilling details on the movie, producer Dinesh Vijan said, “Rajkummar plays a small-time goon whose plans go haywire when he discovers that he might be in store for some super", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-stree-s-success-rajkummar-rao-to-star-in-another-horror-comedy-with-varun-sharma-358788.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/after_strees_success_rajkummar_rao_to_star_in_another_horrorcomedy_with_varun_sharma_1545051027_800x420.png"}