{"text": "Irrfan Khan is all set to return to the bay! It was in March last year that Irrfan Khan broke the news of his cancer diagnosis via his Twitter handle. We all were left in shock, and since then we have been praying for his speedy recovery.\nAlso Read: First Pic Of Irrfan Khan Post His Cancer Treatment Goes Viral & We’re Happy To See Him Smiling\nTwitter\nAlso Read: Cool & Casual: Irrfan Khan Spotted At Mumbai Airport After 8 Months & We're So Happy He's Back\nLooks like Irrfan Khan is recovering and is hail and hearty. About a week ago, he was spotted outside producer Dinesh Vijan's office. This paved way for rumours that Irrfan Khan is gearing up for the sequel of Hindi Medium. Now, the new reports suggest that the sequel of the blockbuster movie is titled English Medium.\nTwitter\nDon't Miss 291 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nIs Irrfan Khan doing fine? During his visit to India, he met with filmmaker Tigmanshu Dhulia, who says “he is perfectly fine now.”\n“I did meet him after he returned to India. He is perfectly fine now. Irrfan told me that he will begin shooting for Hindi Medium franchise soon,” he told Deccan Chronicle adding that he would soon do a film with him too.\n“Yes, we will do a film soon. Actually, we were in the process of writing one for him. Probably, if everything goes well, we shall be making the film soon.”\nMeanwhile, it is said that English Medium will this time chronicle the life of Irrfan Khan’s daughter in United States. The movie will show the struggles of Indian students studying abroad. English Medium will be helmed by Homi Adajania, the man who is known for his works in films like Cocktail, Being Cyrus and Finding Fanny. So, are you excited to see Irrfan Khan back on the big screen? Well, we are!\nAlso Read: 13 Times Sonali Bendre & Irrfan Khan Taught Us How To Live Life While Battling Cancer!", "title": "After His Cancer Treatment, Irrfan Khan Will Start Shooting For ‘English Medium’ Soon", "date_publish": "26/03/2019, 11:20:43", "description": "Looks like Irrfan Khan is recovering and is hail and hearty. About a week ago, he was spotted outside producer Dinesh Vijan's office. This paved way for rumours that Irrfan Khan is gearing up for the sequel of Hindi Medium. Now, the new reports suggest that the sequel of the blockbuster movie is titled English Medium.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-his-cancer-treatment-irrfan-khan-will-start-shooting-for-english-medium-soon-364297.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/after_his_cancer_treatment_irrfan_khan_will_start_shooting_for_english_medium_soon_1553579532_800x420.png"}