{"text": "After 'Thugs Of Hindostan' Debacle, Aamir Khan Extends A Sincere Apology To All His Fans\nAfter 'Thugs Of Hindostan' Debacle, Aamir Khan Extends A Sincere Apology To All His Fans\nAfter the release of Thugs Of Hindostan, everyone had a similar observation to make about Aamir Khan. He either makes the best film or the year or the worst. Clearly, mediocrity isn't his strong suit.\nThe magnum opus tanked at the box-office and opened to horrible review online. After three weeks of the Thugs debacle, Aamir Khan chose to talk about it. Taking \"full responsibility\" for the film's failure, Aamir Khan spoke at an event where he said,\nAgencies\n\"I would like to say that I take full responsibility for Thugs Of Hindostan not working with the audience. I think we went wrong. I would like to take full responsibility for that. You can be sure we tried our level best.\"\nHe also admitted that only a very few people liked the film and he said it is a bad feeling to know that the film you made somehow failed to entertain the audience. He added,\n\"Aur jo audience itni expectation se aayi hai meri film dekhne ke liye, I want to apologise to them also. Iss dafa maine unko entertain nahi kar paaya. Koshish humne puri ki thi. Lekin jo log itne expectation se aaye, unhe mazaa nahi aaya. So, I'm feeling very bad that we were not able to entertain them.\"\nAamir Khan's take on the film's failure is proof that he isn't a sore loser. Talking about the extreme reactions of people towards his film, he added,\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\n\"I feel an audience is free to say what they want to say about the film. What I can say is that we certainly tried our level best.\"\nDirected by Vijay Krishna Acharya, the film boasted to a star-cast that included Amitabh Bachchan, Katrina Kaif and Fatima Sana Shaikh.\n(Also read: Thugs Of Hindostan Opens To Pathetic Audience Reviews, Fans Compare The Film To Aamir's Mela!)", "title": "After 'Thugs Of Hindostan' Debacle, Aamir Khan Extends A Sincere Apology To All His Fans", "date_publish": "27/11/2018, 11:21:43", "description": "He said, \"Aur jo audience itni expectation se aayi hai meri film dekhne ke liye, I want to apologise to them also. Iss dafa maine unko entertain nahi kar paaya. Koshish humne puri ki thi. Lekin jo log itne expectation se aaye, unhe mazaa nahi aaya. So, I'm feeling very bad that we were not able to entertain them,\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-thugs-of-hindostan-debacle-aamir-khan-extends-a-sincere-apology-to-all-his-fans-357444.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_khan_1543298943_800x420.jpg"}