{"text": "As 2019 elections are approaching, political films have been the flavour of Bollywood since the beginning of 2019. A lot of people say that films such as The Accidental Prime Minister and Uri: The Surgical Strike have propagandas. What’s more? Prime Minister Narendra Modi’s frequent meeting with the Bollywood stars also received quite a lot of backlash.\nModiji, we understand your 'Love Aaj kal' is directed towards Anil Ambani but the youth are unemployed, the farmers are distressed & the economy is in turmoil, so it wouldn't hurt to pay a little more attention to the rest of the country. https://t.co/8KMjGDOro4 — Congress (@INCIndia) January 21, 2019\nIf this wasn’t enough already, rumours were afloat a couple of days ago that Congress leaders are trying to get Kareena Kapoor as one of their candidates for Lok Sabha Polls. According to reports, her name was suggested by Congress leaders, Guddu Chouhan and Anas Khan, as a potential candidate for Bhopal parliamentary seat, where the party hasn’t tasted success since 1984.\nKareena, however, rubbished the reports saying that her only focus right now is movies.\nfreepressjournal.in\nIt didn’t end there. Now, grapevine is abuzz with rumours that Madhuri Dixit is all set to enter the world of politics. She will be contesting Lok Sabha elections, as per rumour mills. This, of course, left people puzzled.\ntheindianmoviechannel.com\nTurns out, it was an unsubstantial rumours. Laughing it off, Madhuri Dixit said, “Please tell me first, who is your source,” at a recent interview, as quoted by DNA.\nAlso Read: From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 6.8 K SHARES", "title": "Madhuri Dixit:After Kareena Kapoor, Rumours Of Madhuri Dixit Contesting Lok Sabha Elections Go Viral", "date_publish": "23/01/2019, 17:55:15", "description": "Rumours were afloat a couple of days ago that Congress leaders are trying to get Kareena Kapoor as one of their candidates for Lok Sabha Polls. Now, grapevine was abuzz with rumours that Madhuri Dixit is all set to enter the world of politics. She will be contesting Lok Sabha elections, it was said. This, of course, left people puzzled.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-kareena-kapoor-rumours-of-madhuri-dixit-contesting-lok-sabha-elections-are-doing-the-rounds-360938.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_kareena_kapoor_rumours_of_madhuri_dixit_contesting_lok_sabha_elections_go_viral_1548244365_800x420.png"}