{"text": "After Saawariya, Salman Khan & Sanjay Leela Bhansali Are Coming Together For 'Inshallah'\nAfter Saawariya, Salman Khan & Sanjay Leela Bhansali Are Coming Together For 'Inshallah'\nFilmmaker Sanjay Leela Bhansali's vision was to cast Salman Khan in Bajirao Mastani alongside Aishwarya Rai. He tried convincing him for 15 years but the equation between Aishwarya and Salman were so sour that there was no room for reconciliation.\nUltimately, Sanjay Leela Bhansali had to move on with a new pair Deepika Padukone and Ranveer Singh and he couldn't be more grateful. The jodi turned out to be mega hit in every film.\nTwitter\nBut Sanjay's wish was to always get Salman Khan back on board. After Saawariya, where Sallu mian played a guest cameo, the actor is all set to collaborate with Sanjay leela Bhansali for an upcoming film.\nDon't Miss 862 SHARES 346 SHARES 812 SHARES\nThis Bollywood project is a first on a lot of levels. Not only, Salman Khan is reuniting with SLB after 20 long years, the filmmaker is getting Alia Bhatt on board too.\nFacebook\nThe magical duo are coming together for Inshallah and w couldn't be happier. The soon to be on-screen couple broke the news on Twitter.\nIt’s been 20 years but I am glad Sanjay and I are finally back in his next film, Inshallah. Looking forward to work with Alia and inshallah we will all be blessed on this journey.#Inshallah #SLB @aliaa08 @bhansali_produc @SKFilmsOfficial — Salman Khan (@BeingSalmanKhan) March 19, 2019\nI was 9 when I first walked into Sanjay Leela Bhansali's office, all nervous and hoping and praying that I would be in his next film. It's been a long wait. — Alia Bhatt (@aliaa08) March 19, 2019\nDream with your eyes wide open they say & I did. Sanjay Sir and Salman Khan are magical together & I can't wait to join them on this beautiful journey called “Inshallah” ❤#Inshallah #SLB @BeingSalmanKhan @bhansali_produc @SKFilmsOfficial @prerna982 — Alia Bhatt (@aliaa08) March 19, 2019\nAlia couldn't help but reminisce her days when she walked into Sanjay leela Bhansali's office and dreamt of featuring in his next film. Looking at the pairing, Twitter had a filed day.\nWho would've thought they will work together as a lead pair. 😂 #Inshallah pic.twitter.com/nTw6DlHuTw — Sky! (@being_Akash_) March 19, 2019\nSanjay Leela Bhansali made one of the biggest budgeted grand films like #BajiraoMastani & #Padmaavat with actor like RanveerSingh then imagine what will he do with THE SALMAN KHAN.\nIt is guaranteed 2020s biggest movie. You simply can't question SLB's potential. #Inshallah pic.twitter.com/xVxfvh4AX2 — . (@BeingRohan_) March 19, 2019\nSanjay Leela Bhansali made one of the biggest budgeted grand films like #BajiraoMastani & #Padmaavat with actor like RanveerSingh then imagine what will he do with THE SALMAN KHAN.\nIt is guaranteed 2020s biggest movie. You simply can't question SLB's potential. #Inshallah pic.twitter.com/xVxfvh4AX2 — . (@BeingRohan_) March 19, 2019\nlooks like they've broken the bollywood internet with the announcement 😹 #Inshallah pic.twitter.com/vCQ7L7sw46 — Hud Hud Dabangg (@HudHud_Dabangg) March 19, 2019\nThe movie is slated to release in 2020.", "title": "After Saawariya, Salman Khan & Sanjay Leela Bhansali Are Coming Together For 'Inshallah'", "date_publish": "19/03/2019, 17:31:54", "description": "Filmmaker Sanjay Leela Bhansali's vision was to cast Salman Khan in Bajirao Mastani alongside Aishwarya Rai. He tried convincing him for 15 years but the equation between Aishwarya and Salman were so sour that there was no room for reconciliation.Filmmaker Sanjay Leela Bhansali's vision was to cast Salman Khan in Bajirao Mastani alongside Aishwarya Rai.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-saawariya-salman-khan-sanjay-leela-bhansali-are-coming-together-for-inshallah-363965.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/salman_khan_1552997512_800x420.jpg"}