{"text": "A lot of people were shocked when several big names including that of Alok Nath and Vikas Bahl were called out for sexual harassment in the wake of the #MeToo movement that is still taking India by storm. However, many in the industry knew about these sexual predators for probably years but kept mum for reasons best known to them. The industry which is known for its glitz and glamour looks quite attractive from the outside, but there are a lot of dirty secrets that hide beneath and some of them are finally coming out now.\nAnother name that was embroiled in the #MeToo movement that shocked people was of Sajid Khan. Not one or two, but quite a few women including Bipasha Basu, Amrita Puri and Mandana Karimi have accused him of sexual misconduct.\nTwitter\nSajid Khan’s sister Farah Khan recently commented on the ongoing movement and said that she fears quick judgements and punishments, and trial by Twitter.\n“I am against fear psychosis for anybody whether it is for a woman or for a man who is talking to a girl and getting scared that should I be talking like this. We want to have to have a happy positive environment, so that is most important. The only thing I fear are the quick judgments and the quick punishments that are meted out through trial by Twitter which is happening in hours. Even in Hollywood they take their time, they do their research, they do an investigation. They interview friends and family, whether it is 20 years ago or 10 years ago- they investigate. So that is a bit scary for everybody,” she was quoted as saying by RepublicTV.\nBCCL\nDon't Miss 402 SHARES 566 SHARES\nBacking the #MeToo movement, here’s what Farah Khan had tweeted last week after her brother Sajid Khan was accused of sexual harassment.\nThis is a heartbreaking time for my family.We have to work through some very difficult issues. If my brother has behaved in this manner he has a lot to atone for.I don’t in any way endorse this behavior and Stand in solidarity with any woman who has been hurt. — Farah Khan (@TheFarahKhan) October 12, 2018\nAlso Read: As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware", "title": "After Allegations On Sajid Khan, Farah Khan Says She Fears Quick Judgements & Trial By Twitter", "date_publish": "18/10/2018, 17:14:02", "description": "Another name that was embroiled in the #MeToo movement that shocked people was of Sajid Khan. Not one or two, but quite a few women including Bipasha Basu, Amrita Puri and Mandana Karimi have accused him of sexual misconduct. Sajid Khan’s sister Farah Khan recently commented on the ongoing movement and said that she fears quick judgements and punishments, and trial by Twitter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-allegations-on-sajid-khan-farah-khan-says-she-fears-quick-judgements-trial-by-twitter-355030.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/after_allegations_on_brother_sajid_khan_farah_khan_says_she_fears_quick_judgements__trial_by_twitt_1539858405_800x420.jpg"}