{"text": "After Kick-starting #MeToo In India, Tanushree Dutta To Return To US Hoping Justice Is Served\nAfter Kick-starting #MeToo In India, Tanushree Dutta To Return To US Hoping Justice Is Served\nAfter sparking serious debates and conversation around #MeToo in India, Tanushree Dutta is all set to return to the US.\nDutta made headlines when she accused actor Nana Patekar of sexual harassment for demanding to shoot an intimate dance step with her on the sets of the 2008 film Horn OK Pleassss.\nShe went on to share stories of harassment that also included Vivek Agnihotri, the director of the 2005 film Chocolate, who had asked her to remove her clothes and dance in front of Irrfan Khan. Tanushree now wants to move ahead in life. In a conversation with DNA, she said,\n“My future lies there. I will head out early next year. When I came down to Mumbai, I thought I would go back after a month, but it’s been five months.”\nShe added that her work is done and the revolution happened for all the right reasons. She added,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I do not look at it as now hot, now cold. Such things are a revolution. What matters is its impact in the future. It has created an atmosphere where sexual predators are aware that they cannot get away with misbehavior. It came as a surprise when women began calling out the sexual predators. I am aware that #MeToo cannot be front page news every day.”\nEven today, she is hopeful of getting justice one day. She concluded by saying,\n“I have been living with it for a decade without redressal. The legal process is not dependent on me being around. If I have to be around to push the case, what is the point of the legal system and law enforcers?”\nJust a few days ago, she came out and revealed how she was also on the verge of taking the extreme step owing to frequent negativity.\n\"After putting years of hard work to be treated this way was and still is shattering. The attitude of this kind of people and my constant upstream struggle in the face of such frequent negativity that I have received made me want to give up often. A few years later Jiah and Pratyusha committed suicide. I somehow lived,\" the statement read.", "title": "After Kick-starting #MeToo In India, Tanushree Dutta To Return To US Hoping Justice Is Served", "date_publish": "15/12/2018, 16:46:07", "description": "After sparking serious debates and conversation around #MeToo in India, Tanushree Dutta is all set to return to the US. Dutta made headlines when she accused actor Nana Patekar of sexual harassment for demanding to shoot an intimate dance step with her on the sets of the 2008 film Horn OK Pleassss.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/after-kick-starting-metoo-in-india-tanushree-dutta-to-return-to-us-hoping-justice-is-served-358670.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/tanushree_dutta_metoo_1544874209_800x420.jpg"}