{"text": "After Partying Together, Priyanka Chopra & Nick Jonas Arrive In Mumbai Ahead Of Their Grand Wedding\nAfter Partying Together, Priyanka Chopra & Nick Jonas Arrive In Mumbai Ahead Of Their Grand Wedding\nAfter Virushka (Virat Kohli and Anushka Sharma) and DeepVeer (Deepika Padukone and Ranveer Singh), it’s time for Nickyanka’s (Nick Jonas and Priyanka Chopra) well. Yeah, the couple already has a nickname.\nDudes, you seriously need to take a brief course in giving shortcut names for celebrity couples! How weird it is calling @priyankachopra and @nickjonas couple as #NickYanka 🤐 — Ranjith Kumar (@TheGabbeta) November 25, 2018\nPriyanka Chopra and Nick Jonas are getting married in Jodhpur on Dec 2 and Dec 3, in Hindu and Christian ceremonies, reportedly. The groom has already arrived in India and he is having a gala time.\nPriyanka Chopra was in Delhi shooting for The Sky is Pink when Nick had arrived, and they both partied together on the sets.\nAnd now, the would-be-groom and the bride-to-be have arrived in Mumbai, ahead of their Jodhpur wedding.\nDon't Miss 365 SHARES 282 SHARES 161 SHARES 183 SHARES\nPriyanka Chopra and Nick Jonas’ wedding celebrations will reportedly kick-off on Nov 29 and continue until Dec 3. The couple will host two receptions thereafter, one in Delhi and the other one in Mumbai.\nAccording to TOI, PC will head to Udaipur and later take a helicopter to Umaid Bhawan Palace.", "title": "Priyanka Chopra:After Partying Together, Priyanka Chopra & Nick Jonas Arrive In Mumbai Ahead Of Their Dreamy Wedding", "date_publish": "25/11/2018, 17:31:51", "description": "Priyanka Chopra and Nick Jonas are getting married in Jodhpur on Dec 2 and Dec 3, in Hindu and Christian ceremonies, reportedly. The groom has already arrived in India and he is having a gala time. Priyanka Chopra and Nick Jonas’ wedding celebrations will reportedly kick-off on Nov 29 and continue until Dec 3. The couple will host twp receptions thereafter, one in Delhi and the other one in Mumbai", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/after-partying-together-priyanka-chopra-nick-jonas-arrive-in-mumbai-ahead-of-their-grand-wedding-357359.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/after_partying_together_priyanka_chopra__nick_jonas_arrive_in_mumbai_ahead_of_their_dreamy_wedding_1543146361_800x420.png"}