{"text": "TV actress Saloni Chopra is one fearless woman. She always speaks for what is right and ensures her fans get the same power too. Her Instagram pictures have the most meaningful captions that will inspire you to tell your story and help you make your life beautiful.\nInstagram\nWith #Metoo movement gaining momentum, Saloni Chopra has decided to tell her story. After years of being silent, the actress has now come forward and accused 'Housefull' director of sexual harassment.\nWriting in her blog, Saloni Chopra claims Sajid Khan made her uncomfortable by asking her if she masturbates. This was the time, when Saloni was assisting Sajid for one of his films.\nDon't Miss 106 SHARES 282 SHARES 193 SHARES 862 SHARES\nShe begins her blog with, \"The men I want to write about today are Sajid Khan, Zain Durrani, and Vikas Bahl.\"\nSpeaking further about Sajid Khan, Saloni pens down, \"Then he asked weird questions like if I would ever get a breast job, and talked about how sex is really a mental connection. Of course he went into a philosophical rant about our human bodies and it’s desires and how sorry he felt for people who had to go through abuse (not the only man who’s said this shit before they take advantage of you, it’s quite common) by the end of the interview I was in tears, and I wasn’t entirely sure why. I didn’t know if it was because I felt somewhat uncomfortable around him, or because I’d opened up too much. \"\nAnd when she didn't budge from months of being harassed, she writes, \"He frantically started walking around the room telling me I was never going to have a future in this industry and no man would ever find me sexy and he should have a boner but he doesn’t, he doesn’t have a boner looking at me. And then, he pulled his pants down and showed me his dick as he kept yelling ‘see? You don’t even make me hard!’\nThat's not all, the actress even spoke about Zain Durrani, her ex- boyfriend and how he physically abused her.\n\"Sometimes I think it happened at a halloween party in Bandra, when the management tried to kick him out. But then I think, it was in my bedroom one night? The memories of how it started are blur and painful to extents I cannot explain in words.\"\nShe even called out Vikas Bahl as sexist.\nHere's the link to her entire blog and we bet the horrific details will shock you for sure. More power to her for supporting the movement and coming out!", "title": "After All The Years Of Silence, TV Actress Saloni Chopra Accuses 'Housefull' Director Sajid Khan Of Sexual Harassment", "date_publish": "12/10/2018, 11:47:30", "description": "She begins her blog with, \"The men I want to write about today are Sajid Khan, Zain Durrani, and Vikas Bahl.\" TV actress Saloni Chopra is known to be one fearless woman. She always speaks for what is right and ensures her fans get the same power too. Her Instagram pictures have the most meaningful captions that will inspire you to tell your story and help you make your life beautiful.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/after-all-the-years-of-silence-tv-actress-saloni-chopra-accuses-housefull-director-sajid-khan-of-sexual-harassment-354635.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sajid_1539322514_800x420.jpg"}