{"text": "Ahead Of Thackeray’s Release, Nawazuddin Makes It Clear That He Doesn’t Endorse Any Ideology\nAhead Of Thackeray’s Release, Nawazuddin Makes It Clear That He Doesn’t Endorse Any Ideology\n“Felt sad to see my Fraternity being part of PM’s planned PR,” Nafisa Ali had written after Prime Minister Narendra Modi’s selfie with the young brigade of Bollywood had gone viral. If actors in any way influencing the results of upcoming elections, we don’t know. But the fact that political films have been the flavour of Bollywood since the beginning of 2019 can’t be ignored.\nAfter Uri: The Surgical Strike and The Accidental Prime Minister, Nawazuddin Siddiqui starrer Thackeray, a biopic on late Shiv Sena patriarch Bal Thackeray, who advocated the ‘Maharashtra for Maharashtrians’ plank in the late 1960s, is all set to be released on Jan 25.\nAhead of the movie’s release, Nawazuddin Siddiqui has made it clear that he isn’t endorsing any ideology. He said iron-clad ideology can hinder an artiste's growth, and so, he wants to steer clear of it.\n“I don't have any ideology, philosophy or take on anything. I am not a judgemental person. I am an actor and my job is to take up every role that excites me. If I will have a set ideology, my growth as an actor will be affected. I don't think actors should have their own ideologies,” he told PTI.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nNawazuddin, however, says he is amazed at how people have already drawn conclusions before even watching the film.\n\"I feel a hero's film is rather a propaganda film as they are shown as a person accomplished with all the right qualities and leading a successful life, etc. The film would show how a girl is in love with the hero without any reason. The hero has all the talent, the right values and everyone loves him. Those who hate him, he beats them all in one go. All of this has been accepted since over 50 years,\" he said.\nNawazuddin Siddiqui also revealed that from now on, he will not do supporting roles. \"I will not do that again. I have done supporting roles in the past and I think my quota is over. Every man does his time and I have done mine,” he said.\nAlso Read: Nawazuddin Siddiqui Looks Uncannily Similar To Bal Thackeray In This New Leaked Video & We’re Excited\nWith inputs from PTI", "title": "Ahead Of Thackeray’s Release, Nawazuddin Makes It Clear That He Doesn’t Endorse Any Ideology", "date_publish": "23/01/2019, 18:08:32", "description": "Ahead of the release of Thackeray, a biopic on late Shiv Sena chief Bal Thackeray, Nawazuddin Siddiqui has made it clear that he isn’t endorsing any ideology. He said iron-clad ideology can hinder an artiste's growth, and so, he wants to steer clear of it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ahead-of-thackeray-s-release-nawazuddin-makes-it-clear-that-he-doesn-t-endorse-any-ideology-360942.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ahead_of_thackerays_release_nawazuddin_siddiqui_makes_it_clear_he_doesnt_endorse_any_ideology_1548246560_800x420.jpg"}