{"text": "Aishwarya Shares Details Of How Her Arguments With Abhishek Bachchan Are & It's Like All Of Us!\nAishwarya Shares Details Of How Her Arguments With Abhishek Bachchan Are & It's Like All Of Us!\nFrom being co-stars to friends and then finally taking the plunge and marrying each other, Aishwarya Rai and Abhishek Bachchan's love story feels straight out of a film.\nThe couple got engaged in 2007 and have worked in several memorable films including Dhoom 2, Guru and Raavan.\n10 years ago on a freezing New York balcony, she said \"yes\". 💍❤️ — Abhishek Bachchan (@juniorbachchan) January 13, 2017\nAish was on the show Famously Filmfare where she went candid about her relationship with husband Abhishek Bachchan.\nColors Infinity\nAishwarya was asked what she and Abhishek Bachchan argue the most about. She had a funny take on it and she said, ‘You don’t want to know’.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhen she was nudged a little to share details, she revealed,\n“We’re both genetically very generously been given very strong genes. So, we’re inherently very strong personalities. I think there is a very fine line between arguing and discussing and that’s something we’re still arriving at discovering what is what. So, we discuss a lot, either politely put it as discuss, probably argue but…”\nShe was further asked if there is any habit of Abhishek Bachchan in particular that leads to a fight. She added,\nTwitter\n\"It has been 12 years and how many years before that we’ve known each other as friends. We’ve known each other for quite a long time. We’ve always conversed a lot and communicated a lot, in all its shades, in all the colours of the rainbow.''\nOn the work front, the couple is all set to reunite onscreen for Gulabjamun but a few recent reports claim that the couple has opted out from the project.", "title": "Aishwarya Shares Details Of How Her Arguments With Abhishek Bachchan Are & It's Like All Of Us!", "date_publish": "08/01/2019, 13:01:09", "description": "Aishwarya was asked what she and Abhishek Bachchan argue the most about. She had a funny take on it and she said, ‘You don’t want to know’. When she was nudged a little to share details, she added, “We’re both genetically very generously been given very strong genes. So, we’re inherently very strong personalities.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aishwarya-shares-details-of-how-her-arguments-with-abhishek-bachchan-are-it-s-like-all-of-us-360028.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/abhishek_and_aishwarya_1546934450_800x420.jpg"}