{"text": "Ajay Devgn Breaks Silence On #Metoo, Says He Will Not Work With Anyone Who Has Wronged A Woman\nAjay Devgn Breaks Silence On #Metoo, Says He Will Not Work With Anyone Who Has Wronged A Woman\nAjay Devgn is one of the most talented actors in Bollywood. He's also known as the no-nonsense guy, who doesn't like to have too many 'friends' in the industry. After acting in a string of Rohit Shetty films, Ajay is all set to collaborate with the Pyaar Ka Punchnama director Luv Ranjan.\nTwitter\nEver since the #Metoo movement has gained momentum in India, many filmmakers and actors have been facing the heat. One of them is reportedly director Luv Ranjan. The director has been facing allegations of sexual harassment. It is not clear whether the allegations will impact his upcoming project with Ajay Devgn and Ranbir Kapoor (who's also in the film).\nTwitter\nBut Devgn took to Twitter to clarify that his production house will not tolerate harassment.\nI’m disturbed by all the happenings with regards to #MeToo. My company and I believe in providing women with utmost respect and safety. If anyone has wronged even a single woman, neither ADF nor I will stand for it. — Ajay Devgn (@ajaydevgn) October 12, 2018\nDon't Miss 106 SHARES 7.6 K SHARES\n\"I'm disturbed by all the happenings with regards to #MeToo. My company and I believe in providing women with utmost respect and safety. If anyone has wronged even a single woman, neither ADF nor I will stand for it,\" Devgn tweeted.\n#Metoo is a movement against sexual harassment and sexual assault that first started in the West when Harvey Weinstein's name came up for sexual misconduct. Soon enough, the movement seeped into Bollywood and many names have been accused", "title": "Ajay Devgn Breaks Silence On #Metoo, Says He Will Not Work With Anyone Who Has Wronged A Woman", "date_publish": "13/10/2018, 14:53:01", "description": "Ajay Devgn is one of the most talented actors in Bollywood. He's also known as the no-nonsense guy who doesn't like to have too many 'best friends' in the industry. After acting in a string of Rohit Shetty films, Ajay is all set to collaborate with the Pyaar Ka Punchnama director Luv Ranjan. Me too is a movement against sexual harassment and sexual assault that first started in the West.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ajay-devgn-breaks-silence-on-metoo-says-he-will-not-work-with-anyone-who-has-wronged-a-woman-354713.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ajay_devgn_1539422996_800x420.jpg"}