{"text": "Nothing has changed in the past 28 years, says Ajay Devgn's fans after seeing the poster of De De Pyaar De. The moment you see De De Pyaar De poster it will instantly remind you of Ajay’s debut film Phool Aura Kaante's stunt where he stood on two running bikes spreading his legs wide open. Well, this stunt has inspired a meme fest for all his fans.\nAjay devgan SAMOSA ...😉 #TotalDhamaal style pic.twitter.com/1i1CHmxBNH — FaN oF AkShAy KuMaR (@SinghRowdysingh) February 5, 2019\nsir, you never told anybody that you have a pet frog too.. pic.twitter.com/451vylrsuJ — Keh Ke Peheno (@coolfunnytshirt) February 6, 2019\nHaving said that, this was the entry scene of Ajay in his debut film and it is till date considered as one of the best debutante entry in the films.\nTwitter\nAnd now the actor is back with his signature stunt despite being roasted for it for years. The first poster of his next film De De Pyaar De has Ajay doing his favorite stunt but this time on the luxurious cars having two most gorgeous actresses beside him. Tabu and Rakulpreet will be seen with the action hero in this film. The moment Ajay released this poster on Twitter; fans started the comparison with Phool Aur Kaante.\nTwitter\nHere’s what they had to say about De De Pyaar De first poster.\nTwitter\nTwitter\nTwitter\nTwitter\nTwitter\nTwitter\nThe film is definitely going to be a fun ride for Ajay’s fan, firstly he has some amazing stunts and secondly it has Tabu in it, Ajay and Tabu is one remarkable Jodi onscreen. Also, it will be interesting to see Rakulpreet after a one year gap in a Bollywood movie. She was last seen in Aiyaary.\nDon’t forget to share your thoughts on the poster in the comment section below.", "title": "Ajay Devgn Shares 'De De Pyaar De' Poster & Fans Cannot Stop Comparing It To 'Phool Aur Kaante'", "date_publish": "22/03/2019, 16:33:21", "description": "Nothing has changed in 28 years says Ajay Devgn fans after seeing the poster of De De Pyaar De. The moment you see De De Pyaar De poster it will instantly remind you of Ajay’s debut film Phool Aura Kaante stunt where he stood on two running bikes spreading his legs wide. Well, this stunt has been a meme fest for all his fans.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ajay-devgn-shares-de-de-pyaar-de-poster-fans-cannot-stop-comparing-it-to-phool-aur-kaante-364138.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ajay_devgn_1553253625_800x420.jpg"}