{"text": "Ajay Devgn & Riteish Deshmukh Are Trolling Each Other On Twitter & It’s Savage On Another Level\nAjay Devgn & Riteish Deshmukh Are Trolling Each Other On Twitter & It’s Savage On Another Level\nIf you don’t troll your friends on social media, are you even true friends? Tagging each other on memes to poke fun at each other, is perhaps the best part of the internet, isn’t it?\nvia GIPHY\nIf you need some lessons on how to be savage while trolling your friends, Ajay Devgn and Riteish Deshmukh are here to help you out. The duo share such a tight bond that they are on a trolling spree.\nTwitter\nIt all began after Ajay Devgn shared a picture of himself with Indra Kumar from the sets of Total Dhamaal. They are both happily posing in the picture, but it is Riteish Deshmukh who caught everyone’s attention. “Peechhe daari wala baba kaun hai?,” that’s what Ajay Devgn wrote in the caption.\nDon't Miss 174 SHARES 3.1 K SHARES 2.4 K SHARES\nIn response to that, Riteish Deshmukh tweeted a clip that shows a dog standing on top of the moving rickshaw with a caption that read, “Just saw your dog.” Hilarious, isn’t it?\nTo Riteish Deshmukh’s jibe, here’s what Ajay Devgn had to say.\nYa just like how this bird is mine pic.twitter.com/SZRE4Cxzko — Ajay Devgn (@ajaydevgn) February 5, 2019\nIf you didn’t get the reference, here it is!\nTwitter\nAjay Devgn and Riteish Deshmukh will be seen together in Total Dhamaal, which is releasing on Feb 22.", "title": "Ajay Devgn and Riteish Deshmukh:Ajay Devgn & Riteish Deshmukh Troll Each Other & Their Fun Twitter Banter Will Make You Smile!", "date_publish": "06/02/2019, 13:23:48", "description": "Ajay Devgn and Riteish Deshmukh are trolling each other on Twitter. It all began after Ajay Devgn shared a picture of himself with Indra Kumar from the sets of Total Dhamaal. They are both happily posing in the picture, but it is Riteish Deshmukh who caught everyone’s attention. “Peechhe daari wala baba kaun hai?,” that’s what Ajay Devgn wrote in the caption.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ajay-devgn-riteish-deshmukh-troll-each-other-their-fun-twitter-banter-will-make-you-smile-361669.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ajay_devgn__riteish_deshmukh_are_trolling_each_other_on_twitter__its_savage_on_another_level_1549438990_800x420.png"}