{"text": "From doing comedy in Golmaal series to playing dark roles in films like Gangaajal and Apaharan, Ajay Devgn has proved his mettle as an actor with every film. His brooding performance in Raid won the hearts of the audiences. So much so, that the actor has now bagged the best foreign actor award at a film festival in China.\nActor Ajay Devgn has won Best Foreign Actor award at the 27th China Golden Rooster and Hundred Flowers Film Festival in China for his role in film Raid. The four-day festival was held in Foshan, and wrapped up on Saturday with the Popular Movies Hundred Flowers Awards ceremony. The winners are selected by the audience.\nYoutube\nThe fest is organised every year by CFA -- China Film Association which is associated with ICFS -- India China Film Society founded by Kishor Jawade.\n\"We have always believed in backing content driven cinema, films with stories which are engaging and relatable. 'Raid' has been a very special film for us. It's a film we believed in from day one. The best actor victory for Ajay Devgn at the Golden and Hundred Flowers Film Festival is another feather in his cap and affirmation of his strong acting talent,\" said Bhushan Kumar, T-Series chairman and producer of \"Raid\", in a statement.\ntwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nSet in Uttar Pradesh in the 1980s, Raid is based on real life events involving one of the most high profile income tax raids in India.\nKumar Mangat Pathak, Producer and Chairman at Panorama Studios, said: \"We are proud to be associated with a film like 'Raid', which has made its mark in global cinema. As a producer, it gives us immense confidence and encouragement to make films like these.\"\nDirected by Raj Kumar Gupta, Raid released in India on March 16.\nWith inputs from IANS", "title": "Ajay Devgn Wins Big At A Film Festival In China, Bags Best Foreign Actor Award For ‘Raid’", "date_publish": "12/11/2018, 15:32:10", "description": "From doing comedy in Golmaal series to playing dark roles in films like Gangaajal and Apaharan, Ajay Devgn has proved his mettle as an actor with every film. His brooding performance in Raid won the hearts of the audiences. So much so, that the actor has now bagged the best foreign actor award at a film festival in China.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ajay-devgn-wins-big-at-a-film-festival-in-china-bags-best-foreign-actor-award-for-raid-356501.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ajay_devgn_raid_1542014127_800x420.jpg"}