{"text": "Talking about his upcoming movie 'De De Pyaar De', Ajay Devgn gave his two cents on why female actors enjoy a longer shelf life now. Ajay, who is sharing screen space with his '90s co-star Tabu in upcoming film De De Pyaar De, said the change has come in past one decade.\nafp\n\"Today things are different than what they were ten years ago, in terms of the shelf life of female actors. Now they have more shelf life or as much shelf life as male actors. \"...There is no difference today but earlier there was.\nWe have Tabu and Kajol and others working still,\" Ajay told reporters here at the trailer launch of De De Pyaar De. The 50-year-old actor said working on the romantic comedy after a long gap was a great experience for him. The actor also celebrated his birthday at the trailer launch and said age is just a number.\nAgencies\n\"Ageing is about how you feel and not about the number. All my contemporaries are so fit. I think staying fit must be a conscious decision because the intention was that what you could do 25 years ago... you could still do it.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nI am happy that I can do exactly that,\" he added. De De Pyaar De, directed by Akiv Ali and produced by T-Series and Luv Ranjan, releases on May 17.\nInputs From Times Now", "title": "Ajay Devgn Explains Why Female Actors Have More Shelf Life Today, As Compared To Ten Years Ago!", "date_publish": "03/04/2019, 18:05:06", "description": "Talking about his upcoming movie 'De De Pyaar De', Ajay Devgn gave his two cents on why female actors enjoy a longer shelf life now. Ajay, who is sharing screen space with his '90s co-star Tabu in upcoming film De De Pyaar De, said the change has come in past one decade.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ajay-devgn-explains-why-female-actors-have-more-shelf-life-today-as-compared-to-ten-years-ago-364805.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/de_de_pyaar_de_cast_1554278889_800x420.jpg"}