{"text": "Akshay Kumar Brutally Trolled For Saying His Films Work Best In Pakistan In An Old Interview\nAkshay Kumar Brutally Trolled For Saying His Films Work Best In Pakistan In An Old Interview\nInternet is an unforgiving space and when it comes to Bollywood actors, the reactions are often brutal. Akshay Kumar is the latest celebrity who has fallen into a trap this time.\nAn old video of the actor has resurfaced on the internet and people have royally slammed him for his remarks. In the video, Akshay is seen saying,\nAgencies\n“Pakistan mein meri filmein sabse zaada business karti hai. Jitna pyaar wahan se milta hai, shayad hi kahin se milta hai! (My films work best in Pakistan. The love I get from this country is more than any other place!).”\nAfter the video went viral on the internet, people quickly reacted to it and wrote that had any of the Khans including Shah Rukh Khan, Aamir Khan, Salman Khan would have uttered similar words, they would have been massively trolled.\nAgencies\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nHere is a glimpse of how internet turned Anti-Akshay.\nYe hi agar SRK ne bola hota to ek weak tak anti national SRK trend karta pic.twitter.com/Ld3OTlVaPp — भाईसाहब (@Bhai_saheb) January 28, 2019\nBeen a fan of @akshaykumar since I was a teenager; back when political leanings didn't interfere in my liking of individuals. I still adore him but it's sad to see how he's been helping to further party propaganda. Also it's high time he clarifies the mystery of his nationality. — The Drowsy Goofball (A.) (@DrowsyGoofball) January 28, 2019\nIsko paisa mile toh ye \"Hafiz saeed Zindabaad\" bol de😂 — human (@humanbeing1857) January 28, 2019\nAggar yahi baat Khan's ne boli hoti toh baval ho jaata — Amit Kumar (@AmitKum32463769) January 28, 2019\nWhile celebrities are the softest targets to these attacks on the internet, it's sad to see how old videos that make way manage to spark such controversies. Akshay is yet to make a comment.", "title": "Akshay Kumar Brutally Trolled For Saying His Films Work Best In Pakistan In An Old Interview", "date_publish": "30/01/2019, 11:45:50", "description": "Internet is an unforgiving space and when it comes to Bollywood actors, the reactions are often brutal. Akshay Kumar is the latest celebrity who has fallen into a brutal troll trap this time. An old video of the actor has resurfaced on the internet and people have royally slammed him for his remarks.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/akshay-kumar-brutally-trolled-for-saying-his-films-work-best-in-pakistan-in-an-old-interview-361262.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/akshay_kumar_1548828510_800x420.jpg"}