{"text": "Akshara Haasan was in news a few weeks ago after her private pictures got leaked online. She took to Instagram too creating awareness about the same and complaining to the cyber crime cell.\nReports suggested that Tanuj Virwani, son of veteran actress Rati Agnihotri and Akshara’s ex-boyfriend had asked Akshara’s to share some of her private pictures when they were in a relationship back in 2016.\nTwitter\nBut Tanuj clarifies his stance that he hasn’t leaked any of her pictures online as they are still good friends and had a mutual breakup.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nTwitter\nIndian Express got in touch with actor Tanuj, but due to his busy schedule, his spokesperson spoke on his behalf. The representative insisted that Anuj and Akshara do not share any bad blood and are still on talking terms and he is even ready to help Akshara in finding the main culprit.\nTwitter\nTanuj’s spokesperson said to Indian Express,\n“All I would like to say as Tanuj’s spokesperson is that we have been made aware of the situation. We know that Akshara had filed an FIR about the leak of certain images which were personal. We must first understand that Tanuj and Akshara were dating for a good number of years, but they are not together anymore. However, they are still very good friends”.\nTwitter\nShe further added, “However, having said that, Tanuj is absolutely aware of what Akshara must be going through. We are more than happy to cooperate with the police or with any kind of investigation, so as the culprit gets punished and gets caught. Tanuj is going to give it his all and whatever is needed of him. Legally, he will be more than happy to support.”\nTwitter\nWe hope cops find the main culprit who leaked Akshara’s pictures online.", "title": "Akshara Haasan’s Ex Boyfriend Tanuj Virwani Clarifies Of Not Leaking Her Private Pictures Online", "date_publish": "16/11/2018, 18:11:42", "description": "Akshara Haasan was in news few weeks ago due to her private pictures getting leaked online. Reports suggested that Tanuj Virwani son of veteran actress Rati Agnihotri and Akshara’s ex boyfriend had asked Akshara’s to share some of her private pictures when they were in a relationship in 2016. But Tanuj clarifies his stance that he hasn’t leaked any of her pictures online as they are still good fri", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/akshara-haasan-s-ex-boyfriend-tanuj-virwani-clarifies-of-not-leaking-her-private-pictures-online-356822.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/tanuj_and_akshara_1542372767_800x420.jpg"}