{"text": "In the last three years, Akshay Kumar's choice of films has made him one of the most bankable superstars of the country. Not just because he is popular and loved by many, but because he has picked some of the riskiest projects but with the intention of passion on socially relevant messages. Now, that takes a lot of courage because considering how superstars today are made out of 'masala' Bollywood films, preachy films might have royally backfired.\nR.Balki Films\nBut for Akshay, this journey has only been fruitful. Actor Akshay Kumar, who is known for featuring in socially relevant films, feels that there is no point in making documentary films on social issues as most of the time people don't react to those films.\nAgencies\nThe actor featured in Toilet - Ek Prem Katha which talked about the issue of open defecation in India, when asked him what kind of reaction he received after making the film, he said,\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nViacom 18\n\"I personally believe that there is no point making documentary films on social issues. I am sorry to say that but I have seen it often that nobody reacts to documentary films in villages,\" Akshay said while speaking at the panel discussion titled as 'Universal access to sanitation'.\nHe made another strong point on why documentaries fail to pass on the message. He said,\nScreengrab\n\"People like to see commercial and entertaining films so filmmakers should make entertaining films and they should subtlety give their desired message through it. I think I am very lucky because I have the opportunity to do commercial cinema and give them the message in a very different way. I am proud to say that my film ‘Toilet- Ek Prem Katha’ has been shown in every village.”\nThe actor also urged the government to show his another film \"Pad Man\" in villages to create awareness about menstrual hygiene among people.\n\"I would also urge the government to show my another film 'Pad Man' in rural areas because menstrual hygiene is the biggest taboo in our country,\" the actor said.\nAkshay is currently busy with the promotions of science fiction film 2.0 along with megastar Rajinikanth. The film awaits its theatrical release on November 29, 2018.\n(With IANS inputs)", "title": "Akshay Kumar Makes A Strong Point On Why Commercial Films Create More Impact Than Documentaries", "date_publish": "20/11/2018, 11:31:19", "description": "\"I am sorry to say that but I have seen it often that nobody reacts to documentary films in villages,\" Akshay said while speaking at the panel discussion titled as 'Universal access to sanitation' as a brand ambassador of Harpic on World Toilet Day here on Monday.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/akshay-kumar-makes-a-strong-point-on-why-commercial-films-create-more-impact-than-documentaries-356994.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/akshay_kumar_1542693856_800x420.jpg"}