{"text": "Akshay Kumar Felt Ashamed Of Doing Similar Roles, Says Reinventing Himself As An Actor Was Fun\nAkshay Kumar Felt Ashamed Of Doing Similar Roles, Says Reinventing Himself As An Actor Was Fun\nHailed as Khiladi Kumar of Bollywood, for the longest time, Akshay Kumar was considered only an action hero. In the later phase of his career, he showed his versatility by doing some of the memorable comic roles that include Hera Pheri and Garam Masala. In the recent past, he has done films that are socially relevant.\nTwitter\nThis year he is all set to do a historical film titled Kesari which is based on Battle of Saragarhi. Furthermore, he will also star in a Rohit Shetty’s masala entertainer Sooryavanshi. With that, he is also doing a web-series.\nTrying different kinds of roles, Akshay Kumar says he is enjoying reinventing himself.\n“It is not difficult but I would say it is fun. If I am changing my image, it is because I am enjoying it. I don't have to prove anything to anybody. I feel you have to enjoy the work that you do.”\nhungama.com\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES\n“It feels great to do different characters all the time. When I started my career, that time I was doing only action films and nobody used give me roles which involved romance, comedy, tragedy or drama. One fine day, it just broke when I got ‘Hera Pheri' and then, I started doing different kinds of roles,” he added.\ncinestaan.com\nAkshay said that at one point in his career, he felt ashamed for doing similar roles.\n“There was a time in my career when I used to feel ashamed of myself because I was doing similar kind of films which involved action. So once I got opportunity to dabble into various genres, I started enjoying my work. Since the last 12 years, I have got a chance to keep on changing my image as an actor. So, I feel it is not a tough thing for me.”\nTwitter\nAnswering if 2019 is the year of Akshay Kumar, here’s what he said.\n“I have never said something like that. What is move over Khans or anybody? This is an industry for everyone and everybody is there to last. I think to be in this industry and to sustain in this industry is a very big thing, so there is nothing like that. This is all media created and I think it is a nonsensical discussion.”\nAkshay Kumar starrer Kesari, which also stars Parineeti Chopra, is all set for its release on March 21.\nWith inputs from IANS", "title": "Akshay Kumar Felt Ashamed Of Doing Similar Roles, Says Reinventing Himself As An Actor Was Fun", "date_publish": "14/03/2019, 13:59:08", "description": "Hailed as Khiladi Kumar of Bollywood, for the longest time, Akshay Kumar was considered only an action hero. Trying different kinds of roles, Akshay Kumar says he is enjoying reinventing himself. Akshay said that at one point in his career, he felt ashamed for doing similar roles.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-felt-ashamed-of-doing-similar-roles-says-reinventing-himself-as-an-actor-was-fun-363698.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/akshay_kumar_felt_ashamed_for_doing_similar_roles_says_reinventing_himself_as_an_actor_was_fun_1552548577_800x420.jpg"}