{"text": "Akshay Kumar Sums Up 18 Years Of Marriage With Twinkle Khanna With A Hilarious Video Of Her Punching Him\nAkshay Kumar Sums Up 18 Years Of Marriage With Twinkle Khanna With A Hilarious Video Of Her Punching Him\nCalled the power couple of Bollywood, Akshay Kumar and Twinkle Khanna have often given us couple goals. Just like Ryan Reynolds and Blake Lively, they have both been trolling each other, and the proof is all over the social media.\nToday marks the 18th wedding anniversary of Akshay Kumar and Twinkle Khanna, and their anniversary wish for each other has left us all in splits.\nTwitter\nAsk Twinkle Khanna as to what Akshay Kumar gave her this anniversary, and she’ll tell you all things that Akshay Kumar did NOT give her.\nWhat did your husband give you for your anniversary ? Unfortunately he didn’t give me a private jet #18YearChallenge pic.twitter.com/XnEtWT1dbV — Twinkle Khanna (@mrsfunnybones) January 17, 2019\nWhat did your husband give you for your anniversary ? Unfortunately he didn’t give me a date with my childhood crush Rob Lowe #18yearchallenge pic.twitter.com/0bHTmOq6zi — Twinkle Khanna (@mrsfunnybones) January 17, 2019\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nWhat did your husband give you for your anniversary? Unfortunately he didn’t even give me a freshly wrapped Mr Singh just kept all the hugs for himself #18yearchallenge pic.twitter.com/OKvP2UUPGi — Twinkle Khanna (@mrsfunnybones) January 17, 2019\nAfter Twinkle Khanna gave her fans a laughter riot with these tweets, Akshay Kumar also wished her in another hilarious post. Summing up her life after marrying Twinkle Khanna, he shared a throwback vide of her punching him. Take a look!\nWhen you’re a martial arts enthusiast teaching her the moves but She decides to use you as a punching bag instead 😬😂 That’s how 18 years have been...Improvised and full of surprises ❤️ #TheYinToMyYang pic.twitter.com/CVt6NfV8bq — Akshay Kumar (@akshaykumar) January 17, 2019\nCouples who troll each other stay stronger -- Akshay Kumar and Twinkle Khanna have just proved that.", "title": "Akshay Kumar Sums Up 18 Years Of Marriage With Twinkle Khanna With A Hilarious Video Of Her Punching Him", "date_publish": "17/01/2019, 18:07:05", "description": "Called the power couple of Bollywood, Akshay Kumar and Twinkle Khanna have often given us couple goals. Just like Ryan Reynolds and Blake Lively, they have both been trolling each other, and the proof is all over the social media. Today marks the 18th wedding anniversary of Akshay Kumar and Twinkle Khanna, and their anniversary wish for each other has left us all in splits.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-sums-up-18-years-of-marriage-with-twinkle-khanna-with-a-hilarious-video-of-her-punching-him-360604.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/akshay_kumar_sums_up_his_life_after_wedding_with_twinkle_khanna_with_a_hilarious_video_of_her_punchi_1547728689_800x420.png"}