{"text": "Akshay Kumar Doesn't Want To Pressurise His Son Into Entering Films Like Other Star Kids\nAkshay Kumar Doesn't Want To Pressurise His Son Into Entering Films Like Other Star Kids\nAkshay Kumar’s son Aarav is a star in the making. He is as dashing as his father. Whenever Akshay’s son is clicked by the paps, there comes a lot of questions around if he will too make his career in Bollywood like every other star kid.\nTwitter\nRight now, lots of star kids are being launched right from Sara Ali Khan, Ananya Pandey, Ahaan Shetty to Jahnvi Kapoor. We won’t be surprised if after a few years Akshay's son too will be making his debut. But right now, his father has no thoughts of pressuring his Aarav.\nTwitter\nIndiatimes in a interaction with Akshay asked him about his son’s interest in Bollywood, he said,\n“He is just 16 years old, I would like to let him live his life rather than put pressure on him and ask whether he is interested in films. I am not that kind of a father, I will let him live, he is right now interested to be with his friends, enjoy life and study. Like every youngster, he is very much interested in technology, so I think I will let him live”.\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nAkshay was also asked what the tough part to be a father is, “Being a father is not a part you play, if you are a father, you are a father. I just enjoy being a father and happy with my life”.\nOn the professional front, Akshay’s next film is 2.0 along with Rajnikanth where he will be playing a villain.", "title": "Akshay Kumar Doesn't Want To Pressurise His Son Into Entering Films Like Other Star Kids", "date_publish": "27/11/2018, 15:37:16", "description": "Akshay Kumar’s son Aarav is a star in the making. He is as dashing as his father. Whenever Akshay’s son is clicked by the papa, there come s a lot of questions around will be too make his career in Bollywood like every star kid. Right now lots of star kids are being launched right from Sara Ali Khan, Ananya Pandey, Ahan Shetty to Jahnvi Kapoor. We won’t be surprised if after a few years Akshay so", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-doesn-t-want-to-pressurise-his-son-into-entering-films-like-other-star-kids-357475.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aarav_bhatia_1543314302_800x420.jpg"}