{"text": "Akshay Kumar Is All Set To Star In 'Mission Mangal', India's First Space Film Based On Mars Mission\nAkshay Kumar Is All Set To Star In 'Mission Mangal', India's First Space Film Based On Mars Mission\nKnown for lending support to social causes through his films, Akshay Kumar is now all set to star in what is touted as India’s first space film. Once again collaborating with R Balki after Padman, Akshay Kumar will star in Mission Mangal, a film based on India’s Mars Mission.\nThis film will be a joint production between Fox Star Studios and Akshay's home production Cape Of Good Films.\nPTI\nBoth Fox Star Studios and Cape of Good Films will collaborate for two other distinct entertainers which will have Akshay in the lead, a statement issued by Fox Star read. The actor is set to reunite with his Padman director who will co-produce the film.\nMission Mangal will be directed by Jagan Shakti. Akshay said he is delighted to collaborate with Fox Star Studios. He said he is looking forward to deliver meaningful and entertaining cinematic experience to the audience.\nTwitter\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\n\"With our combined energies we hope to create content that not only excites but also empowers,\" the actor said in a statement.\nCiting example of their last collaboration, Jolly LLB 2 that turned to be one of the biggest hits of 2017, Vijay Singh, CEO, Fox Star Studios, said he is happy to partner with Akshay for a three-film deal.\n\"Akshay is one of the most successful actors who has a fantastic understanding of scripts and changing audience preferences. We are looking forward to an unprecedented collaboration with the National Award-winning actor,\" Singh said.\nAmar Butala, Chief Acquisition Officer, Fox Star Studios, said, \"Akshay has played an immensely valuable role in creating and fronting stories that have not only enthralled the audience but have also inspired change and we hope to bolster that with this partnership.\"\nThe shoot for Mission Mangal commences in mid-November.\nWith inputs from PTI", "title": "Akshay Kumar Is All Set To Star In 'Mission Mangal', India's First Space Film Based On Mars Mission", "date_publish": "05/11/2018, 14:29:18", "description": "Akshay Kumar's next will be \"Mission Mangal\", which is being touted as India's first space film. This film will be a joint production between Fox Star Studios and Akshay's home production Cape Of Good Films. Both Fox Star Studios and Cape of Good Films will collaborate for two other distinct entertainers which will have Akshay in the lead, a statement issued by Fox Star read.", "authors": [], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-is-all-set-to-star-in-mission-mangal-india-s-first-space-film-based-on-mars-mission-356080.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/akshay_kumar_1541407372_800x420.jpg"}