{"text": "“Kaabil Bano, Kamyabi Jhak Maar Ke Piche Aayegi”\nMarks aren’t everything in life. There’s so much more to do than just worry about numbers. Not everyone who was a topper is doing well in life, and not everyone who scored less is a failure. If you work hard and follow your passion, sooner or later you will emerge as a winner.\nin.com\nAkshay Kumar not only agrees with this but is a living example showing us all that your dreams can come true. The Khiladi Kumar recently revealed that he wasn’t good in academics, but with his hard work and the blessing of his parents, he managed pretty well.\nTwitter\n“I was never good at academics but with god's grace, my parents blessings and hard work, I think I managed pretty well. With exams around the corner, I would like to reiterate to students and parents, there is more to life than just exams,” he says.\nYouTube\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nEveryone possesses a different talent. Discover it, excel in it and then sky is the limit.", "title": "Akshay Kumar Believes There’s More To Life Than Exams, Shares He Wasn’t Good At Academics", "date_publish": "31/01/2019, 16:10:06", "description": "Akshay Kumar recently revealed that he wasn’t good in academics, but with his hard work and the blessing of his parents, he managed pretty well. Marks aren’t everything in life. There’s so much more to do. Not everyone who was a topper is doing well in life, and not everyone who scored less is a failure. If you work hard and follow your passion, you would emerge a winner, they say.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-believes-there-s-more-to-life-than-exams-shares-he-wasn-t-good-at-academics-361368.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/theres_more_to_life_than_exams_says_akshay_kumar_as_he_shares_he_wasnt_good_at_academics_1548930157_800x420.jpg"}