{"text": "Akshay & Katrina Team Up For Sooryavashi, Bharat Memes Take Over The Internet And More From Ent\nAkshay & Katrina Team Up For Sooryavashi, Bharat Memes Take Over The Internet And More From Ent\n1. After 9 Years, Akshay Kumar & Katrina Kaif Are Back With Their Irresistible Chemistry In Rohit Shetty’s Sooryavashi\nAkshay Kumar and Katrina Kaif simply are one of the hit onscreen couples of the 2000s. There have been fireworks on the big screen each time they have come together. From films like Singh Is Kinng, Humko Deewana Kar Gaye to Namaste London, Tees Maar Khan, Welcome and De Dana Dan, each time the duo has appeared, they have created magic.\n2. Trailer Of Salman Khan’s Bharat Is Out & It Has Already Sent The Internet On A Trolling Spree!\nFrom a motorcycle stuntman to an oil-mining employee, from fighting off pirates as a navy officer to saving co-workers from blasts dust storms and locating missing immigrants from across the border, Salman's character journey’s through 71 years of Indian history.\n3. Little Girl No More! Maisie Williams Had A Hilarious Reaction To Arya Losing Her Virginity To Gendry\nDon't Miss 174 SHARES 122 SHARES 814 SHARES\nBefore the Great War could begun, while some spent the night drinking together, Arya Stark wanted to apparently lose her virginity before the battle with the army of dead begins the next morning. “We’re probably going to die tomorrow, I want to know what this feels like before that happen,” she says.\n4. Ranveer Singh And Deepika Padukone Were Spotted At A Wedding In Mumbai & Their Chemistry Was Crackling As Always\nRanveer Singh and Deepika Padukone were spotted at a wedding in Mumbai recently. The pictures of the elegant and much-in-love couple since then have been going viral on social media.\n5. Rape Accused Alok Nath’s Film 'Main Bhi' Stands Unreleased As Distributors Deny To Buy It\nAmid all of this, Alok Nath’s next film Main Bhi is facing a tough time. The movie stands unreleased as many distributors have rejected the film after knowing Alok Nath’s association with it.", "title": "Akshay & Katrina Team Up For Sooryavashi, Bharat Memes Take Over The Internet And More From Ent", "date_publish": "22/04/2019, 18:26:55", "description": "From Akshay Kumar and Katrina Kaif teaming up for Rohit Shetty’s Sooryavashi to Salman Khan starrer Bharat’s trailer giving rise to memes, here is all that rocked the world of entertainment. Game Of Thrones season 8 episode two was perhaps the last one where we saw everyone alive and together. Winter is soon coming for everyone, and they’re all prepared to die.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/akshay-katrina-team-up-for-sooryavashi-bharat-memes-take-over-the-internet-and-more-from-ent-365900.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/akshay__katrina_team_up_for_sooryavashi_bharat_memes_take_over_internet_and_more_from_ent_1555933673_800x420.png"}