{"text": "Akshay Kumar is one actor who takes up films with some of the most relevant social issues. Be it Padman or Toilet Ek Prem Katha, all his films have highlighted issues that were needed to be highlighted.\nActor Akshay Kumar, who started an open conversation on menstrual hygiene with his film “PadMan”, says he is proud to see how talks have transformed into a grassroot-level movement. The actor invited all ‘Pad Heroes’ across India to join him and the Niine Movement for a nationwide running event Run4Niine on March 8, which is observed as International Women’s Day.\nTwitter\n“It has already been more than a year since the release of ‘PadMan’, and I am proud to see how it has evolved into a phenomenal grassroot-level movement,” Akshay said in a statement.\nHe is proud to partner with the Niine Movement again to encourage an open and unashamed discussion on menstruation with fellow citizens, pad heroes, change makers and path breakers.\nTwitter\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\n“Each one of us that takes part in it helps to create an unstoppable force that will beat the stigma around periods,” added the actor.\nThe initiative has been taken with the aim to set a record as India’s largest nationwide run for menstrual hygiene awareness.\n(With IANS inputs)", "title": "Akshay Kumar Feels Proud That Awareness On Menstruation Has Evolved Into A Movement", "date_publish": "19/02/2019, 17:32:04", "description": "Actor Akshay Kumar, who started an open conversation on menstrual hygiene with his film “PadMan”, says he is proud to see how talks have transformed into a grassroot-level movement. The actor invited all ‘Pad Heroes’ across India to join him and the Niine Movement for a nationwide running event Run4Niine on March 8, which is observed as International Women’s Day.", "authors": [], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-feels-proud-that-awareness-on-menstruation-has-evolved-into-a-movement-362436.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/akshay_kumar_pad_man_1550577877_800x420.jpg"}