{"text": "youtube/screengrab\nUri The Surgical Strike, which has minted over 200 crores already, has the IMDb rating of 8.6. The movie is behind Amitabh Bachchan starrer 1971 classic Anand, which is at the first spot.\n“Happy to see a turnout of 2000 plus girls from nearby schools at our self defense training camp in Thane today. The workshop was to teach them some basic self defense techniques. Hoping it was helpful and to see more of them at our training centre.”\nIt is at the event that Deepika spilled quite a lot of secrets about Ranveer Singh. In one of the videos doing the rounds, she can be seen saying, “He takes longer in the shower, longer in the loo, longer to get ready, longer to get into bed...”. At this the audiences erupted in laughter, to which she clarified, “I said longer to get into bed.”\nDon't Miss 862 SHARES 346 SHARES\nNot only aam janta but celebrities are also raving about the performances in the film. And that does not include Ranveer Singh and Alia Bhatt but Siddhant Chaturvedi, Vijay Raaz and Vijay Varma.\nBut there's another boy who is ruling everyone’s heart, he is none other than apna MC Sher aka Siddhant Chaturvedi. This boy left us swooning with his brilliant performance in Gully Boy. In fact, he has become a national crush and it's not even surprising.", "title": "Akshay Kumar Teaches Girls Self Defence, Uri Bags 2nd Spot On IMDb's Top Films & More From Ent.", "date_publish": "21/02/2019, 18:27:01", "description": "Akshay Kumar Teaches Girls Self Defence, Uri Bags 2nd Spot On IMDb's Top Films & More From Ent.Akshay Kumar Teaches Girls Self Defence, Uri Bags 2nd Spot On IMDb's Top Films & More From Ent.Akshay Kumar Teaches Girls Self Defence, Uri Bags 2nd Spot On IMDb's Top Films & More From Ent.Akshay Kumar Teaches Girls Self Defence, Uri Bags 2nd Spot On IMDb's Top Films & More From Ent.Akshay Kumar Teaches", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/akshay-kumar-teaches-girls-self-defence-uri-bags-2nd-spot-on-imdb-s-top-films-more-from-ent-362574.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1550754574_800x420.jpg"}