{"text": "1. Akshay Kumar Sums Up 18 Years Of Marriage With Twinkle Khanna With A Hilarious Video Of Her Punching Him\nCalled the power couple of Bollywood, Akshay Kumar and Twinkle Khanna have often given us couple goals. Just like Ryan Reynolds and Blake Lively, they have both been trolling each other, and the proof is all over the social media. Today marks the 18th wedding anniversary of Akshay Kumar and Twinkle Khanna, and their anniversary wish for each other has left us all in splits.\n2. From Doing Couple Yoga To Playing Guitar, Sushmita Sen & Rohman ShawlPaint The Town Red With Their Love-Filled Posts\nWith all the PDA and mushy posts, she is giving us all a glimpse into her love life too. We know couple goals is an overused term but looking at their love-filled posts, you’ll sure agree how Sushmita Sen and Rohman Shawl are setting the relationship goals right.\n3. Happy Birthday, Javed Akhtar! These 9 Powerful Lines From The Legend Will Stir Your Soul\nDon't Miss 343 SHARES 174 SHARES 122 SHARES\nAs Javed Akhtar turned 74 today, here's taking a look at 7 powerful lines from the legend, that we guarantee, will stir up your soul.\n4. Hazel Keech Takes #10YearChallenge, Admits She Had Depression And Would Starve Herself\nHowever, Hazel Keech took this challenge to narrate a different story altogether. Through her post, she revealed how she has been battling depression and bulimia (an eating disorder). She calls it a #personalcelebration.\n5. After Taking Internet By Storm, #10YearChallenge Gets A Hilarious Twist & It’ll Crack You Up\nDo you also feel like not much has changed in all these years? If you look at your pictures from the past, you’ll realise there has been a significant change. That’s what the challenge is all about -- 2009 VS 2019. Our social media feeds are flooded with side-by-side photos of nostalgic throwback pictures. Celebrities have joined the bandwagon too.", "title": "Akshay-Twinkle Celebrate 18th Anniversary, Sushmita-Rohman Give Us Couple Goals & More From Ent", "date_publish": "17/01/2019, 18:42:39", "description": "From Akshay Kumar and Twinkle Khanna celebrating their 18th wedding anniversary by trolling each other on social media to Sushmita Sen and Rohman Shawl painting the town red with their love-filled posts on Instagram, here’s all that rocked the world of Bollywood and entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/akshay-twinkle-celebrate-18th-anniversary-sushmita-rohman-give-us-couple-goals-more-from-ent-360609.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/akshaytwinkle_celebrate_18th_anniversary_sushmitarohman_give_us_couple_goals__more_from_ent_1547730843_800x420.png"}