{"text": "A Special Investigation Team (SIT) has summoned actor Akshay Kumar, former Punjab chief minister Parkash Singh Badal and former deputy chief minister Sukhbir Singh Badal in the wake of 2015 Punjab Sacrilege Case.\n..While former chief minister Parkash Singh Badal has been asked to appear before SIT on November 16, former deputy chief minister Sukhbir Singh Badal has been summoned on November 19 and Akshay Kumar has been asked to come on November 21, at the Circuit House in Amritsar...(2/2) — Government of Punjab (@PunjabGovtIndia) November 11, 2018\nAkshay Kumar has, however, denied involvement in the case.\nWhile Parkash has been asked to appear before the SIT of Punjab Police on November 16, Sukhbir has been summoned on November 19 and Akshay has been asked to come on November 21 to the Circuit House in Amritsar.\nThe summon orders have been issued separately for the three by SIT member and IG rank officer Kunwar Vijay Pratap Singh, according to an official release issued here.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe SIT is probing police firing incidents at Kotkapura and Behbal Kalan in Faridkot in 2015 after a series of sacrilege incidents in the state. In police firing at Behbal Kalan, two persons were killed.\nNotably, the actor's name was mentioned in Justice Ranjit Singh Commission report on sacrilege incidents. According to the report, a meeting between former deputy chief minister Sukhbir and Dera Sacha Sauda sect head Gurmeet Ram Rahim Singh in connection with the release of latter's movie 'MSG' was held at Akshay's flat in Mumbai.\nThe meeting was held before the pardon given to Gurmeet Ram Rahim Singh in a blasphemy case. However, Akshay had denied all the claims. Kunwar Singh said the summons relate to investigation of cases originating from the various incidents of sacrilege in the year 2015.\ntwitter\nThe summons have been issued under Section 160 of the CrPC, requiring attendance at investigation, relating to the Bargari sacrilege case and the Behbal Kalan and Kotkapura police firing incidents, the release said.\nThe notice says the presence of the aforesaid person is necessary for the purpose of inquiry into the above-mentioned offence and the person summoned needed to give such information relating to the said alleged offence as he may possess.\nThe SIT had earlier examined ADGP Jitendra Jain, then IG Bathinda; IGP Paramraj Singh Umaranangal; then Commissioner Ludhiana; IGP Amar Singh Chahal, then DIG Ferozepur Range; MS Jaggi, then DC Faridkot; SS Mann, then SSP Faridkot; VK Syal then SDM Faridkot, besides Mantar Singh Brar, then Kotkapura MLA.\nIn addition, 50 private persons and more than 30 police officials of junior rank have also been examined.\nThe five-member SIT was set up by the state government in September this year, soon after issuance of the notification to withdraw investigation of sacrilege incidents of the Guru Granth Sahib from the CBI.\nWith inputs from PTI", "title": "Akshay Kumar, Parkash & Sukhbir Singh Badal Get Summoned By SIT In 2015 Punjab Sacrilege Case", "date_publish": "12/11/2018, 13:52:23", "description": "A Special Investigation Team (SIT) has summoned actor Akshay Kumar, former Punjab chief minister Parkash Singh Badal and former deputy chief minister Sukhbir Singh Badal in the wake of 2015 Punjab Sacrilege Case. The Special Investigation Team (SIT), probing police firing incidents at Behbal Kalan on sacrilege issue, has summoned former chief minister Parkash Singh Badal, his son Sukhbir Singh Bad", "authors": [], "url": "https://www.indiatimes.com/entertainment/akshay-kumar-parkash-sukhbir-singh-badal-get-summoned-by-sit-in-2015-punjab-sacrilege-case-356494.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sacrilege_incidents_1542009031_800x420.jpg"}