{"text": "Alia Bhatt Is Excited For Priyanka Chopra-Nick Jonas’ Marriage, Can’t Wait To See Her In The Wedding Attire\nAlia Bhatt Is Excited For Priyanka Chopra-Nick Jonas’ Marriage, Can’t Wait To See Her In The Wedding Attire\nAre we over the adorable couple that Deepika Padukone and Ranveer Singh make? They are truly, deeply and madly in love, and now they are man and wife too.\nAfter DeepVeer, as Deepika and Ranveer are fondly called by their fans, it’s time for Priyanka Chopra and Nick Jonas’ wedding, which will take place in Jodhpur, as PC’s mother Madhu Chopra had confirmed.\nAlso Read: With Smile On Faces & Happiness In Their Hearts, Ranveer & Deepika Land In India As A Married Couple\nThe wedding will take place in Umaid Bhawan Palace of Jodhpur, and Priyanka Chopra’s mother Madhu Chopra has confirmed the same.\n“Mera bahut pasandida shehar hai. Saari duniya chhodkar hum yahaan aaye hain (This is one of my favourite cities. We have chosen this city over the whole world),” she told paps while she was keeping a check on the wedding preparations there.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 1 K SHARES\nIf reports are to be believed Priyanka Chopra and Nick Jonas will tie the knot on Dec 2. And just like PC’s fans, Alia Bhatt is also excited. So much so, that she just cannot wait to see her in the wedding attire, she says:\n“I am very happy and excited about the wedding. I am also very eager to see Priyanka in her wedding attire,” she was quoted as saying by ANI.\nWhat’s more? She also talked about her own wedding. Alia, who is dating Ranbir Kapoor, was asked as to when the wedding bells will ring for her, to which, here’s what she said.\nTwitter\n“You'll have to wait for that to happen! It will take time,” she said.\nAlso Read: With Smile On Faces & Happiness In Their Hearts, Ranveer & Deepika Land In India As A Married Couple", "title": "Alia Bhatt Is Excited For Priyanka Chopra-Nick Jonas’ Marriage, Can’t Wait To See Her In The Wedding Attire", "date_publish": "19/11/2018, 16:55:29", "description": "After Deepika Padukone and Ranveer Singh's wedding, it is time for Priyanka Chopra and Nick Jonas' marriage.The preparations have already begun at Umaid Bhawan Palace of Jodhpur. Alia Bhatt is excited for the wedding. So much so, that she cannot wait to see Priyanka Chopra in the wedding attire.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/alia-bhatt-is-excited-for-priyanka-chopra-nick-jonas-marriage-can-t-wait-to-see-her-in-the-wedding-attire-356958.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/alia_bhatt_says_she_is_excited_for_priyanka_chopra_and_nick_jonas_wedding_1542620101_800x420.png"}