{"text": "Alia Bhatt Has The Funniest Take On All The 'Roka Rumours' With Ranbir Kapoor!\nAlia Bhatt Has The Funniest Take On All The 'Roka Rumours' With Ranbir Kapoor!\nA lot of couples in Bollywood might take the plunge this year. Rumours are at an all-time high for couples including Shibani Dandekar-Farhan Akhtar, Malaika Arora-Arjun Kapoor and Alia Bhatt-Ranbir Kapoor. These lovebirds land on our Instagram and Facebook profiles every now and then, thanks to the increasing pop and paparazzi culture in India.\nIf we talk about Ranbir Kapoor and Alia Bhatt, some strong rumours have suggested that the couple is already engaged and the Roka happened at the Ambani pre-wedding bash in Switzerland.\nThere have been no concrete facts to support the news though but in a recent interview with Filmfare, Alia Bhatt had a lot to say about the rumoured roka and impending reported wedding in 2020.\nDon't Miss 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES\nReacting to the buzz for once and for all, Alia said,\n“The only ‘Roka I’m going to is the restaurant in London. There’s no roka happening for me. And why are you putting a year to my marriage?”\nWell, she might be the youngest actress but her wit and charm are always on point! For all those who are still waiting to see them get hitched, maybe you'll have to wait for a little longer. Ranbir Kapoor and Alia Bhatt started dating after cupid stuck for them on the sets of their upcoming film Bhramastra. The film is scheduled to release in December.", "title": "Alia Bhatt Has The Funniest Take On All The 'Roka Rumours' With Ranbir Kapoor!", "date_publish": "05/04/2019, 18:41:50", "description": "If we talk about Ranbir Kapoor and Alia Bhatt, some strong rumours have suggested that the couple is already engaged and the Roka happened at the Ambani pre-wedding bash in Switzerland. There have been no concrete facts to support the rumors but in a recent interview with Filmfare, Alia Bhatt had a lot to say about the rumored roka and impending 'rumored' wedding in 2020.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-bhatt-has-the-funniest-take-on-all-the-roka-rumours-with-ranbir-kapoor-364960.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/alia_and_ranbir_1554470939_800x420.jpg"}