{"text": "The #MeToo movement arrived in India a little late but one thing is for sure that it is not dying anytime soon. A lot of powerful women have finally named the sexual predators who harassed them in the past or the present. They are braving the storm by sharing these stories, and at the same time, they are encouraging others to talk about what they have gone through too. After all, it was Tanushree Dutta who paved a way for this in the first place by opening about her own ordeal.\nTOI\nAlia Bhatt’s mother, Soni Razdan, also opened up on the ongoing #MeToo moment and revealed that “somebody tried to rape” her years ago. She didn’t name the person only because she thought it would cause trouble to him and his family, she told The Quint.\nmystarzone.com\nFurthermore, talking to IANS, she added that #MeToo a positive change against sexual harassment.\n“Living in a patriarchal society I know that such thing is horrifying for any girl and that is why the movement is a positive sign, where people are coming up with their stories. It is easy to say that if such harassment happens, walk out of your job. But people depend on that job, it is about their livelihood, a question of survival. So while we must encourage victims for coming up with their #MeToo stories, we should not judge women for not sharing their stories,” she said.\nfreepressjournal.in\nDon't Miss 1.4 K SHARES 3.9 K SHARES 336 SHARES 6.8 K SHARES 7.8 K SHARES\nWhen asked if sexual harassment happens at workplace, she said, “When someone is humiliating and harassing a woman, he must be knowing that the victim is needy and left with no option but to tolerate such harassment to save the job. It is about livelihood. Every company should have zero tolerance on sexual harassment so that victims feel secure while taking a stand.”\nAlso Read: CID Is Going Off Air After 21 Years & These 15 Memes Will Make You Laugh & Cry At The Same Time", "title": "Alia’s Mother Soni Razdan Shares Her Take On #MeToo, Recounts How ‘Somebody Tried To Rape’ Her", "date_publish": "24/10/2018, 14:54:36", "description": "Alia Bhatt’s mother, Soni Razdan, also opened up on the ongoing #MeToo moment and revealed that “somebody tried to rape” her years ago. She didn’t name the person but because she thought it would cause trouble to him and his family. Furthermore, talking to IANS, she added that #MeToo a positive change against sexual harassment.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/alia-s-mother-soni-razdan-shares-her-take-on-metoo-recounts-how-somebody-tried-to-rape-her-355356.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/alia_bhatts_mother_soni_razdan_talks_on_metoo_recalls_the_time_somebody_tried_to_rape_her_1540371313_800x420.jpg"}