{"text": "1. From Adorable Wishes To Cutting Fancy Cakes, Alia Bhatt's Birthday Party Was All Things Love!\nAlia Bhatt has turned 26 today and she is celebrating her day with her loved ones which includes her beau Ranbir Kapoor. Last night Bhatt’s close friends and family hosted a small surprise birthday party for her at her residence. Take a look at the inside pictures and videos from the celebration right here.\n2. PM Narendra Modi’s Biopic To Release On April 12, One Day After First Phase Lok Sabha Elections\nWhen Prime Minister Modi’s biopic was announced with a poster that had Vivek Oberoi in the titular role, it made a lot of waves on social media. Produced by Sandip Ssingh, Anand Pandit and Suresh Oberoi, Omung Kumar’s film that will chronicle the life of Prime Minister Narendra Modi will be released on April 12.\n3. From Amitabh Bachchan To Sachin Tendulkar, Celebs Condole Loss Of Lives In Mumbai Bridge Collapse\nDon't Miss 336 SHARES 174 SHARES 122 SHARES\nSix months after the bridge was declared ‘fit to use’ after structural audit, Mumbai’s CST foot overbridge near the bustling Chhatrapati Shivaji Maharaj Terminus (CMST) railway station collapsed taking the lives of at least six people and injuring more than 30 people.\nAs the Thunder calls for his axe, the weapon flies past Captain Marvel’s head, but she didn’t even flinch. “I like this one,” he tells Black Widow post that. Thor’s reaction is so endearing, isn’t it? Fans cannot stop gushing. They want more of their two favourite superheroes. 5. SRK Opts Out Of Rakesh Sharma Biopic, Writer Anjum Rajapali Says He’s ‘Shaken Up’ After Zero's Failure!\n5. SRK Opts Out Of Rakesh Sharma Biopic, Writer Anjum Rajapali Says He’s ‘Shaken Up’ After Zero's Failure!\nRubbishing the rumours that SRK walked out of the film because he didn’t want to do another space film after Zero, he said, “If you're asking me, there was a problem with the script (of 'Zero'). Himanshu (Sharma, the writer) is a very talented person but things go wrong sometimes. I don't think he said no to 'Saare Jahan Se Achcha' because of the space (angle). I think he's also pretty shaken up, he was banking a lot on that,\" Anjum said while moderating a panel discussion 'Screenwriters: The Creative Force Powering Indian Cinema's New Surge'.”", "title": "Alia Bhatt Turns 26, PM Narendra Modi’s Biopic To Release On April 12 & More From Entertainment", "date_publish": "15/03/2019, 18:14:08", "description": "From Alia Bhatt's 26th birthday to the announcement of PM Narendra Modi's biopic's release date, here's all that rocked the world of entertainment. She entered the world of cinema as the 'student of the year' but the tag of being Mahesh Bhatt's daughter constantly questioned her talent and credibility as an actor. SOTY released but she didn't become critics' favorite debutante that year.", "authors": [], "url": "https://www.indiatimes.com/entertainment/alia-bhatt-turns-26-pm-narendra-modi-s-biopic-to-release-on-april-12-more-from-entertainment-363790.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_turns_26_pm_narendra_modis_biopic_to_release_on_april_12__more_from_entertainment_1552651801_800x420.png"}