{"text": "Depression, anxiety and mental illness are a real thing. It’s like any other medical illness. Many people think that they are merely sad or there are just over-thinking. But sometimes, it could be a serious condition that needs your attention.\nYouTube\nAlia Bhatt who played the role of girl who is discontented with her life and meets a free-spirited psychologist who helps her to gain a new perspective on her life, recently admitted that she is getting bouts of anxiety in real life as well. She earlier thought it was work-pressure, but speaking to her friends made it easier for her not to evade reality.\nTwitter\n“I haven’t been depressed but I’ve had bouts of anxiety. It comes and goes. It’s been happening quite a bit since the past five to six months. It’s not like an anxiety attack but I just feel low,” she told Filmfare.\nTwitter\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 12.5 K SHARES 5.5 K SHARES\nAlia Bhatt seems to be having it all – a great career, a loving partner and also a huge fan following, but she says she is suffering from anxiety too. Talking about how she deals with it, here’s what she said.\nYouTube\n“No matter how bad it is, I just let myself feel it. Sometimes, I feel like crying for no reason. Then it passes. Initially, I’d be a little confused. I’d constantly give reasons that it’s because of work or maybe I’m tired or haven’t been able to meet anyone... The kind of personality I have, I become a little on the edge. I spoke to friends about it. I spoke to Ayan (Mukerji, director) about it, I spoke to my sister’s friend Rohan (Joshi). Everyone told me that you’ve got to realise that it will go away. What’s important is to accept it and not say that you’re fine. If you’re not feeling fine, then you should just say you’re not feeling fine.”\nInstagram\nFor the unversed, Alia Bhatt’s sister Shaheen Bhatt has fought depression. She even wrote a book titled ‘I've Never Been (un)Happier’ in which she shared her experience of coming out of it. She even expressed how she was on the verge of committing suicide.", "title": "Alia Bhatt Admits To Battling Bouts Of Anxiety, Says She Feels Like Crying For No Reason", "date_publish": "29/03/2019, 18:13:32", "description": "Alia Bhatt who played the role of girl who is discontented with her life and meets a free-spirited psychologist who helps her to gain a new perspective on her life, recently admitted that she is having bouts of anxiety in real life as well. She earlier thought it was work-pressure, but speaking to her friends made it easier for her not to evade reality.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/alia-bhatt-admits-to-battling-bouts-of-anxiety-says-she-feels-like-crying-for-no-reason-364552.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_admits_to_having_bouts_of_anxiety_says_she_feels_like_crying_for_no_reason_1553861854_800x420.jpg"}