{"text": "Alia Bhatt Ends The Nepotism Debate With This Sensible Answer, Says ‘Can’t Be Sorry For Being Born In This Family'\nAlia Bhatt Ends The Nepotism Debate With This Sensible Answer, Says ‘Can’t Be Sorry For Being Born In This Family'\nThe Nepotism debate was flagged by Bollywood queen Kangana Ranaut and it has not ended yet.\nTwitter\nHowever Alia Bhatt’s sensible take on it might rest the debate once for and all.\nShe was asked about the ongoing nepotism debate once again to which she replied, “Nepotism exists in every field. My thoughts on nepotism don't come from a negative place. If you know somebody from a certain field you will always help them.”\nTwitter\nShe even said that just because one is a star kid one cannot be lucky every time,\n“As I said, there are no negative thoughts. I can't wake up and say sorry for being born in this family. But I can definitely say that I will work as hard as possible to prove that I deserve to be here.” The actress even confessed, \"But having said that, I am so in love with acting and being an actor, I would be devastated if I never got the opportunity.\"\nTwitter\nClearly, Alia has won hearts with this reply. For quite a few days there have been many attacks from Kangana on Alia, but the latter chose to be calm and replied with her class.\nDon't Miss 126 SHARES 336 SHARES 247 SHARES 699 SHARES", "title": "Alia Bhatt Ends The Nepotism Debate With This Sensible Answer, Says ‘Can’t Be Sorry For Being Born In This Family'", "date_publish": "08/03/2019, 13:14:08", "description": "Nepotism debate was flagged by the Bollywood queen Kangana Ranaut and it has been ended yet. But today Alia Bhatt’s this sensible reply on it might rest the debate once for and all. Alia who is one of the most gifted and talented actress is also a nepotism product but today she has emerged more than her surname with her powerhouse talent.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/alia-bhatt-ends-the-nepotism-debate-with-this-sensible-answer-says-can-t-be-sorry-for-being-born-in-this-family-363373.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_1552031927_800x420.jpg"}