{"text": "Alia And Ranbir Resume Shooting For Brahmastra, DeepVeer To Host A Grand Wedding Reception In Mumbai And More From Ent\nAlia And Ranbir Resume Shooting For Brahmastra, DeepVeer To Host A Grand Wedding Reception In Mumbai And More From Ent\nViral Bhayani\nAfter celebrating and enjoying Diwali festivities, B-town is now back to the normal grind. Most of them have resumed their work. Lovebirds and Bollywood's hottest couple Ranbir and Alia have resumed preps for their upcoming film Brahmastra.\nTwitter\nAfter their wedding, DeepVeer will be hosting two receptions, one in Bangalore and one in Mumbai. Their Mumbai reception date is out and it’s on December 1, 2018. This reception will be nothing but GRAND. Bollywood biggies will be invited for Bajirao Mastani’s reception. This reception will definitely be one grand and memorable affair.\nTwitter\nDon't Miss 3.5 K SHARES 336 SHARES 247 SHARES\nJust like many others who outraged over Virat Kohli's 'Leave India' comment to a fan, Indian actor Siddharth too has reacted. Just to jog your memory a little, Kohli asked a fan to 'leave India' after he said he likes watching English and Australian batsmen more than the Indians.\nThe entire Bollywood too celebrated Diwali with their loved ones and shared the pictures on social media. Amitabh Bachchan too shared happy family pictures celebrating Diwali. But the celebration pictures didn’t go down well with his fans due to firecrackers in Bachchan’s hand. Well, if you see the picture closely, AB is lighting a fuljadi which also creates pollution and it could have been avoided.\nIf that name rings any bells, it’s because this is the story of Sivagami, the mother of Bhalladeva, the antagonist in the blockbuster Baahubali movies. Now Netflix is bringing Baahubali: Before the Beginning set several years before the events in Baahubali to a screen near you.\nDie-hard fans may be disappointed that the series will not have Rana Daggubati, Prabhas or most of the other heavy-weights. But here are 11 facts that will make you want to watch this show.", "title": "Alia And Ranbir Resume Shooting For Brahmastra, DeepVeer To Host A Grand Wedding Reception In Mumbai And More From Ent", "date_publish": "09/11/2018, 17:40:33", "description": "Just like many others who outraged over Virat Kohli's 'Leave India' comment to a fan, Indian actor Siddharth too has reacted. Just to jog your memory a little, Kohli asked a fan to 'leave India' after he said he likes watching English and Australian batsmen more than the Indians.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/alia-and-ranbir-resume-shooting-for-brahmastra-deepveer-to-host-a-grand-wedding-reception-in-mumbai-and-more-from-ent-356369.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranbir_1541765766_800x420.jpg"}