{"text": "Alia Bhatt’s Audition Video For 'Student Of The Year' Proves She Was Born To Conquer Bollywood!\nAlia Bhatt’s Audition Video For 'Student Of The Year' Proves She Was Born To Conquer Bollywood!\nAt the age of 17 years, she auditioned for her debut film – Karan Johar’s Student Of The Year. Who would have known the diva, with her first film itself, steal the hearts of millions! From Disco Deewane to Radha Teri Chunri, the new girl with an innocent face, struck a chord with the youth of the nation.\nvia GIPHY\nShe is a product of nepotism which is why she bagged a big budget film at the very start of her career. However, in her journey post that, Alia Bhatt has remarkably worked on her acting skills and proved her mettle in the industry.\nvia GIPHY\nWith films like Highway, 2 States, Dear Zindagi, Raazi and recently released Gully Boy, she has done various kinds of roles and stood out in each one of them.\nvia GIPHY\nShe is just 26 years old, but she has made a mark in the industry already. She is an inspiration to many. But have you ever wondered how she landed her first role?\nvia GIPHY\nAt the age of 17, Alia Bhatt gave her first audition for Student Of The Year. Interestingly, she had to say lines from film Wake Up Sid, that starred her now boyfriend Ranbir Kapoor. Take a look!\nShe also danced to Sonam Kapoor’s song from I Hate Luv Stories called Bahara.\nConsidering her age, she has achieved a lot already. Don’t you all agree? Happy Birthday, Alia Bhatt!\nDon't Miss 357 SHARES 1.1 K SHARES 336 SHARES 207 SHARES 247 SHARES", "title": "Alia Bhatt’s Audition Video For 'Student Of The Year' Proves She Was Born To Conquer Bollywood!", "date_publish": "15/03/2019, 11:52:35", "description": "Alia Bhatt audition tape for her debut film Student Of The Year is going viral on her 26th birthday. is a product of nepotism, sure. That’s why she bagged a big budget film at the very start of her career. However, in her journey post that, Alia Bhatt has remarkably worked on her acting skills and proved her mettle in the industry.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/alia-bhatt-s-audition-video-for-student-of-the-year-proves-she-was-born-to-conquer-bollywood-363752.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/on_alia_bhatts_26th_birthday_her_first_audition_tape_for_student_of_the_year_goes_viral_1552629081_800x420.png"}