{"text": "Kangana Ranaut has had issues with Alia Bhatt and it isn't new to any of us. Not sure how and when the animosity brew but Kangana has been targeting Bhatt since a long time now. A few months ago, she had alleged that the Raazi star didn’t reciprocate her gesture and help promote Manikarnika: The Queen of Jhansi.\nShe went on to calling Alia a puppet of producer Karan Johar and urged her to ‘to grow a spine’.\nAnd just few days ago, in an interview to Bollywood Life, Kangana had said that she finds comparisons between herself and Alia embarrassing because she found Alia’s critically acclaimed performance in Gully Boy ‘mediocre’. To quote her exact words, she had said,\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 12.5 K SHARES 5.5 K SHARES\n“I am embarrassed...What is there to beat in Gully Boy performance ....same snappy muh phat girl... Bollywood’s idea of a fiery girl, woman empowerment and good acting, spare me this embarrassment, please. Media have taken filmy kids love too far. Stop pampering mediocre work or else bar will never be raised.”\nBut what wins us over every time is how Alia is always calm and dignified with her response. In a rather graceful response to Kangana's attack, Alia spoke to Bollywood life and said,\nAgencies\n“I respect Kangana’s work a lot and I respect her opinion. If she feels a particular way she must have reason to feel that way. I would rather remember how much she had praised me after watching Raazi. And I’d just like to focus on my work. Maybe she will appreciate me again if I work hard enough.”\nNo matter what Kangana says about Alia, her response proves that she will never stoop low and maintain poise and grace. No wonder Bhatt has such a fan following!", "title": "Alia Bhatt Promises To Work 'Harder' After Kangana Calls Her Gully Boy Performance 'Mediocre'", "date_publish": "13/04/2019, 16:10:42", "description": "Kangana Ranaut has had issues with Alia Bhatt and it isn't new to any of us. Not sure how and when the animosity brew but Kangana has been targeting Bhatt since a long time now. A few months ago, she had alleged that the Raazi star didn’t reciprocate her gesture and help promote Manikarnika: The Queen of Jhansi.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-bhatt-promises-to-work-harder-after-kangana-calls-her-gully-boy-performance-mediocre-365396.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/alia_bhatt_1555153092_800x420.jpg"}