{"text": "It was a big night for actors like Alia Bhatt, Ranveer Singh, Ranbir Kapoor, Vicky Kaushal and Neena Gupta who were the top winners at the 64th Filmfare Awards in Mumbai on Saturday. The films that took away the biggest awards include Raazi, Andhadhun and Badhaai Ho.\nIn the popular category, Alia won the award for the Best Actor (Female) for Raazi and the film also won the Best Film award (Popular). Ranbir Kapoor won Best Actor (Male) in the popular category for Sanju, while Ranveer Singh (Padmaavat) and Ayushmann Khurrana (Andhadhun) won in the Best Actor category (Critics). Sara Ali Khan (Kedarnath) and Ishan Khatter (Dhadak) were given awards for Best Debut.\nInstagram\nHere's the entire list of winners here!\nBest Actor In A Leading Role (Male): Ranbir Kapoor for Sanju\nBest Actor In A Leading Role (Female): Alia Bhatt for Raazi\nCritics Best Actor in Leading Role (Male): Ranveer Singh for Padmaavat tied with Ayushmann Khurrana for Andhadhun\nCritics Best Actor in Leading Role (Female): Neena Gupta for Badhaai Ho\nBest Director: Meghna Gulzar for Raazi\nBest Film (Popular): Raazi\nCritics Best Film: Andhadhun\nBest Actor In A Supporting Role (Male): Gajraj Rao for Badhaai Ho tied with Vicky Kaushal for Sanju\nBest Actor In A Supporting Role (Female): Surekha Sikhri for Badhaai Ho\nBest Screenplay: Sriram Raghavan, Arijit Biswas, Pooja Ladha Surti, Yogesh Chandekar, Hemanth Rao for Andhadhun\nBest Dialogue: Akshat Ghildial for Badhaai Ho\nBest Original Story: Anubhav Sinha for Mulk\nBest Debut Actor (Male): Ishaan Khatter\nBest Debut Actor (Female): Sara Ali Khan\nBest Debut Director: Amar Kaushik for Stree\nBest Short Film (Popular Choice): Plus Minus\nBest Actor (Male) for Short Film: Hussain Dalal for Shameless\nBest Actor (Female) for Short Film: Kirti Kulhari for Maya\nBest Short Film (Fiction): Rogan Josh\nBest Short Film (Non-Fiction): The Soccer City\nGulshan Kumar Award for Best Music Album: Sanjay Leela Bhansali for Padmaavat\nBest Lyrics: Gulzar for Ae Watan from Raazi\nBest Playback Singer (Male): Arijit Singh for Ae Watan from Raazi\nBest Playback Singer (Female): Shreya Ghoshal for Ghoomar from Padmaavat\nRD Burman Award for New Music Talent: Niladri Kumar\nBest Cinematography: Pankaj Kumar for Tumbbad\nBest VFX: Red Chillies VFX for Zero\nBest Background Score: Daniel B George for Andhadhun\nBest Action: Vikram Dahiya and Sunil Rodriguez for Mukkabaaz\nBest Choreography: Kruti Mahesh Midya and Jyothi D Tommaar for Ghoomar from Padmaavat\nBest Editing: Pooja Ladha Surti for Andhadhun\nBest Production Design: Nitin Zihani Choudhary, Rakesh Yadav for Tumbbad", "title": "Alia And Ranbir Win Best Actors At 64th Filmfare Awards-Here's The Full List Of Winners!", "date_publish": "24/03/2019, 11:19:01", "description": "In the popular category, Alia won the award for the Best Actor (Female) for Raazi and the film also won the Best Film award (Popular). Ranbir Kapoor won Best Actor (Male) in the popular category for Sanju, while Ranveer Singh (Padmaavat) and Ayushmann Khurrana (Andhadhun) won in the Best Actor category (Critics). Sara Ali Khan (Kedarnath) and Ishan Khatter (Dhadak) were given awards for Best Debu", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-and-ranbir-win-best-actors-at-64th-filmfare-awards-here-s-the-full-list-of-winners-364210.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/filmfare_1553406644_800x420.jpg"}