{"text": "Alia Is In Awe Of Ranbir's Natural Acting, Says She Forgets Her Lines When He Performs\nAlia Is In Awe Of Ranbir's Natural Acting, Says She Forgets Her Lines When He Performs\nThe ambiguity around Alia Bhatt and Ranbir Kapoor's has finally ended. The couple is seeing each other since 2018 and is all geared up for the release of their film Brahmastra.\nTwitter\nApart from shooting and prepping up for Ayan Mukerji's film, the couple spends a lot of time together. Alia was also present in New York with the Kapoor's and welcomed the new year together.\nTwitter\nIn a recent interview, Alia Bhatt expressed how she feels about acting with beau Ranbir Kapoor. Alia was all praises for Ranbir and his acting prowess. She said,\nDon't Miss 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES\n\"I have never seen a more natural actor in my life. He's one of the greatest actors. Not only am I fond of him as an actor but a lot of girls and guys admire him as an actor.\"\nShe added how Ranbir is \"very relaxed and chilled out\" on the sets and immerses himself completely in his craft. She added that seeing Ranbir Kapoor perform often makes her forget her own dialogues. She said,\n\"I usually remember my dialogues well, I never forget my lines while performing a scene but when I watch Ranbir perform, I do forget my dialogues at times... simply because, when Ranbir is emoting, he does it with so much ease. I just keep watching him. I tend to forget about my performance. He has the most honest and simple eyes.\"\nThat's not all. Alia was all praises for Neetu Kapoor and Rishi Kapoor as well. She said,\n\"Neetuji is a fabulous human being. I can call her a friend. She is chilled out and has a great attitude towards life and I think Ranbir gets that cool, relaxed, chilled out and mast attitude from his mother. Rishiji... (smiles) the best thing about him is that he is unique. Whenever you get some time to spend with Rishiji, you just have fun with him since he is unique in his own self. One cannot learn and take away anything from him simply because there is only one Rishi Kapoor.\"\nAlia is currently busy with the promotions for Gully Boy and is currently in Berlin with the team for the premiere of the movie.", "title": "Alia Is In Awe Of Ranbir's Natural Acting, Says She Forgets Her Lines When He Performs", "date_publish": "10/02/2019, 10:58:58", "description": "The couple is seeing each other since 2018 and is all geared up for the release of their film Brahmastra.The couple is seeing each other since 2018 and is all geared up for the release of their film Brahmastra.The couple is seeing each other since 2018 and is all geared up for the release of their film Brahmastra.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-is-in-awe-of-ranbir-s-natural-acting-says-she-forgets-her-lines-when-he-performs-361869.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranbir_kapoor_and_alia_bhatt_1549777652_800x420.jpg"}