{"text": "Alia Bhatt Gets Emotional, Apologises To Sister Shaheen For Not Understanding Her Moments Of Depression\nAlia Bhatt Gets Emotional, Apologises To Sister Shaheen For Not Understanding Her Moments Of Depression\nAlia Bhatt is one of the few actresses who is extremely close to her family. Everyone knows Bhatt family is a close-knit one, especially the sisters. Whether it's Pooja Bhatt's relationship with Alia, or Alia's with Shaheen.\nFor many who don't know, Shaheen had earlier this year spoken about her struggles with depression in a leading magazine. She has now come out with a book named, \"I've never been (un)happier\".\nOverwhelmed by sister's struggles and success, Alia Bhatt posted a heartwarming video for her elder sister Shaheen, after reading her book. The book targets people who are struggling with mental issues and depression as Shaheen's book is an account of her struggles with depression.\nTwitter\nPosting an emotional video on Youtube, Alia shared a heartwarming message for her little sister apologising to her for not understand her moments of depression earlier. The video starts with a clip from Alia's childhood where she can be seen dancing with her sister.\nSpeaking about Shaheen's debut book, Alia said, \"When I read your very first book, a book that you have written with so much ease and honesty, while I struggle to write one letter to you. I feel awful. I feel terrible because despite living with you for 25 years, I have never really understood your silent moments of depression. I never recognized a snappy moment as something much bigger.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n\"Every time you refused to go out for dinner, I would think she rather sit at home and watch TV, be alone, not that you couldn't bring yourself to get out of bed,\" she added.\nTaking to Instagram, Alia writes a beautiful caption for a little sister. \"Dear Shaheen.. Somehow when I finished reading your book I couldn't tell you how I felt immediately.. Cause I felt too much.. And I don't think I could ever discuss it with you properly.. I've tried now! Link in bio.. #NeverBeenUnhappier\"\nIf these are not sister goals, then we don't know what is.", "title": "Alia Bhatt Gets Emotional, Apologises To Sister Shaheen For Not Understanding Her Moments Of Depression", "date_publish": "13/10/2018, 18:07:14", "description": "Alia Bhatt has posted a heartwarming video for her elder sister Shaheen, after reading her book. On World Mental Health Day this year, Shaheen Bhatt released her debut book named \"I've never been (un)happier\".The book is an account of her struggles with depression. Posting an emotional video on Youtube, Alia shared a heartwarming message for her little sister regarding the same.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-bhatt-gets-emotional-apologises-to-her-sister-shaheen-for-not-understanding-her-moments-of-depression-354733.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/alia_bhatt_1539432132_800x420.jpg"}