{"text": "Alia Bhatt Gushes About Working With Ranbir And Ranveer, Says Both Are Great Humans And Actors\nAlia Bhatt Gushes About Working With Ranbir And Ranveer, Says Both Are Great Humans And Actors\nAfter a successful 2018, Alia Bhatt's 2019 looks like a phenomenal one too. With releases like Gully Boy and Brahmastra, Alia surely has a line up of some great releases. The trailer of Gully Boy was unveiled yesterday and has received a big thumbs up from the audience and the film fraternity.\nThe trailer launch event was a fun one as Ranveer Singh was in his full-element like always.\nApart from their fun banter, the stars were at their candid best and spoke unabashedly. While interacting with the media, Alia expressed how she considers upcoming superstars of Hindi cinema Ranveer Singh and Ranbir Kapoor as superb human beings and outstanding actors.\nAlia was interacting with the media at the trailer launch of \"Gully Boy\" along with his co-actor Ranveer Singh, director Zoya Akhtar and producer Farhan Akhtar and Ritesh Sidhwani on Wednesday in Mumbai.\nWhile Alia will be seen opposite Ranveer Singh in Gully Boy, she will also be seen with Ranbir Kapoor in Brahmastra.\nWhen she was quizzed and asked to comment about what the actual difference between the two actors is, she said,\n\"There are lots of similarities. Both are superb human beings and outstanding actors. Both of them are really special to me and the only difference between them is that with one of them I am doing 'Gully Boy' and with the other, I am doing 'Brahmastra'.\"\nAlia plays the role of a medical student in \"Gully Boy\" which is based on underground rapping and hip-hop scene of India. She is also collaborating with Zoya Akhtar and Excel Entertainment for the first time in a film. Talking about how her experience of working with Ranbir and Ranveer has been like, Alia said,\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES\nAgencies\n\"It was a brilliant experience working with Zoya and working with Excel. I think they have such a fantastic team. I have never worked with a better team... It was a crazy ride working on this film.\"\nThe film will be hitting the theaters on February 14 and Brahmastra will have a Christmas release.", "title": "Alia Bhatt Gushes About Working With Ranbir And Ranveer, Says Both Are Great Humans And Actors", "date_publish": "10/01/2019, 14:34:00", "description": "Alia was interacting with the media at the trailer launch of \"Gully Boy\" along with his co-actor Ranveer Singh, director Zoya Akhtar and producer Farhan Akthar and Ritesh Sidhwani on Wednesday in Mumbai. Alia will be next seen on screen with Ranveer Singh in \"Gully Boy\" and after that she will feature with Ranbir Kapoor in \"Brahmastra\".", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/alia-bhatt-gushes-about-working-with-ranbir-and-ranveer-says-both-are-great-humans-and-actors-360146.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_and_alia_1547101939_800x420.jpg"}