{"text": "All You Need To Know About Acid Attack Survivor Lakshmi Who Inspired Deepika's Role In Chhapaak\nAll You Need To Know About Acid Attack Survivor Lakshmi Who Inspired Deepika's Role In Chhapaak\n2018 proved that only content-rich films have struck a chord with audiences. The fact that films like Badhaai Ho and Andhadhun worked their magic at the box office and movies including Thugs of Hindostan and Zero failed miserably proved that Indian cinema is going through a transitional phase.\nAfter taking a sabbatical for a year and getting married to Ranveer Singh, Deepika Padukone has finally signed a movie. She will be seen in Meghna Gulzar's next titled Chhapaak, in which she will be playing the role of an acid attack victim.\nWhile earlier it was said that Rajkummar Rao will star alongside Deepika, now it has been confirmed that Mirzapur fame actor Vikrant Massey has bagged the role of her husband in the movie.\ncinestaan.co\nDeepika’s role of an acid attack victim has been inspired by Lakshmi Agarwal, who after going through a lot of hardships is now leading her life with courage and bravery. Deepika who earlier said that she was quite moved by the story is happy to be playing this role.\nBut who is Lakshmi Agarwal?\nFor the unversed, Lakshmi Agarwal was 15 years old when she was walking to a bookstore and was attacked by a man who threw acid on her twice. For three months, she was admitted to Delhi’s Ram Manohar Lohia Hospital where she underwent multiple surgeries. Her room had no mirrors so she would try to catch a glimpse of her face in the reflection of water.\nstylewhack.com\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThereafter, Lakshmi Agarwal fought to ban the sale of acids in India and filed a PIL in Supreme Court. Following this, a ban was imposed on the sale of acid to minors and also a photo identity card would be compulsory for buying.\nstylewhack.com\nFurthermore, acid attack was included as a separate offense under IPC (Indian Penal Code) by the passage of a criminal act, 2013.\nUS State Department’s International Women of Courage Award honoured her in 2013 where then-First Lady Michelle Obama presented her the award.\nIn 2014, Lakshmi met journalist Alok Dixit, who was also the founder of Stop Acid Attack campaign and the cupid worked its magic. They fell in love but decided not to get married and be in a live-in relationship instead. Why? Because Lakshmi Agarwal didn’t want people to come at her wedding and comment on her looks. Together they co-founded NGO, Chhanv Foundation.\nWhile everything seemed good, soon after their child was born, Lakshmi and Alok parted ways on account of some differences. She was finding it tough to manage her finances. So much so, that she was couldn’t even afford the rent of the two-room flat she was living in, in Delhi’s Lakshmi Nagar.\nPost this Akshay Kumar came to her rescue and donated Rs 5 lakh.", "title": "All You Need To Know About Acid Attack Survivor Lakshmi Who Inspired Deepika's Role In Chhapaak", "date_publish": "24/12/2018, 15:03:10", "description": "After taking a sabbatical for a year and getting married to Ranveer Singh, Deepika Padukone has finally signed a movie. She will be seen in Meghna Gulzar's next titled Chhapaak Lakshmi Agarwal, in which she will be playing the role of an acid attack victim.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/all-you-need-to-know-about-acid-attack-survivor-lakshmi-who-inspired-deepika-s-role-in-chhapaak-359178.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/heres_all_about_acid_attack_survivor_lakshmi_agarwal_whose_role_deepika_padukone_will_play_in_chha_1545642490_800x420.png"}