{"text": "Everything is not okay in Nick Jonas and Priyanka Chopra's marriage, claims an American magazine. Well, this news came as a big shock to all the fans but looks like the news was cooked up without any evidence.\nAgencies\nAccording to OK! magazine, the 36-year-old actress and the 26-year-old singer are quickly falling out of love now that they are \"starting to really get to know each other\", reports gossipcop.com.\n\"They've been fighting about everything -- work, partying, spending time together. The bottom line is that Nick and Priyanka rushed into things...And now they're paying the price. Their marriage is hanging by a thread,\" said a source.\nThe source added that Nick believed the actress was \"cool and easygoing\" when they got married.\"But recently Nick has seen a controlling side to her. She also has a temper -- that's something Nick wasn't aware of until after the wedding celebrations.\"\nDon't Miss 12.5 K SHARES 186 SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nAgencies\nAccording to the source, Nick's family is \"begging him to end\" the marriage as they initially thought Priyanka was \"this mature woman who was ready to settle down and have kids\", but they now feel she's a party girl who \"acts like she is 21\". The source says a split could result in a major battle over money.\n\"There are whispers that Nick and Priyanka got married so quickly they didn't take the time to draw up a prenuptial agreement...\"\nThe couple got married in India in December last year. Priyanka and Nick had three-day wedding festivities at Jodhpur's royal Umaid Bhawan Palace, where they exchanged wedding vows as per both Christian and Hindu rituals in two separate ceremonies.\nWell, neither Nick nor PC have reacted to the news but their social media activities prove otherwise. Infact, PC is spending a lot of time with her husband and his fam-jam. The pictures that she recently posted proves that all is okay in the hood.\nIf reports are to be believed, Nick and PC have already called their legal team and are planning to sue the magazine for spreading the rumours.\n(With agency inputs)", "title": "All Good In The Hood! Here's The Truth Behind Nick Jonas-Priyanka Chopra's Divorce Rumours!", "date_publish": "31/03/2019, 15:51:29", "description": "Everything is not okay in Nick Jonas and Priyanka Chopra's magazine claims an American Magazine. Well, this news came as a big shock to all the fans but looks like the news was cooked up without any evidence. According to OK! magazine, the 36-year-old actress and the 26-year-old singer are quickly falling out of love now that they are", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/all-good-in-the-hood-here-s-the-truth-behind-nick-jonas-priyanka-chopra-s-divorce-rumours-364634.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/pc_and_nick_1554029910_800x420.jpg"}