{"text": "All Decked Up For Priyanka Chopra & Nick Jonas’ Wedding, Jodhpur’s Umaid Bhavan Looks Dreamy\nAll Decked Up For Priyanka Chopra & Nick Jonas’ Wedding, Jodhpur’s Umaid Bhavan Looks Dreamy\nWe just can’t wait to see Nick Jonas dancing to desi tunes especially with his Band Baajaa Baaraat.\nPriyanka Chopra and Nick Jonas are all set to tie the knot on Dec 2. After Nick Jonas, Baraatis Joe Jonas and Game of Thrones actress Sophie Turner have also arrived in India, and the party mode of the stars is on.\nAfter throwing a bash to welcome them both, the pre-wedding festivities have begun for PC. If reports are to be believed, pre-wedding festivities for Nick Jonas and Priyanka Chopra will kick-start today.\nFor the uninitiated, the couple will tie the knot at Jodhpur’s Umaid Bhawan Palace. It’s going to be a royal affair for sure. The first pictures of the decked up Umaid Bhawan Palace are out, and it looks no less than a dream. Take a look!\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 12.5 K SHARES 186 SHARES\nGrapevine suggests that families have booked Umaid Bhawan from Nov 29 to Dec 3. Pre-wedding ceremonies will reportedly take place at Mehrangarh Fort. According to a report in DNA, 3.93 crores have been spent on the wedding festivities. The property has 64 rooms and suites, 22 palace rooms and 42 suites.\nFans are eagerly waiting to see Nick in desi attire and ever-gorgeous Priyanka Chopra in her wedding attire!", "title": "All Decked Up For Priyanka Chopra & Nick Jonas’ Wedding, Jodhpur’s Umaid Bhavan Looks Dreamy", "date_publish": "28/11/2018, 12:51:06", "description": "Priyanka Chopra and Nick Jonas are all set to solemnise their about a year old relationship. For the uninitiated, the couple will tie the knot at Jodhpur’s Umaid Bhawan Palace. It’s going to be a royal affair for sure. The first pictures of the decked up Umaid Bhawan Palace are out, and it looks no less than a dream. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/all-decked-up-for-priyanka-chopra-nick-jonas-wedding-jodhpur-s-umaid-bhavan-looks-dreamy-357515.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/all_decked_up_for_priyanka_chopra__nick_jonas_wedding_jodhpurs_umaid_bhavan_looks_dreamy_1543389103_800x420.png"}