{"text": "All Set To Play A Soldier In His Next, Sushant Singh Rajput Shares The Teaser Of ‘Rifleman’\nAll Set To Play A Soldier In His Next, Sushant Singh Rajput Shares The Teaser Of ‘Rifleman’\nAfter the success of Kedarnath, Sushant Singh Rajput got 12 movie offers, he told media recently. His journey so far has been inspiring for many. He is one of the few actors who had successfully taken a leap from TV to the big screen.\nTwitter\nAfter having played diverse roles in the past, in his next, Sushant Singh Rajput will be seen essaying the role of a soldier. Titled Rifleman, Sushant Singh Rajput will be seen protecting his nation against advanced enemies.\nHere’s the first teaser of the movie, which Sushant Singh Rajput shared on Army Day.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nEarlier, Sushant Singh Rajput had shared a video of him training with the Jawans. Take a look!\nThis year, Sushant Singh Rajput will also be seen in movies including Sonchiraiya that also stars Bhumi Pednekar and Kizie Aur Manny alongside debutant Sanjana Sanghi.", "title": "All Set To Play A Soldier In His Next, Sushant Singh Rajput Shares The Teaser Of ‘Rifleman’", "date_publish": "16/01/2019, 14:48:07", "description": "After having played diverse roles in the past, in his next, Sushant Singh Rajput will be seen essaying the role of a soldier. Titled Rifleman, Sushant Singh Rajput will be seen protecting his nation against advance enemies. This year, Sushant Singh Rajput will also be seen in movies including Sonchiraiya that also stars Bhumi Pednekar and Kizie Aur Manny alongside debutant Sanjana Sanghi", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/all-set-to-play-a-soldier-in-his-next-sushant-singh-rajput-shares-the-teaser-of-rifleman-360507.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/all_set_to_play_a_soldier_in_his_next_sushant_singh_rajput_shares_the_teaser_of_rifleman_1547630410_800x420.png"}