{"text": "All Set To Make His Reality TV Debut, Hockey Star Sandeep Singh Wants To Take Up Acting As Well\nAll Set To Make His Reality TV Debut, Hockey Star Sandeep Singh Wants To Take Up Acting As Well\nSandeep Singh's life story found its way onto the silver screen last year with Soorma, and he will be entering the world of small screen this year with an adventure reality show. The former India hockey team captain says he is also eager to take up acting stints in the future.\nSingh will be making his small screen debut with Roadies Real Heroes, which will air on MTV from February 10.\n\"Rannvijay Singha was of the view that I should have starred in Soorma and he feels that post Roadies there will be a lot of film offers for me. I love experimenting and doing new things in life and if things fall into place, I'm ready to take up acting too. I'm sure it will be a wonderful experience for me,\" Singh told IANS in an email interview.\nTwitter\nSingh will join the 16th edition of the adventure reality show as a gang leader.\n\"I am very excited to be a part of 'Roadies Real Heroes' as it has been one of my favourite reality shows and I am now ready for an adventurous journey as one of the gang leaders on the show,\" he said about being part of the show.\nSingh could relate to the concept of the show, which tests contestants' physical and mental strength. When the team approached him to do the show, Singh said he didn't think much about it and immediately said \"yes\".\nPTI\n\"Roadies tests your mental and physical ability in the most challenging way and I have gone through this. So I don't think I could have got a better opportunity to enter the small screen,\" added Singh, who hails from Haryana.\nSo, what about fiction shows on the small screen?\n\"In today's world, I believe reality shows are more in demand as compared to fiction shows. A show like 'Roadies' is a brand in its own, and I feel the concept this season is the best till now and at the same time the most challenging one too.\"\nsportzwiki\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nSingh himself has seen a lot of hardship. He was left almost paralysed after he was accidentally shot by a Railway Protection Force jawan inside a train in 2006 while he was on his way to join the national squad due to leave for the World Cup in Germany. The incident left him wheelchair-bound for two years.\nHis passion for the sport brought him back to feet and on the field. The turning point came when he became the captain of the Indian national team in 2009.\nLooking back, Singh, also famous as \"Flicker Singh\" due to his ability to shoot drag-flicks on the field, said: \"Whenever I'm in a dilemma or any bad situation, I just look back and remember those days. That really motivates me.\"\n(Sugandha Rawal can be contacted at sugandha.r@ians.in)", "title": "All Set To Make His Reality TV Debut, Hockey Star Sandeep Singh Wants To Take Up Acting As Well", "date_publish": "24/01/2019, 17:15:47", "description": "Sandeep Singh's life story found its way onto the silver screen last year with \"Soorma\", and he will be entering the world of small screen this year with an adventure reality show. The former India hockey team captain says he is also eager to take up acting stints in the future. Singh will be making his small screen debut with \"Roadies Real Heroes\", which will air on MTV from February 10.", "authors": [], "url": "https://www.indiatimes.com/entertainment/all-set-to-make-his-reality-tv-debut-hockey-star-sandeep-singh-wants-to-take-up-acting-as-well-360977.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sandeep_singh_1548318525_800x420.jpg"}