{"text": "All Set For Their Wedding Reception, Ranveer-Deepika Beam With Joy As They Leave For Bengaluru\nAll Set For Their Wedding Reception, Ranveer-Deepika Beam With Joy As They Leave For Bengaluru\nWe, as Indians, have always been eager to see the new bride. After all, Muh Dikhayi ceremony is a part of our post-wedding rituals, where ladies unveil the face of the bride and present her with gifts.\nSo, when a star like Deepika Padukone has got married to the love of her life Ranveer Singh, the excitement level of fans to just catch a glimpse of the couple is soaring with every passing day. One public appearance they make, and fans go gaga swooning over them. They are quite evidently happy in love.\nViral Bhayani\nSo, after Deepika Padukone and Ranveer Singh landed in India, waved and thanked fans and paps who congratulated them, they are now off to Bengaluru, Deepika’s home-town where their wedding reception is scheduled to take place.\nThey were spotted at the airport wearing pristine white outfits. While Ranveer wore a kurta-pyjama with a floral jacket, Deepika donned a anarkali suit. What caught our attention was her sparkling smile, chooda and mangalsutra.\n#1\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n#2\nViral Bhayani\n#3\nViral Bhayani\n#4\nViral Bhayani\n#5\nViral Bhayani\n#6\nViral Bhayani\n#7\nViral Bhayani\nDeepika Padukone and Ranveer Singh’s Bengaluru reception on Nov 21 will be attended by friends and extended family members. They will host another reception party in Mumbai for their friends from the industry.", "title": "All Set For Their Wedding Reception, Ranveer-Deepika Beam With Joy As They Leave For Bengaluru", "date_publish": "20/11/2018, 11:09:48", "description": "Deepika Padukone and Ranveer Singh’s Bengaluru reception on Nov 21 will be attended by friends and extended family members. They were spotted at the airport wearing pristine white outfits. While Ranveer wore a kurta-pyjama with a floral jacket, Deepika donned a anarkali suit. What caught out attention was her sparkling smile, chooda and mangalsutra.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/all-set-for-their-wedding-reception-ranveer-deepika-beam-with-joy-as-they-leave-for-bengaluru-356992.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singh_and_deepika_padukone_pose_at_mumbai_airport_as_they_head_to_bengaluru_for_wedding_rece_1542692455_800x420.png"}