{"text": "As an industry, Bollywood is sometimes a funny place. All it takes is just one picture for media to start floating news of tiffs and break ups. While Luka Chuppi turned out to be a big hit, strong rumors suggested that Kriti Sanon and Kartik Aaryan are not even on talking terms.\nThere were rumours that Kriti was upset with Kartik for hogging the limelight and taking sole credit for the success of the film. Talking to a tabloid, Kriti Sanon had stated,\nInstagram\n“This business of overlooking the leading lady has been going on for a while and it’s so unfair. I am glad this conversation is finally happening. It’s logical to talk about only the male protagonist when the leading lady doesn’t have a lot to do, but when they are both carrying a film on their shoulders, the credit should be equally shared. Everybody deserves a mention.”\nFurthermore, the reports suggested that things are bitter between the two actors. But amidst all these reports, Kriti and Kartik's social media activities hint that all's well.\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nOn Friday, Luka Chuppi co-stars Kartik Aaryan and Kriti Sanon took to Twitter to take a 'not so sly' dig at these reports.In his post, Kartik wrote,\n“Ajii sunti ho !!! Guddu aur Rashmi ke Pyaar ki khabar chapne ki bajaay, Ye kaunsi khabar chhap gayi akhbaar mein. Abhi toh humaari shaadi ke ‘50 days’ hue hain bas , aur log afwaahein phailaane lage @kritisanon #LukaChuppi.”\nHave a look at their exchange of words on Twitter:\nHelmed by Laxman Utekar-directed Luka Chuppi was a film that took a hilarious dig at society's hypocrisy towards the concept of live-in. The movie has collected Rs 87.8 crore in 50 days of the release and turned out to be one of the biggest blockbusters of the year.", "title": "Amidst Rumours Of Tiff, Kriti Sanon-Kartik Aaryan Celebrate 50 Days Of 'Luka Chuppi' Together", "date_publish": "20/04/2019, 12:47:11", "description": "As an industry, Bollywood is sometimes a funny place. All it takes is just one picture for media to start floating news of tiffs and break ups. While Luka Chuppi turned out to be a big hit, strong rumors suggested that Kriti Sanon and Kartik Aaryan are not even on talking terms.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amidst-rumours-of-tiff-kriti-sanon-kartik-aaryan-celebrate-50-days-of-lukka-chuppi-together-365796.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kartik_and_kriti_1555748348_800x420.jpg"}