{"text": "Amid Rumours Of Cancer, Ranbir Kapoor Says Father Rishi Is Doing Well & Will Be Back Home Soon\nAmid Rumours Of Cancer, Ranbir Kapoor Says Father Rishi Is Doing Well & Will Be Back Home Soon\nIt was on September 29, 2018 when Rishi Kapoor had tweeted about his short absence from work for some medical treatment. Since then, the man is in America, often seen hanging out with Sonali Bendre who was undergoing her cancer treatment there. Rumours started flooding on social media that he had cancer, especially after his pictures in blonde hair emerged on social media.\nTwitter\nWhile family members have rubbished the rumours in the past, nobody knows what Rishi Kapoor is going through. Finally opening up on the same, Ranbir Kapoor gave an update on father Rishi Kapoor’s health. He said that he is doing fine and will be back home soon.\nInstagram\n“He is doing very well. He will be back very soon. He is missing movies and working in films. I hope and with all your wishes and prayers that he comes back soon,” Ranbir Kapoor was quoted as saying by PTI.\nDon't Miss 322 SHARES 237 SHARES 197 SHARES 2.5 K SHARES 247 SHARES\nTwitter\nEarlier in an interaction with ET, Randhir Kapoor had said, “We don't know yet what is the exact nature of his ailment. Rishi himself doesn't know what he's suffering from. He has not even started undergoing tests there; how can people speculate that he has cancer and that too, one that has escalated to advanced stage.”\nWe hope for a speedy recovery for Rishi Kapoor!", "title": "Amid Rumours Of Cancer, Ranbir Kapoor Says Father Rishi Is Doing Well & Will Be Back Home Soon", "date_publish": "20/03/2019, 18:15:41", "description": "It was on September 29, 2018 when Rishi Kapoor had tweeted about his short absence from work for some medical treatment. Since then, the man is in America, often seen hanging out with Sonali Bendre who was taking her cancer treatment from there. Rumours started flooding on social media that he had cancer, especially after his pictures in blonde hair emerged on social media.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/amid-rumours-of-cancer-ranbir-kapoor-says-father-rishi-is-doing-well-will-be-back-home-soon-364054.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/amid_rumours_of_cancer_ranbir_kapoor_says_rishi_kapoor_is_doing_well__will_be_back_soon_1553084840_800x420.png"}