{"text": "If the rumours are to be believed, Ranveer Singh and Deepika Padukone will get married in less than a month. Grapevine suggests that the most loved couple of Bollywood, who started dating on the sets of Ram Leela, will get married between Nov 12 to Nov 16. The preparations for DeepVeer’s big day are going on in full swing.\nbollywoodshaadis.com\nHowever, amid all these speculations, Ranveer Singh says that right now he is only focussing on films and acting.\n“Right now, I am focussed on the work that I am doing in films. I am doing back-to-back films. I've been very blessed to have some really amazing projects at hand and I tremendously value these opportunities,” Ranveer told IANS.\nTwitter\n“I want to do my bit to contribute towards the filmmaking process and to try and make the best films possible. So, my focus in life right now is acting and films,” he added.\nAlso Read: Ranveer-Deepika's Wedding Date Is Out & The Couple Will Make An Official Announcement Soon\nWith inputs from IANS\nDon't Miss 365 SHARES 193 SHARES 161 SHARES 183 SHARES 1 K SHARES", "title": "Amid Wedding Rumours, Ranveer Singh Says His Focus In Life Right Now Is Acting & Films", "date_publish": "17/10/2018, 17:10:31", "description": "If the rumours are to be believed, Ranveer Singh and Deepika Padukone will get married in less than a month. However, amid all these speculations, Ranveer Singh says that right now he is only focussing on films and acting. Grapevine suggests that the most loved couple of Bollywood, who started dating on the sets of Ram Leela, will get married between Nov 12 to Nov 16.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/amid-wedding-rumours-ranveer-singh-says-his-focus-in-life-right-now-is-acting-films-354972.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/amid_wedding_rumours_deepika_padukone_ranveer_singh_says_he_is_currently_focussing_on_films__actin_1539774929_800x420.png"}