{"text": "Nick Jonas and Priyanka Chopra's love story is as good as a Disney fairy tale. The couple who got engaged in India in August is all set to get hitched by the end of this year. In just five months of being together, Nick popped the question to PC with a Tiffany and Co diamond ring and the couple decided to take the plunge.\nAgencies\nIf you are someone who has been jealous of PC and Nick's story, wait till you read this detail. According to a report in TMZ, Nick has purchased a swanky $6.5 million pad in Beverly Hills Post Office, Los Angeles with the sought-after pin code—90210.\nAgencies\nThis mansion will have five bedrooms, four bathrooms, an ungated pool that overlooks the hills and a total area of 4,129 square feet. In case you are wondering how PC and Nick's future home will look like, have a look at the pictures.\nHere are the pictures of Nick and PC's new home and they will make you really jealous.\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)\nNick Jonas’ home in Beverly Hills, Los Angeles. (redfin.com)", "title": "Amid Wedding Rumours, Nick Jonas Gifts A $6.5 Mn Mansion To Fiancee PC & We're Sure It's A Sign", "date_publish": "24/10/2018, 17:13:26", "description": "Nick Jonas and Priyanka Chopra's love story is as good as a Disney fairy tale. The couple got engaged in India in August is all set to get hitched by the end of this year. In just five months of being together, Nick popped up the question to PC with a Tiffany and Co diamond ring and the couple decided to take the plunge.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amid-wedding-rumours-nick-jonas-gifts-a-6-5-mn-mansion-to-fiancee-pc-we-re-sure-it-s-a-sign-355378.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/pc_and_nick_1540381559_800x420.jpg"}