{"text": "Bollywood celebrities are one such clan in our country that have a massive fan following. Fans look upto them and aspire to be like them. From insane number of fan pages on social media to standing outside celebrity homes for long hours is something that's become a ritual over the last few years.\nTwitter\nBut Bollywood celebs do understand this frenzy and handle it in the most responsible way. Recently, Aamir Khan released their long awaited movie, Thugs Of Hindostan which received a negative response at the box office.\nThe movie was touted as one of the biggest flops Aamir Khan has ever featured in. His fans were disappointed at his movie choice. But not losing home, Aamir is determined to come back stronger on the silver screen.\n1. Taking to Twitter, Aamir Khan shares his list of resolutions and it's practically a win win for all the Aamir fans. Infact, the first one is something we should all inspire to be too.\nDon't Miss 468 SHARES 161 SHARES 814 SHARES\n2. Burying the past, SRK and Salman not only came together for Zero (Yes, Salman has a cameo), but they also had a blast at Salman's house party as the year ended. Brother in arms taught us, how times might change but they will still be friends forever. Here's hoping their equation only gets stronger\n3. Come hail, come storm, but Akshay Kumar is one of the most disciplined actors we will ever come across. While the world was partying till the wee hours, Akshay chose to keep fit in the first sun rise of the New Year. Along with that, he also promised us 2 action packed films.\nSharing with you all the first sunrise of the New Year :)\nMy workout motivation : two action-packed films this year, so find something to make you wake up, get up and get out there! Wishing you all a healthy and #HappyNewYear pic.twitter.com/ffjGW4hV8l — Akshay Kumar (@akshaykumar) January 1, 2019\n4. Ajay Devgn ensures that the onset of 2019 was about spending time with family. He flew to Maldives with his family and enjoyed soaking up some sun with his wife and kids. Posing with his daughter, he puts out a strong message which says, I'm sure your daughters are precious to you.\" After all, they are the real gems\nThe light is beautiful, but my daughter outshines everything!\nHappy 2019 and I’m sure your daughters are all precious to you. pic.twitter.com/UrRp3nNram — Ajay Devgn (@ajaydevgn) January 1, 2019\n5. Prabhudheva again taught us the meaning of being together with family on such important occasions. He wishes his followers a very Happy New Year along with his little family\nWish you all a very Happy New Year💫 pic.twitter.com/UgFYG1ZArJ — Prabhudheva (@PDdancing) December 31, 2018\nLooking at Bollywood resolutions, it sure comes as a learning for all of us on how to spend 2019 wisely and with family.", "title": "Amidst Wishing Fans On New Year, Bollywood Celebrities Declare Their Resolutions For 2019", "date_publish": "01/01/2019, 11:45:11", "description": "The movie was touted as one of the biggest flops Aamir Khan has ever featured in. His fans were disappointed at his movie choice. But not losing home, Aamir is determined to come back stronger on the silver screen. 1. Taking to Twitter, Aamir Khan shares his list of resolutions and it's practically a win win for all the Aamir fans. Infact, the first one is something we should all inspire .", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/amidst-wishing-fans-on-new-year-bollywood-celebrities-declare-their-resolutions-for-2019_-359616.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aamir_1546324647_800x420.jpg"}