{"text": "Varun and Natasha have never hesitated from media attention in the past as they have been spotted together on multiple occasions. Giving his confirmation around all the rumoured reports of dating Natasha Dalal, Varun Dhawan made it clear on Karan Johar's chat show that she indeed is the 'one'.\nDhawan had even posted an adorable picture with Natasha on the occasion of Diwali this year, giving out another hint that he's dating her.\nAnd now, while we are rejoicing about all the celebrity weddings that happened and are scheduled to happen in December, looks like this couple too is taking things ahead in a similar direction.\nVarun and Natasha were spotted at the Mumbai airport today with Daddy Varun Dhawan as they flew out of the city. The couple and Daddy Dhawan posed for the paps and smiled. The pictures made way on the internet and like always, everyone has a similar reaction: When's the wedding?\nViral Bhayani\nDon't Miss 207 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nThis speculation stems from the very fact that Varun confessed on Koffee With Karan that he's dating her and is looking forward to settling with her.\nWell, looks like another bachelor in the B-town is ready to take the plunge!", "title": "Amidst Wedding Rumours, Varun Dhawan Flies Out Of Mumbai With GF Natasha & Dad David Dhawan", "date_publish": "24/11/2018, 14:42:31", "description": "This speculation stems from the very fact that Varun confessed on Koffee With Karan that he's dating her and is looking forward to settling with her. Well, looks like another bachelor in the B-town is ready to take the plunge!Dhawan had even posted an adorable picture with Natasha on the occasion of Diwali this year, giving out another hint that he's dating her.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amidst-wedding-rumours-varun-dhawan-flies-out-of-mumbai-with-gf-natasha-dad-david-dhawan-357308.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/varun_dhawan_1543051932_800x420.jpg"}