{"text": "Amitabh Bachchan Drops A New Video Announcing KBC's New Season And It's All Hearts!\nAmitabh Bachchan Drops A New Video Announcing KBC's New Season And It's All Hearts!\nFor every 90's kid, KBC isn't just a show. It's an emotion. The joy of sitting with the entire family over dinner and Amitabh Bachchan's Kaun Banega Crorepati was priceless.\nWell, for some, things are the same as the show has continued to run over all these years. KBC is all about Amitabh Bachchan and the way he hosts and entertains his audience and the contestants is what makes it one of India's most loved shows.\nSony\nAnd now, the show is being revived for its another season and looks like Big B is all geared up to impress the audience. Sony release the first promo of the upcoming season and it gives you a small glimpse of what lies ahead for all of us.\nBig B being being B is seen giving a pep talk to all those people who have been endlessly trying to come and make a cut on the show. Without further ado, have a look at the promo right here.\nA few days ago, Big B took to Twitter to share the details of the first promo. He had written,\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\n\"Its 2019 and it all began in 2000. 19 years and a gap of about two years when it did not happen for me. But 17 years is a lifetime and a life time that was given a lifeline by you.\"", "title": "Amitabh Bachchan Drops A New Video Announcing KBC's New Season And It's All Hearts!", "date_publish": "16/04/2019, 17:22:35", "description": "For every 90's kid, KBC isn't just a show. It's an emotion. The joy of sitting with the entire family over dinner and Amitabh Bachchan's Kaun Banega Crorepati was priceless. Well, for some, things are the same as the show has continued to run over all these years. KBC is all about Amitabh Bachchan and the way he hosts and entertains his audience and the contestants is what makes it one of India's", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amitabh-bachchan-drops-a-new-video-announcing-kbc-s-new-season-and-it-s-all-hearts-365573.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/amitabh_bachchan_1555416471_800x420.jpg"}