{"text": "Amitabh Bachchan is more than just a movie star. He is a legend. Remember when he fell sick, the entire nation prayed for his well-being. Big B has been the face of social service advertisements too, including Polio, which has been successfully eradicated from India. Apart from contributing to the world of cinema, he is also doing his bit for the society.\nTwitter\nKeeping up the good work, Amitabh Bachchan recently performed national anthem with specially-abled children in sign language. The video will not only give you goosebumps but will also make your hearts melt. Watch it below.\nOur national anthem with Amitabh Bachchanji @SrBachchan Ji in a different way to support the Deaf Dumb & Differently able. He deserves a National Salute, So gracious. I am sure you will love it. PL enjoy & Share ❤🙏 pic.twitter.com/wNdjsvbj69 — ❤️Jasmine🆎 Ef Chicago (@JaniJasmine) January 30, 2019\nAmitabh Bachchan says he feels honoured to have got the opportunity. “My privilege, my honour, My India,” he wrote.\nThe National Anthem .. our pride, our identity, our liberation, our belief, our self esteem .. BUT MUCH much MORE IN THE EYES OF THOSE, THAT CANNOT HEAR OR SPEAK !! .. my privilege, my honour .. my INDIA🇮🇳🇮🇳🇮🇳 https://t.co/i9RTUS5PaT — Amitabh Bachchan (@SrBachchan) January 30, 2019\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES", "title": "Amitabh Bachchan:Amitabh Bachchan Performing National Anthem In Sign Language With Specially Abled Children Will Tug At Your Heartstrings", "date_publish": "31/01/2019, 16:42:05", "description": "Keeping up the good work, Amitabh Bachchan recently performed national anthem with specially abled children in sign language. The video will not only give you goosebumps but will also make your hearts melt. Amitabh Bachchan says he feels honoured to have got the opportunity. “My privilege, my honour, My India,” he wrote.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-performing-national-anthem-in-sign-language-with-specially-abled-children-will-tug-at-your-heartstrings-361380.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/amitabh_bachchan_performs_national_anthem_in_sign_language_with_specially_abled_children_1548931716_800x420.png"}