{"text": "Amitabh Bachchan To Meet UP Farmers, Will Pay Off Their Loans Amounting To Rs 4.05 Crore\nAmitabh Bachchan To Meet UP Farmers, Will Pay Off Their Loans Amounting To Rs 4.05 Crore\nBollywood megastar Big B has a heart of gold. Whether it's helping the farmers in Maharashtra or sending appreciation to Bollywood A-listers who do some phenomenal work, Amitabh Bahcchan is rooted and loves to help and show care.\nAfter Maharashtra, the actor has reportedly paid off loans of farmers in Uttar Pradesh and will personally meet some of them to give them their bank letters. He has arranged for 70 farmers to travel to Mumbai and receive their bank letters, his spokesperson has said.\nThe superstar will be taking care of 1,398 farmer loans from Uttar Pradesh amounting to over Rs 4.05 crore.\nALSO READ: Shah Rukh Khan Requests Amitabh Bachchan To Visit AbRam On Saturdays Because He Thinks He’s His Grandfather\nAFP\nAmitabh has done an 'OTS: One Time Settlement with Bank Of India' and cleared the farmer's loans with the bank. He has also invited 70 farmers to Mumbai by blocking an entire train compartment for their travel, to personally give them their bank letters on November 26.\nThe farmers will receive their bank letters from Big B at his office.\nALSO READ: AbRam Is Convinced That Amitabh Bachchan Is His Grandfather, Keeps Wondering Why He Doesn't Live With Him\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nWhen approached, his official spokesperson confirmed: \"Yes, Mr. Bachchan has cleared the loans of 1398 farmers from Uttar Pradesh. He had earlier paid off the loans of Maharashtra's farmers. And now he has done so for the debted farmers of UP. Around 70 farmers have been chosen to personally travel and receive the bank letters directly from Mr. Bachchan in Mumbai, clearing their outstanding dues.\"\nAFP\nEarlier this year, the \"Paa\" star, who is in Baroda to accept Sayaji Ratna Award, helped over 350 farmers by paying off their debts and also helped the families of around 44 martyrs of Maharashtra.\nAmitabh and his wife Jaya handed over the amount to the farmers and army martyrs families privately in Mumbai a few months ago.\nALSO READ: Amitabh Bachchan Gets Trolled By Fans For Bursting Crackers During Diwali\nInputs from IANS", "title": "Amitabh Bachchan To Meet UP Farmers, Will Pay Off Their Loans Amounting To Rs 4.05 Crore", "date_publish": "20/11/2018, 16:54:15", "description": "After Maharashtra, megastar Amitabh Bachchan will pay off loans of farmers in Uttar Pradesh and will personally meet some of them to give them their bank letters. He will arrange for 70 farmers to travel to Mumbai and receive their bank letters, his spokesperson has said.", "authors": [], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-to-meet-up-farmers-will-pay-off-their-loans-amounting-to-rs-4-05-crore-357045.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/amitabh_bachchan_1542713386_800x420.jpg"}