{"text": "The toll has risen to 49 after several Jawan who were injured in the Pulwama terror act Attack succumbed. While everyone is paying their condolences to the families of the martyrs, Amitabh Bachchan has decided to donate Rs 5 lakh each to the families of the martyrs.\nConfirming the news, his spokesperson told IANS, “Yes, Mr Bachchan will be giving Rs 5 lakh to each of the martyr's families and is currently finding out the correct process to do so.”\nthe number of the martyr has gone up to 49 .. i am contributing for now 50 .. thats 2.5 cr — Amitabh Bachchan (@SrBachchan) February 16, 2019\nIt is said that Amitabh Bachchan is finding out “from several government sources where and how the amount will be distributed to ensure it is expedited.”\nAmitabh Bachchan had cancelled the his attendance at Virat Kohli's Foundation event, where he was invited as the special guest. The event has now been postponed to Saturday.\nDon't Miss 837 SHARES 781 SHARES 2.1 K SHARES 814 SHARES 555 SHARES\nIn the worst ever terror attack in Jammu and Kashmir since militancy erupted in 1989, a Jaish-e-Mohammad suicide bomber on Thursday rammed his vehicle packed with explosives into a Central Reserve Police Force (CRPF) bus on the Jammu-Srinagar highway in Pulwama district, killing 40 troopers on the spot.\nWith inputs from IANS", "title": "Amitabh Bachchan To Donate Rs 5 Lakh Each To Families Of CRPF Martyrs Of Pulwama Attack", "date_publish": "16/02/2019, 17:40:54", "description": "The toll has risen to 49 after several Jawan who were injured in the Pulwama terror act Attack succumbed. While everyone is paying their condolences to the families of the martyrs, Amitabh Bachchan has decided to donate Rs 5 lakh each to the families of the martyrs.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-to-donate-rs-5-lakh-each-to-families-of-49-crpf-martyrs-of-pulwama-attack-362277.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/amitabh_bachchan_to_donate_rs_5_lakh_each_to_families_of_49_crpf_martyrs_of_pulwama_attack_1550318340_800x420.jpg"}