{"text": "After learning about the plight of farmers through a TV programme, Amitabh Bachchan vowed to help the manual scavengers. He made a promise to donate Rs 50 lakh towards buying mechanical equipment. Fulfilling his promise, he reportedly donated one large and two small machines to the Brihanmumbai Municipal Corporation’s K West ward in Andheri on Saturday. Rest of the machines will be handed over by December, it is said.\nBollywood megastar Amitabh Bachchan has fulfilled a promise he made to help manual scavengers by arranging machines. \"At the NDTV Cleanathon 'Banega Swachh India', seeing the inhuman plight of the manual scavenger, I had committed to buy 50 machines for them. Today I fulfilled that promise! 25 small individual machines and one large truck machine gifted to BMC,\" Amitabh tweeted early on Sunday.\nTwitter\nIn a letter dated November 24, and addressed to the Manual Scavengers Association (MSA) and the BrihanMumbai Municipal Corporation (BMC), the actor said he wanted to do something to prevent manual scavengers from physically and manually going down the manholes and sewer drainages.\n\"My contribution was to prevent the dehumanising work of these scavengers and to give them the respect and dignity in society,\" Big B wrote.\nThe actor had committed Rs 50 lakh towards purchase of machines for the workers.\nT 3005 - At the NDTV Cleanathon , 'banega swachch india' , seeing the inhuman plight of the manual scavenger, I had committed to buy 50 machines for them .. today I fulfilled that promise ! 25 small individual machines and one large truck machine gifted to BMC ! pic.twitter.com/6Xn8PFmv3i — Amitabh Bachchan (@SrBachchan) November 24, 2018\nDon't Miss 553 SHARES 814 SHARES 555 SHARES 144 SHARES\n\"I am donating a large machine to the BMC and with the balance funding, donating smaller machines to the individual workers,\" Amitabh said.\nHe has urged the BMC and MSA to give a report consistently on the right and correct usage of the equipment. The actor has been actively working to help farmers as well.\nWith inputs from IANS", "title": "Amitabh Bachchan Fulfils His Promise, Gifts Machines To Suck Sewage & Wins Hearts!", "date_publish": "25/11/2018, 17:30:43", "description": "After learning about the plight of farmers through a TV programme, Amitabh Bachchan vowed to help the manual scavengers. He made a promise to donate Rs 50 lakh towards buying mechanical equipment. Fulfilling his promise, on Saturday, he donated a suction machine to the Brihanmumbai Municipal Corporation’s K West ward in Andheri.", "authors": [], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-fulfills-his-promise-gifts-machines-to-bmc-for-sewage-cleaning-wins-hearts-357361.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/amitabh_bachchan_1543147636_800x420.jpg"}