{"text": "This year most of us took a pledge to celebrate pollution-free Diwali. But there are few who fail to understand that pollution is slowly killing us and if we do not take precautions now, the world will definitely come to an end very soon. Lots of Bollywood celebrities too requested their fans to not burst crackers in Diwali and celebrate the festival smoke-free.\nThe entire Bollywood too celebrated Diwali with their loved ones and shared the pictures on social media. Amitabh Bachchan too shared happy family pictures celebrating Diwali. But the celebration pictures didn’t go down well with his fans due to firecrackers in Bachchan’s hand. Well, if you see the picture closely, AB is lighting a fuljadi which also creates pollution and it could have been avoided.\nThe fans are brutally trolling Amitabh Bachchan for not celebrating a pollution-free Diwali. Instagrammers had a field day, pointing out how Big B was irresponsible in bursting crackers along with his family.\nInstagram\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nInstagram\nInstagram\nInstagram\nTwitter\nInstagram\nInstagram\nClearly, social media doesn't spare anyone.", "title": "Amitabh Bachchan Gets Trolled By Fans For Bursting Crackers During Diwali", "date_publish": "09/11/2018, 16:11:53", "description": "This year most of us took a pledged to celebrate pollution free Diwali. But there are few who fail to understand that pollution is slowly killing us and if we do not take precautions now, the world will definitely come to an end very soon. Lots of Bollywood celebrities too requested their fans to not burst crackers in Diwali and celebrate pollution free Diwali. The entire Bollywood too celebrat", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-gets-trolled-by-fans-for-bursting-crackers-during-diwali-356359.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/amitabh_1541760509_800x420.jpg"}