{"text": "To commemorate the 100th anniversary of the massacre of hundreds of innocent Indians by British forces at the Jallianwala Bagh, members of the film industry, including Amitabh Bachchan, Sunny Deol, Bhumi Pednekar and Madhur Bhandarkar, paid tributes to the martyrs.\nA century ago, British forces led by Brigadier General Reginald Dyer opened fire on hundreds of unarmed, innocent Indians, including women and children, who were protesting peacefully against the oppressive Rowlatt Act of the British government on April 13, 1919 at Jallianwala Bagh in Amritsar.\nRemembering the horrific incident, Big B tweeted: \"Jallianwala Bagh centenary. In remembrance of the merciless killings by the British and the resolve to rid India of British Colonial rule.\"\nT 3142 - #JallianwalaBaghCentenary .. in remembrance of the merciless killings by the British .. and the resolve to rid India of British Colonial rule — Amitabh Bachchan (@SrBachchan) April 13, 2019\n\"Tribute to martyrs,\" Sunny wrote along with a photograph of the Jallianwala Bagh.\nDon't Miss 233 SHARES 862 SHARES 346 SHARES\n\"Toilet: Ek Prem Katha\" star Bhumi urged people to \"always remember the courage and sacrifice of our freedom fighters\" and to get inspired by their \"valour and contribution into making our country stronger\".\nThis definitely was one of the most heart wrenching dark moments in our history.May we always remember the courage & sacrifice of our freedom fighters.May we get inspired by their valour & contribute into making our country stronger #jaihind #JallianwalaBaghCentenary pic.twitter.com/wMJExJX6rz — bhumi pednekar (@bhumipednekar) April 13, 2019\nActress-turned-politician Kirron Kher said: \"Remembering the innocent souls who were martyred, mercilessly, for taking a stand for our country's independence this day, 100 years ago.\"\nRemembering the innocent souls who were martyred, mercilessly, for taking a stand for our country's independence this day, 100 years ago. #JallianwalaBaghCentenary is a reminder that even the worst of massacres couldn't dampen the spirit of our countrymen. #JaiHind pic.twitter.com/1pWxBcUvlG — Chowkidar Kirron Kher (@KirronKherBJP) April 13, 2019\nAccording to Kirron, \"Jallianwala Bagh centenary is a reminder that even the worst of massacres couldn't dampen the spirit of our countrymen.\"\nBhandarkar posted: \"Let us pay tribute to those who sacrificed their lives for independence movement in Amritsar.\"\nLet’s pay tribute to those who sacrificed their lives for independence movement on 13th April 1919 at #Amritsar.🙏🇮🇳 #JallianwalaBaghCentenary #JallianwalaBaghMassacre #RememberAndNeverForget pic.twitter.com/1gY2gOvVv9 — Madhur Bhandarkar (@imbhandarkar) April 13, 2019\nActress Preity G Zinta shared: \"My heartfelt tribute to the brave hearts and martyrs who lost their lives in the horrific Jallianwala Bagh massacre a century ago. I salute them and their families for their valour. Hope the people of this country remember what it took to get here and always stay united.\"\nMy heartfelt tribute to the brave hearts & martyrs who lost their lives in the horrific #JallianwalaBaghMassacre a century ago. I salute them & their families for their valour. Hope the people of this country remember what it took to get here and always stay united. #respect pic.twitter.com/4yprNtZtUr — Preity G Zinta (@realpreityzinta) April 13, 2019\n(With agency inputs)", "title": "Amitabh Bachchan, Bhumi Pednekar & More Bollywood Celebs Pay Homage to Jallianwala Bagh Martyrs", "date_publish": "13/04/2019, 16:48:21", "description": "A century ago, British forces led by Brigadier General Reginald Dyer opened fire on hundreds of unarmed, innocent Indians, including women and children, who were protesting peacefully against the oppressive Rowlatt Act of the British government on April 13, 1919 at Jallianwala Bagh in Amritsar.", "authors": [], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-bhumi-pednekar-more-bollywood-celebs-pay-homage-to-jallianwala-bagh-martyrs-365399.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/amitabh_bachchan_1555155078_800x420.jpg"}