{"text": "There are some actors in Bollywood who believe in giving it back to society. From extending monetary help to standing up for causes, some Bollywood actors are doing a great job at it. Recent reports claim, Amitabh Bachchan will be paying off loans of over 850 farmers from Uttar Pradesh.\nBig B said he previously helped over 350 farmers from Maharashtra by clearing their loans.\nAgencies\nIn a heartfelt blog-post, Big B poured his heart and explained why he thought it was important to help these farmers. He wrote,\nImage for representational purpose only\n\"It has been a most satisfying experience to give some to them our countrymen that sacrificed their lives for us... 44 families diversified into 112 entities were given out in my small way from Maharashtra, the brave hearts , the SHAHEED. More needs to be done from other parts of the country too. It shall be done. Over 350 farmers loans that were difficult to pay off, and to prevent them from committing suicide, was paid off some days back too... Earlier farmer loans from Andhra and Vidarbha had been done... Now a list of over 850 farmers from Uttar Pradesh have been identified and their loans amounting to over Rs 5.5 crore shall be taken care of... The assistance from the bank in question assists in its execution and its benevolence.\"\nDon't Miss 862 SHARES 346 SHARES\nBig B added that he will be helping Ajeet Singh, who appeared on KBC Karmveer. He added,\n\"Tomorrow a contribution to Ajeet Singh, who was on KBC Karmveer, and who works towards forced prostitution and the protection of young girls being kidnapped and forced into this dastardly crime, is being sent to him to help in his most valiant endeavor.\"\n(With PTI inputs)", "title": "Amitabh Bachchan Proves To Be A Good Samaritan, To Pay Off Loans Of Over 850 Farmers From UP", "date_publish": "20/10/2018, 11:00:21", "description": "Megastar Amitabh Bachchan has revealed he will be paying off loans of over 850 farmers from Uttar Pradesh. The 76-year-old actor said he previously helped over 350 farmers from Maharashtra by clearing their loans. \"It has been a most satisfying experience to give some to them our countrymen that sacrificed their lives for us.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amitabh-bachchan-proves-to-be-a-good-samaritan-to-pay-off-loans-of-over-850-farmers-from-up-355108.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/big_b_loan_1540014241_800x420.jpg"}