{"text": "Bollywood and it’s obsession with remakes isn’t going to fade away anytime soon. Not only the song like Yeh Jawani from SOTY 2 are remixed/remade, but even for movies, the same story is sold in a new bottle all over again.\nonlookersmedia\nNow, popular and hit Tamil movie Kanchana 2 is being remade in Hindi. While Akshay Kumar will play the lead role in it, Kiara Advani has also been roped in for a prominent role. And according to the latest buzz, Amitabh Bachchan is also a part of the movie, and this time he is playing quite a different role.\nAlso Read: Did You Know Amitabh Bachchan Was Once Mistaken For Salman Khan? His Response To It Was Quite Cool!\nIMDB\nDon't Miss 555 SHARES 144 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES\nIf a report in India Today is to be believed, Amitabh Bachchan has been roped in to play the role of a transgender in the movie. Given the fact that Big B has nailed distinct roles like Paa in the past, we’re sure he will ace this one as well.\nYouTube\nIn the Tamil version of the movie, Sarathkumar has played the role of a transgender named Kanchana. In the film, it is said, that Akshay Kumar's character is possessed by a ghost. The film, tentatively titled Laxmi, will not be totally similar to the original though.", "title": "Amitabh Bachchan Will Reportedly Play A Transgender In His Next Film Starring Akshay Kumar!", "date_publish": "28/04/2019, 18:45:54", "description": "Now, popular and hit Tamil movie Kanchana 2 is being remade in Hindi. While Akshay Kumar will play the lead role in it, Kiara Advani has also been roped in for a prominent role. And according to the latest buzz, Amitabh Bachchan is also a part of the movie, and this time he is playing quite a different role -- of a transgender.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-will-reportedly-play-a-transgender-in-his-next-film-starring-akshay-kumar-366246.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/amitabh_bachchan_to_play_a_transgender_in_kanchana_hindi_remake_starring_akshay_kumar_1556456769_800x420.png"}