{"text": "Amitabh Bachchan Showers Aamir Khan With Praise, Says He Is The Beacon That Shines All Over The World\nAmitabh Bachchan Showers Aamir Khan With Praise, Says He Is The Beacon That Shines All Over The World\nMegastar Amitabh Bachchan has been in the industry for too long and understands the potential of young actors and actresses. He has never shied away from praising the younger lot when they have done a phenomenal performance in their respective films.\nThis time around, he has praised superstar Aamir Khan and says that he is the beacon that shines in China and the world from the films in India.\nAmitabh said that the Chinese Ambassador visited the sets of the quiz based show \"Kaun Banega Crorepati\" to praise Bollywood actors, who are most popular in China.\n\"The Chinese Ambassador visits the KBC sets to give praise to the film celebrities that are most popular in his country. He shakes my hand... I shift it to Aamir and tell him Aamir is the beacon that shines in China and the world over from the films in India,\" Big B wrote on his blog.\nChina has emerged as a new market for Hindi films. Aamir's sports biography \"Dangal\" earned a staggering $190 million in China. His \"Secret Superstar\" grossed over Rs 200 crore within five days of its release.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAmitabh and Aamir are now gearing up for the release of their upcoming film \"Thugs Of Hindostan\".\nThe film, which also stars Katrina Kaifand Fatima Sana Sheikh, has been directed by Vijay Krishna Acharya and is set to release on November 8.\nIANS Inputs", "title": "Amitabh Bachchan Showers Aamir Khan With Praise, Says He Is The Beacon That Shines All Over The World", "date_publish": "26/10/2018, 17:55:10", "description": "Megastar Amitabh Bachchan has praised superstar Aamir Khan and says that he is the beacon that shines in China and the world from the films in India. Amitabh said that the Chinese Ambassador visited the sets of the quiz based show \"Kaun Banega Crorepati\" to praise Bollywood actors, who are most popular in China.", "authors": [], "url": "https://www.indiatimes.com/entertainment/amitabh-bachchan-showers-aamir-khan-with-praise-says-he-is-the-beacon-that-shines-all-over-the-world-355527.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/amitabh_bachchan_1540556892_800x420.jpg"}