{"text": "Veteran actor and director Amol Palekar was repeatedly interrupted during his speech at the National Gallery of Modern Art (NGMA) in Mumbai and then cut off after he criticized the government. Mr Palekar was speaking at the opening of an exhibition \"Inside The Empty Box\" in memory of artist Prabhakar Barwe.\nScreengrab\nA video circulating on social media showed Mr Palekar criticising the Ministry of Culture for reportedly scrapping the advisory committees at the gallery's Mumbai and Bengaluru centres.\nRemember how we used to have MASSIVE debates over FoE being killed?\nWhere is the intolerance? @AnupamPKher used to mock those complaining.\nNow there is no debate, now it's open, brazen, unabashed.\nKar Lo Jo Kar Sakte Ho attitude.\nThanks #AmolPalekar for standing up to this BS🙏 pic.twitter.com/KIqYkPUbtY — Akash Banerjee (@akashbanerjee) February 10, 2019\n\"Many of you may not know that this retrospective will be the last show decided by the advisory committee of local artists and not by some bureaucrat or an agent of the government with an agenda of either moral policing or proliferation of certain art commensurate with an ideological incline,\" Amol Palekar said referring to news reports.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nToday, Palekar held a press conference, where he expressed his opinions. Expressing that he was hurt, he said,\nTwitter\n“I was invited as one of the speakers at the event by the NGMA, while speaking there, I was interrupted, I was requested not to speak about this, and you have all seen the video, you know what happened. I was not permitted to deliver the lecture, I couldn’t complete… so many questions have started arising so we are here to address those.”\nANI quoted Palekar as saying,\nAmol Palekar on being asked to cut short his speech at National Gallery of Modern Art, Mumbai: I even told them that I wanted to thank Ministry of Culture for the magnanimity of culture for showing this exhibition.She said she doesn't want any backhand compliment like this & left https://t.co/w1ZnDMSvbS — ANI (@ANI) February 10, 2019\nActor Amol Palekar on being asked to cut short his speech at National Gallery of Modern Art, Mumbai: Director was present there & she even said that I should have spoken to her before speaking this here. I even replied whether my script would be censored before I speak. pic.twitter.com/lF5nuH8bDv — ANI (@ANI) February 10, 2019\n“The director was present there and she even said that I should have spoken to her before speaking this here. I even replied whether my script would be censored before I speak. I told them that I wanted to thank the Ministry of Culture for the magnanimity of culture for showing this exhibition. She said she doesn’t want any backhand compliment like this and left.”\nMany expressed their opinions criticising what happened with him.\nVeteran Actor and Film Maker Amol Palekar being rudely cut off and asked to shut up just because he was mildly critical of Ministry of Culture. There is no Intolerance. Only sycophancy is tolerated pic.twitter.com/pFN6rhQ1g9 — Joy (@Joydas) February 9, 2019\nNo matter who you vote, what happened to Amol Palekar today is most shameful.\nRight wingers will give a shit.\nAnd well liberals I have no hopes from, honestly.\nBut my heart cries. What a gentleman he is. And how rudely that lady spoke. — richa singh (@richa_singh) February 9, 2019\nShocking this video is from @mumbai_ngma , actor Amol palekar was not allowed to speak. This what intolerance is. @sardesairajdeep @sagarikaghose @BDUTT https://t.co/6IRfzofzbp — Ashish Joshi (@SolutionsJoshi) February 9, 2019\nEven more shameful is that there were people in audience who apparently support art, culture, films and allowed Amol Palekar to be humiliated like this by Sycophants of Government https://t.co/6Edu0W724u — Joy (@Joydas) February 9, 2019\nIs this how a veteran actor and a man of Amol Palekar’s stature treated? That video was difficult to watch. — Rituparna Chatterjee (@MasalaBai) February 10, 2019\n(With agency inputs)", "title": "Amol Palekar Lashes Out Against NGMA After Speech Cut-Off, Says 'I Cannot Remain Silent'", "date_publish": "10/02/2019, 16:51:45", "description": "A video circulating on social media showed Mr Palekar criticising the Ministry of Culture for reportedly scrapping the advisory committees at the gallery's Mumbai and Bengaluru centres. \"Many of you may not know that this retrospective will be the last show decided by the advisory committee of local artists and not by some bureaucrat.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amol-palekar-expresses-hurt-after-being-interrupted-during-his-speech-criticising-government-361901.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/amol_palekar_1549799922_800x420.jpg"}