{"text": "\"I remember I was given the narration and even confirmed that I was the heroine of the film and then suddenly I got to know some sugar daddy picked up the phone and his relative was replaced by me.\" Amrita Rao reveals this to Indiatimes in an exclusive conversation.\nTwitter\nTwitter\nWhen we met Amrita she looked the same, she is definitely aging backwards. Looking ravishing in a red and white long dress sitting with a mug of hot water only to keep her cold calm, Amrita talks about how she managed to survive in the industry despite having no sugar daddy.\nIt’s now new that an outsider gets replaced by star kids in this industry. Recently Taapse Pannu was replaced in Pati Patni Aur Woh without giving any reason.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTalking to Amrita about on being replaced by a star kid, she says, “Yes I was, I remember I was given the narration and even confirmed that I was the heroine of the film and then suddenly I got to know some sugar daddy picked up the phone and his relative replaced me in that movie. I don’t mind if that happens, It’s okay, its natural, but I at least wished that the director had the decency to convey it to me gracefully, that for certain reasons we had to change the plan. What hurts you or puts you off is that they do it in an undignified manner.”\nTwitter\nSipping the hot water and looking through the sea view of her hotel room, Amrita regrets of having no senior person to guide in her career which left her longing the success she desired,\n“When you look back you always feel that ‘oh I could have done better’’, that’s a very natural thing, but I guess for somebody who didn’t come from a film background who didn’t have godfather, no sugar daddies, I used to always wish to have some senior actor or actress who could give me an insight of this industry on how to be, how to decline a film so that you don’t hurt fragile egos, there is so much that I learned in my journey which I wish I knew before.”\nConvincingly she adds,\n“I was a like kid who thought I am so nice and everybody would be nice to me, but that doesn’t happen. When you are talented, all your films are doing good back to back, there are some people who get insecure and there is politics going on around you and you do become a victim of those kind of games. But that’s beyond your control, like I don’t have anybody who will pick up the phone for me and get things done or see that I am at the right places, right covers, see that I get the awards if I deserve it, I don’t have anybody who can pick up the phone for me\".\nThe actress is happy with the recent changes in Bollywood, even thankful to Tanushree Dutta who started the #MeToo movement in Bollywood, “Kudos to Tanushree Dutta who actually flagged off the MeToo Movement in India, she gave a lot of strength to women who were quiet and scared to speak up, they were still bottled in their experience. I really appreciate her. Secondly, it’s great that this fear psychosis is now around, if you mess around you will be tarnished for life on the internet. And that is why a lot of men have put their act together. Now they are scared to be frivolous and flirtatious even on phone chats with women, I think that’s so good. The reason why women were targeted is because we live in a society where victims were made to feel like it was their fault and MeToo has really changed that”.\nAmrita feels she is fortunate enough to never be a victim of being sexually harassed, “Fortunately it has not happened to me because I always had my mom with me around the sets. Also I belong to the city, to a good family, who didn’t really depend on the film industry for a lifestyle, all this matters because people who tend to take you in a ride because they know, you are a weaker person, even when you saw the victims of MeToo, they were not from the cities, no godfathers, parents had no idea about what’s happening, they were taken for a ride and that is so sad, it’s terrible.”\nAmrita Roa’s positive attitude toward life is truly inspiring. The actress will next be seen in Thackeray alongside Nawazuddin Siddiqui.", "title": "Amrita Rao Reveals She Was Once Replaced By A Star Kid Without Any Reason, Calls It 'Undignified'", "date_publish": "21/01/2019, 16:17:48", "description": "When we met Amrita she looked the same, she is definitely aging backward. Looking ravishing in a red and white long dress sitting with a mug of hot water only to keep her cold calm, Amrita talks about how she managed to survive in the industry despite having no sugar daddies.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/amrita-rao-reveals-she-was-once-replaced-by-a-star-kid-without-any-reason-calls-it-undignified-360787.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/amrita_rao_1548069332_800x420.jpg"}