{"text": "Amrita Rao Feels She Should Have Done More Films With Shahid After 'Vivah' But It Didn't Happen\nAmrita Rao Feels She Should Have Done More Films With Shahid After 'Vivah' But It Didn't Happen\nBollywood actress Amrita Rao is one of the few celebrities who looks like the girl next door even after so many years. Her claim to fame was Ishq Visq and Main Hoon Na and she soon became a popular face.\nFamilies connected with her innocence and choice of films. But she soon took a gap after her wedding. And now the actress is back again with Thackeray. She will be seen playing Meenatal alongside Nawazuddin Siddiqui.\nIn of our earlier interviews, Amrita had revealed how she lost out on big projects because she has no sugar daddies. She also has reservations in doing love making scenes.\nShe said: \"As the cinema is changing, on-screen kissing, love-making scenes are becoming part of the narrative. I am not saying it is wrong, because it is the reflection of how our society has changed and become comfortable with it. But I am uncomfortable performing it on screen. Love-making is so personal to me that if I do it on screen, it is like I am leaving a part of my soul. I cannot do that.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nAccording to her, it is not about \"right or wrong, it is just about a choice that we all make.\"\nHer performance and on-screen chemistry with actor Shahid Kapoor in Ishq Vishq and Vivah was highly appreciated.\nYoutube\nWhen asked if she would like to act with him again, Amrita said: \"Well after 'Vivah', we should have done more films together but I really do not know why it did not happen. The good thing is that there is still an audience waiting for us to come together and do a film. Like audience, even I am looking forward to such an occasion to happen.\"\nAmrita also said that she would like to work with actor Ayushmann Khurrana in because she \"enjoys watching him on screen a lot.\" Here's hoping we get to see more of her in the coming year.\nInputs from IANS", "title": "Amrita Rao Feels She Should Have Done More Films With Shahid After 'Vivah' But It Didn't Happen", "date_publish": "27/01/2019, 16:50:23", "description": "Actress Amrita Rao says she does not feel comfortable in doing love-making scenes on screen. In an interview to IANS, Amrita spoke about her return on big screen after a long time with the film Thackeray and why she does not like to be a part of \"love-making\" scenes anymore. She said: \"As the cinema is changing, on-screen kissing, love-making scenes are becoming part of the narrative. I am not say", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/amrita-rao-feels-she-should-have-done-more-films-with-shahid-after-vivah-but-it-didn-t-happen-361135.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/amrita_1548592022_800x420.jpg"}