{"text": "Comic book legend Stan Lee passed away early this week. The Marvel creator was 95 and had been keeping unwell for quite sometime before he breathed his last. Celebrities from across the world are in shock and have been mourning his demise.\nTwitter\nFrom Ryan Reynolds, Chris Evans and Arnold Schwarzenegger among others have been tweeting and remembering their fondest memories with him.\nStan Lee created more legends than any of us can count, but his own life was the greatest story he ever wrote. He inspired billions around the world, including me, and I was honored to know him. pic.twitter.com/CGNWG6BArc — Arnold (@Schwarzenegger) November 13, 2018\nThere will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!! — Chris Evans (@ChrisEvans) November 12, 2018\nDon't Miss 4.3 K SHARES 130 SHARES 1.1 K SHARES\nStan Lee was the co-creator of Spider-Man, Iron Man, Hulk, X-Men, Black Panther, Daredevil, The Avengers whose comic book book characters turned into mega movie franchises. He frequently even made cameo appearances in those movies based on Marvel characters.\nAnd now Amul has paid a homage to the legend. In the poster, Stan Lee can be seen standing in front of all his superheroes. Captioning the tribute, Amul wrote - \"Tribute to comic-book icon, creator of the modern superhero.\"\nStan Lee is survived by his daughter Joan Celia Lee. Strength to the entire family during this tough time.", "title": "Amul Gives A Heartwarming Tribute To Comic-Book Icon Stan Lee, Calls Him 'A Marvel Of A Man'", "date_publish": "14/11/2018, 12:14:06", "description": "stan lee, comic book, iron man, spider-man, superhero, stan lee passes awaystan lee, comic book, iron man, spider-man, superhero, stan lee passes awaystan lee, comic book, iron man, spider-man, superhero, stan lee passes awaystan lee, comic book, iron man, spider-man, superhero, stan lee passes awaystan lee, comic book, iron man, spider-man, superhero, stan lee passes awaystan lee, comic book, iro", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/amul-gives-a-heartwarming-tribute-to-comic-book-icon-stan-lee-calls-him-marvel-of-a-man-356626.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/stan_lee_1542178260_800x420.jpg"}