{"text": "Amy Jackson Drops The News Of Her Pregnancy With The Sweetest Post, Celeb Friends React!\nAmy Jackson Drops The News Of Her Pregnancy With The Sweetest Post, Celeb Friends React!\nPosting a beautiful picture with her fiance and a baby bump, Amy Jackson announced the news of her pregnancy on social media today. Any Jackson is engaged to George Panayiotou and she dropped the news of her engagement on January 1.\nToday, sharing the details of the latest addition in her family, she wrote,\n\"I’ve been waiting to shout it from the roof tops, and today, being Mother’s Day couldn’t be more perfect... I already love you more than anything in this world, the purest most honest love. We can’t wait to meet you our little Libra one.\"\nAmy's post went viral on the internet and all her celebrity friends reacted and expressed their joy with their congratulatory messages. Read on!\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAmy has chosen to embrace motherhood and is welcoming the new phase in her life with open arms. While the rumours of her wedding dates were all over the internet, her announcement only proves that she is not in any hurry to tie the knot.", "title": "Amy Jackson Drops The News Of Her Pregnancy With The Sweetest Post, Celeb Friends React!", "date_publish": "31/03/2019, 18:02:43", "description": "Amy has chosen to embrace motherhood and is welcoming the new phase in her life with open arms. While the rumors of her wedding dates were all over the internet, her announcement only proves that she is not in any hurry to tie the knot. Amy's post went viral on the internet and all her celebrity friends reacted and expressed their joy with their congratulatory messages. Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/amy-jackson-drops-the-news-of-her-pregnancy-with-the-sweetest-post-celeb-friends-react-364645.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/amy_jackson_1554036234_800x420.jpg"}