{"text": "Amyra Dastur Feels It's Important For Actors To Be Patient And Wait For The Right Role\nAmyra Dastur Feels It's Important For Actors To Be Patient And Wait For The Right Role\nAmyra Dastur has had the most eventful 2018. From featuring on television, in movies and web series, Amyra’s face was seen across every possible medium this year. For those of you who don’t know, Amyra began her Bollywood career back in 2013 with Issaq, and Mr. X in 2015.But she rose to fame with Kung Fu Yoga last year.\nImstagram/Amyra Dastur\nAnd since then, there has been no looking back. We got talking to Amyra Dastur for our exclusive year-ender special and she had some wonderful things to say about 2018 and what it taught her.\nIt was the most progressive year for Amyra and we agree\nIt’s honestly been the most progressive and successful year for me career wise. I’ve never felt more grateful. Rajma Chawal is doing well on Netflix, and the audience seems to be loving our little slice of life film! I’ve managed to bag three Bollywood films, which are all slated to release in 2019; Mental Hai Kya, Prassthanam and Made In China, along with a film opposite Prabhudeva in Tamil.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nApart from this, my first-ever web series produced by Disney, ‘The Trip 2’, is being loved by people all over. I’ve just been working and constantly finding ways to improve myself and better myself to keep the work as great and consistent as it has been for me in 2018.\nFrom Kung Fu to Rajma Chawal, Amyra is breaking stereotypes - Patience is key\nIt was definitely a struggle. Issaq didn’t do well at the box office, , but I got a lot of positive responses for my acting, I then went the commercial route and started feeling that I was only being seen as the quintessential pretty girl. ‘Rajma Chawal’ has broken that notion but it took me a while to get here.\nI was in the South for two years before I got my third Hindi film - Rajma Chawal, and I truly believe that acting there and gaining experience from those projects is what has enabled me to grow as an actor and bag more good content-driven work. But yes, finally being here was hard and filled with days of disappointment and rejection, and I know I still have a long way to go, but I’m definitely more confident and wiser.\nAmyra feels there's no real difference between movies and web-series - Content should matter, not the medium\nInstagram/Amyra Dastur\nIt’s absolutely the same thing. There’s a script, a director and a camera. It’s like shooting for a film or an advertisement. The technical aspect is the same but the one advantage I feel one has as an actor while shooting for a web series over a film is that a web series is shot in one single schedule/period of time. This makes it easier to stay in character and concentrate on that particular role. When you’re shooting a film, for e.g.; Mental Hai Kya, we Shot In May and then August and now finally in December.\nGetting back into the character one is playing, especially in a psychological thriller such as this, is a challenge. With more experience, I feel like I will find it easier, but for now, it’s something I am conscious of and plan to work on as time goes by. Trust the universe – what’s meant to be yours will be yours.\n2018 has taught Amyra Dastur to trust the Universe\n2018 taught me to believe in myself and learn to be a little patient as an actor. Just trust the universe at the end of the day. Wait for the right path and role to come along.\nI struggled a lot in the beginning of my career because I was younger, restless, and immature. Now, with age and work experience, even filming with people who were not my age, made me learn so much. This was the highlight of this year. From Rajkummar Rao, Boman Irani, Sanjay Dutt, Rishi Kapoor, you learn so much with these kinds of people.\n#Metoo Movement - As an outsider, I can see the difference in the way men are talking to women now\nThe biggest takeaway from #MeToo is how cautious men are now while talking to women Not only in the industry, but people are careful and watching their words, which means change is happening. Now let’s see what happens. In fact, newbies will now find it easier to make their way as other people are more alert.", "title": "Amyra Dastur Feels It's Important For Actors To Be Patient And Wait For The Right Role", "date_publish": "21/12/2018, 16:38:32", "description": "amyra dastur, year ender, bollywood, rajma chawal, the trip, moviesamyra dastur, year ender, bollywood, rajma chawal, the trip, moviesamyra dastur, year ender, bollywood, rajma chawal, the trip, moviesamyra dastur, year ender, bollywood, rajma chawal, the trip, moviesamyra dastur, year ender, bollywood, rajma chawal, the trip, moviesamyra dastur, year ender, bollywood, rajma chawal, the trip, movi", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/amyra-dastur-feels-it-s-important-for-actors-to-be-patient-and-wait-for-the-right-role-358007.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/amyra_1544008689_800x420.jpg"}