{"text": "An All-Male Film Panel Met PM Modi To Discuss Nation Building, People Ask Where Are The Women?\nAn All-Male Film Panel Met PM Modi To Discuss Nation Building, People Ask Where Are The Women?\nLast evening a panel of people including Aamir Khan, Rajkumar Hirani, Aanand L Rai, Ritesh Sidhwani, Siddharth Roy Kapur, Maulik Bhagat, and Mahaveer Jain met PM Modi to discuss how the entertainment industry can contribute more in nation-building.\nThe picture was posted by Film critic and business analyst Taran Adarsh and has gone viral on the internet in less than 24 hours. Can you guess why?\nHon Prime Minister Shri Narendra Modi meets film industry delegation: Aamir Khan, Rajkumar Hirani, Aanand L Rai, Ritesh Sidhwani, Siddharth Roy Kapur, Maulik Bhagat and Mahaveer Jain... How entertainment industry can contribute more in nation building was discussed. pic.twitter.com/VKbWvhqnso — taran adarsh (@taran_adarsh) October 25, 2018\nWell, the outrage over this picture built up when people spotted that this panel didn't include even one single woman from the film industry.\n\"Where is Rima Das? Her movie is going for Oscars and she has not been included? wrote one user.\nOther users pointed out how this panel can discuss nation building and development without a single woman in sight.\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\nToday, when we talk about women empowerment and feminism, it is shocking and sad to see that no woman could make the cut in the list of members of the panel. This picture triggered a lot of anger and angst among people who couldn't stop but asking, \"Where are the women?\".\nIn case you are wondering what made the netizens angry today, these tweets sum up the reason well.\nAamir and other male representatives from Bollywood met PM Modi to discuss issues plaguing the industry. The manel was very successful and the lack of female representation was not noticeable. pic.twitter.com/Ec6UAJHmL5 — Shilpa Rathnam (@shilparathnam) October 26, 2018\nNot even a single women there! This pic is from industry which portrays itself as forefront of equality and social justice! — Vinay (@vnay_85) October 25, 2018\nKoi inhe inclusivity ka memo bhej do please https://t.co/2XVGkoHcUz — Aakriti Mehrotra (@Aakriti1) October 26, 2018\n1. Where are women? 2. Why only Hindi belt? https://t.co/8RxxLJkDRA — Amanuensis (@amansrvstv1) October 26, 2018\nWHERE ARE THE WOMEN https://t.co/0mdRHYDTkA — Srishti Dixit (@srishtidixit) October 26, 2018\n....By including more women in delegations and making Bollywood a safer place for women https://t.co/0HdhAjWBa9 — Faye DSouza (@fayedsouza) October 26, 2018\nThey couldn't find a single woman to be part of that delegation, to discuss the entertainment industry's contribution to nation building. Women aren't part of nations, or the entertainment industry. (Or maybe even some buildings.) Patriarchy upholds everything 🤷 https://t.co/qt4wDEAvFh — Vijayeta (@SacredInsanity) October 26, 2018\nSerious? Not a single woman in the delegation? https://t.co/YY3uBSZSSx — Nigel Britto (@NigelBritto) October 26, 2018\nHey Hon. PM, where are the brave women from #Bollywood who spoke up? Need to build the nation? Involve women! #MeTooIndia https://t.co/Ws3cWo0PSW — Hanisha Lalwani (@HanishaLalwani) October 26, 2018\nWhat?! No women in this gathering? Entertainment industry has women as an intrinsic part of it. How do they dream of nation building without involving women in the process? Disappointing. https://t.co/bXRQjNm9ET — N (@_morphiine_) October 26, 2018\nSo many women, wow. We're truly moving towards a equal society. We totally don't need feminism. Pfft. https://t.co/XJCVA1GNRg — Sulagna Chatterjee (@BeingChatterjee) October 26, 2018\nAnd ya'll didn't think it was important to have some women be a part of this? https://t.co/fMkfMAjxcQ — Junisha Dama (@bandeatqueen) October 26, 2018\nNO woman in the delegation!! These producers possibly think they can make the film and build the nation without women’s participation. https://t.co/jbJJWG1aHP — Kanchan Srivastava (@Ms_Aflatoon) October 26, 2018\nWomen may hold up half the sky, but they can't touch the proverbial glass ceiling. https://t.co/k5pmwo3hhE — Kiran Manral (@KiranManral) October 26, 2018\nThe Indian entertainment industry has only men. Impressive. https://t.co/bXnQ4jo8jg — kamalika ghosh (@GhoshKamalika) October 26, 2018\nThere are apparently no women to represent Bollywood... https://t.co/Fc0Sm42ZtV — Rohan Sandhu (@Rohan_Sandhu) October 26, 2018", "title": "An All-Male Film Panel Met PM Modi To Discuss Nation Building, People Ask Where Are The Women?", "date_publish": "26/10/2018, 13:58:01", "description": "Everyone has just one question after seeing the picture. Where are the women? Everyone has just one question after seeing the picture. Where are the women? Everyone has just one question after seeing the picture. Where are the women? Everyone has just one question after seeing the picture. Where are the women?", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/an-all-male-film-panel-met-pm-modi-to-discuss-nation-building-people-ask-where-are-the-women-355499.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/women_1540543678_800x420.jpg"}