{"text": "Every Bollywood celebrity feels paparazzi has a tendency to go overboard. Some like it, some hate it but no one can do anything about it. The constant media glare on celebrities has left them a tad irritated which is understandable. Be it at the gym, airport, salon, restaurant or even home, they are followed. Nobody can deny that their personal space has been killed. But one can't help it.\nViral Bhayani\nIf the papz stop covering them, they complain (the classic example is Karan Johar, the director was shattered when he saw no papz at the airport one day and we wore his favorite jacket to flaunt) and if they do they still complain well, all we can say too many cooks spoil the broth.\nWas about to land! Wore a new jacket! Product in hair! Big sun glasses were put on! New bag pack positioned for capture! And then....the worse thing happened!!!!! The paps Were NOT there!!!!! Shattered! Will now repeat this look and pray! — Karan Johar (@karanjohar) March 11, 2018\nSome of the celebs even lose their cool and request or yell at the papz to stop following them. The latest is Janhvi Kapoor. She is been followed anywhere and everywhere which has made her irritated. PS: Earlier loved when paparazzi followed and clicked her but now she too is fed up with the overexposure and we get it.\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nViral Bhayani\nThe latest video of Jahnvi telling papz, ‘Gym Se Zyaada Aap Logon Ke Liye Taiyar Hoke Aana Padta Hai’ outside her gym is going viral. In the video, you can clearly see how miffed she is to be under the constant media glare.\nHowever, the irony is despite Jahnvi being upset the papz waited for her return took her pictures and then left. What dedication, Applause!\nApart from Janhvi, Kareena Kapoor Khan who is the favourite muse if the papz she too has been requested to stop following her and her son Taimur wherever they go.\nBebo and Saif Ali Khan time and again have expressed how worried they are about their son Taimur being clicked wherever he goes.\nAfter all, said and done, we just hope the papz draw a line which will maintain the healthy relationship between the celebrities and them.", "title": "An Irritated Janhvi Kapoor Tells The Paparazzi ‘ Gym Se Zyaada Aap Logon Ke Liye Taiyar Hoke Aana Padta Hai’ & We Get Her", "date_publish": "08/03/2019, 15:18:44", "description": "Every Bollywood celebrity feels paparazzi have gone out of the board. Some like it, some hate but no one can do anything about it. The constant media glare on the celebrity has left them a tad bit irritated and upset and we totally feel them, Be it at the gym, airport, salon, restaurant or even home they are followed, well it won’t be a denying today that their personal space has been killed up th", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/an-irritated-janhvi-kapoor-tells-the-paparazzi-gym-se-zyaada-aap-logon-ke-liye-taiyar-hoke-aana-padta-hai-we-get-her-363387.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/janhvi_kapoor_1552039754_800x420.jpg"}