{"text": "Most of us watch movies for entertainment, but some of them represent the society, real events and issues. Some of them are so thought provoking that they make you think deeply. One such movie was Amitabh Bachchan and Taapsee Pannu-starrer Pink.\nNo means no – is a phrase that became popular for all the right reasons after Pink released. Shoojit Sircar’s production stressed on the importance of consent. The movie represented the issue of gender equality so brilliantly that it struck a chord with almost everyone who watched it.\nTwitter\nPink is now getting a Tamil remake. Boney Kapoor who is producing the movie says it’s an ode to his late wife Sridevi. He revealed that Sridevi wanted Ajith to be cast in the role of Amitabh Bachchan and fulfilling her wish, Boney Kapoor has indeed done the same.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“While working with Ajith in English Vinglish, Sridevi had expressed her desire that Ajith does a Tamil film for our home production. Nothing exciting came up till one day last year. Ajith suggested remaking Pink in Tamil. She immediately agreed as she thought it was most appropriate and timely film to make and Ajith would bring all the elements required to make it into a great Tamil film,” Boney Kapoor had earlier told IANS.\nTwitter\nWhat’s more Vidya Balan will also make a special appearance in the movie. The Tamil remake of Pink has been titled AK 59. Apart from Pink, Boney Kapoor is also planning to remake Badhaai Ho in Telugu and Tamil, he told DNA.", "title": "An Ode To Sridevi! Boney Kapoor Fulfills Late Wife’s Wish, To Remake ‘Pink’ In Tamil With Ajith", "date_publish": "31/01/2019, 17:58:37", "description": "Pink is now getting a Tamil remake. Boney Kapoor who is producing the movie says it’s an ode to his late wife Sridevi. He revealed that Sridevi wanted Ajith to be cast in the role of Amitabh Bachchan and fulfilling her wish, Boney Kapoor has indeed done the same. The Tamil remake of Pink has been titled AK 59. Apart from Pink, Boney Kapoor is also planning to remake Badhaai Ho in Telugu and Tamil,", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/an-ode-to-sridevi-boney-kapoor-fulfills-late-wife-s-wish-to-remake-pink-in-tamil-with-ajith-361388.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/an_ode_to_sridevi_boney_kapoor_fulfils_late_wifes_wish_to_remake_pink_in_tamil_with_ajith_1548934916_800x420.png"}