{"text": "An Old Video Of Drake Inappropriately Kissing And Touching A Minor At A Concert Goes Viral\nAn Old Video Of Drake Inappropriately Kissing And Touching A Minor At A Concert Goes Viral\nDrake is one of the finest rappers we have in the world today. Every song that he releases creates fireworks on the Youtube page-views and becomes an instant hit.\nBut recently the Rapper has been receiving a lot of backlash on social media over a video in which he can be seen kissing and inappropriately touching a 17-year-old girl during one of his previous concerts.\nAccording to a YouTube user, the video that is now viral, was filmed in 2010 and took place at a show in Denver, reports eonline.com.\nIn the clip, the rapper, then 23 years old, is seen dancing with the girl, then kissing her shoulder and hugging her around her chest while standing behind her.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\ndrake kisses underage girl, learns she’s underage, then kisses her again but this time feels her breasts pic.twitter.com/oLkxZccHiS — SPOOK GOD ALLAH (@thespookgod) January 4, 2019\nAfter calling the girl onstage, Drake even asked her age, to which the girl replied that she is 17.\nMany people took to Twitter to voice criticism of Drake over the video, with some also mentioning his controversial friendship with 14-year-old \"Stranger Things\" star Millie Bobby Brown.\nInputs from IANS", "title": "An Old Video Of Drake Inappropriately Kissing And Touching A Minor At A Concert Goes Viral", "date_publish": "06/01/2019, 17:10:23", "description": "Rapper Drake is receiving a lot of backlash on social media over a video in which he can be seen kissing and inappropriately touching a 17-year-old girl during one of his previous concerts. According to a YouTube user, the video that is now viral, was filmed in 2010 and took place at a show in Denver, reports eonline.com.", "authors": [], "url": "https://www.indiatimes.com/entertainment/an-old-video-of-drake-inappropriately-kissing-and-touching-a-minor-at-a-concert-goes-viral-359947.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rapper_drake_1546775262_800x420.jpg"}