{"text": "\"Kaamyabi aur nakaamyabi ... insaan khud hi chunta hai\"\nNine years ago, Zoya Akhtar entered the world of films and delivered a film that showcased the brutality and fragility of dreams and human relationships. Without being too harsh, the story of her film was painful and endearing in equal measures.\nTwitter\nThe film didn't garner commercial success but was successful in being an important film which we will remember for years to come. Luck By Chance was an important film and not because of the star-cast that boasted of some of the most successful actors of the film industry but because it was all about love, dream and broken hearts.\nExcel Entertainment\n\"Yahan talent ke saath saath luck bhi bahut bada factor hota hai..\"\nTaking a dig at nepotism and the 'jugaad' that forms the center of the film industry, Zoya Akhtar blends emotions into a cocktail that you enjoy sip by sip. Each and every character is paced with the idea of showcasing different elements that form the harsh and hard-hitting reality of stardom.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nExcel entertainment\nToday, the film completes 9 years of its release so let's take you back to the era where Zoya managed to create the perfect world of madness with some of the most imperfect and real characters. Read on!\n1. Stardom ek cocktail hai ... fame, power, money ... bahut khatarnaak nasha hai: The brutal truth of the film industry: Where success and numbers are considered bigger than excellence\nProducer Romy Rolly (Rishi Kapoor) just wants a hit film. Without recognising what the audience wants or what the major focus of the storyline of his film would be, he only chases 'A-listers' in attempt to crack the shortcut to delivering a hit film. His struggles were shown with a pinch of comedy but the reality hit really hard. There is a scene where Zafar Khan (Hrithik Roshan) ditches him last minute and the way Romy Rolly breaks down in front of his wife (Juhi Chawla) shows the fragility that comes as an extra baggage for people who are trying too hard to succeed in the film industry.\n2. Sapne toh sabi dekhte hai ... lekin sirf wohi sapna sakaar hota hai ... joh lakh samjhane par bhi insaan bhulana nahi chahta: Closed doors and broken doors isn't the end of your story. Sometimes smaller opportunities grant you more success and recognition than bigger ones.\nExcel Entertainment\nFor Sona Mishra (Konkona Sen), life wasn't a bed of roses. A small town girl was trying too hard to succeed in an industry that's often brutal and heartbreaking. From losing out to opportunities that she sincerely chases to infidelity, Sona's perseverance proves that no matter how hard things get, having your heart in the right place is important.\n3. Unhe mat bhulo, joh tumhe tab jaante the jab tum kuch nahi the ... kyunki bas yeh hi hai, joh tumhe hamesha sach bolenge: Holding on to people who were at your worst is important to retain your true self when success knocks your door\nShah Rukh Khan's cameo in the film is one of my favourite scenes of the film. He talks to Vikram and explains how stardom can get to one's head. He subtly tells him that it's important to know who your people are and how to hold on to them.\n4. Relationships work only on commitment and sincerity\nIn their phase of loneliness and struggle, Sona and Vikram find companionship in each other. Their friendship blossoms to love but it ends on a heartbreaking note after he starts seeing his co-star. Zoya Akhtar's way of showing the ups and downs of a relationship that finds itself in the center of such complexities deserves attention.\nIn one of the scenes after the breakup, Sona receives a gift hamper which is a fridge. After realizing that Vikram (who was the brainchild behind the contest entry of the competition) is no more in her life, she sits blank and stares. The scene is hard-hitting because it beautifully depicts the pain and longing of a lover's heart.\n5. Mauke milte nahi, banaye jaate hai ... kaamyabi hum tak nahi aati, hum mein kaamyabi tak jaana hota hai: Even when your dreams shatter, there's always light at the end of the dark tunnel\nSona's dream of making her debut in a big banner film must have failed but she found other small TV projects that earned her respect and recognition. In one of the scenes, Sona, who is heartbroken tearfully tells a producer that she has talent and he replies, “Woh kisse chahiye?”. Zoya AKhtar has her way of piercing right through your heart and in no time, your heart is full as you feel empathetic for Sona.\n6. When you commit yourself to someone, you can't allow yourself to see perfection in someone else. Love is all about compassion and commitment.\nExcel Entertainment\nVikram and Sona's failed love story teaches us a lot about the delicate nature of relationships that blossom out of pure convenience. However, when life really happens, these relationships break like an eggshell. Vikram gets attracted to her young co-star and Sona's insecurities as his girlfriend increases. Luck By Chance is all about heart and the fragility and failure of Sona-Vikram's relationship proves love is all about commitment and without it, it just fades away.\n7. Not everyone deserves a second chance and one must know when to let go.\nForgiveness is liberating but one must know when to let go. In the last scene, Vikram confronts Sona and begs for forgiveness. Sona, who has clearly moved on in life tells him that even if she gives them another chance, his habit of hovering around and looking for newness would never guarantee stability in the relationship. The film ends with Sona walking out of her shoot and finding her solace in whatever little opportunities she finds proving that in between painful closures, new beginnings-life happens.", "title": "An Underrated Story Of Broken Dreams: 7 Takeaways From Zoya Akhtar's Luck By Chance", "date_publish": "30/01/2019, 18:39:57", "description": "Each and every character is paced with the idea of showcasing different elements that form the harsh and hard-hitting reality of stardom. Today, the film completes 9 years of its release so let's take you back to the era where Zoya managed to create the perfect world of madness with some of the most imperfect and real characters. Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/an-underrated-story-of-broken-dreams-7-takeaways-from-zoya-akhtar-s-luck-by-chance-361327.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/luck_by_chance_1548852909_800x420.jpg"}