{"text": "Even if you are not a Marvel fan, we are sure, you must have heard about the crazy fandom for Avengers: Endgame, the movie which will conclude over 22 marvel films. A lot of superheroes died in Infinity War and many more will follow, unfortunately.\nAFP\nFans have been waiting for the movie for so long. And as the release date (April 26 in India and April 25 in the US) is nearing, we can see the crazy fandom already. It’s not a film that any Marvel fan would miss, after all.\nAP\nThe advance bookings of Avengers: Endgame has already begun in the US. Who doesn’t want to watch the movie first day first show? Or else, your friends might give you the spoilers.\nBCCL\nSo, when it all began, cinema websites crashed. So much so, that movie has already made a record of most pre-sales tickets purchased within 24 hours. What’s more? The tickets are being resold on ebay for as much as USD 9199 (Rs. 635259.94). Don't believe us? Check it out!\neBay\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nLmao ppl are selling avengers endgame tickets for 10000$, in France release date is 24 (vs 26 in USA) so with that 10000$ u can go on vacation but hey Americans are pure retards — entropy (@BuyMeAGolden) April 4, 2019\npeople are selling Avengers Endgame tickets for 10000$ — SABBIR AHMED (@SabbirHSTU17) April 4, 2019\nIt's getting crazy!\nAlso Read: Avengers Director Joe Russo Inspired By Rajinikanth's Robot, Also Loved Watching Salman Khan’s Dabangg", "title": "And The Frenzy Begins! People Are Selling Avengers: Endgame Tickets On eBay For Rs 6,35,260", "date_publish": "04/04/2019, 19:03:29", "description": "The advance bookings of Avengers Endgame have already begun. Who doesn’t want to watch the movie first day first show? Or else, your friends might give you the spoilers. So, when it all began, cinema websites crashed. So much so, that movie has already made a record of most pre-sales tickets purchased within 24 hours. What’s more? The tickets are being resold on ebay for as much as USD 9199 (Rs", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/and-the-frenzy-begins-people-are-selling-avengers-endgame-tickets-on-ebay-for-rs-6-35-260_-364898.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/the_frenzy_begins_people_are_selling_avengers_endgame_tickets_on_ebay_for_almost_rs_635260_1554383375_800x420.png"}