{"text": "And So It Begins! PC-Nick Jonas Arrive In Jodhpur To Kick-Start Their Destination Wedding\nAnd So It Begins! PC-Nick Jonas Arrive In Jodhpur To Kick-Start Their Destination Wedding\nBegin the *drum rolls* as Priyanka Chopra and Nick Jonas have left the Bay to finally begin their happily ever after. The love-birds are all set to tie the knot in Jodhpur and the celebrations have just kick-started for the families.\nAfter a Puja at Dr. Madhu Chopra's place last afternoon, the couple along with their families flew down to Jodhpur in the wee hours of the morning.\nPC and Nick were accompanied by mother, Madhu Chopra, cousin Parineeti Chopra, and other relatives. Also seen were Nick’s brother Joe Jonas and Joe’s fiancé and Games of Thrones star Sophie Turner.\n(Also read: Sansa Stark Goes 'Desi', Dons An Exquisite Salwar-Suit For PC - Nick Jonas' Wedding Puja)\nViral Bhayani\nViral Bhayani\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nViral bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nA DNA report claims that Jodhpur celebrations will begin with mehendi and sangeet ceremony on November 29 at the Umaid Bhawan Palace.", "title": "And So It Begins! PC-Nick Jonas Arrive In Jodhpur To Kick-Start Their Destination Wedding", "date_publish": "29/11/2018, 11:33:42", "description": "Begin the *drum rolls* as Priyanka Chopra and Nick Jonas have left the Bay to finally begin their sweet forever. The love-birds are all set to tie the knot in Jodhpur and the celebrations have just kick-started for the families.After a Puja at Dr. Madhu Chopra's place last afternoon, the couple along with their families flew down to Jodhpur in the wee hours of the morning.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/and-so-it-begins-pc-nick-jonas-arrive-in-jodhpur-to-kick-start-their-destination-wedding-357572.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_chopra_and_nick_jonas_1543470083_800x420.jpg"}