{"text": "AndhaDhun Director Sriram Shares What It Took To Make This ‘IMDb’s Top Rated Movie Of 2018’\nAndhaDhun Director Sriram Shares What It Took To Make This ‘IMDb’s Top Rated Movie Of 2018’\nThe edge-of-the-seat thriller Ayushmann Khurrana’s Andhadhun was a wild trip for the audiences. Based on the French short film The Piano Tuner, the movie had many twists and turns, which made it an intriguing watch throughout. Not long ago, the movie was declared as IMDb’s top-rated movie of 2018. Now, the director Sriram Raghavan has shared what it takes to make a movie like Andhadhun.\nAndhaDhun won four honours, including the Best Director, at the Star Screen Awards. Sriram Raghavan, who helmed the edge-of-the-seat thriller is thrilled.\nApart from the Best Director trophy for Raghavan, the Ayushmann Khurrana and Tabu-starrer on Sunday night bagged the Best Film Writing for Arijit Biswas, Yogesh Chandekar, Hemant Rao, Pooja Ladha Surti and Raghavan; the Best Editing for Pooja Ladha Surti; and Best Sound Design for Madhu Apsara.\nRaghavan said in a statement, \"I'm very happy with the audience response that 'AndhaDhun' has had. The awards of course are an icing on the cake.\nbccl\nDon't Miss 862 SHARES 322 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"A film like this not only requires complete creative freedom but also the belief and support of its producer, and I got that abundantly from Sanjay Routray and Matchbox Pictures. Looking forward to more such collaborations.\"\nEarlier this year, AndhaDhun emerged as a runaway success at the box office, winning high critical acclaim and big audience applause. It is also the top Indian movie of 2018, as determined by IMDb customer ratings.\n\"What began as shared passion for us has culminated in recognition from audiences. I am very grateful to Star Screen Awards for these awards, and to Sriram for his unique, uncompromising vision,\" Routray said.\nInputs From IANS", "title": "AndhaDhun Director Sriram Shares What It Took To Make This ‘IMDb’s Top Rated Movie Of 2018’", "date_publish": "17/12/2018, 15:04:37", "description": "AndhaDhun won four honours, including the Best Director, at the Star Screen Awards. Sriram Raghavan, who helmed the edge-of-the-seat thriller is thrilled. Apart from the Best Director trophy for Raghavan, the Ayushmann Khurrana and Tabu-starrer on Sunday night bagged the Best Film Writing for Arijit Biswas, Yogesh Chandekar, Hemant Rao, Pooja Ladha Surti and Raghavan; the Best Editing for Pooja", "authors": [], "url": "https://www.indiatimes.com/entertainment/andhadhun-director-sriram-shares-what-it-took-to-make-this-imdb-s-top-rated-movie-of-2018_-358762.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/director_sriram_raghavan_shares_what_it_took_to_make_imdbs_top_rated_movie_of_2018_andhadhun_1545043592_800x420.jpg"}