{"text": "Angad Bedi Shares A Funny Story Of Being Stranded By An Ex In New York On Neha Dhupia's Chat Show!\nAngad Bedi Shares A Funny Story Of Being Stranded By An Ex In New York On Neha Dhupia's Chat Show!\nNeha Dhupia's radio show is all about revelations and decoding personal mysteries. In a first, Neha invited husband Angad Bedi on the show and he indeed was in #NoFilter mood.\nWhile chit-chatting with wife and host Neha Dhupia, he went on to spill the beans on several things including cutting his hair despite being a Sikh to dating older women.\nDuring the chat, he also unveiled some secrets about his dating life and exes. The funniest of all was how he revealed that he once dated a woman 3.5 years older to him, who left him stranded on the streets of New York.\nTalking about his ex, he went on to say,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“We were celebrating her 30th birthday. We went to a bar and she was partying with her friends. After a few drinks she got a bit aggressive and then she just wanted to go somewhere. But since I was really tired, I said ‘why don’t you go, I will just go back’. She just left me in the bar. I didn’t have any money, my mobile phone. It was in her bag. I didn’t even have the address where I was staying.”\nHe later revealed how was rescued. He started walking down on the street at around 4:30 am and while he was crossing a bar, where he spotted a few of his friends, who helped him. But there was a twist in the story too. He went on to confess that he reconciled with her only because he didn't want to miss his Miami trip, for which he had paid in advance. He added,\n“For her birthday present, I had paid for a trip to Miami. I made up with her because I wanted to go to Miami. We fought there also. She said, ‘get out of the room’. I said I am more than happy to leave this room in Miami. Then I went partying with the other girls and it was so much fun. I should have come alone to Miami. There is no reason to carry your tiffin to a swanky restaurant.”\nThe couple dated briefly before tying the knot in a private ceremony in Delhi on 10th May 2018. The couple is expecting their first baby together.", "title": "Angad Bedi Shares A Funny Story Of Being Stranded By An Ex In New York On Neha Dhupia's Chat Show!", "date_publish": "17/11/2018, 13:55:47", "description": "While chit-chatting with wife and host Neha Dhupia, he went on to spill the beans on several things including cutting his hair despite being a Sikh to dating older women. During the chat, he also unveiled some secrets about his dating life and exes. The funniest of all was how he revealed that he once dated a woman 3.5 years older to him, who left him stranded on the streets of New York.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/angad-bedi-shares-a-funny-story-of-being-stranded-by-an-ex-in-new-york-on-neha-dhupia-s-chat-show-356847.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/angad_bedi_1542445289_800x420.jpg"}