{"text": "After never-ending series of dramatic turn of events, Divorcing Hollywood power couple Angelina Jolie and Brad Pitt have reached a final agreement over the custody of their six children, Jolie’s lawyer said on Friday, after more than two years of often bitter negotiations. “A custody arrangement was agreed weeks ago, and has been signed by both parties and the judge,” Jolie’s lawyer Samantha Bley DeJean said in a statement to Reuters.\n“The agreement, which is based on the recommendations of the child custody evaluator, eliminates the need for a trial. The filing and details of the agreement are confidential to protect the best interests of the children.” Representatives of Pitt had no immediate comment.\nReuters\nJolie and Pitt, once one of Hollywood’s most glamorous couples, separated in September 2016 after a more than 10-year romance and two-year marriage. Jolie, who filed for divorce citing irreconcilable differences, had been seeking primary custody of their six children, three of whom are the couple’s biological children and three of whom are adopted.\nFriday’s statement did not say how custody would be divided, and Jolie’s spokesperson declined to give details. A trial date in the custody case had been tentatively set for December 4 before a private judge in Los Angeles. A source close to Jolie said that she “is very pleased to be entering the next stage and relieved with progress for the health of their family.”\nAFP\nDon't Miss 2.4 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nThe 2016 divorce filing triggered a bitter custody dispute during which Pitt was investigated and cleared of child abuse, and both sides accused each other of trying to manipulate media coverage in their favour. The couple are yet to reach a final divorce settlement.\nAFP\nMoneyball actor Pitt, 54, and Maleficent star Jolie, 43, began dating in late 2005 and married in 2014. They are parents to Maddox, 17, Pax, 15, Zahara, 13, Shiloh, 12, and 10-year-old twins Knox and Vivienne.\nWith inputs from Reuters", "title": "Angelina Jolie And Brad Pitt Finally Reach Child Custody Agreement, Says Lawyer", "date_publish": "01/12/2018, 16:57:28", "description": "Divorcing Hollywood power couple Angelina Jolie and Brad Pitt have reached a final agreement over the custody of their six children, Jolie’s lawyer said on Friday, after more than two years of often bitter negotiations. “A custody arrangement was agreed weeks ago, and has been signed by both parties and the judge,” Jolie’s lawyer Samantha Bley DeJean said in a statement to Reuters.", "authors": [], "url": "https://www.indiatimes.com/entertainment/angelina-jolie-and-brad-pitt-finally-reach-child-custody-agreement-says-lawyer-357749.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/angelina_jolie_brad_pitt_1543663956_800x420.jpg"}