{"text": "We have seen her nailing some action roles in movies like Lara Craft: Tomb Raider and Wanted among others. But are you all ready to see her in the Marvel Cinematic Universe? According to The Hollywood Reporter, the actress is in talks to star in The Eternals.\ncollider.com\nIt is said that Marvel is eyeing to cast Angelina Jolie in the movie, which is to be directed by Chloe Zhao of The Rider fame. What will the movie be about? The details about the movie are being kept under wraps but one of the insiders has revealed one aspect to the story involves the love story between Ikaris, a man fuelled by cosmic energy, and Sersi, who relishes moving amongst humans.\nignimgs.com\nThe story will reportedly revolve around centuries-spanning romance around two immortal beings called the Eternals. Hailed as the protectors of Earth, the Eternals will be on a mission against their destructive counterparts and monstrous genetic relatives called the Deviants.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\ncollider.com\nIt is unclear as to which role Angelina Jolie will play. Also, rumours are rife that The Eternals will feature Marvel’s first openly gay character. Considering the fact that Angelina Jolie has been an advocate for gay rights, it wouldn’t be surprising if she is the one who bags the role, right?\nWith inputs from PTI", "title": "Angelina Jolie Might Make Her Superhero Debut Soon, Is In Talks For Marvel’s ‘The Eternals’", "date_publish": "28/03/2019, 14:15:42", "description": "We have seen her nailing some action roles in movies like Lara Craft: Tomb Raider and Wanted among others. But are you all ready to see her in the Marvel Cinematic Universe? According to The Hollywood Reporter, the actress is in talks to star in The Eternal.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/angelina-jolie-might-make-her-superhero-debut-soon-is-in-talks-for-marvel-s-the-eternals-364472.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/angelina_jolie_might_make_her_superhero_debut_soon_is_in_talks_for_a_marvels_the_eternal_1553761333_800x420.png"}