{"text": "\"We are planning to do 'Welcome 3' and 'Welcome 4' back-to-back. We will start shooting soon. The actors will remain same - John, Anil, Nana, Paresh bhai. The third one will be directed by Ahmed Khan (the first two were helmed by Bazmee),\" source close to the makers told PTI.\n\"I had a struggle period, my first realisation of becoming a mainstream actor was perhaps a bit far-fetched. It was in the 10th standard. I sort of realised that my dream - after all - may not come true because most of the people around me were from a filmy lineage,\" Ranveer said.\n\"I have never seen a more natural actor in my life. He's one of the greatest actors. Not only am I fond of him as an actor but a lot of girls and guys admire him as an actor.\"\n\"I would like to react to her personally if she has any complaints. I don’t want to talk about it in the media. As I have said before, I really admire her as an actor and the choices that she makes. She’s a very outspoken person and I admire her for that as well. If I have upset her unintentionally, then I don’t know. Basically, it wasn’t my intention. I didn’t do anything to get a reaction like this.\"\nAfter a long gap of over 15 years, he was recently seen in Pahlaj Nihalani's 'Rangeela Rajaa' with Govinda, released in January this year.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES", "title": "Anil Kapoor & Nana Patekar To Reunite For Welcome Franchise, Alia In Awe of Ranbir's Acting & More From Ent.", "date_publish": "10/02/2019, 17:50:19", "description": "\"I had a struggle period, my first realisation of becoming a mainstream actor was perhaps a bit far-fetched. It was in the 10th standard. I sort of realised that my dream - after all - may not come true because most of the people around me were from a filmy lineage,\" Ranveer said.\"I had a struggle period, my first realisation of becoming a mainstream actor was perhaps a bit far-fetched.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-nana-patekar-to-reunite-for-welcome-franchise-alia-in-awe-of-ranbir-s-acting-more-from-ent-361913.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1549801617_800x420.jpg"}