{"text": "Anil Kapoor Is Excited To Play A Historical Character For The First Time In Dharma Productions' Takht!\nAnil Kapoor Is Excited To Play A Historical Character For The First Time In Dharma Productions' Takht!\nFor the first time in thirty years, Anil Kapoor is going to play a historical character. Dharma Productions' upcoming film Takht will be his first period drama in over three-decade-long career.\nBCCL\nAs per the reports, Kapoor will play the role of Shahjahan in Karan Johar's directorial venture. \"For the first time I am playing a historical character. It is a combination of many things for an actor, you can't just say there is excitement, there is lot more,'' Anil told PTI.\n''Till the time I don't get into it I won't be able to say what emotions I am feeling,\" Kapoor added without divulging details about his character in the Karan Johar-directed historical drama.\nTakht is set in the Mughal era and chronicles the story of two warring brothers. Besides Kapoor, the film also features Kareena Kapoor Khan, Ranveer Singh, Alia Bhatt, Vicky Kaushal, Bhumi Pednekar, Janhvi Kapoor, and it will reportedly go on floors later this year.\nAnil Kapoor's latest film Total Dhamaal has minted over Rs 150 crore at the box office. The actor is currently working in the upcoming film Pagalpanti. He also working with his son Harshvardhan Kapoor on Abhinav Bindra biopic.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n(With agency inputs)", "title": "Anil Kapoor Is Excited To Play A Historical Character For The First Time In Dharma Productions' Takht!", "date_publish": "26/03/2019, 14:34:16", "description": "Actor Anil Kapoor is excited for the upcoming film Takht which will be his first period drama in over three-decade-long career. As per the reports, Kapoor will play the role of Shahjahan in Karan Johar's directorial venture.Takht is set in the Mughal era and chronicles the story of two warring brothers.", "authors": [], "url": "https://www.indiatimes.com/entertainment/anil-kapoor-is-excited-to-play-a-historical-character-for-the-first-time-in-dharma-productions-takht-364328.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/anil_kapoor_1553593674_800x420.jpg"}