{"text": "Anil Kapoor Is Not Miffed With Deepika - Ranveer, Says He's Looking Forward To Their Reception\nAnil Kapoor Is Not Miffed With Deepika - Ranveer, Says He's Looking Forward To Their Reception\nDeepika Padukone and Ranveer Singh's wedding was a private affair in Italy. Only their close friends and family made it to their guest list for the Italy celebrations. A lot of people couldn't digest the fact that Anil Kapoor and his family were not a part of the celebrations. Their absence did spark a lot of rumors about their tiff.\nFor those who don't know, Ranveer Singh and Sonam Kapoor are second cousins and their families share a close bond with each other.\nSo much so that Ranveer was the last person to leave the dance floor from Sonam Kapoor's reception and dance party.\nInstagram\nAnil Kapoor was present at an event in Goa where he clarified that all's well between him and Deepika-Ranveer. Putting a rest to all such rumors, he said,\n“I don’t know where the news of me being upset with Ranveer Singh and Deepika Padukone for not calling me came from. I am going to their reception on the 1st December and I am looking forward”\nKapoor had even taken to his Twitter account to wish Ranveer-Deepika on their wedding.\nThat’s one good looking couple right there! #ThePerfectMatch May those smiles never leave your faces! Wishing you a lifetime of happiness, love & togetherness! Lots of love coming your way! @RanveerOfficial @deepikapadukone https://t.co/YWaPbQcqOD — Anil Kapoor (@AnilKapoor) November 16, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Anil Kapoor Is Not Miffed With Deepika - Ranveer, Says He's Looking Forward To Their Reception", "date_publish": "28/11/2018, 18:01:46", "description": "Deepika Padukone and Ranveer Singh's wedding was a private affair in Italy. Only their close friends and family could make a cut in their guest list for the Italy celebrations. A lot of people couldn't digest the fact that Anil Kapoor and his family were not a part of the celebrations. Their absence did spark a lot of rumors about their tiff. For those who don't know Ranveer Singh and Sonam Kapo", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-is-not-miffed-with-deepika-ranveer-says-he-s-looking-forward-to-their-reception-357513.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1543388417_800x420.jpg"}