{"text": "Mowgli is a story we all have grown up on and now yet again it’s the chance to relive our memories by binging on the show. This time Mowgli will have a twist. Bollywood stars have been approached to lend their voice for the Hindi version. Isn’t that exciting?\nTo begin with, apna Jhakaas hero Anil Kapoor will be giving his voice for Baloo, one of our favourite characters in Mowgli. Anil is super thrilled to be a part of this Hindi version Mowgli. Sharing the picture of Baloo on his Insta, the actor wrote, “Bringing the 'bear necessities' to Mowgli: Legend of the Jungle as Baloo, the tenacious mentor. On @netflix_in, Dec 7”.\nAnd the voice to Kaa will be Kareena Kapoor Khan. Her manger Ponam Damania shared this information in the most honest way possible, “ A voice that captivates like no other. Kareena Kapoor Khan to tell the story of the jungle as Kaa in Mowgli: Legend Of The Jungle on @netflix_in #kareenakapoorkhan.”\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nFerocious when provoked, especially when it comes to her man cub! Nisha brings the motherly instinct alive in Mowgli: Legend of the Jungle. So excited to be the voice behind Nisha 🐺 @NetflixIndia Dec. 7 pic.twitter.com/Tlc9BsFWa6 — Madhuri Dixit Nene (@MadhuriDixit) November 20, 2018\nMadhuri Dixit will be the voice for Nisha and there is no debate on that, after all she is B Town’s original Nisha, “ Ferocious when provoked, especially when it comes to her man cub! Nisha brings the motherly instinct alive in Mowgli: Legend of the Jungle. So excited to be the voice behind Nisha 🐺 @NetflixIndia Dec. 7”.\nAbhishek Bachchan will be Bagheera who is always there for Mowgli, while Jackie Shroff is the Shere Khan. How excited are you watch the Hindi version of Mowgli on Netflix?", "title": "Anil Kapoor, Madhuri Dixit & Bebo To Lend Voice For The Hindi Version Of 'Mowgli'", "date_publish": "20/11/2018, 14:42:53", "description": "How damn excited are you watch the Hindi version of Mowgli on Netflix? Mowgli is a story we all have grown up on and now yet again it’s the chance to relive our memories by binging on the show. But this time Mowgli will have a twist and that is our B town stars will lend their voices for the Hindi version. Isn’t that even more exciting?", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/anil-kapoor-madhuri-dixit-bebo-to-lend-voice-for-the-hindi-version-of-mowgli-357023.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kareena_1542705572_800x420.jpg"}