{"text": "Anil Kapoor To Play Shah Jahan In Karan Johar’s Multi-Starrer ‘Takht’ & He’ll Bulk Up For The Role\nAnil Kapoor To Play Shah Jahan In Karan Johar’s Multi-Starrer ‘Takht’ & He’ll Bulk Up For The Role\nWith Takht in the making, Karan Johar’s obsession with multi-starrer films continues. This time he is bringing together – Ranveer Singh, Kareena Kapoor, Alia Bhatt, Vicky Kaushal, Bhumi Pednekar, Anil Kapoor and Janhvi Kapoor. Well, that makes half of the B-town, don’t you think?\nbrecorder.com\nBut this one is a period drama. For the first time, Karan Johar is attempting a historical magnum opus, which his contemporaries including Sanjay Leela Bhansali and Ashutosh Gowarikar have an upper hand in.\nWhile not much information has been revealed about Takht as of now, grapevine suggests that Anil Kapoor will play the role of Mughal Emperor Shah Jahan in the multi-starrer Dharma Productions film. And to gear up for the role, Anil Kapoor will bulk up and gain weight, it is being said.\nTwitter\n“Anil will be putting on a lot of weight to look his part. He is currently extremely lean and fit, but early next year, he will be on a different diet and will gain quite a few kilos before he begins shoot for the period drama,” a source told DNA.\nAnd if this was not enough to amp up your excitement level, Karan Johar says the movie will be like his iconic film Kabhi Khushi Kabhi Gham, set in the Mughal era. Well, that sounds exciting, doesn't it?\nDon't Miss 233 SHARES 185 SHARES 336 SHARES 870 SHARES 544 SHARES\nWhat is it exactly about? “It’s about two warring brothers and it’s based on facts. It’s like the K3G of the Mughal era. But it’s more extreme, there is more betrayal. It has the tropes of court politics. It’s so rich in texture,” he had told Film Companion in an interview.\nLast time, Anil Kapoor played a bulked-up role in Badhaai Ho Badhaai, remember? We’re sure he will ace this role as well.", "title": "Anil Kapoor To Play Shah Jahan In Karan Johar’s Multi-Starrer ‘Takht’ & He’ll Bulk Up For The Role", "date_publish": "11/12/2018, 17:46:32", "description": "With Takht in the making, Karan Johar’s obsession with multi-starrer films continues. This time he is bringing together – Ranveer Singh, Kareena Kapoor, Alia Bhatt, Vicky Kaushal, Bhumi Pednekar, Anil Kapoor and Janhvi Kapoor. nil Kapoor will play the role of Mughal Emperor Shah Jahan. Anil Kapoor will bulk up and gain weight, it is said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anil-kapoor-to-play-shah-jahan-in-karan-johar-s-multi-starrer-takht-he-ll-bulk-up-for-the-role-358387.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anil_kapoor_to_play_shah_jahan_in_karan_johars_multistarrer_takht__hell_bulk_up_for_the_role_1544529877_800x420.png"}