{"text": "In a recent interview with an agency, Anil Kapoor said that Indian film industry has successfully struck a balance between content-driven and commercial cinema. The 62-year-old actor said if the story is good, it receives love from the audience. Talking about the fact that the film industry has become more inclusive.\nAgencies\n\"There is a place and audience for all types of cinema - content and commercial and our industry has balanced it well. Films with good content are making good money at the box office. This is all because audience is more evolved than ever before. Audiences have evolved and so films have evolved to better resonate with that change. I don't think it's a matter of films being better or worse. It's a matter of being the reflection of the times,\" Kapoor told PTI.\nThis year the actor has had two releases -- \"Ek Ladki Ko Dekha Toh Aisa Laga\" and \"Total Dhamaal\". The films minted Rs 43 crore and Rs 145 crore, respectively. Kapoor said he has been experimenting with every film and is happy about it.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"There is a sense of self-growth and fulfilment and the feeling of a job well done. I take pride in that.\"\nAnil Kapoor's upcoming films include Anees Bazmee's Pagalpanti, Takht with Karan Johar, and a biopic on Olympic gold medallist Abhinav Bindra with son Harshvardhan Kapoor.\n(Also read: Anil Kapoor Shares A Picture From His Next Film & Everyone’s Convinced He Is Ageing In Reverse)", "title": "Anil Kapoor Praises Industry For Striking Right Balance Between Content And Commercial Cinema", "date_publish": "18/03/2019, 11:57:35", "description": "In a recent interview with an agency, Anil Kapoor said that Indian film industry has successfully struck a balance between content-driven and commercial cinema. The 62-year-old actor said if the story is good, it receives love from the audience. Talking about the fact that the film industry has become more inclusive.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-praises-industry-for-striking-right-balance-between-content-and-commercial-cinema-363881.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/anil_kapoor_1552891213_800x420.jpg"}