{"text": "Anil Kapoor Pays Tribute To Sridevi During A Reality Show, Recalls How He Used To Touch Her Feet\nAnil Kapoor Pays Tribute To Sridevi During A Reality Show, Recalls How He Used To Touch Her Feet\nBollywood was full of ups and downs this year. While there were too many weddings, from Sonam Kapoor, Priyanka Chopra and Deepika Padukone, there was also a shocking demise of legendary actress Sridevi.\nThe actress who died in late March due to drowning in her hotel bathtub in Dubai shocked the entire nation. The Kapoor family was jolted by the big loss and still hasn't been able to recover. Whether it's Janhvi Kapoor or Boney Kapoor, these celebrities get emotional many a times while talking about their loved one.\nTwitter\nAnil Kapoor, her brother-in-law and co-star, misses Sridevi terribly too. In fact, he was called to a dance reality show to watch performances and pay tribute to Sridevi. Recalling how he used to touch feet every time they met, Anil mentioned she used to feel awkward seeing him do that.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n“As an artist I feel blessed to have worked with Srideviji and she had an huge contribution to my career. She was an actor with immeasurable talent who could fill the screen with her magic. We shouldn’t remember her with sadness and rather celebrate her brilliance as a performer with love, affection and joy,” Anil Kapoor said on the show.\nWell, no matter how many actresses and movies come and go, there is no denying that Sridevi created a special place in our hearts. Her contribution to Hindi cinema is irreplaceable", "title": "Anil Kapoor Pays Tribute To Sridevi During A Reality Show, Recalls How He Used To Touch Her Feet", "date_publish": "06/12/2018, 17:17:34", "description": "The actress who died in late March due to drowning in her hotel bathtub in Dubai shocked the entire nation. The Kapoor family was jolted by the big loss and still haven't been able to recover. Whether it's Janhvi Kapoor or Boney Kapoor, these celebrities get emotional many a time while talking about their loved one.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-pays-tribute-to-sridevi-during-a-reality-show-recalls-how-he-used-to-touch-her-feet-358083.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anil_1544095047_800x420.jpg"}