{"text": "Anil Kapoor turned 62 this year but he looks 26 and there are no conflicts over it.\nThe man believes in making mistakes in life and learning from it every day. As the year is coming to end, we met AK and asked him what he learned from this year.\nInstagram\nAnil said, “You learn every day, you make mistakes and then you say let’s not make that mistake and again you make a fresh mistake. Life is a challenge, you face problems every day and you motivate yourself to solve them. This is life, it goes on, but you should just make the most of it”.\nNow we know how the actor manages to be so jhakaas, his life mantra is just inspiring.\nThis year, we also saw a lot of weddings in Bollywood. Even Anil was super fascinated seeing all the actress turning into gorgeous brides including his daughter Sonam, “It has been a beautiful year for me with all the weddings, I have seen some beautiful brides that’s really lovely. It was so good to see so much ethnicity in the weddings”.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe actor will be seen next in Ek Ladki Ko Dekha Toh Aisa Laga featuring Sonam, Juhi Chawla and Rajkummar Rao in the film. The trailer of the film is simply spectacular, it will be releasing on December 27, Anil is damn excited about the film and shares what’s his favourite part of the film,\n“My favourite part is obviously Sonam and Rajkummar, they both look just lovely together, the music is fantastic. Juhi is there, what can I say about her, Juhi is Juhi! Then, I and Sonam are working for the first time. Also, the title Ek Ladki Ko Dekha Toh Aisa Laga made me nostalgic. Everything is so good about this film.”\nWe quizzed him about Sonam’s choices for films, to which the proud father said,\n“Sonam’s choices have been amazing, she has always been very brave with her choices. She really never thinks or cares about who her co-star will be, she always thinks about the content first and all other things come later. Also, all her choices have always gone right”.\nWe are damn excited to see this father-daughter duo spill their magic onscreen for the first time ever.", "title": "Anil Kapoor Shares His Learning From 2018 And It Is Something We All Should Adapt Right Away", "date_publish": "26/12/2018, 12:38:44", "description": "Anil Kapoor turned 62 this year but he looks 26 and there is no debate over it. The man still is happy to make mistakes in life and learn from it every day. As the year is coming to end, we met AK and asked him what he learned from this year. Anil said, “You learn every day, you make mistakes and then you say let’s not make that mistake and again you make a fresh mistake. Life is a challenge ever", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/anil-kapoor-shares-the-lessons-he-learned-from-2018-it-s-something-we-should-adapt-right-away-359289.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anil_kapoor_1545812086_800x420.jpg"}