{"text": "Anil Kapoor, John Abraham And Nana Patekar All Set To Reunite For The 'Welcome' Franchise\nAnil Kapoor, John Abraham And Nana Patekar All Set To Reunite For The 'Welcome' Franchise\nIf Welcome is one movie that changes your bad mood into a good one in a jiffy, here is a piece of news that will make you really happy. According to a PTI report, John Abraham, Anil Kapoor, Paresh Rawal and Nana Patekar are all set to reunite for the third and fourth installments of \"Welcome\" franchise. The makers have already started working on the project.\nJust to jog your memory a little, Welcome was a hit 2007 comedy film directed by Anees Bazmee and produced by Firoz A Nadiadwala.\nTwitter\nStarring Akshay Kumar, Katrina Kaif, Feroz Khan, Kapoor, Patekar, Rawal and Mallika Sherawat, the film went on to become a blockbuster.\nIn 2015, the actors reprised their role in Welcome Back and played the roles of underworld dons - Majnu and Uday.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\n\"We are planning to do 'Welcome 3' and 'Welcome 4' back-to-back. We will start shooting soon. The actors will remain same - John, Anil, Nana, Paresh bhai. The third one will be directed by Ahmed Khan (the first two were helmed by Bazmee),\" source close to the makers told PTI.\nWhile the third part will release in 2020, the fourth one will be aimed at releasing in 2021. The source added,\n\"This time we will have lot of action. We will have fun and stylised action, like how it was in 'Mission Impossible' series. So, there will be laughter and action both. First time we will incorporate the action thing in 'Welcome' series.\"\nThe makers added,\n\"The moment 'Welcome 3' will get over in two month's time we will start 'Welcome 4'. It will be the first Indian franchise to have a movies back-to-back. We had planned this four-five months ago.\"", "title": "Anil Kapoor, John Abraham And Nana Patekar All Set To Reunite For The 'Welcome' Franchise", "date_publish": "10/02/2019, 16:06:01", "description": "If Welcome is one movie that changes your bad mood into a good one in jiffy, here is a news that will make you really happy. According to a PTI report, John Abraham, Anil Kapoor, Paresh Rawal and Nana Patekar are all set to reunite for the third and fourth installments of \"Welcome\" franchise. The makers have already started working on the project.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/anil-kapoor-john-abraham-and-nana-patekar-all-set-to-reunite-for-the-welcome-franchise-361894.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/welcome_1549795218_800x420.jpg"}