{"text": "Anisha Padukone Reveals Her Family Was Doubtful About Deepika Bagging Her First Film With SRK\nAnisha Padukone Reveals Her Family Was Doubtful About Deepika Bagging Her First Film With SRK\nDeepika Padukone is a self-made star. The actress had no filmy background and still made it big in Bollywood which is just commendable.\nTwitter\nWith her very first film, she made her a place for herself in the audiences' heart. The actress made her debut with Om Shanti Om with superstar Shah Rukh Khan in 2007 and has come a long way since then.\nTwitter\nOver the years, Deepika saw a lot of highs and lows but today she has emerged as a winner. The actress even made it to Forbes list on number 4 position which is a big achievement.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nInitially, when she planned to make her career in Bollywood and informed her family about getting a film with Shah Rukh Khan, it was unbelievable for them. Deepika's sister Anisha Padukone in an interview with a magazine revealed how the family was skeptical about her getting a film with SRK,\nTwitter\n“When she (Deepika) informed us that Farah Khan had promised her a movie with SRK, we were a bit skeptical and asked her not to stop looking for more options. But when we realized she has actually signed the contract, all of us were very happy,”\nTwitter\nAnisha even revealed that DP always wanted to be a performer, “Deepika and I were in the same school until I was in 4th grade. She always loved to participate in school plays, dancing and performing for the Teacher's Day, the usual things kids do in school.”\nTwitter\nAnisha shares one anecdote too. She said, “One incident our mother tell us about is that during one of her performances in school she imitated the principal and that too in a convent school, where things like these are not easily accepted. Surprisingly, everyone loved her act because it was so good”.\nTwitter\nWith all the love and support from her family, Deepika Padukone became what she is - a superstar.", "title": "Anisha Padukone Reveals Her Family Was Doubtful About Deepika Bagging Her First Film With SRK", "date_publish": "06/12/2018, 17:54:38", "description": "Deepika Padukone is a self-made star. The actress had no backing when she made her debut in Bollywood debut. With her very first film, she made her space in audiences heart. The actress made her debut with Om Shanti Om with superstar Shah Rukh Khan in 2007 and has come a long way. Deepika saw a lot of highs and lows but emerged a winner. Today she was announced as the number one sexiest actre", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/anisha-padukone-reveals-her-family-was-doubtful-about-deepika-bagging-her-first-film-with-srk-358088.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_1544098209_800x420.jpg"}