{"text": "Where there is hope, there is a way and looks like the prayers of millions of his fans have been answered. After his long battle with cancer, Irrfan Khan is finally back in India.\nIn March, Irrfan announced that he had been diagnosed with a rare form of tumour. After the diagnosis, the actor along with his family had temporarily shifted base to London for his treatment.\nTwitter\nAnd now, after a long wait, several rumors and social media hoaxes, we finally have a concrete status on his health.\nDon't Miss 291 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nDirector-producer Tigmanshu Dhulia. Dhulia has himself confirmed the news and added that Irrfan will soon begin the shooting for Hindi Medium 2 soon.\n(Also read: 13 Times Sonali Bendre & Irrfan Khan Taught Us How To Live Life While Battling Cancer!)\nThe original schedule of the film was delayed because of Irrfan's treatment in the US. Talking to Deccan Chronicle, Tigmanshu said,\n“I did meet him after he returned to India. He is perfectly fine now. Irrfan told me that he will begin shooting for Hindi Medium franchise soon. We will do a film soon. Actually, we were in the process of writing one for him. Probably, if everything goes well, we shall be making the film soon.\"\nThere were several reports that hinted at the fact that to ensure recovery, Irrfan wouldn't work for at least a year.\nTwitter\nNot many know that Irrfan did make a secret visit to India last year for two days. He visited Trimbakeshwar Shiva Temple in Nashik and performed a havan with the pandits.", "title": "Another Hero Is Back: Irrfan Khan Is In India, Will Start Shooting For Hindi Medium 2!", "date_publish": "03/03/2019, 14:24:30", "description": "Actor Irrfan Khan is back in India and is perfectly fine now, confirmed director-producer Tigmanshu Dhulia.Actor Irrfan Khan is back in India and is perfectly fine now, confirmed director-producer Tigmanshu Dhulia.Actor Irrfan Khan is back in India and is perfectly fine now, confirmed director-producer Tigmanshu Dhulia.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/another-hero-is-back-irrfan-khan-is-in-india-will-start-shooting-for-hindi-medium-2_-363080.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/irrfan_khan_1551603440_800x420.jpg"}