{"text": "Not one, but four women including singers Sona Mohapatra and Shweta Pandit have accused Anu Malik of sexual harassment. While he denies all claims and calls them baseless stories, one of the crew memberes of reality show Indian Idol has recently revealed that high-ups were aware of him abusing his power. Furthermore, speculations are rife that he might be ousted from the singing reality show.\nAlso Read: After Sona Mohapatra, Singer Shweta Pandit Accuses 'Paedophile' Anu Malik Of Sexual Harassment\nIndian Idol's former assistant producer Danica D’Souza, who is currently in New York working as Design and Operations director for The Laura Flanders Show, in an interview with Mid-Day has revealed that the higher authorities of the show were aware of the fact that he misused his power to take sexual advances.\namazon.com\n“This incident occurred in Kolkata. One of our colleagues from the production crew was travelling with a cameraman and Malik in a car to get sound bites. When she returned, she looked traumatised and told us of the unfortunate incident. She said once they had wrapped up their work, Malik touched her thigh in the car, and felt her up. She was startled. The cameraman who was sitting in the front seat wasn't aware of what was going on behind him,” she said and added that the higher-ups “[women on the team] sympathised but quickly swept the incidents under the rug.”\ni0.wp.com\nDon't Miss 193 SHARES 362 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nMeanwhile, a Pinkvilla report suggests that talks are on to kick him out of the show post these sexual harassment allegations. The makers are internally discussing the matter and have reportedly decided to drop Anu Malik as the judge of Indian Idol 10.\nAlso Read: After Sona Mohapatra & Shweta Pandit, 2 More Women Accuse Anu Malik Of Sexually Harassing Them", "title": "Anu Malik Likely To Be Ousted From ‘Indian Idol 10’ Post Several Sexual Harassment Allegations Against Him", "date_publish": "21/10/2018, 13:02:14", "description": "Not one, but four women including singers Sona Mohapatra and Shweta Pandit have accused Anu Malik of sexual harassment. While he denies all claims and calls them baseless stories, one of the crew memberes of reality show Indian Idol has recently revealed that high-ups were aware of him abusing his power. Furthermore, speculations are rife that he might be ousted from the singing reality show.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anu-malik-likely-to-be-ousted-from-indian-idol-10-post-several-sexual-harassment-allegations-against-him-355152.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anu_malik_likely_to_be_ousted_from_indian_idol_10_post_sexual_harassment_allegations_against_him_1540105277_800x420.jpg"}