{"text": "Anupam Kher Admits He ‘Wrongly Judged’ Former PM Manmohan Singh, Says ‘History Will Not Misjudge’ Him\nAnupam Kher Admits He ‘Wrongly Judged’ Former PM Manmohan Singh, Says ‘History Will Not Misjudge’ Him\n“Hazaaron Jawabon Se Acchi Hai Meri Khamoshi, Na Jaane Kitne Sawaalon Ki Aabru Rakhe” – Manmohan Singh\nAnupam Kher, who has been quite open about his views on politics has often dissed former Prime Minister Manmohan Singh. Remember his viral speech on intolerance in India with which he created a storm on social media? It was quite a goosebump-inducing speech, wasn't it?\n#Demonetizaton ke side effects: #ManmohanSingh ji aaj 10min tak bole. Jai Ho.:) — Anupam Kher (@AnupamPKher) November 24, 2016\nInterestingly, the man is playing the role of Manmohan Singh in his biopic titled, The Accidental Prime Minister, which is based on namesake memoir penned by Singh’s media adviser (2004 to 2008) Sanjay Baru.\nAfter having wrapped up the shoot of the movie, Anupam Kher says he was wrong and he “wrongly judged” Manmohan Singh. He added that history will not misjudge him.\nDon't Miss 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n“I did have my reservations before doing this film and also wrongly judged you at times but today after finishing the shoot and having almost lived the role for more than one-year I can say it with utmost sincerity that history will not misjudge you. Will wait to have that cup of tea with you once you watch our film,” he wrote.\nTwitter\nHere's how people reacted to his comment.\nWhere were you when he was the prime minister? Why didn’t you make the movie that time? Who you r trying to impress now? — Naveen (@dhingra_naveen) October 26, 2018\n1 thing is for sure... everyone knows that you and team @narendramodi has made this film to show Manmohan Singh as bad pm. be sure if you have done such things and u try to release film before general elections then it will be negative impact on your master's vote. — gopal parekh (@gopalparekh) October 27, 2018\nAs long as you portrayed him as the most honest man in Indian politics then it’s all good. — Ricky (@ricky703ca) October 26, 2018\nHe was less of a pm and more of a maid @gandhi's — D.R Saini (@DRSaini18) October 27, 2018\nHe saved your bankrupt economy...be thankful but you are now used to screwed up economy, so won’t be able to appreciate. — Ricky (@ricky703ca) October 27, 2018\nAnupam Kher also shared a behind the scenes video where he can be seen dressed up as Prime Minister Manmohan Singh alongside Suzanne Bernert, who portrays UPA chairperson Sonia Gandhi, in the Accidental Prime Minister.\nStarring Anupam Kher in the lead role, The Accidental Prime Minister is set to release on Dec 7", "title": "Anupam Kher Admits He ‘Wrongly Judged’ Former PM Manmohan Singh, Says ‘History Will Not Misjudge’ Him", "date_publish": "28/10/2018, 11:32:26", "description": "Anupam Kher is playing the role of Manmohan Singh in his biopic titled, The Accidental Prime Minister, which is based on namesake memoir penned by Singh’s media adviser (2004 to 2008) Sanjay Baru. After having wrapped up the shoot of the movie, Anupam Kher says he was wrong and he “wrongly judged” Manmohan Singh. He added that history will not misjudge him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anupam-kher-admits-he-wrongly-judged-former-pm-manmohan-singh-says-history-will-not-misjudge-him-355584.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anupam_kher_admits_he_wrongly_judged_manmohan_singh_says_history_will_not_misjudge_him_1540706600_800x420.png"}