{"text": "1. Anupam Kher Admits He ‘Wrongly Judged’ Former PM Manmohan Singh, Says ‘History Will Not Misjudge’ Him\nAfter having wrapped up the shoot of the movie, Anupam Kher says he was wrong and he “wrongly judged” Manmohan Singh. He added that history will not misjudge him.\n2. Ranveer Singh Is So Obsessed With Taimur That He Can't Wait To Work With Him In The Future\nIf you love the adorable goofball that Taimur Ali Khan is, you’re not alone. Even Ranveer Singh quite obsessed with the tiny tot. So much so, that he wants to work with him in future.\n3. To Protect Actors From Harassment, HBO Hires Intimacy Coordinator To Make Sex Scenes Safer\nContributing to it, HBO is making sure that the sex scenes in its shows are safe for the actors, as the channel is hiring intimacy coordinator for all shows, according to The Huffington Post.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 788 SHARES\n4. Swara Bhasker Once Lost Out On A Film For ‘Looking Intelligent’ In Initial Days Of Her Career\n“I think everyone who comes to the industry has to face certain kind of rejection for how they look. Otherwise people would not be spending so much money on the make up. All this is a reflection of a person's mindset. The first meeting I had when I came to Bombay, a director rejected me saying, you look too intelligent. I have still not understood what does this mean,” she told PTI.\n5. As He Talks On #MeToo, Saif Ali Khan Says People Don't Have Guts To Misbehave With His Family\nSaif Ali Khan had earlier said that working with sexual predators in the industry is certainly off-limits for him. Now, speaking on the #MeToo movement, he said that he feels his family is automatically safeguard from sexaul advances. He feels nobody has the guts to misbehave with his family.", "title": "Anupam Kher ‘Misjudged’ Manmohan Singh, Ranveer Singh’s Obsession With Taimur & More From Ent", "date_publish": "28/10/2018, 18:23:54", "description": "From Anupam Kher wrapping up the shoot of Manmohan Singh biopic and saying that he “wrongly judged” him to Ranveer Singh revealing on Karan Johar’s show Koffee With Karan that he is obsessed with Taimur and wants to work with him future, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/anupam-kher-misjudged-manmohan-singh-ranveer-singh-s-obsession-with-taimur-more-from-ent-355612.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anupam_kher_misjudged_manmohan_singh_ranveer_singhs_obsession_with_taimur__more_from_ent_1540727810_800x420.png"}