{"text": "Anupam Kher’s The Accidental Prime Minister has been in news ever since the trailer was released. The trailer created a huge stir among the audiences due to its controversial content. The Congress party is protesting against the film for showing Sonia and Rahul Gandhi in a bad light.\nTwitter\nThe trailer of the film shows how former PM Manmohan Singh was helpless under Sonia Gandhi’s supervision and had no say of his own. This film is based on a book written by Sanjay Baru who closely worked with PMO.\nIndiatimes met Anupam Kher and had a detailed conversation with him, where he happened to reveal that he wasn’t keen to do the film initially as he too thought it’s controversial; however, he later got convinced as he found the project very challenging.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAnupam narrates,\n“I think so far there is not any film made like this, realistically on the politics of our country. And there is a first account film made on Former Prime Minister Manmohan Singh, in the form of the book with the same name. And when I read the script as an audience I wanted to watch the film, it’s been 70 years we are independent so we should know what is happening in the PMO and yet it is not the political course that I got attracted to, it’s a relationship course between this media advisor and the Prime Minister.\"\nTwitter\n\"Also this film has shown a very important part of history from 2004 to 2014, it’s 10 years of history which we all have witnessed, even though before in the beginning stages I said NO to do this film because I thought it’s too much, it’s a controversial film. It was my initial thought, then I saw Dr. Manmohan Singh on TV and tried to walk like him and it was a disaster and that challenged me as an actor. I thought it’s a going to be a great opportunity for me to be a part of this.”\nTwitter\nTalking about the ongoing protest against the film he said, “We are living in a time where such things are possible that doesn’t stop anything, there is a system, there is Censor Board, and every film has it’s aura, if people will like it nothing can stop it. The trailer is already loved by everyone. I think we should be very proud of this film as cinema goers, as we have the capability to make a film which is based on true facts, this is the first time you will see real names been taken right from Sonia Gandhi to Rahul Gandhi.”\nHe also said he isn’t surprised about the protest against the film, \"Of course, it is a film and the protest will happen. When I had come to Bombay 40 years ago, I didn’t think what will happen to me, I just didn't want to. The film is based on book, which was controversial and we have mentioned that in the promo, you are bound to imagine it how controversial it may be, but just because it is controversial art cannot be stopped, otherwise what is the idea of society or art being evolved, little opposition should not demoralize and stop us from trying to work out the possibility of making it.”\nInstagram\nAnupam even said playing Manmohan Singh has been the toughest role of his film career,\n\"It is the most difficult role I have done in past 35 years of my career. Saaransh was, of course, my first film, then nobody knew me, but today people know me and won’t see any trace of Anupam Kher in Manmohan Singh, that’s the biggest achievement.”\nInstagram\nThe actor insists everyone should watch the film as politics is an imperative part of every individual life, “At the end, everything is about entertainment, and politics and cricket is the most prominent part of every individual life. They discuss it everywhere, we are a very politically aware country, and with this film people will get to see what happens inside the PMO office written by Sanjay Baru.”", "title": "Anupam Kher Was Reluctant To Play Manmohan Singh Initially Because He Knew It Was Controversial", "date_publish": "03/01/2019, 17:23:36", "description": "Anupam Kher’s The Accidental Prime Minister film has been in news ever since the trailer was out. The trailer created a huge stir among the audiences due to its controversial content. The Congress party expressed a huge protest against the film due showing their chief Sonia and Rahul Gandhi under bad light. The trailer of the film shows how former PM Manmohan Singh was helpless under Sonia Gandhi", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/anupam-kher-was-reluctant-to-play-manmohan-singh-initially-because-he-knew-it-was-controversial-359790.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/anupam_kher_1546517091_800x420.jpg"}