{"text": "Anupam Kher Is Always Up For Challenges, Will Be Seen Playing A Doctor In A New American Show\nAnupam Kher Is Always Up For Challenges, Will Be Seen Playing A Doctor In A New American Show\nAnupam Kher is one of the finest actors that the industry currently has. The 68-year-old star has done several international projects including Silver Linings Playbook (2012), The Big Sick (2017) and Sense8. In his next, Anupam Kher will be seen playing the role of a doctor.\nVeteran Indian actor Anupam Kher, who plays a doctor in a medical drama on NBC, says the show gave him an opportunity to reinvent himself and working on the American show is a different horizon for him as an actor.\nIt is a different horizon for me as an actor. I have worked for 34 years in India and abroad and I wanted to challenge myself, reinvent myself. Then this opportunity came, Kher told PTI here.\nTwitter\nKher plays Dr Vijay Kapoor in the medical drama New Amsterdam' that runs on NBC. The show got picked up for a full season and the network recently announced it will have nine more episodes, bringing the total count to 22. Describing his experience of working on the show, Kher said learning all the medical terms was a challenge and I love challenges. That is the only way you can reinvent and recreate your own work. Kher said he had read the pilot for the show, he was very excited about it.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nHere is a series on the medical profession which talks about being compassionate, about the nobility of medical profession. The only religion that should be observed in hospitals by doctors and everyone else is that of humanity and this series underlines that angle, he said.\nKher said he is excited that show is being telecast in India. The actor, Chairman of the Film and Television Institute of India (FTII), is among the few Indian actors to have made successful forays in international films and television shows.\nInstagram\nFrom playing a Punjabi father in Gurinder Chadha's 2003-hit Bend It Like Beckham, Kher has acted in several American films such as the Oscar-nominated and Robert De Niro-starrer film Silver Linings Playbook, Ang Lee's Venice Film Festival's Golden Lion-winning Lust and the recent Sundance hit The Big Sick.\nKher said that much before him, several people such as Om Puri and Irrfan Khan have done amazing work in the international entertainment industry and now Priyanka Chopra has really brought Indian cinema to the global mainstream. This is where the training one gets working as an actor, theatre person in India, helps, he said.\nWith inputs from PTI", "title": "Anupam Kher Is Always Up For Challenges, Will Be Seen Playing A Doctor In A New American Show", "date_publish": "18/10/2018, 15:21:56", "description": "Anupam Kher is one of the finest actors that the industry currently has. The 68-year-old star has done several international projects including Silver Linings Playbook (2012), The Big Sick (2017) and Sense8. In his next, Anupam Kher will be seen playing the role of a doctor.", "authors": [], "url": "https://www.indiatimes.com/entertainment/anupam-kher-is-always-up-for-challenges-will-be-seen-playing-a-doctor-in-a-new-american-show-355023.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/new_amsterdam_anupam_kher_1539853822_800x420.jpg"}