{"text": "The love story is based on the natural calamity that had hit Kedarnath in 2013 and shows how two people decide to fight against all odds to make their love story immortal.\nHe said, “I never announced she is my girlfriend, if you see my entry, you will see, I sang Aisi Laagi Lagan and then I went to meet Salman. We had a quick chat and he asked who’s coming with me I said Jasleen, she is my student. But Salman said she is saying something else. The moment she came, she announced that we are lovers and I was shocked, Salman was shocked, the entire family of hers and mine were shocked.\"\nDon't Miss 10.9 K SHARES\nActress Malaika Arora feels there is more noise than actual change at the moment. \"I don't see too much of a change. I hear people. I think there is more noise than change,\" Malaika told IANS over the phone from Mumbai when asked about the change coming with the discussions around the #MeToo movement in India.\nFormer Roadies and Bigg Boss contestant, Renee Dhyani has shared #MeToo story recently. Currently working in Zee TV's Yeh Teri Galiyan, Renee revealed about the time when his co-star asked her to “suck his di**” in front of his sister-in-law and girlfriend.\nAfter Nick shut the Tiffany store down to buy her an engagement ring, this time it was PC who got Tiffany's store shut down to celebrate her bridal shower with her family and close friends.", "title": "Anup Jalota Denies Affair With Jasleen, Teaser Of Kedarnath Is Out And More From Ent", "date_publish": "30/10/2018, 17:26:03", "description": "The love story is based on the natural calamity that had hit Kedarnath in 2013 and shows how two people decide to fight against all odds to make their love story immortal.He said, “I never announced she is my girlfriend, if you see my entry, you will see, I sang Aisi Laagi Lagan and then I went to meet Salman. We had a quick chat and he asked who’s coming with me I said Jasleen, she is my student.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/anup-jalota-denies-affair-with-jasleen-teaser-of-kedarnath-is-out-and-more-from-ent-355739.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/trending_1540900759_800x420.jpg"}