{"text": "The #MeToo movement broke out last year in India where women spoke about how they were mentally and sexually harassed at work. While some took to social media, some resorted to filing a complaint at the police station.\nMany offices started a 'Sexual Harassment Intolerance' campaign including Bollywood. A lot of famous names surfaced where women claimed about various filmmakers who misbehaved with them at work.\nInstagram/Hrithik FC\nOne of them was Vikas Bahl. The director of Queen allegedly molested his junior colleague in 2015. She reported the incident to the production house but no help was given back then. She finally spoke about her story at a leading publication citing details of his misbehavior.\nTwitter\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nWhat followed later was expected. Bahl who was one of the founders of Phantom Films along with Anurag Kashyap and Vikramaditya Motwane, was removed from the list. Vikas was in the midst of directing Super 30 but lead actor of the film, Hrithik Roshan too chose to not work with him.\nAnd now with the film hanging in the middle, the other founder Anurag Kashyap has taken over to supervise the post production of the film.\n'According to a report in Huffington Post, Anurag will now take over the film. “At the moment I am getting Womaniya (now titled Bhains Ki Aankh) started, but yes, I will be overseeing the post-production of Super 30,” Kashyap confirmed.\nTwitter\nAs the name suggests, there are about 30 new people making a debut with this film. This movie is about Anand Kumar, a Mathematics genius from a modest family in Bihar who makes sure that even the poor man can create some of the world's most genius minds.\nKashyap further said that he won't be taking any credits for his work on the film. Kashyap also said that he decided to join to project only after Bahl gave his consent.", "title": "Anurag Kashyap Replaces Vikas Bahl In Super 30, To Oversee Production Of This Hrithik Roshan Starrer", "date_publish": "12/02/2019, 17:23:33", "description": "This movie is about Anand Kumar, a Mathematics genius from a modest family in Bihar who makes sure that even the poor man can create some of the world's most genius minds.This movie is about Anand Kumar, a Mathematics genius from a modest family in Bihar who makes sure that even the poor man can create some of the world's most genius minds.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/anurag-kashyap-replaces-vikas-bahl-in-super-30-to-oversee-production-of-this-hrithik-roshan-starrer-362041.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1549974177_800x420.jpg"}