{"text": "Anurag Kashyap Claims He Received Messages Asking Him To Join 'I Will Vote for Modi' Campaign\nAnurag Kashyap Claims He Received Messages Asking Him To Join 'I Will Vote for Modi' Campaign\nJust like many others, Filmmaker Anurag Kashyap too claimed he received a message from a BJP supporter urging him to join the \"I will vote for Narendra Modi\" campaign. On Thursday, when the first phase of Lok Sabha elections began, Kashyap shared snapshots of the message he received from Gouraksha Dhotre, President of All India Cine Workers Association.\n\"Had gotten this three days back. Self explanatory,\" wrote Kashyap, along with the screenshot of the message.\nbccl\nThe message read: \"A humble request if you can send an email saying I will vote for Narendra Modi, at the below-given email. It shall be great. Just mention your name and creative designation in that below your message iwillvoteformodi@gmail.com.\nTwitter\n\"We are getting maximum number of people to digitally get 1,000-plus people from film industry in this campaign to answer the artistes... from the film industry (who say) that we will not vote for Modi. If you know a few creative people from the film industry who are Modi followers, kindly forward this message to them.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe message was sent by Dhotre, one of the activists of Maharashtra Navnirman Cineworkers Association (MNCA).\nHad gotten this three days back 👇🏼. Self explanatory . pic.twitter.com/EV2dFg2qWw — Anurag Kashyap (@anuragkashyap72) April 11, 2019\nAsked about the campaign, Dhotre told IANS: \"I am the President of All India Cine Workers Association, an independent body. I believe in the ideology of BJP and yes, I am urging everyone in the film industry to vote for Modiji because I believe that he is the only leader that we need in our country.\"\n\"Hundreds of actors started their campaign against Modiji. They are telling people not to vote BJP. why should we sit silently? We also then should be telling people to vote for him.\"\nInputs From IANS", "title": "Anurag Kashyap Claims He Received Messages Asking Him To Join 'I Will Vote for Modi' Campaign", "date_publish": "12/04/2019, 10:43:55", "description": "Just like many others, Filmmaker Anurag Kashyap too claimed he received a message from a BJP supporter urging him to joim.Just like many others, Filmmaker Anurag Kashyap too claimed he received a message from a BJP supporter urging him to join the.Just like many others, Filmmaker Anurag Kashyap too claimed he received a message from a BJP supporter urging him to joim.Just like many others, Filmmak", "authors": [], "url": "https://www.indiatimes.com/entertainment/anurag-kashyap-claims-he-received-messages-asking-him-to-join-i-will-vote-for-modi-campaign-365298.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/anurag_1555056654_800x420.jpg"}