{"text": "It was both shocking and heartbreaking to come to terms with the story of actor Savi Sidhu who is struggling to support his family. The man who has played prominent roles in movies like Black Friday, Gulaal and Pataila House had no film offers and was finding it tough to support his family financially. And so, he chose to take up the job of a security guard in order to the make ends meet.\nNow, Savi Sidhu works 12 hours a day in a housing society. He was forced to take up this job as he had no money. The actor whose films were once played on the big screen had no money to now go and watch a film in the theatre.\nSavi Sidhu’s story went viral on social media. It was soon noticed by filmmaker Anurag Kashyap who has worked with him in his films. Reading the heart-wrenching story of Savi Sidhu, Anurag Kashyap poured his heart out narrating how he was once a waiter too. He also said that he respects Savi Sidhu for taking up a job and not begging.\nThere are so many actors out there who don’t have work. I respect Savi Siddhu as an actor and have cast him thrice when he earned the role. I respect him that he chose to live his life with dignity and picked a job unlike so many entitled out of work actors who have either — Anurag Kashyap (@anuragkashyap72) March 19, 2019\n2... become alcoholics or wasted themselves away. Nawaz used to be a watchman, I used to be a waiter, I met one actor who sells bhelpuri on streets, I know and actor from Black Friday who drives a rickshaw, the lead from Salaam Bombay used to do the same .. — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nDon't Miss 449 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n3. I have seen the great Uday Chandra who did “Hum Paanch” and “Khel Khiladi Ka” in my early days walking the street. This is also true for many people in all walks of life. This could also be me or anyone else in the future. To give an actor a role out of sympathy is insulting . — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nThe art and the artist. Savi will have to help himself. Only thing one can do is get the casting directors to audition him for him to earn the role and for that he will have to walk to that casting directors office like million others. He has made a conscious choice and .. — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nOne should be proud of him that he did not allow the vanity of the artist to destroy him , and he actually does a job . I have writers that I have worked with who are always borrowing money, I have seen filmmaker’s I have admired borrow money from me for a meal.. — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nTo be a watchman is a job, I don’t see it as a small job or big. At least he is not begging . And I genuinely believe that charity does not make art or an artist. There are millions of stories like Savi Siddhu’s. — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nYou want to help artists like him then you need to start watching their art by paying for it, by actually be a paying audience. Tweeting the story to me won’t help. I have worked with new comers all my life and I move on to the next new talent I can find . — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nWe all make conscious choices. Go to cinemas and buy tickets for films that has unknown amazing talent like Savi Siddhu to make sure that they continue to be what they are best at, to be the artist they want to be. That’s all I had to say . Thank you — Anurag Kashyap (@anuragkashyap72) March 19, 2019\nRajkummar Rao also wrote on Twitter that he would reach out to his casting director friends in order to help Savi Sidhu.\nVery inspired by ur story #SaviSidhu sir. Have always admired ur work in all ur films. Love ur positivity. Will def ask all my casting friends to reach out to u. Thank u @FilmCompanion for sharing his story. Perseverance is the key to overcoming obstacles. https://t.co/mITl3DsmzF — Rajkummar Rao (@RajkummarRao) March 19, 2019\nPlease watch and if there is work for him you know where to find him.#savisidhu https://t.co/FuwvVpzwyr — Patralekhaa (@Patralekhaa9) March 19, 2019\nSometimes luck just runs out for people!\nAlso Read: 'Gulaal' Actor Savi Sadhu, Who Has Worked With Akshay Kumar-Anurag Kashyap, Takes Up Job As A Security Guard", "title": "Anurag Kashyap Extends Support To Actor Savi Sidhu, Who Now Works As A Guard To Make Ends Meet", "date_publish": "20/03/2019, 11:34:39", "description": "Savi Sidhu’s story went viral on social media. It was soon noticed by filmmaker Anurag Kashyap who has worked with him in his films. Reading the heartwrenching story of Savi Sidhu, Anurag Kashyap poured his heart out narrating how he was once a waiter too. He also said that he respects Savi Sidhu for leading taking up a job and not begging.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anurag-kashyap-extends-support-to-actor-savi-sidhu-who-now-works-as-a-guard-to-make-ends-meet-363994.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/anurag_kashyap_reacts_to_the_news_of_gulaal_actor_savi_sidhu_being_forced_to_work_as_security_guard_1553060647_800x420.png"}