{"text": "Anushka Sharma Wishes Husband Virat Kohli In An Adorable Post, Thanks God For His Birth\nAnushka Sharma Wishes Husband Virat Kohli In An Adorable Post, Thanks God For His Birth\nAnushka Sharma and Virat Kohli’s love outshines whenever they are together. While Virat cannot stop gushing over his lady love, Anushka, on the other hand, is always beaming with joy holding his hand and walking beside him. They’re just perfect for each other, aren’t they?\nAlso Read: From Brutally Trolling Her To Now Demanding Her Presence, Virat Kohli Fans Don’t Hate Anushka Sharma Anymore\nIt’s Virat Kohli’s birthday today. And Anushka Sharma took to Twitter to share the love for her husband. In an adorable post, she wrote, “Thank God for his birth”.\nAlso Read: Anushka Sharma Is In Awe Of Virat Kohli’s Record-Breaking Performance, Can’t Stop Gushing ‘What A Man’ He Is\nRecently, Virat Kohli and Anushka Sharma celebrated their first Karwa Chauth together. This how they showered love upon each other.\nAlso Read: Virat Kohli & Anushka Sharma Show They Are BFFs Before Lovers & People Can't Stop Swooning Over The Couple!\nDon't Miss 3.5 K SHARES 518 SHARES 235 SHARES\nNo matter how busy they are in their respective work life, Virat Kohli and Anushka Sharma always manage to take out time for each other.\n“We try to create a proper work-life balance. Both of us really love doing what we do professionally… But at the same time, we try and find time to do something together. We don’t take our professions or our career too seriously… We don’t draw our identity only from that. We are very simple and like doing normal things,” Anushka had said in an interview before.\nAren’t they both just perfect for each other?\nAlso Read: This Pic Of Anushka Sharma Staring Angrily At Husband Virat Kohli Has Become A Subject Of Hilarious Jokes!", "title": "Anushka Sharma Wishes Husband Virat Kohli In An Adorable Post, Thanks God For His Birth", "date_publish": "05/11/2018, 13:41:42", "description": "Anushka Sharma and Virat Kohli’s love outshines whenever they are together. While Virat cannot stop gushing over her lady love, Anushka, on the other hand, is always beaming with joy holding his hand and walking beside him. They’re just perfect for each other, aren’t they?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anushka-sharma-wishes-husband-virat-kohli-in-an-adorable-post-thanks-god-for-his-birth-356073.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/anushka_sharma_wishes_husband_virat_kohli_in_an_adorable_post_thanks_god_for_his_birth_1541404095_800x420.png"}