{"text": "Anushka Cheers For Husband Virat In Australia & We Doubt We'll Ever Get Bored Of Seeing This!\nAnushka Cheers For Husband Virat In Australia & We Doubt We'll Ever Get Bored Of Seeing This!\nAnushka Sharma and Virat Kohli is one adorable couple. They always leave us in awe with their love and PDA. And now these latest pictures of Anushka cheering for Hubby Virat at the cricket stadium is a sight for sore eyes.\nTwitter\nThe actress is in Sydney to cheer her hubby and is doing her best to motivate him on the ground.\nTwitter\nThe pictures of Anushka cheering for Virat are going viral on the internet. Just look at her, she is just so happy and proud of her hubby. Beaming with joy seeing her man play Anushka looks the happiest woman on earth right now.\nDon't Miss 3.4 K SHARES 518 SHARES 235 SHARES\nTwitter\nThe gorgeous couple even rang their New Year in Sydney as Virat had to play the 4th test match between Indian and Australia from January 2, 2019.\nAnushka even shared the beautiful pictures of them celebrating their New Year. She looked uber gorgeous in every frame, while Virat was dressed to kill.\nThis lovely couple never fails us to give us major couple goals. They always make us believe true love exists with her partnership.", "title": "Anushka Cheers For Husband Virat In Australia & We Doubt We'll Ever Get Bored Of Seeing This!", "date_publish": "04/01/2019, 13:45:40", "description": "Anushka Sharma and Virat Kohli is one adorable couple. They always make us go awe with their love and PDA. And now this latest pictures of Anushka cheering for Hubby Virat at the cricket stadium is full of aww. The actress is in Sydney to cheer her hubby and is doing her best to motivate him on the ground. The pictures of Anushka cheering for Virat are going Viral on the internet. Just look at he", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/anushka-cheers-for-husband-virat-in-australia-we-doubt-we-ll-ever-get-bored-of-seeing-this-359833.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/anushka_sharma_1546588226_800x420.jpg"}