{"text": "“Kya aap sab tayyaar hai? (Are you all ready?) See you all at 7:30 PM!,” wrote Alia Bhatt on social media.\nUnlike, previous times when she has toured with Virat, this time she will be paying for her trip. According to reports, the actress will go to stadiums separately. The actress will also hire her own car. She will also bear all her expenses.\n\"First of all, the pressure comes from people's opinion and how in today's age everyone's opinion becomes news,\" Priyanka told IANS in an interview when asked about the pressures that comes with the 'global star' tag.\n\"I don't have any intention to join politics or an election campaign of a political party. Many people feel that I want to enter politics but that's not true. There are few actors in our industry like Ranbir Kapoor where he has been seen talking in an interview that 'We have regular supply of water and electricity at my home so, why should I comment about politics?' But I feel because of this country's people you are living in your luxurious home and you are travelling in your Mercedes so, how can you talk like that? This is irresponsible behaviour and I am not that kind of person.\"\n\"There has to be a war against terror, not against a country, religion, religions or between religions. I am very clear in my outlook. I (will) probably get picked on, but I am not going to sit on the fence and say 'this audience will like it, that won't.\"\nDon't Miss 862 SHARES 346 SHARES", "title": "Anushka To Pay For World Cup 2019, Ranbir-Alia To Unveil First Look Of Brahmastra & More From Ent.", "date_publish": "04/03/2019, 18:23:53", "description": "Unlike, previous times when she has toured with Virat, this time she will be paying for her trip. According to reports, the actress will go to stadiums separately. The actress will also hire her own car. She will also bear all her expenses.Unlike, previous times when she has toured with Virat, this time she will be paying for her trip.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/anushka-to-pay-for-world-cup-2019-ranbir-alia-to-unveil-first-look-of-brahmastra-more-from-ent-363151.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/virushka_1551704376_800x420.jpg"}