{"text": "It was a remarkable day in Visakhapatnam yesterday. After all, Virat Kohli had hit another century at the India Vs West Indies ODI match. With that, he has also become the fastest cricketer to have completed 10,000 ODI runs. He is now the fifth batsman to score 10,000 runs in ODIs after Sachin Tendulkar, Sourav Ganguly, Rahul Dravid and MS Dhoni.\nPTI\nEvery cricket fan in the nation went crazy yesterday over his performance. While fans of Sachin Tendulkar and Virat Kohli might still argue who is better, the Master Blaster couldn’t hold himself back from showering praises upon him.\nThe intensity and consistency with which you bat is just amazing. @imVkohli, congratulations on achieving 10,000 runs in ODIs. Keep the runs flowing. pic.twitter.com/tQUhY8bHna — Sachin Tendulkar (@sachin_rt) October 24, 2018\nNot only that, even Mumbai police praised him for ‘over-speeding’.\nNo over-speeding challan here, just accolades & best wishes for more @imVkohli ! Many congratulations on your amazing feat! pic.twitter.com/JOytK0YfK2 — Mumbai Police (@MumbaiPolice) October 24, 2018\nDon't Miss 3.5 K SHARES\nAmid all this, his wife Anushka Sharma was also going gaga over his fabulous record-breaking performance. Gushing over him, she kept wondering what a great man he is.\nInstagram\nIn an earlier interview, Anushka Sharma about Virat Kohli had said, “I am married to the greatest man in the world.\" Indeed.", "title": "Anushka Sharma Is In Awe Of Virat Kohli’s Record-Breaking Performance, Can’t Stop Gushing ‘What A Man’ He Is", "date_publish": "25/10/2018, 11:22:26", "description": "It was a remarkable day in Visakhapatna. After all, Virat Kohli had hit another century at the India Vs West Indies ODI match. With that, he has also become the fastest cricketer to have completed 10,000 ODI runs breaking Master Blaster Sachin Tendulkar’s record.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anushka-sharma-is-in-awe-of-virat-kohli-s-record-breaking-performance-can-t-stop-gushing-what-a-man-he-is-355401.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anushka_sharma_is_in_awe_of_virat_kohlis_recordbreaking_performance_cant_stop_wondering_what_a_1540445720_800x420.png"}