{"text": "Anushka Is High On Marital Bliss, Says Virat Has All The Qualities She Wanted In A Life Partner\nAnushka Is High On Marital Bliss, Says Virat Has All The Qualities She Wanted In A Life Partner\nTrue love brings out the best in you and for Virat Kohli and Anushka Sharma, their love story has been nothing short of a fairy tale. After dating for over three years, the couple tied the knot in Tuscany, Italy and the pictures turned our hearts into a pool of mush.\nInstagram\nIt's been more than a year since they got married to each other but the way their love is only increasing with time, it's some solid relationship goals. Even when their professional commitments keep them busy, they know how to take time out for each other.\nAnushka opened up about her marriage and talking to Filmfare, she shared some beautiful details about their marriage. Talking about her husband Virat's impact on her life, Anushka said,\nInstagram\nDon't Miss 3.4 K SHARES 518 SHARES 12.5 K SHARES 5.5 K SHARES 3.1 K SHARES\n\"His honesty is something I deeply value. I’m an honest person and have suffered on account of that. He’s brutally honest too. I’m so happy that I met someone like him because we both lead our lives with complete honesty. It’s so transparent and clean. I have a life partner with whom nothing is pretentious.\"\nAnushka added that they both fit in perfectly in each other's life also because they are very similar as individuals. She added,\n\"Everything is real. Also, the fact that we both support each other. He’s someone, who’s constantly trying to get better professionally and as an individual. I’m also like that. We don’t take ourselves so seriously. We’re similar people. That’s why we get along.\"\nThe couple recently took some time out and was holidaying in New Zealand.", "title": "Anushka Is High On Marital Bliss, Says Virat Has All The Qualities She Wanted In A Life Partner", "date_publish": "31/01/2019, 11:37:11", "description": "True love brings out the best in you and for Virat Kohli and Anushka Sharma, their love story has been nothing short of a fairy tale. After dating for over three years, the couple tied the knot in Tuscany, Italy and the pictures turned our hearts into a pool of mush.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/anushka-is-high-on-marital-bliss-says-virat-has-all-the-qualities-she-wanted-in-a-life-partner-361342.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/virushka_1548914208_800x420.jpg"}