{"text": "‘OMG Yes’! Anushka Sharma And Her Doppelganger Julia Michaels’ Reaction On Seeing Each Other’s Picture Is Priceless\n‘OMG Yes’! Anushka Sharma And Her Doppelganger Julia Michaels’ Reaction On Seeing Each Other’s Picture Is Priceless\nHow would you react on seeing someone who looks uncannily similar to you? I would be fascinated but at the same time creeped out too.\nBut because it’s a big damn world, most of us might never come across our own doppelgangers. However, in case of a celebrity, when your face is plastered almost everywhere including social media, it doesn’t take much effort to spot a look-alike.\nThat’s what happened recently. After Salman Khan’s doppelganger was spotted in Karachi, Pakistan, Anushka Sharma’s look-alike was found in America. And not just a random person, but Anushka Sharma looks quite similar to American singer Julia Michaels.\nDon't Miss 3.4 K SHARES 518 SHARES 12.5 K SHARES 5.5 K SHARES\nAfter the picture went viral, fans were shook.\nUnbelievable 😀😀 — Pawan Tiwari (@pawanerp) February 4, 2019\nWell, not only fans, Julia Michaels was shocked at this too. So much so, that she decided to tweet to Anushka Sharma. Sharing the collage of side-by-side picture with her, she wrote, “Hi @AnushkaSharma apparently we’re twins lol.”\nAnushka Sharma was quick to notice this. In her response, she wrote, “OMG YES!! I've been looking for you and the remaining 5 of our dopplegangers all my life.\"\nOMG YES!! 😲 I've been looking for you and the remaining 5 of our dopplegangers all my life 😂 https://t.co/SaYbclXyXt — Anushka Sharma (@AnushkaSharma) February 5, 2019", "title": "Anushka Sharma’s doppelganger:Anushka Sharma And Her Doppelganger Julia Michaels’ Reaction On Seeing Each Other’s Picture Is Priceless", "date_publish": "06/02/2019, 11:13:06", "description": "Anushka Sharma’s doppelganger tweeted to her. Anushka Sharma’s look-alike was found in an American Singer Julia Michaels. Well, not only fans, Julia Michaels was shocked at this. So much so, that she decided to tweet to Anushka Sharma. Sharing the collage of side-by-side picture with her, she wrote, “Hi @AnushkaSharma apparently we’re twins lol.”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/anushka-sharma-and-her-doppelganger-julia-michaels-reaction-on-seeing-each-other-s-picture-is-priceless-361652.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/anushka_sharmas_doppelganger_julia_michaels_tweets_to_her_and_their_reaction_seeing_each_other_1549431039_800x420.png"}