{"text": "How often have we seen 'hero ka dost' getting as much love and adulation as much as the main lead? Well, there is one person in Bollywood who is changing the way we see such actors.\nBe it Dangal, Badrinath Ki Dulhania, Happy Phirr Bhag Jayegi, Stree to his latest release Luka Chuppi, Aparshakti has made his presence felt. He also went on to impressing critics and fans with his performance in films like Stree and Dangal, has said he wants to play lead roles but does not want to rush with the offers he is getting.\nInstagram\nHe is waiting for the right script and the right part. Talking to IANS, he said,\nTwitter\n“There are a lot of people who approached me after Dangal and Stree to do films in lead roles with great money. But I don’t want to rush into it. I want you to call me with a happy face that the film is rocking... And that will only happen if I make wise and patient decisions. So I am just kind of waiting for the right script and not jumping the gun and not rushing into it.”\nHe further added that people have to go through a lot of small roles to finally bad a big role. He added,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“A lot of actors have made that mistake. Apart from Rajkummar Rao, nobody has been able to do that... Somebody who used to do smaller roles and then come into the big proper male lead character. Apart from Rajkummar, I don’t think anyone else has been able to do that.”\nHe shares a heartwarming anecdote on how someone at the airport once reminded him that he is doing absolutely fine. He said,\n“I was travelling and a guy came to me at the airport and said a very thing cute thing which makes me very happy. He said ‘Sir, aapko pata hai aapne hero ke dostun ko respect de di’ (‘Do you know you gave respect to hero’s friends’). I felt so good about it. And whenever somebody comes and gives me ‘gyaan’ on doing a lead role or look upon down on me as an actor because I am not doing things in the lead space, I just go back to that conversation and feel happy about it.”\nAparshakti feels it is important to prove one’s mettle time and again. “And be at the right place at the right time, perform at the right time, work with the right people and don’t get into the rat race of being a hero.” Asserting that there is a difference between “being a hero and being an actor”, he said: “My modus operandi is to become a better actor.”\nHe has just started writing his chapter in the Bollywood story, and feels it will get more difficult with time. He adds,\nMaddock Films\n“Now is the more difficult part of the journey because earlier people didn’t know who you are (I am) and didn’t know what you (I) can do. But now people expect a certain kind of performance from you (me). So it is going to be more difficult.”\nOn the professional front, he has projects like Jabariya Jodi and Street Dancer 3D in his kitty.\n(With agency inputs)", "title": "Aparshakti Khurana Shares Why Playing 'Hero Ka Dost' Satisfies Him As An Actor!", "date_publish": "11/03/2019, 13:25:42", "description": "This is how Aparshakti Khurana deals with people looking down upon his roles Praising Rajkummar Rao for making a swift shift from small roles to playing the main lead, Aparshakti Khurana says he wants to wait and make the right decisions while choosing his future films.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aparshakti-khurana-shares-why-playing-hero-ka-dost-satisfies-him-as-an-actor-363508.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/aparshakti_khurana_1552309713_800x420.jpg"}