{"text": "Aparshakti Khurrana Has A Sensible Take On Why He Has No Competition With Brother Ayushmann!\nAparshakti Khurrana Has A Sensible Take On Why He Has No Competition With Brother Ayushmann!\nWhen siblings enter a similar profession, there are several questions around competition and rivalry. For actors Ayushmann Khurrana and brother Aparshakti Khurrana, there is no scope of competition between them. Talking to IANS, Aparshakti said,\nTwitter\n“Competition generally happens between two equals. In our case, Ayushmann and I are in different spaces of cinema. He has always been a front-runner. His films differ from mine, and so does our audience”.\nHe justified how there can't be any competition between two equals. He added,\nTwitter\n“There can’t be any comparison, because comparison takes place between two equals and we both have different paths in the industry. There can’t be any competition.\"\nHe also shared his desire to work with his older brother on screen. The actor who was last seen in Luka Chuppi ( 2019)and Stree (2018), has been appreciated for his nuanced comical performances. The actor also said that he was not worried about being typecast into roles where he plays the hero’s best friend.\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\n“Not at all. I feel there is a need for such characters in our films. The film does not solely work on a single hero. It takes proper teamwork and coordination to make a film hit,” he said.\nHe further added,\n“If filmmakers feel I am capable of such roles, there is nothing about being typecast. It all depends upon relevant roles and scripts.\"\nNot many know that Aparshakti was a practicing lawyer before getting into anchoring for radio shows and then acting. His upcoming project includes Street Dancer 3D, where the actor will share screen-space with Varun Dhawan.\n(With agency inputs)", "title": "Aparshakti Khurrana Has A Sensible Take On Why He Has No Competition With Brother Ayushmann!", "date_publish": "27/03/2019, 16:01:14", "description": "He also shared his desire to work with his older brother on screen. The actor who was last seen in Luka Chuppi ( 2019)and Stree (2018), has been appreciated for his nuanced comical performances. The actor also said that he was not worried about being typecast into roles where he plays the hero’s best friend.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/aparshakti-khurrana-has-a-sensible-take-on-why-he-has-no-competition-with-brother-ayushmann-364394.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ayushmann_1553680815_800x420.jpg"}