{"text": "Apna Time Aayega! Trailer Of Gully Boy Is Here & It's A Haven For Underground Music Lovers\nApna Time Aayega! Trailer Of Gully Boy Is Here & It's A Haven For Underground Music Lovers\n\"Tu Nanga Aaya Hai Toh Kya Ghanta Leke Jaayega\"- raps Ranveer Singh in the trailer of Gully Boy. Helmed by Zoya Akhtar, the film stars Ranveer Singh, Alia Bhatt, Kalki Koechlin in pivotal roles.\nAfter a long wait, the trailer of the film is already out and yes, it does fulfill all our expectations.\nExcel Entertainment\nBoth Alia Bhatt and Ranveer Singh look endearing and convincing in their roles as they tell their story of rags to riches and making it big in the city of dreams-Mumbai. In his rapper avatar, Ranveer Singh's portrayal again proves that he can easily slip in, into the skin of all his characters.\nExcel Entertainment\nThe trailer of the film was unveiled in Mumbai today and Singh like always headlined it in his own style.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nDirected by Zoya Akhtar and produced by Ritesh Sidhwani and Farhan Akhtar, the film has lifted inspiration from the life of rappers, Vivian Fernandes aka Divine and Naved Shaikh aka Naezy.\nTwitter\nWithout further ado, watch the trailer right here.\nThis film definitely looks like one where you don't have to think twice before putting your money on it!", "title": "Apna Time Aayega! Trailer Of Gully Boy Is Here & It's A Haven For Underground Music Lovers", "date_publish": "09/01/2019, 15:17:09", "description": "\"Tu Nanga Aaya Hai Toh Kya Ghanta Leke Jaayega\"- raps Ranveer Singh in the trailer of Gully Boy. Helmed by Zoya Akhtar, the film stars Ranveer Singh, Alia Bhatt, Kalki Koechlin in pivotal roles. After a long wait, the trailer of the film is already out and yes, it does fulfill all our expectations.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/apna-time-aayega-trailer-of-gully-boy-is-here-it-s-a-haven-for-underground-music-lovers-360093.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/gully_boy_1547025854_800x420.jpg"}