{"text": "'Aquaman' Jason Momoa Says He Hasn't Worked Out In A Year & Fans Are Finding It Hard To Believe\n'Aquaman' Jason Momoa Says He Hasn't Worked Out In A Year & Fans Are Finding It Hard To Believe\nHe is handsome, he is talented and he is also romantic – Jason Momoa is one sexy beast that leaves women drooling over his hot bod! He is so hot, he sets the temperatures soaring.\nBut can you believe that the handsome hunk hasn’t worked out in a year! That’s what he said recently.\npinimg.com\nJason Momoa who has been gearing up for the release of Aquaman was interviewing with Entertainment Weekly, when his co-star Amber Heard revealed that he \"loves working out\".\nTo which, Jason Momoa replied, “Absolutely f*****g not I love rock climbing, but I do not love working out. I haven't worked out in at least a year and it's been awesome.”\nCan you believe it?\newedit.files.wordpress.com\nJason Momoa’s much-awaited movie Aquaman has already hit the theatres in China and it made a huge splash on the opening day itself.\nFrankly,#Aquaman might be the best CGI movie ever, except #Avater .Not surprisingly, it has earned 60M in two and a half days in China, releasing on Dec 7, which also broke the record made by #Avengers earlier this year. The glittering effects made this popcorn movie succeed.🥰 pic.twitter.com/xJAtxMcweg — zzace (@Melodyzhhang) December 9, 2018\nDon't Miss 112 SHARES 365 SHARES 638 SHARES 583 SHARES\na) this keeps getting crazier\nb) the reaction from everyone who has seen #Aquaman including all those millions of movie goers in China really makes me hyped for an amazing film https://t.co/PU2bv3q2Pq — BatmanFanDeutschland (@BatmanMeer1989) December 9, 2018\n#Aquaman Has Earned Over $60M In Just Two Days In China — தாந்தோனி (@thanDhoniRule) December 9, 2018\n‘Aquaman’ opens big in China, and Warner Bros. is already planning a sequel: #JasonMomoa is hosting Saturday Night Live this weekend, one more bit of high-profile publicity for #Aquaman. The Warner Bros./ #DC superhero flick he’s starring has already… https://t.co/LZzc6BU7Ay pic.twitter.com/5jlTRbL8nn — HyperLoop555 (@Triple5Light) December 9, 2018\n#Aquaman scoring high on china Box office 🤘 can't wait for India release !! pic.twitter.com/v6UfEmvJOr — k A (@KajalHolicSRS) December 8, 2018\nAquaman will open in theatres in Indian on Dec 21.", "title": "'Aquaman' Jason Momoa Says He Hasn't Worked Out In A Year & Fans Are Finding It Hard To Believe", "date_publish": "09/12/2018, 14:58:28", "description": "He is handsome, he is talented and he is also romantic – Jason Momoa is one sexy beast that leaves women drooling over his hot bod! He is so hot, he sets the temperatures soaring. So much so, that he will make you reach out for an AC. But can you believe that the handsome hunk hasn’t worked out in a year! That’s what he said recently.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aquaman-jason-momoa-says-he-hasn-t-worked-out-in-a-year-fans-are-finding-it-hard-to-believe-358229.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/aquaman_jason_momoa_says_he_hasnt_worked_out_in_a_year__fans_are_finding_it_hard_to_believe_1544345020_800x420.jpg"}