{"text": "AR Rahman's Marvel Anthem For Avengers: Endgame Is Out And Fans Are Disappointed\nAR Rahman's Marvel Anthem For Avengers: Endgame Is Out And Fans Are Disappointed\nJust a few days ago, Indian film critic and trade analyst Taran Adarsh had confirmed that Rahman will be composing a song for Indian fans in three languages, Hindi, Tamil, and Telugu. Finally, after the short and sweet wait, the Marvel Anthem in Hindi composed by music maestro AR Rahman is finally out. To share the news with the world, Marvel India tweeted the video and wrote:\nScreengrab\n\"Here's something special for all you amazing Marvel India fans!\"\nThe anthem by AR Rahman was at an event in Mumbai. Rahman's anthem is as perfect as it could get as it perfectly sums up the Avengers' resolution to take down Thanos - \"Whatever it takes.\"\nIn the second half of the song, you get to go on a ride that includes Captain America, Iron Man, Hawkeye, Thor, and Black Widow. Without further ado, listen to the song here:\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHere are the first reactions to the song. While a few liked the song, most confessed that it's the worst Rahman song they've ever heard.\nThe #MarvelAnthem by AR Rahman is terribly disappointing. It’s a fine standalone song, but doesn’t suit the evocative & powerful nature of #Endgame’s marketing campaign.\nRahman of the now was not the right guy to compose the song. Shankar Ehsaan Loy would’ve been a better fit. — Dashran Yohan (@dashtalksmovies) April 1, 2019\nFor the first time in my life i have disliked an A.R Rahman song. #MarvelAnthem — Fazlur (@abychalbe) April 1, 2019\n#MarvelAnthem\nIt isn't the level of MCU. — CHOWKIDAR THANOS (@TitanKaThanos) April 1, 2019\nWorst antham for endgame #MarvelAnthem — Ritik Pandey (@itsmeRitik_) April 1, 2019\n*After listening AR Rahman's marvel anthem\nMe - pic.twitter.com/UcyV3Jomre — Jatin Joshi (@JatinJoshi394) April 1, 2019\nHuge respect for @arrahman sir but Please do us a favour and don't add this in the Movie. — ShvatiK (@shvatik) April 2, 2019", "title": "AR Rahman's Marvel Anthem For Avengers: Endgame Is Out And Fans Are Disappointed", "date_publish": "02/04/2019, 11:11:23", "description": "Just a few days ago, Indian film critic and trade analyst Taran Adarsh had confirmed that Rahman will be composing a song for Indian fans in three languages, Hindi, Tamil, and Telugu. Finally, after the short and sweet wait, the Marvel Anthem in Hindi composed by music maestro AR Rahman is finally out.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ar-rahman-s-marvel-anthem-for-avengers-endgame-is-out-and-fans-are-disappointed-364707.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/rahman_1554185411_800x420.jpg"}