{"text": "Celebrities aren’t immune against the sad realities of life. A lot of them including Deepika Padukone in the past had revealed about their struggle with depression. An untreated depression has all the potential to lead to suicide.\nDid you know that before the country recognised the talent of AR Rahman, the celebrated composer says there was a phase in his life where he felt like a failure and thought about ending his life almost every day.\nThe Oscar-winning composer says the initial low phase of his career eventually helped him emerge braver.\n\"Up until 25, I used to think about suicide. Most of us feel they are not good enough. Because I lost my father, there was this void... There were so many things happening. (But) that in a way made me more fearless. Death is a permanent thing for everyone. Since everything created has an expiry date, so why be afraid of anything?\" Rahman told PTI.\nBCCL\nThe turnaround for the 51-year-old composer came when he built his recording studio Panchathan Record Inn in his backyard in hometown Chennai.\n\"Before that, things were dormant so may be it (the feeling) manifested then. Because of my father's death and the way he was working, I didn't do many movies. I got 35 movies and I did two. Everyone wondered 'How are you going to survive? You have everything, grab it.' I was 25 then. I couldn't do that. It's like eating everything. You become numb. So even if you eat small meals, make it fulfilling,\" he adds.\nThe composer talks about hard times and other events in his life in Notes of a Dream: The Authorized Biography of AR Rahman. Written by author Krishna Trilok, the biography, in association with Landmark and Penguin Random House, was launched here, Saturday. Rahman was nine when his father RK Shekhar, who was film-score composer, passed away and the family had to rent out his musical equipment to get by. Rahman, thus, took to music at a very young age.\nDon't Miss 2.4 K SHARES 2.5 K SHARES 132 SHARES 1.3 K SHARES\nyourstory\n\"I finished everything between the age of 12 to 22. It was boring for me to do all the normal stuff. I didn't want to do it,\" he says.\nIn his 20s, before he made his debut as a composer with Mani Ratnam's \"Roja\" (1992), Rahman along with his family embraced Sufi Islam. He reinvented himself by letting go not only the baggage from the past, but also his birth name - Dileep Kumar, which he says, he despised.\n\"I never liked my original name Dileep Kumar. I don't even know why I hated it. I felt it didn't match my personality. I wanted to become another person. I felt like that would define and change my whole (being). I wanted to get rid of all the past luggage,\" he says.\nWith Roja, Rahman shot to instant fame as the wonder kid in the industry, who changed the grammar of music and sounds. But creating music is not a lonely process for the musician as much as it is \"internal\".\n\"You manifest who you are and let it out. So when you are ideating on your mental drawing book, you need a lot of self-analysis and you have to dive deep within you. You need to listen to yourself. It's hard to listen to your inner side. But once you do, you have to let lose and forget yourself,\" he adds.\nyoutube\nIt was for this reason, Rahman says, that he works only during late nights or early mornings.\n\"If I am going deep inside something and suddenly there's a knock on the door, I'll come to reality from a very different world and I won't be able to go back to the same spot again. This is one of the reasons I prefer (being at work) very early mornings like 5 AM or 6 AM or the nights,\" he says.\nRahman says the most important thing for him is not to feel bored and constantly try to do something new; be it professionally or personally.\n\"You feel jaded if you do the same thing. You need to find different things to do. For me travelling, parenting and spending time with my family though I can't do that much is beautiful. It helps a lot.", "title": "AR Rahman Talks About The Time He Felt Like A Failure & Wanted To Commit Suicide Everyday!", "date_publish": "04/11/2018, 16:35:48", "description": "Before the country recognised the talent of AR Rahman, the celebrated composer says there was a phase in his life where he felt like a failure and thought about ending his life almost every day. The Oscar-winning composer says the initial low phase of his career eventually helped him emerge braver. \"Up until 25, I used to think about suicide. Most of us feel they are not good enough.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ar-rahman-talks-about-the-time-he-felt-like-a-failure-wanted-to-commit-suicide-everyday-356029.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ar_rahman_1541327235_800x420.jpg"}