{"text": "The festival of lights is right around the corner and just like all of us Bollywood celebrities are also gearing up to have enjoy the festivities. A day before yesterday, the King Khan of Bollywood, Shah Rukh had organised a Diwali bash at his home Mannat, which was attended by many celebs including Katrina Kaif, Kareena Kapoor, Aamir Khan, Alia Bhatt and Karan Johar among others.\nAlso Read: From Aamir Khan To Kareena Kapoor, Celebs Upped The Glamourous Quotient At Shah Rukh Khan’s Diwali Bash\nAnd yesterday, another Diwali party was organised by Shilpa Shetty Kundra. From Salman Khan to Preity Zinta, a lot of celebrities graced the occasion in their ethnic best attires.\nWhat made heads turn was the fact that Arbaaz Khan arrived at the Shilpa Shetty’s Diwali bash with girlfriend Giorgia Andriani and Sushmita Sen with her rumoured boyfriend Rohman Shawl.\n#1\nViral Bhayani\nDon't Miss 343 SHARES 597 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\n#2\nViral Bhayani\n#3\nTwitter\n#4\nViral Bhayani\n#5\nViral Bhayani\n#6\nViral Bhayani\n#7\nViral Bhayani\n#8\nViral Bhayani\n#9\nViral Bhayani\n#10\nViral Bhayani\n#11\nViral Bhayani\nEveryone looked stunning in their festive attires, don’t you think? How are you celebrating Diwali? Let us know in the comments section below.", "title": "Arbaaz Khan & Sushmita Sen Make An Entrance With Their Partners At Shilpa Shetty’s Star-Studded Diwali Bash", "date_publish": "05/11/2018, 11:36:10", "description": "And yesterday, another Diwali party was organised by Shilpa Shetty Kundra. From Salman Khan to Preity Zinta, a lot of celebrities graced the occasion in their ethnic best attires. What made heads turn was the fact that Arbaz Khan arrived at the Shilpa Shetty’s Diwali bash with girlfriend Giorgia Andriani and Sushmita Sen with her rumoured boyfriend Rohman Shawl", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/arbaaz-khan-sushmita-sen-make-an-entrance-with-their-partners-at-shilpa-shetty-s-star-studded-diwali-bash-356056.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/arbaaz__sushmita_arrive_with_respective_partners_among_others_at_shilpa_shettys_diwali_bash_1541396403_800x420.png"}