{"text": "The news of sexual harassment charges pressed against Rajkumar Hirani has shaken the faith of a lot of people. While fans are disjointed with the news, a few people have strongly reacted to it.\nAfter a prolonged deafening silence of people over the issues, a very few have actually come out and spoken about it.\nDia Mirza, a close friend of Hirani who's worked with him in Lage Raho Munnabhai and Sanju , reacted with stupefied confusion.\nTwitter\n\"I am deeply distressed by this news. As someone who has known and respects Raju sir for 15 years, I can only hope that a due official inquiry is conducted. He is one of the most decent human beings I have ever worked with and I think it would be grossly unjust on my part to speak on this as I do not know the details,\" Dia said.\nAfter Sanju actress Dia Mirza called it 'deeply depressing', actor Sharman Joshi, who has worked with Hirani in the epic hit 3 Idiots, has spoken out on the issue.\nDon't Miss 189 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nHdfinewallpapers\nApart from Sharman Joshi, Arshi Warsi too has reacted over the matter.\nArshad Warsi, who played Circuit in Hirani's Munna Bhai franchise, said,\nTwitter\n\"If you talk to me about Raju Hirani as a person, as a personality and how he is, I think he is a wonderful person and a thorough gentleman. So, for me, It’s a shocker as it is for everybody else who has heard this news.\"\nEveryone is questioning Bollywood's silence over the accusations.\n(With agency inputs)", "title": "Arshad Warsi & Sharman Joshi React To Sexual Harassment Charges Pressed Against Rajkumar Hirani", "date_publish": "15/01/2019, 11:23:07", "description": "The news of sexual harassment charges pressed against Rajkumar Hirani has shaken the faith of a lot of people. While fans are disjointed with the news, a few people have strongly reacted to the news. After a prolonged deafening silence of people over the issues, a very few have actually come out and spoken about it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/arshad-warsi-sharman-joshi-react-to-sexual-harassment-charges-pressed-against-rajkumar-hirani-360418.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hirani_1547556702_800x420.jpg"}