{"text": "#AryaChallenge Takes Over The Internet, Fans Give Hilarious Twist To Her Badass Moves From The Battle Of Winterfell\n#AryaChallenge Takes Over The Internet, Fans Give Hilarious Twist To Her Badass Moves From The Battle Of Winterfell\nDon’t call yourself a Game of Thrones fan, if you have still not seen the third episode of Game of Thrones season 8. Also, don’t scroll down, because:\nvia GIPHY\nIn the battle of Winterfell, when all eyes were glued to Jon Snow, who people thought will kill the Night King, and also Daenerys Targaryen, who seemed most powerful with her dragons, it was Arya Stark who stole the show.\nvia GIPHY\nPeople hailed that she was the real queen, the real hero of Game of Thrones after she stabbed the Night King. Apparently, appearing from nowhere in the darkness, Arya Stark pounced on the Night King, and pulled off a mid-air hand switch to kill the most dangerous villain of the show.\nvia GIPHY\nFirstly, it was her who did it. And secondly, how she did it was hell impressive.\nAnd people are so impressed and curious that they are now trying it on their own. And so, #AryaChallenge has taken over the internet.\nAnd it’s hilarious. Take a look!\n#1\n#2\n#3\nNichtern says #NotToday Holy Cross😤 With his six assists today, the rookie is tied for first in Army’s single-season assists record with 45👏 #GoArmy #FamilyToughnessTradition pic.twitter.com/BBDKZWXLHK — Army M.Lacrosse (@ArmyWP_MLax) April 30, 2019\nDon't Miss 159 SHARES 842 SHARES\n#4\n#5\n#6\n#7\nPeople on the internet are so creative!", "title": "#AryaChallenge Takes Over The Internet, Fans Give Hilarious Twist To Her Badass Moves From The Battle Of Winterfell", "date_publish": "02/05/2019, 13:56:03", "description": "And people are so impressed and curious that they are now trying it on their own. And so, #AryaChallenge has taken over the internet. And people are so impressed and curious that they are now trying it on their own. And so, #AryaChallenge has taken over the internet.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/aryachallenge-takes-over-the-internet-fans-give-hilarious-twist-to-her-badass-moves-from-the-battle-of-winterfell-366471.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/arya_starks_badass_moves_in_the_battle_of_winterfell_gives_rise_to_aryachallenge_1556783424_800x420.png"}