{"text": "As 2018 Comes To An End, Alia Bhatt Shares How Challenging & Beautiful This Year Was For Her!\nAs 2018 Comes To An End, Alia Bhatt Shares How Challenging & Beautiful This Year Was For Her!\nAlia Bhatt is currently one of the most sought after actresses in 2018. Doing challenging roles like Raazi this year, Alia Bhatt once again proved her mettle as an actor. This year has been fabulous for Alia Bhatt and she says that her love of movies kept her going.\nAs 2018 comes to an end, Alia Bhatt opened up about how challenging yet beautiful her year was and also hinted at what really kept her going.\nAlia, who wrapped up the shoot of 'Kalank' with co-stars Varun Dhawan and Aditya Roy Kapur in Hyderabad today, on Day 70, took to her Instagram and penned down her thoughts about the passing year.\nbollywood\nShe wrote, \"This past year has been the most challenging phase in my life. It was all work work work. At one point I thought I wouldn't be able to do it anymore. But my love (love for the movies) kept me going and I cherish every moment of it. I've learnt soo much.and now I can't believe it holiday time.That said.It's just the beginning gearing up for 2019.\"\nDon't Miss 336 SHARES 161 SHARES 247 SHARES 699 SHARES\nClearing the air about her rumoured relationship with Ranbir Kapoor, Alia, in her post, shared that it is the love of her movies that kept her going.\nInstagram\nWith three movies in her kitty, including 'Gully Boy,' opposite Ranveer Singh, multi-starrer 'Kalank', which features Madhuri Dixit, Sonakshi Sinha, Varun Dhawan, Kunal Khemu, Aditya Roy Kapur, and Sanjay Dutt and 'Brahmastra' opposite Ranbir Kapoor, Alia will surely rule 2019.\nWith inputs from ANI", "title": "As 2018 Comes To An End, Alia Bhatt Shares How Challenging & Beautiful This Year Was For Her!", "date_publish": "30/12/2018, 18:48:29", "description": "Alia Bhatt is currently one of the most sought after actresses in 2018. Doing challenging roles like Raazi this year, Alia Bhatt once again proved her mettle as an actor. This year has been fabulous for Alia Bhatt and she says that her love of movies kept her going.", "authors": [], "url": "https://www.indiatimes.com/entertainment/as-2018-comes-to-an-end-alia-bhatt-shares-how-challenging-beautiful-this-year-was-for-her-359527.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/as_2018_comes_to_an_end_alia_bhatt_shares_how_challenging__beautiful_this_year_was_1546175616_800x420.jpg"}