{"text": "Vicky Kaushal and Yami Gautam starrer Uri has proved itself at the box-office and become this year's first hit. In less than a week, the film is inching closer to 50 crores at the box-office. While both Vicky and Yami are earning praises for the portrayal of their characters in the film, there is another reason why the team is being touted as inspirational.\nRSVP Films\nOn the occasion of Army Day, on 15th of January, the entire team of Uri including Vicky Kaushal, Yami Gautam, and the director of Uri, Aditya Dhar attended the parade in Delhi.\n(Also read: After The Success Of Uri, Vicky Kaushal Promises To Never Take His Stardom For Granted)\nAgencies\nReports claim that apart from hosting a special screening of the movie, Ronnie Screwvala’s production house RSVP also extended a donation worth Rs 1 crore towards the welfare fund of Army widows.\nAgencies\nThis is definitely inspirational for reasons more than one. That's not all. The team had also hosted a special screening of Uri to get honest feedback from the army officers and they did successfully pass the litmus test.\n(Also read: Vicky Kaushal Shares How He Gained 15 Kgs Of Muscle Weight For ‘Uri’ & It’ll Make You Sweat)\nDon't Miss 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES", "title": "As A Mark Of Respect On Army Day, The Makers Of 'Uri' Donate 1 Crore To Army Widows", "date_publish": "16/01/2019, 15:33:46", "description": "Vicky Kaushal and Yami Gautam starrer Uri has proved itself at the box-office and become this year's first hit. In less than a week, the film is inching closer to 50 crores at the box-office. While both Vicky and Yami are earning praises for the portrayal of their characters in the film, there is another reason why the team is being touted as inspirational.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/as-a-mark-of-respect-on-army-day-the-makers-of-uri-donate-1-crore-to-army-widows-360514.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_1547633122_800x420.jpg"}