{"text": "As Avengers: Endgame Tickets Go On Sale In India, Websites Crash Because Of Mass Bookings\nAs Avengers: Endgame Tickets Go On Sale In India, Websites Crash Because Of Mass Bookings\nTickets for the most-anticipated movie of the year Avengers: Endgame went on sale today in India and people from all over the nation went wild to book their tickets for first day first show, because who wants spoilers from friends, colleagues and random strangers?\nAnd this came at a cost, crashing the websites left, right and centre. So, guys, Avengers Endgame isn’t just a film, it is a phenomenon.\nThe website of Bookmyshow crashed in some areas of the country because lots of people were trying to book their tickets at the same time apparently.\nFor the unversed, the Avengers: Endgame tickets went up on sale on BookMyShow, Paytm, as well as the official websites of PVR Cinemas and INOX on Sunday. For Cinépolis and Carnival Cinemas, the tickets are apparently not live yet.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nIf this wasn’t enough, Paytm is apparently running a contest which offers two free tickets to the film for first day first show. Considering the frenzy of Marvel fans, the websites crashing were no surprise tbh.\nYeh avengers ki tickets jis speed se sold out huyi hai, usse speed se mera ex rang badalta tha. 😭😒#yaadaagyiuski — ❤️ (@chaikideewani) April 20, 2019\nAlmost all the Avengers : Endgame tickets are sold out for 26th at my place in just a few hours I'M SO ANNOYED — madhu (@bizzleshawn) April 21, 2019\nBought my life's most expensive movie ticket for Avengers Endgame.. — Agnimitra Sharma (@AgniOnFire) April 21, 2019\nBought my life's most expensive movie ticket for Avengers Endgame.. — Agnimitra Sharma (@AgniOnFire) April 21, 2019\nAvengers: Endgame tickets sold out faster than Tatkal Tickets 😮\nWhat a hype 😍#AvengersEndgame — Gaurav Rai (@Gaurav_Rai_) April 21, 2019\nCouldn't book for 26th\nAs it was sold out not even other languages were spared\nThanos wipes all the tickets — Aditya (@adi11_aditya) April 21, 2019\nAvengers hype is unreal. Tickets are selling like hot cakes. — Rohit (@iamFayezur) April 21, 2019\nDid you manage to book the tickets yet? If you were the lucky one, tell us about it in the comments section below. And by the way, tickets can be booked through Insider as well, in case BookMyShow collapses. But I think, it’s too late for this information now.", "title": "As Avengers: Endgame Tickets Go On Sale In India, Websites Crash Because Of Mass Bookings", "date_publish": "21/04/2019, 17:57:22", "description": "Tickets for the most-anticipated movie of the year Avengers: Endgame went on sale today in India and people from all over the nation went wild to book their tickets for first day first show, because who wants spoilers from friends, colleagues and random strangers? The website of Bookmyshow crashed in some areas of the country because lots of people were trying to book their tickets at the same tim", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-avengers-endgame-tickets-go-on-sale-in-india-websites-crash-because-of-mass-bookings-365856.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/as_avengers_endgame_tickets_go_on_sale_in_india_websites_crash_because_of_mass_bookings_1555848983_800x420.png"}