{"text": "Some love stories are classic and timeless and Raj-Simran's love story is one such example. The film managed to win a lot of hearts and it still continues to rule the hearts of many. For many of us, this love story still remains a favorite one. And this year, this love story has completed 23 years of release.\nOn Tuesday night, Shah Rukh took to his social media handles to thank all his fans and followers for keeping Raj and Simran's story alive even after 1200 weeks. He wrote, \"A special journey that began 23 years ago, goes on even today. Your love has kept Raj & Simran's story alive on the big screen for 1200 weeks non-stop. Thank u for falling in love with us so unconditionally for so many years! #23YearsOfDDLJ\"\nThat's not all, some days back, even Kajol had tweeted, describing similar sentiments.\nA special journey that began 23 years ago, goes on even today. Your love has kept Raj & Simran's story alive on the big screen for 1200 weeks non-stop. Thank u for falling in love with us so unconditionally for so many years! #23YearsOfDDLJ — Shah Rukh Khan (@iamsrk) October 23, 2018\n1200 weeks and still running! thank you all for all the love that you have been showering on #DDLJ for so many years! It was, it is and will always be an incredibly special film for all of us. @iamsrk @yrf #AdityaChopra — Kajol (@KajolAtUN) October 20, 2018\nEven fans got super-nostalgic recalling a film they could never stop loving.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\n#Throwback :- Some rare candids from the sets of DDLJ ✨\nThe most loved film of all time! #23YearsOfDDLJ pic.twitter.com/ZxDwBLx52m — SRK's RAKESH (@rakesh_889) October 19, 2018\nShah Rukh Khan and Kajol agreed to be a part of Karan Johar's first film during the shooting of the song 'Tujhe Dekha Toh Yeh Jaana Sanam'. Johar was Chopra's assistant director along with Uday Chopra. After 3 Years the promised movie released :)#23YearsOfDDLJ pic.twitter.com/ipZkyrhsix — SRKUniverse Germany (@SRKUniverse_GER) October 19, 2018\nDDLJ is the epitome of cult romance in Bollywood and will always remain an all time favorite. It's one of the rare movies you end up watching till the end whenever it runs on television. Thank you for giving us Raj and Simran and so many beautiful memories. #23YearsOfDDLJ https://t.co/Xv4VTlNRVA — Sara Naveed (@SaraNaveed) October 24, 2018", "title": "As DDLJ Completes 23 Years Of Release, Shah Rukh Khan Thanks Fans For Keeping Raj-Simran Alive", "date_publish": "24/10/2018, 15:26:46", "description": "On Tuesday night, Shah Rukh took to his social media handles to thank all his fans and followers for keeping Raj and Simran's story alive even after 1200 weeks. He wrote, \"A special journey that began 23 years ago, goes on even today. Your love has kept Raj & Simran's story alive on the big screen for 1200 weeks non-stop. Thank u for falling in love with us so unconditionally for so many years! #2", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/as-ddlj-completes-23-years-of-release-shah-rukh-khan-thanks-fans-for-keeping-raj-simran-alive-355362.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ddlj_1540379072_800x420.jpg"}