{"text": "As If His Clean-Shaven Look Wasn't Enough, Kit Harington Startled Fans With A Striptease On SNL\nAs If His Clean-Shaven Look Wasn't Enough, Kit Harington Startled Fans With A Striptease On SNL\nKit Harington made his debut on Saturday Night Live recently, and proved that when it comes to importance of facial hair, especially a beard, ‘he knows nothing.’ Why would he do that, right? Join us in paying respects to his spectacular beard which is no more between us.\nTwitter\nIf you don’t know already, he once said that he has been waiting for Game Of Thrones to come to an end so that he can trim his hair. And when he had finally cut his long and curly locks, we were all startled. And now he made his debut in a shiny clean-shaven look!\nvia GIPHY\nEven his wife Rose Leslie jokingly asked him how soon he could grow it back. And he addressed the elephant in the room.\nTwitter\n“Now I’ve just shaved my beard so this is more of kind of a creepy prepubescent Jon Snow. This is Jon Snow if he suddenly played for the Yankees … I have no idea what that means, but the writers told me to say that, so you guys probably know what it means,” he quipped.\nvia GIPHY\nNot just you, a lot of people are disheartened!\nKit Harrington without a beard looks like someone used Marvel’s de-aging CGI on Billy Crystal. #snl pic.twitter.com/XMSWMkOBs1 — David Burch (@davidaburch) April 7, 2019\nDon't Miss 842 SHARES 596 SHARES 406 SHARES 1.3 K SHARES 786 SHARES\nKit Harrington shaved his beard and I AM NOT HERE FOR IT #SNL pic.twitter.com/R4BAsnAOmC — 𝚜𝚊𝚋𝚛𝚒𝚗𝚊 𝚕𝚘𝚟𝚎𝚜 𝚊𝚔𝚞 💕 (@wtevrneko) April 7, 2019\nme: wow kit harington is so attractive 😍😍😍\nkit harington: *shaves his beard and does an american accent*\nme: I’ve never been more disgusted in my life — a time for wolves 🐺 (@themollyjeanne) April 7, 2019\nKit Harington [hosting #snl]: look, i shaved off my beard!\nEvery woman on earth: pic.twitter.com/ooqEMbf4Nm — Erin Auci (@erina58) April 7, 2019\nOh no. The beard is necessary Kit.#SNL — rabia O'chaudry (@rabiasquared) April 7, 2019\nThis wasn’t all, you guys! The man even stripped on the show. It’s definitely something you want to see but trust us, you would never be able to look at Jon Snow the same way after this.\nvia GIPHY\nvia GIPHY\nHe stripped for a sketch called Bachelorette Party, in which he played Bryan, a man who surprises his fiancée at their pre-wedding get-together with a parody performance. Donning red corset dress with gloves and heels, he slowly stripped in front the guests as they all looked in confusion at him. Yeah, yeah, he flaunted his abs.\nvia GIPHY\nKit Harington almost had a mini Game of Thrones reunion as Emilia Clarke, John Bradley and his wife Rose Leslie also appeared on the show.\nDuring his monologue about who wins Game Of Thrones, they all trolled by demanding spoilers.\nvia GIPHY\nClarke stood up in the audience and asked if he could at least share \"a sense of how it ends\". When Harington pointed out that she already knows because she is in the show, she said, \"Well yeah but I forgot. It's been so damn long since the last season, plus a lot of my scenes are talking to a dragon, which is just a tennis ball on a green pole. I have no idea what's actually happening.\"\nTwitter\nBradley then stood up to ask what happened to his character, Samwell Tarly, because \"they only let me see two pages of the script and all my character says is, 'Arhhhh'.\" \"What did it say in the script before that?\" Harington asked. \"Dragon opens mouth,\" Bradley replied.\nTwitter\nWhen Leslie stood up, Harington said he \"couldn't even tell (her)\" how the show ends, but she said she didn't care about that because \"I'm not a nerd\". \"My question is, what are we going to do for money now?\" she said. \"We didn't save anything, and you kept telling me, 'Oh I'm the King of the North, we can order UberEats every night.\"\nvia GIPHY\nWe can’t get over Kit Harington’s clean-shaven look! This was a lot ahead of the finale. Meanwhile, just a reminder -- Game of Thrones season 8 will premiere on April 14.", "title": "As If His Clean-Shaven Look Wasn't Enough, Kit Harington Startled Fans With A Striptease On SNL", "date_publish": "08/04/2019, 12:58:56", "description": "Kit Harington made his debut on Saturday Night Live recently, and proved that when it comes to importance of facial hair, especially a beard, ‘he knows nothing.’ He stripped for a sketch called Bachelorette Party, in which he played Bryan, a man who surprises his fiancée at their pre-wedding get-together with a parody performance. Donning red corset dress with gloves and heels, he slowly stripped", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-if-his-clean-shaven-look-wasn-t-enough-kit-harington-startled-fans-with-a-striptease-on-snl-365052.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kit_harington_shaved_off_his_beard_and_stripped_on_saturday_night_live_snl_1554706447_800x420.png"}