{"text": "As If We Didn't Have Enough Reasons Already, Ranveer Makes Us Swoon With His 'Deepika' Mehendi\nAs If We Didn't Have Enough Reasons Already, Ranveer Makes Us Swoon With His 'Deepika' Mehendi\nUndoubtedly, wedding is the most special event in anyone’s life. It’s the beginning of a new phase full of love and happiness – the beginning of a happily ever after, as they say.\nFor Deepika Padukone and Ranveer Singh as well, it was the beginning of a happily ever after. Solemnising their relationship of six years, Deepika and Ranveer Singh tied the knot in Italy and of course, they were happy and emotional at the same time.\nAlso Read: With Smile On Faces & Happiness In Their Hearts, Ranveer & Deepika Land In India As A Married Couple\nAs they returned to Mumbai yesterday, Deepika Padukone was glowing like a beautiful new bride. With sindoor in her hair, chooda on her wrists and a sparkling smile, Deepika celebrating the griha pravesh ceremony at Singh’s residence in Mumbai.\nTwitter\nOn the other side was Ranveer Singh, looking calmer than ever. Perhaps, that’s what love does to you. But did you notice the Mehendi on his palm?\nTwitter\nWhat caught our attention was Ranveer Singh’s Mehendi that had Deepika written on it in Hindi.\nInstagram\nOf course, she’ll light up his life forever! Ranveer Singh and Deepika Padukone, congratulations. Lots of love to you both!\nAlso Read: From Ring Ceremony To Sangeet, Here’s How Deepika & Ranveer Celebrated Day 1 Of Wedding Festivities In Italy\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES", "title": "As If We Didn't Have Enough Reasons Already, Ranveer Makes Us Swoon With His 'Deepika' Mehendi", "date_publish": "19/11/2018, 11:41:35", "description": "As they returned to Mumbai yesterday, Deepika Padukone was glowing like a beautiful new bride. On the other side was Ranveer Singh, looking calmer than. Perhaps, that’s what the feeling of love does to you. But did you notice the Mehendi on his palm? What caught our attention was Ranveer Singh’s Mehendi that had Deepika written on it in Hindi.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-if-we-didn-t-have-enough-reasons-already-ranveer-singh-makes-us-swoon-with-his-deepika-mehendi-356924.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singh_mehendi_has_deepikas_name_written_on_it_1542607004_800x420.png"}