{"text": "As Kuch Kuch Hota Hai Turns 20, Kajol Is Still Clueless About Why She Chose Rahul Over Aman\nAs Kuch Kuch Hota Hai Turns 20, Kajol Is Still Clueless About Why She Chose Rahul Over Aman\nShah Rukh Khan and Kajol’s Kuch Hota Hai has become a cult. The film has completed 20 years and the entire cast and crew celebrated the day in a grand way. Interestingly, the actors of this film have different perspectives on it now. Shah Rukh feels the script was trash and he feels creepy about it. Well, we didn't see this coming.\nI can’t believe it’s been #20YearsOfKKHH ! A film that gave me love ,acceptance and a career....will always be eternally grateful to @KajolAtUN @iamsrk #rani and @BeingSalmanKhan for indulging a 25 years old boy with stars in his eyes! Thank you for all the love❤️ pic.twitter.com/xm3RGVOneI — Karan Johar (@karanjohar) October 16, 2018\nAnybody who has watched Kuch Kuch Hota Hai has at one point, indulged in a debate on why Anjali chose Rahul over Aman. Rahul played by SRK was a selfish guy while Aman portrayed by Salman Khan was a darling.\nTwitter\nIndiatimes met Kajol and had a conversation with her on the same. We asked her what would have she done today if she had to choose between Rahul and Aman, she said,\nDon't Miss 812 SHARES 343 SHARES 3 K SHARES 555 SHARES 4 K SHARES\n\"I have no clue, I really have no clue. The great thing about that film is that everybody has their own choices and it has a certain appeal to everybody”.\nTwitter\nLater, she laughed it off and asked a counter question:\n“And if Aman was not played by Salman then what? She further added, “Salman was a beautiful character and yes in a way Rahul(SRK) was selfish”.\nWe hope the film has a remake and this time Anjali chooses Aman and NOT Rahul.", "title": "As Kuch Kuch Hota Hai Turns 20, Kajol Is Still Clueless About Why She Chose Rahul Over Aman", "date_publish": "17/10/2018, 13:46:00", "description": "Shah Rukh Khan and Kajol’s Kuch Hota Hai has become a cult. The film has completed its 20 years and the entire cast and crew celebrated this day in a grand way. The actors have the film have aged and today have the different perspective over the film. Shah Rukh feels the script was trash and feels creepy about it and we cannot agree more with him.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/as-kuch-kuch-hota-hai-turns-20-kajol-is-still-clueless-about-why-she-chose-rahul-over-aman-354932.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kajol_1539758660_800x420.jpg"}