{"text": "As ‘Kal Ho Naa Ho’ Completes 15 Years, Preity Zinta Reveals She Lost Her First Love Before Shooting The Film\nAs ‘Kal Ho Naa Ho’ Completes 15 Years, Preity Zinta Reveals She Lost Her First Love Before Shooting The Film\n“Aaj ek hassi aur baant lo, aaj ek dua aur maang lo, aaj ek ansoon aur pee lo, aaj ek zindagi aur jee lo, aaj ek sapna aur dekh lo, aaj … kya pata, kal ho naa ho…”\nThis dialogue from Kal Ho Naa Ho is enough to give us the feels. We all have shed tears while watching the movie that taught us the harsh reality of life, love, friendship and family.\nYouTube\nWe have all watched Kal Ho Naa Ho a zillion times maybe, and we can still watch it again. But have you realised that it’s been 15 years since the epic romantic drama had released? And just like us, the cast and the crew also have a lot of memories attached to it.\nTwitter\nIt was my father’s last release, an immortal melody, says Karan Johar as Kal Ho Naa Ho clocks 15 years.\nA film I absolutely loved writing....My fathers last release....an immortal melody and an incredible cast and crew....I love you so much #KalHoNaaHo it’s been 15 years.... pic.twitter.com/7ggf6Aft8v — Karan Johar (@karanjohar) November 28, 2018\nKaran Johar also posted a video tribute writing that the film will always be close to his heart.\nDon't Miss 343 SHARES 881 SHARES 123 SHARES 1 K SHARES 237 SHARES\nDid you know that Kal Ho Naa Ho was first offered to Kareena Kapoor, but she rejected it, and later it fell into Preity Zinta’s kitty?\nRemembering the good old days, Preity Zinta says some of the best things happened to her during the movie.\n“It was very special to me because I lost my first love. I was in love with him, he was not. I felt strongly when the film was offered to me. Some of the best things have happened to me during that film,” she told PTI.\nYouTube\nThe film revolved around a young, introvert woman, who has trust issues after her father's suicide. Eventually, she falls in love but that is not meant to be.\n\"It was one of those films that filled me with joy but it broke our hearts as well. It was a roller coaster ride... It is a timeless film. I am fortunate that I was a part of it,\" Preity said.\nTwitter\nPreity had turned down Jab We Met but has no regrets about the film, which is considered a modern romantic classic. Preity said she and Kareena have a \"karmic connection\".\n\"There is a karmic connection between Kareena and me. We both are in very good karma with each other because she said no to Kal Ho Na Ho' and I said no to Jab We Met', both of them are iconic and career defining films. People tell me they liked me a lot in Kal Ho Na Ho' and I think she did a wonderful job as Geet,\" she said.\nWith inputs from PTI", "title": "As ‘Kal Ho Naa Ho’ Completes 15 Years, Preity Zinta Reveals She Lost Her First Love Before Shooting The Film", "date_publish": "28/11/2018, 18:26:23", "description": "It’s been 15 years since the epic romantic drama had released, and just like us, the cast and the crew also have a lot of memories attached to it. Also, Did you know that Kal Ho Naa Ho was first offered to Kareena Kapoor, but she rejected it, and later it fell into Preity Zinta’s kitty?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-kal-ho-naa-ho-completes-15-years-preity-zinta-reveals-she-lost-her-first-love-before-shooting-the-film-357563.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/preity_zinta_reveals_she_lost_her_first_love_before_shooting_of_kal_ho_naa_ho_1543409474_800x420.jpg"}