{"text": "As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware\nAs More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware\nThe #MeToo movement has taken the entertainment industry by storm. The wave of the movement is spreading across the nation like a wildfire. After Tanushree Dutta accused Nana Patekar of sexual harassment, many big names of the industry have found themselves in trouble.\nSajid Khan was directing his forthcoming film Houseful 4, when all hell broke loose for him. After Rachel White, Saloni Chopra and journalist Karishma Upadhyay, more women have accused the filmmaker of sexual harassment. Joining the bandwagon and sharing their win stories are Bipasha Basu, Aisha actress Amrita Puri and ex-Bigg boss contestant Mandana Karimi.\nTwitter\nBipasha Basu also said that Sajid Khan would crack lewd jokes and was rude to all women.\n“I am glad that women are speaking up about the atrocities of these men with power and clout... But nothing of that sort happened with me... It was just his general attitude towards women that would disturb me on set- he cracked lewd jokes openly and was pretty rude to all girls.\nI was told by all not to say anything to him and stoop to his level- so I quietly finished my work as a professional and explained my stance to the producers, that I couldn't associate myself with this film anymore as I could lose my temper any moment,” she was quoted as saying by PTI.\nDon't Miss 264 SHARES 193 SHARES 862 SHARES\nOpening up on the ongoing controversy, here’s what Amrita Puri wrote on Twitter.\nIt was fairly well known that @SimplySajidK is a creep and is completely inappropriate as far as his conduct with women goes. I was warned to stay away from him if I ever came across him. I refuse to believe that it has come as a surprise to ppl from the industry or his family. — Amrita Puri (@_Amrita_Puri) October 12, 2018\nIn reply to Amrita, here’s what Farhan Akhtar tweeted.\nI deeply resent your insinuation that me or my family knew of his behaviour yet did nothing. Your anger is justified. Your conspiracy theories not. @_Amrita_Puri https://t.co/MCLptZioWR — Farhan Akhtar (@FarOutAkhtar) October 13, 2018\nMy tweet was not directed to you. Are you related? Pardon my ignorance. Also it’s not fair to generalise as I did. My apologies. However @SimplySajidK’s misconducts were fairly well known. I’m surprised that it’s come as a shock. — Amrita Puri (@_Amrita_Puri) October 13, 2018\nModel-actress and ex-bigg boss contestant Mandana Karimi said that Sajid Khan asked her to remove clothes.", "title": "As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware", "date_publish": "14/10/2018, 11:44:32", "description": "Sajid Khan has been accused of sexual harassment and misconduct by more women. After three accusations against him, actress Bipasha Basu and Aisha fame Amrita Puri have also spilled the beans. Moreover, Model-actress and ex-bigg boss contestant Mandana Karimi said that Sajid Khan asked him to remove clothes.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-more-sexual-misconduct-stories-of-sajid-khan-surface-amrita-puri-says-no-way-his-family-was-unaware-354741.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/as_more_women_accuse_sajid_khan_of_sexual_misconduct_bipasha_basu__amrita_puri_join_bandwagon_1539496429_800x420.png"}