{"text": "Social media is currently flooded with stories of several women who are accusing the rich and the powerful of sexual harassment. Women have gone through a lot for years, and finally, they are getting a platform to talk about their #MeToo stories revealing the name of the predators. While a lot of celebrities have extended support to these women and the #MeToo movement, singer Usha Uthup and Sussanne Khan have urged people to be careful of the false allegations or individuals without any legal evidence.\nBCCL\nSussanne Khan's former husband Hrithik Roshan was attacked by Kangana Ranaut recently, after she demanded punishment for the actor for dating \"young girls\" while keeping a trophy wife. In the wake of the #MeToo movement, here's what Sussanne said recently:\n“I honestly don't want to comment on this issue much but I definitely feel that there is lot of pretence, false allegations and sort of crazy behaviour. They are using the platform badly and it's not a good thing. If they use platform correctly then, it's supposed to be good thing. They shouldn't make allegation on an individual without any legal evidence,” she told IANS.\nd218kegnl5or7l.cloudfront.net\nOn the other hand, singer Usha Uthup says that the #MeToo movement has been blown out of proportion.\n“I am quite sad about the whole thing being blown out of proportion. Am equally sad on how it has been worked out. I never thought they could do something of this kind to make it that big… I feel sorry. It should not have happened like this. So many people involved and hurt in so many ways,” she told IANS.\nAlso Read: As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware\nDon't Miss 862 SHARES 346 SHARES 183 SHARES", "title": "As #MeToo Gains Momentum, Usha Uthup & Sussanne Khan Warn People Against Fake Allegations", "date_publish": "14/10/2018, 14:59:27", "description": "Social media is currently flooded with stories of several women who are accusing the rich and the powerful of sexual harassment. Women have gone through a lot for years, and finally they are getting a platform to talk about their #MeToo stories revealing the name of the predators. While a lot of celebrities have extended support to these women and the #MeToo movement, singer Usha Uthup and Sussann", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-metoo-gains-momentum-usha-uthup-sussanne-khan-warn-fans-against-fake-allegations-354758.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/as_metoo_gains_momentum_usha_uthup__sussanne_khan_warn_fans_against_fake_allegations_1539507911_800x420.png"}