{"text": "As Slumdog Millionaire Completes 10 Years, Anil Kapoor Says He Feels Honoured To Be A Part Of It\nAs Slumdog Millionaire Completes 10 Years, Anil Kapoor Says He Feels Honoured To Be A Part Of It\nIt was a remarkable day when Danny Boyle’s Slumdog Millionaire had bagged eight out of ten Oscar nominations. AR Rahman brought two awards back home with his Jai Ho composition. Veteran writer-lyricist-filmmaker Gulzar and sound engineer Resul Pookutty were also winners who made India proud in 2009 for the movie.\nTwitter\nThe rags-to-riches story of a young boy caught everyone’s attention. From child actors to Dev Patel, Anil Kapoor and Irrfan Khan, everyone gave a spectacular performance in the movie that won hearts of the audiences all over the nation.\nTwitter\nIt’s been ten years since the movie had released. Reminiscing the time, Anil Kapoor says he feels honoured to be a part of the movie.\nDon't Miss 8.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“It feels like only yesterday that we were shooting for 'Slumdog Millionaire', and what a journey it has been since then,” he was quoted as saying by IANS.\n“Many have called Slumdog a masterpiece, and I can honestly say that I'm honoured to have been a part of it,” he added.\nAnil Kapoor also shared his favourite scene from the movie.\nMy favourite scene from #SlumdogMillionaire has to be this one! A pivotal moment in the film filled with so much tension & drama! Who knew that a simple visit to the bathroom could make it or break it!#DannyBoyle #DevPatel @BecauseImFreida @foxsearchlight #SlumdogMillionaire pic.twitter.com/e6eLsduGyG — Anil Kapoor (@AnilKapoor) January 23, 2019\nSlumdog Millionaire won eight Oscars at the 81st Academy Awards, including Best Adapted Screenplay, Cinematography, Sound Mixing, Film Editing, Original Score, Original Song, Direction and Motion Picture.", "title": "As Slumdog Millionaire Completes 10 Years, Anil Kapoor Says He Feels Honoured To Be A Part Of It", "date_publish": "23/01/2019, 17:17:14", "description": "It was a remarkable day when Danny Boyle’s Slumdog Millainore had swept eight on 10 Oscar nominations. AR Rahman brought two awards back home with his Jai Ho composition. Veteran writer-lyricist-filmmaker Gulzar and sound engineer Resul Pookutty were also winners who made India proud in 2009 for the movie.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-slumdog-millionaire-completes-10-years-anil-kapoor-says-he-feels-honoured-to-be-a-part-of-it-360932.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/as_slumdog_millionaire_completes_10_years_anil_kapoor_says_he_feels_honoured_to_be_a_part_of_it_1548243334_800x420.jpg"}