{"text": "As 'The Big Bang Theory' Cast Tape The Last Episode, Kunal Nayyar Shares An Emotional Post!\nAs 'The Big Bang Theory' Cast Tape The Last Episode, Kunal Nayyar Shares An Emotional Post!\n2019 is the year when it all ends. After Avengers and Game of Thrones, another show The Big Bang Theory, which entertained the audiences for 12 years, is coming to an end.\nThe Big Bang Theory cast and crew is in a sad and heartbroken state as they are filming the last 279th episode. The show will always remain close to their hearts, for sure, but now that it is coming to end, it will definitely leave a void in their hearts. The cast members are sharing bittersweet memories of the show, and they are all very emotional.\nKunal Nayyar, who played the role of Dr Rajesh Ramayan Koothrappali, shared a photo of the entire cast hugging and penned down an emotional note that read:\n“Thank you\nThank you for your words,Thank you for your encouragement\nThank you for tuning in night in and night out\nThank you for the stories you shared about how this show made you feel\nThank you too, for the not so nice times\nThank you, for lifting us up when we were down\nFame can feel like a cage, so Thank you for making us feel safe enough to be free.\nThank you for letting me share my birthday on stage with my six best friends,\nAnd Thank you, for you, because without you- there would be no us.\nSo this goes out to you, the fans... One last time.\nIn love and gratitude, -Kunal”\nJim Parsons, who plays the role of Sheldon Cooper shared an emotional note with the picture of apartment 4A, which was Cooper’s residence during all these seasons.\nJohnny Galecki who plays Leonard shared the picture of Apartment 4B, where he had moved after marrying Penny. “More feelings than words can express,” he wrote.\nRaunch (Bernadette) shared a cast selfie with the word “forever” and we’re in tears.\nDon't Miss 6.4 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“Final bows tonight,” shared Cuoco with a behind-the-scene picture.\nIt’s the end of an era!", "title": "As 'The Big Bang Theory' Cast Tape The Last Episode, Kunal Nayyar Shares An Emotional Post!", "date_publish": "01/05/2019, 12:12:07", "description": "And right, the Big Bang Theory cast and crew is in a sad and heartbroken state as they are filming the last 279th episode. The show will always remain close their hearts, for sure, but now that it is coming to end, it will definitely leave a void in the hearts. The cast members are sharing bittersweet memories of the show, and they are all very emotional.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/as-the-big-bang-theory-cast-tape-the-last-episode-kunal-nayyar-shares-an-emotional-post-366384.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/the_big_bang_theory_cast_bids_emotional_goodbye_to_the_show_1556691230_800x420.png"}