{"text": "Ashton Kutcher Was Willing To Give Up His Own Life And Donate His Heart To Save His Twin Brother\nAshton Kutcher Was Willing To Give Up His Own Life And Donate His Heart To Save His Twin Brother\nOne of the most special bonds in everyone's life is the sibling bond. No matter how many ups and downs your relationship undergoes, you always find a way to each other.\nActor Ashton Kutcher wanted to give his own heart to his twin brother Michael when he needed a transplant at the age of 13.\nMichael, who is living with cerebral palsy, a permanent movement disorder, has said he has \"deep appreciation\" for Ashton, as he was willing to give up his own life to save Michael, before another suitable donor was found, reports femalefirst.co.uk.\nTwitter\nRecalling the \"That 70s Show\" alum's generosity, Michael said: \"It's just ... I can't find the words. It's a connection that you can't explain. In all seriousness, we're just very connected... It's an honour or deep appreciation and a deep love for someone who would sacrifice that for you. I really can't put words to it.\"\nAshton had once said that Michael taught him people are not all created equally. But Michael insists he doesn't want people to \"feel sorry\" for him, because he doesn't think he got \"the wrong end of the stick\" by being born differently.\nReuters\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHe said: \"I think his quote of (how) not everyone's not created equally, I think that goes back to him feeling sorry for me at a point. He's right. We aren't created equally, whether it be a disability or a health issue or whether it be anything, ethnicity, sex. We're just not created equally. If we were, what's cool about that?\n\"I don't really like to use the word disability, I like to use the word giftability because we're all created different. We all have disabilities. I think his quote is right on. We're not born equal, but that's okay. It's okay. You may think I got the wrong end of the stick, but having the transplant and the disability and everything, but in my eyes, I got the right end.\"\n(With agency inputs)", "title": "Ashton Kutcher:Ashton Kutcher Wanted To Donate His Heart To Save His Twin When He Was In Need Of A Transplant", "date_publish": "06/01/2019, 10:53:48", "description": "Michael, who is living with cerebral palsy, a permanent movement disorder, has said he has \"deep appreciation\" for Ashton, as he was willing to give up his own life to save Michael, before another suitable donor was found, reports femalefirst.co.uk. Read more.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ashton-kutcher-was-willing-to-give-up-his-own-life-and-donate-his-heart-to-save-his-twin-brother-359920.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ashton_kutcher_1546753954_800x420.jpg"}