{"text": "While you can only dream of your favourite superstar sharing their phone numbers on social media. For many, this dream 'almost' came true after Ashton Kutcher tweeted his real number last night.\nThe (now deleted) tweet went crazy viral and Kutcher wrote,\nAgencies\n“I miss having a real connection w/ real people. My Community. From now on you can just text me. I won’t be able to respond to everyone but at least we can be real w/ each other & I can share the unedited latest & greatest in my world.”\nAlongwith the phone number, he shared a gif and wrote,\nAgencies\n“You are the fabric of who we are, and we love you!”\nIn just a few hours, there were many reactions to the tweet and many even responded by saying that they need his wife Mila Kunis' number. After fans started flooded his phone “Hey it’s Ashton. This is an auto text to let you know I got your message.\"\nThe excitement of his fans was short-lived as he deleted the tweet soon after.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nLater he explained that he was constantly bombarded with messages on Twitter. “I will repost soon… sms is a fragile beast.” While many are still trying to figure out whether it was a plan, he had even tweeted that a big change in on its way in his social media strategy.", "title": "Ashton Kutcher Tweets His Real Number For Fans, Claims He Misses Having A 'Real' Connection", "date_publish": "30/01/2019, 13:52:04", "description": "In just a few hours, there were many reactions to the tweet and many even responded by saying that they need his wife Mila Kunis' number. After fans started flooded his phone “Hey it’s Ashton. This is an auto text to let you know I got your message.\" The excitement of his fans was short-lived as he deleted the tweet soon after.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ashton-kutcher-tweets-his-real-number-for-fans-claims-he-misses-having-a-real-connection-361290.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ashton_kutcher_1548834671_800x420.jpg"}