{"text": "Actor Naseeruddin Shah once again made headlines facing the internet's ire for his remarks on mob lynching and religion in the country. During an interview he expressed his worry for his children in today’s India and became the eye of the storm. He is facing a lot of trolls on social media, being called a traitor, and is receiving threats being asked to leave the country.\n\"Everyone has a right to share their thoughts,\" said filmmaker Madhur Bhandarkar while reacting to Naseeruddin Shah's recent comments on Bulandshahr violence incident.\nBhandarkar stated that since India is a democratic country, one can express his opinions. However, according to him, there is no intolerance in the country.\n\"Everyone has the right to speak. We live in a democratic country. I don't think there is any fear. Everyone is equal in India and this is his point of view.\nbccl\nThis is the special thing about our country that everyone can express their opinions. I don't think there is any problem or intolerance,\" the 50-year-old said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMeanwhile, Bollywood actor Ashutosh Rana took sides with Shah and urged that one must ponder over the statement rather than merely reacting on it.\n\"Everyone should have a right to share their thoughts with their friends or other people without any fear. We should be wary of reacting, acting or doing a trial on any such comment.\nap\nIf any of our brother or friend is saying something, we should not only listen to them but must also ponder over it,\" Rana said while interacting with media.\n\"Independence stands for simplicity and gentleness and that is what our culture is,\" the actor added.\nVeteran actor Naseeruddin Shah has been facing flak for his recent comment over the Bulandshahr violence incident in which two people including a police official were killed over rumour of cow slaughter.\nbccl\n\"At many places, the death of a cow is being given more importance than the killing of a policeman. I feel anxious for my children because tomorrow if a mob surrounds them and asks, 'Are you a Hindu or a Muslim?' they will have no answer.\nIt worries me that I don't see the situation improving anytime soon,\" Shah had said in a video which surfaced on the social media earlier this week.\nInputs From ANI", "title": "Ashutosh Rana Supports Naseeruddin Shah's Remark, Says ‘We Should Listen To Him’", "date_publish": "24/12/2018, 17:49:32", "description": "\"Everyone has a right to share their thoughts,\" said filmmaker Madhur Bhandarkar while reacting to Naseeruddin Shah's recent comments on Bulandshahr violence incident. Bhandarkar stated that since India is a democratic country, one can express his opinions. However, according to him, there is no intolerance in the country. \"Everyone has the right to speak. We live in a democratic country. I don't", "authors": [], "url": "https://www.indiatimes.com/entertainment/ashutosh-rana-supports-naseeruddin-shah-s-remark-says-we-should-listen-to-him-359193.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ashutosh_rana_and_naseeruddin_shah_1545647724_800x420.jpg"}