{"text": "Ashutosh Rana-Ranveer Singh's Camaraderie Is One Of The Reasons Why You Should Go For Simmba!\nAshutosh Rana-Ranveer Singh's Camaraderie Is One Of The Reasons Why You Should Go For Simmba!\nWhen was the last time you went to watch a film with a tub full of popcorn with zero expectations and without reading a single film review or tweet about the film?\nWell, if this is something you have sorely missed doing, you can break this jinx with Ranveer Singh starrer Simmba.\nThis cop-drama has all Rohit Shetty elements including-action packed sequences, cheeky one-liners and emotional drama that can make you drop a tear or two.\nWhile mixed reviews have dropped in about the film where toxic masculinity and misplaced social messaging is what is upsetting the critics, this film is all about Ranveer Singh. Accompanying and matching up to Ranveer Singh's screen-presence is veteran actor Ashutosh Rana! Their camaraderie is what will make you want to whistle.\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\nIf you are someone who can live with the fact that some movies are just for entertainment, Ranveer Singh's film is a choice you won't regret making.\nSpoiler Alert:\nAjay Devgn and Akshay Kumar's cameo might be just for a few minutes, but they end up the screen and make the climax whistle-worthy and how!\nIn the film, Rana and Singh share a scene where they get drunk on the terrace. Their drunk conversation is what will make you laugh for all the right reasons. Ashutosh Rana's wife and actor Renuka Shahane couldn't contain her excitement and she shared an adorable BTS picture of him and Ranveer.\nShe wrote,\nIf predictable masala-entertainers suit your taste, Simmba is a dish that won't burn your tongue!", "title": "Ashutosh Rana-Ranveer Singh's Camaraderie Is One Of The Reasons Why You Should Go For Simmba!", "date_publish": "29/12/2018, 12:38:31", "description": "Ajay Devgn and Akshay Kumar's cameo might be just for a few minutes, but they end up the screen and make the climax whistle-worthy and how! Ashutosh Rana's wife and actor Renuka Shahane couldn't contain her excitement and she shared an adorable BTS picture of him and Ranveer.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ashutosh-rana-ranveer-singh-s-camaraderie-is-one-of-the-reasons-why-you-should-go-for-simmba-359463.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/simmba_1546068443_800x420.jpg"}