{"text": "At Shah Rukh Khan’s Diwali Party, Vicky Kaushal Hid Behind The Curtains & The Reason Will Crack You Up\nAt Shah Rukh Khan’s Diwali Party, Vicky Kaushal Hid Behind The Curtains & The Reason Will Crack You Up\nVicky Kaushal is not only every woman’s crush but also a rising star of the film industry. His humility and generosity, even after so much success, is what makes him the ruler of hearts.\nInstagram\nWhat happens when current heartthrob of Bollywood meets the King of Bollywood, Shah Rukh Khan? Vicky Kaushal recently shared his experience of attending Shah Rukh Khan’s Diwali party. Just that Vicky didn’t know it was a Diwali bash, and it turned out to be quite hilarious! Wondering how? Read on!\n“So, Shah Rukh sir called me and said: 'It was my birthday a few days ago. It's just a chill dinner, so, come with your friends.' It was my first time at Mannat and I was so happy that it was a chill get-together for his birthday,” Vicky said on a chat show.\nSo, Vicky Kaushal wore denims and T-shirt and a shirt over it.\n“I enter and see Kareena Kapoor Khan, Malaika Arora, everyone in like heavy Indian. Me, Taapsee, Rajkummar Rao... three-four of us were prepared for a birthday casual scene till we realised that we were so off. We were hanging out in one corner behind the curtain. I was so embarrassed because I was the first of that lot to enter.”\nDon't Miss 233 SHARES 343 SHARES 870 SHARES 555 SHARES 263 SHARES\nVicky Kaushal said that Karan Johar even took a dig at his fashion faux pas. “Karan meets me and he's like, 'Hi, you.' Then he just looks at me and says, 'We need to talk',” he said.\nAnd you thought that actors never get it wrong on special occasions?", "title": "Vicky Kaushal:Vicky Kaushal Spent Shah Rukh Khan’s Diwali Party Hiding Behind Curtains & The Reason Will Make You LOL", "date_publish": "27/03/2019, 13:32:53", "description": "Vicky Kaushal recently shared his experience of attending Shah Rukh Khan’s Diwali party. Just that Vicky didn’t know it was a Diwali bash, and it turned out to be quite hilarious. If you thought that actors never get it wrong on special occasions, read on.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/at-shah-rukh-khan-s-diwali-party-vicky-kaushal-hid-behind-the-curtains-the-reason-will-crack-you-up-364385.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/vicky_kaushal_once_spend_shah_rukh_khans_diwali_party_hiding_behind_the_curtains_heres_why_1553672427_800x420.jpg"}