{"text": "An article on Priyanka Chopra that labelled her as a scam artist went viral on the internet and for all the wrong reasons. The publication and the author started receiving a lot of flak for their regressive and sexist comments. In less than twenty-four hours, they pulled down the article and apologized for their write up.\nPeople Magazine\nExtending the apology, they had written: \"An earlier story about Priyanka Chopra and Nick Jonas did not meet our standards. We've removed it and apologize.\"\nThe author of the article received a lot of backlash for her story.\nYo, Mariah Smith had the absolute gall to write about Priyanka being a scammer with a Spon-Con wedding when she herself got a whole-ass birthday party paid for by brands.😂https://t.co/Ki9zkKtcul — Bennett D. 'Approachably Cool' Bennett (@TheAcecapade) December 5, 2018\nWhat a sad way to make a living. Good luck, Mariah Smith. Wishing this story millions of 👀 so that you get your Cut. #Vicioushttps://t.co/hVXWmXmpt6 — Twerk Gotra (@ippusultan) December 5, 2018\nI can credit The Cut and Mariah Smith's bullshit hot take with one thing: They moved me from being on the fence about Nick and Priyanka to vowing to defend them to the death. pic.twitter.com/FjLb7nPnH9 — Suleikha Snyder (@suleikhasnyder) December 5, 2018\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nMariah Smith, it was offensive! You should know better and you know you’re better than that. What you wrote is totally beyond! I feel the BITTERNESS in each word you put in it! You’re unbelievable! — Ushi Sato (@UshiSato) December 5, 2018\nThe backlash against The Cut and Mariah Smith’s trash garbage article is well deserved. She absolutely should have known better. Its baffles me that she even thought it would be okay to write something so offensive & degrading. Mariah, herself, owes Priyanka an apology too. pic.twitter.com/sWOevuSxWi — Jackson (@lawanddesign) December 6, 2018\nAnd now, the author of the article, Mariah Smith, too has taken the full responsibility and apologized for her words.\nAgencies\nShe took to Twitter to extend a personal apology to both PC and Nick. In her tweet, she wrote:", "title": "Author Of The Article That Called PC A 'Scam Artist' Extends Apology, Says She's Not Racist", "date_publish": "08/12/2018, 15:10:49", "description": "An article on Priyanka Chopra that labeled her as a scam artist went viral on the internet and for all the wrong reasons. The publication and the author started receiving a lot of flak for their regressive and sexist comments. In less than twenty-four hours, they pulled down the article and apologized for their regressive comments.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/author-of-the-article-that-called-pc-a-scam-artist-extends-apology-says-she-s-not-racist-358189.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pc_and_nick_jonas_1544262722_800x420.jpg"}