{"text": "Author Of The Racist Article Apologises To PC, 2018 Was The Year Of Celebrity Weddings & More From Ent.\nAuthor Of The Racist Article Apologises To PC, 2018 Was The Year Of Celebrity Weddings & More From Ent.\nExtending the apology, they had written: \"An earlier story about Priyanka Chopra and Nick Jonas did not meet our standards. We've removed it and apologize.\"\nIn a recent interview with IANS, she bared her heart on her granddaughter Sara Ali Khan’s confidence, humility and charm make her very happy and it’s heartwarming to see the daughter of Saif Ali Khan and his former wife Amrita Singh the way she has turned out.\n\"Mere bachchon ke bahut kam (paparazzi) photos aatein hai, but honestly speaking, I don't like it [kids getting photographed] at all. That's why I try and hide my children as much as possible.\"\nThe pictures that made way to the internet prove that the celebrations were exotic and grand in every sense of the word. Have a look at the pictures.\nWe heavily rely on what we see and how these stars conduct themselves publicly, what we don't see is how real their emotions are! They too fall in love, have their share of heartbreaks, fall in love with their co-stars and have their share of personal and purely private love-stories.\nDon't Miss 365 SHARES 161 SHARES 862 SHARES", "title": "Author Of The Racist Article Apologises To PC, 2018 Was The Year Of Celebrity Weddings & More From Ent.", "date_publish": "08/12/2018, 17:41:45", "description": "Extending the apology, they had written: \"An earlier story about Priyanka Chopra and Nick Jonas did not meet our standards. We've removed it and apologize.\" In a recent interview with IANS, she bared her heart on her granddaughter Sara Ali Khan’s confidence, humility and charm make her very happy and it’s heartwarming to see the daughter of Saif Ali Khan and his former wife Amrita Singh", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/author-of-the-racist-article-apologises-to-pc-2018-was-the-year-of-celebrity-weddings-more-from-ent-358206.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wrap_1544271459_800x420.jpg"}