{"text": "Despite so many efforts from Disney, just a couple of weeks ahead of its release, sadly, some important and spoiler-heavy footage from Avengers: Endgame has been leaked online.\nIf you are an ardent Marvel fan, we are sure, you don’t want to see the spoilers. And so, we suggest you go off social media for sometime because photos, clips and videos are all over the internet.\nIt is said that the quality of the video isn’t good but a major chunk, which has many important moments from the much-awaited movie has been leaked.\nHowever, it doesn’t reveal the ending of the movie. It is said that the leaked footage has confirmed some of the major fan theories.\nSo, fans are suggesting going off social media for some time, because once you see the footage, there is absolutely no way of going back. You don’t want the movie ruined for you, right?\nA big Video leak of Avengers Endgame is going around from a special screening in South Korea. Its almost 5 minutes and please avoid it if you dont want spoilers. Saw only a minute of it by accident and now I... https://t.co/je5hqoiVwA — Jose Saul Nieves Rayuta (@Rayuta) April 16, 2019\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nStop with the #AvengersEndgame leaks. This is ridiculous. Also, don't watch a pirated version of this movie on your sad little computer. This film deserves to be watched in a theater not in your mom's basement. — BJ The Web Guy (@BJtheWebGuy) April 16, 2019\n10 Day Away from #AvengersEndgame and spoilers and leaks are flying around...\nWe have prepared for this people...BLOCK, MUTE, Shut Social Media DOWN if you have to!!#ThanosDemandsYourSilence pic.twitter.com/zn4N4p3naU — Chad Hoschka (@ChadHoschka) April 16, 2019\ni am sutting down all the social media for 10 day..INSTA.FB.TWITTER...all of it#belikedrstrange#AvengersEndgame#AvengersEndgameleak — vipin patel (@vipinpa37700567) April 16, 2019\nIf you don’t want to be spoiled stay off all major social media. Someone has leaked Avengers Endgame. #AvengersEndgame #leak #spoilers — Gonzo (@SmugFac3Ac3) April 16, 2019\nI heard someone leaked avengers endgame footage, and I’m terrified to stumble upon it here..😳😰 — Mauricio Galvan (@Steelfold10) April 16, 2019\nGuys we need to get off of Twitter for the next 11 days. Massive leaks for Avengers: Endgame are on this site!!! This will be my final post for a while until the movie is out. See ya on April 27th. — Issac the King (@IssacFl94852488) April 16, 2019\nDisney had kept the film so shrouded that even journalists and critics were not shown the movie. Only 10 minutes of Avengers: Endgame was screened for the press in Los Angeles. Furthermore, 20 minutes of the movie were screened for select members of the press in South Korea.\nIt is said that the 5-minute video that has leaked is reportedly from the screening in South Korea. However, nothing can be confirmed as of now. But Marvel fans, beware of social media! Like a true fan, we suggest, you should watch Avengers: Endgame in the theatres on April 26.", "title": "Avengers: Endgame Footage Leaked Online & Fans Are Taking Social Media Detox To Avoid Spoilers!", "date_publish": "16/04/2019, 20:40:36", "description": "Despite so many efforts from Disney, just a couple of weeks ahead of its release, sadly, some important and spoiler-heavy footage from Avengers: Endgame has leaked online. So, fans are suggesting going off social media for some time, because once you see the footage, there is absolutely no way to unsee it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/avengers-endgame-footage-leaked-online-fans-are-taking-social-media-detox-to-avoid-spoilers-365587.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/thanos_from_avengers_endgame_1555425344_800x420.png"}