{"text": "Just like each one of us, who was eagerly waiting for Avengers Endgame to release, Bollywood celebrities were waiting with a baited breath too!\n\"The things we do for love,\" is how a Marvel fan reacted when he managed to book a 1.40 am the show for Avengers: Endgame. It seems odd to quote Jaime Lannister from Game of Thrones in the \"Avengers\" context but such is the frenzy that fans will watch any show they can over the weekend -- whether at 1.40 am or at 6 am -- even if it means spending big bucks. And still, no tickets are available. To accommodate the demand for the last of the Avenger series, which released on Friday, some theatres are running shows 24X7.\n(Also read: 6 Tricks And Tips People Are Following To Avoid 'Avengers: Endgame' Spoilers And You Should Too!)\nEven celebrities in Mumbai are bit by the Marvel bug as many celebrities were spotted attending the screening of the film last evening. While the film is already off to a good-start in India, the turn out of celebrities in the theatres just proved that they are big Marvel fans too!\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\nPaps in Mumbai managed to click stars who attended the screening and the long list include celebrities like Akshay Kumar, Twinkle Khanna, Kriti Sanon, Sushant Singh Rajput, Ishaan Khatter, Disha Patani, Huma Qureshi, Pooja Hegde and several others.\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nHelmed by Anthony Russo and Joe Russo, the superhero film features Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Gwyneth Paltrow and Josh Brolin in lead roles. The screenplay of the movie is by Stephen McFeely and Christopher Markus, and it has been produced by Kevin Feige.\n(With agency inputs)", "title": "'Avengers: Endgame' Fever Grips Mumbai! Celebrities Attend The Screening Of The Film!", "date_publish": "27/04/2019, 12:05:24", "description": "Even celebrities in Mumbai are bit by the Marvel bug as many celebrities were spotted attending the screening of the film in Mumbai last evening. While the film is already off to a good-start in India, the turn out of celebrities in the theatres just proved that they are big Marvel fans too!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/avengers-endgame-fever-grips-mumbai-celebrities-attend-the-screening-of-the-film-366178.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_endgame_1556347029_800x420.jpg"}