{"text": "The social media fad around Avengers proves that the film is one of the most anticipated films of the year. #AvengersEndGame is one of the top trends on Twitter.\nMarvel fans are finding themselves in a virtual queue to grab tickets for the highly anticipated superhero film Avengers: Endgame. BookMyShow has witnessed a record advance ticket sale with one million tickets sold in just over a day.\nBookMyShow witnessed a peak of 18 tickets per second, even before the film releases in cinemas on April 26 in India in English, Hindi, Tamil and Telugu.\nBCCL\nAshish Saksena, Chief Operating Officer - Cinemas, BookMyShow, said in a statement issued on Monday evening: “We expect Avengers: Endgame to break more records as cinemas continue to open the advance bookings.”\nAvengers: Endgame is the 22nd film from the Marvel Cinematic Universe, the latest after Captain Marvel, which released last month. The film stars Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson and Brie Larson, amongst others.\nDon't Miss 264 SHARES 837 SHARES 3.5 K SHARES\n#AvengersEndgame advance booking is unheard of, unimaginable and unprecedented... Much, much better than several #Hindi biggies that opened in 2018 and 2019... Eyes a record-breaking, historic start in #India... Dear BO records, get ready to be smashed and shattered! — taran adarsh (@taran_adarsh) April 22, 2019\n“Avengers: Endgame is not just a movie, it’s an epic culmination of a decade-long journey which the fans have taken with us across 22 films of the Marvel Cinematic Universe. The phenomenal interest shown by audiences across the country, is testament of how this is one of the most anticipated movies for the fans and we can’t wait for them to watch it,” said Bikram Duggal, Head - Studio Entertainment, Disney India.\nTrade analyst Taran Adarsh tweeted on Monday: “Avengers: Endgame advance booking is unheard of, unimaginable and unprecedented. Much better than several Hindi biggies that opened in 2018 and 2019.”\nThe interest has been more in metropolitan cities like Delhi and Mumbai. Rahul Kadbet, Vice President Programming, Carnival Cinemas, told IANS: “Around 2.25 lakh tickets have been sold which is about 74 per cent of the capacity for weekend. We have 1000+ shows per day for the movie in over 100 cities. Maximum tickets were sold in Delhi/NCR and Mumbai.”\nThe rush for tickets for the film, which will show supervillain Thanos engaging in an epic battle with superheroes like Iron Man, Thor and Captain America, was anticipated.\nRajender Singh Jyala, Chief Programming Officer, INOX Leisure Ltd. said: “As anticipated, across the country, the shows of Avengers: Endgame are almost sold out in a very short time. The first day advance sales have been unprecedented.”\nBCCL\nThe craze for the film has also made some fly to different cities. Imphal-based engineer Sanjay Nongmaithem told IANS: “I have been following the series since its beginning in 2008 with Iron Man so, I want to see how it culminates. My eight-year-old daughter, Gracy, is also a fan of the Avengers. In Manipur, our theatres don’t screen Bollywood or Hollywood films so we are left with no choice but to fly to Guwahati, which is nearby.”\nOne Twitter also posted a request on Twitter to the film’s directors -- the Russo Brothers. “I am from India and a huge Marvel fan. In Silchar, Assam, there are two movie halls but none are screening Avengers.... Help us.”\n(With agency inputs)", "title": "Avengers: Endgame Sells 1 Million Advance Tickets In India Proving That The Madness Is Real!", "date_publish": "23/04/2019, 12:06:13", "description": "The social media fad around Avengers proves that the film is one of the most anticipated films of the year. #AvengersEndGame is one of the top trends on Twitter. Marvel fans are finding themselves in a virtual queue to grab tickets for the highly anticipated superhero film Avengers: Endgame. BookMyShow has witnessed a record advance ticket sale with one million tickets sold in just over a day.", "authors": [], "url": "https://www.indiatimes.com/entertainment/avengers-endgame-sells-1-million-advance-tickets-in-india-proving-that-the-madness-is-real-365922.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_1556002025_800x420.jpg"}