{"text": "What we expected has actually happened!\nAvengers: Endgame, the final chapter from the Avengers franchise, has broken box office records in India by registering an opening day collection of Rs 53.10 crore, becoming the biggest Hollywood opener in the country till date.\nap\nFrom Iron Man to Captain America to Hulk to Black Widow to Thor -- Marvel superheroes have assembled one last time in \"Avengers: Endgame\" to save the world and fight against Thanos. As conjectured by trade analysts, the movie is not only turning out to be an emotional affair for fans but also soaring high at the box office globally.\nMarvel Studios' \"Avengers: Endgame\" has taken an unprecedented opening at the Indian box office collecting Rs 63.21 crore (Gross Box Office Collection) and Rs 53.10 crore (Net Box Office Collection) in all languages. It released in Hindi, English, Tamil and Telugu across 2845 screens in India on Friday, according to the film's representatives.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nafp\n\"The massive response by audiences across the country is a testimony of how emotionally invested the Marvel fans are in the 'Avengers' franchise. They have eagerly waited to watch the culmination of the journey of 11 years and their extraordinary love for the marvel characters is clearly evident today,\" Bikram Duggal, Head - Studio Entertainment, Disney India, said in a statement.\nTrade analyst Taran Adarsh said the fourth and final \"Avengers\" movie is already on the path to creating history.\n\"'Avengers\" Endgame' is sensational...Creates history... Records highest Day 1 of 2019 so far... emerges biggest Hollywood opener to date... Crosses Day 1 business of 'Thugs Of Hindostan', the biggest opener from Hindi film industry (Rs 52.25 crore in Hindi, Tamil and Telugu).\"\nap\n\"'Avengers: Endgame' emerges a game changer... Sets new benchmarks on Day 1... An eye opener for the industry that feels national holidays/festivals yield best results at the box office,\" Adarsh added.\nHe compared the opening day numbers of \"Avengers: Infinity War\" and \"Avengers: Endgame\".\n\"2018: 'Avengers: Infinity War' was Rs 31.30 crore/plus 2000 screens; 2019: 'Avengers: Endgame' Rs 53.10 crore/2845 screens.\"\nPointing out a coincidence, he wrote: \"'Baahubali 2' released on (Friday) April 28, 2017; 'Avengers: Infinity War' released on (Friday) April 27, 2018; now 'Avengers: Endgame' released on (Friday) April 26, 2019... All three money spinners released on the last Friday of April, and non-holiday releases.\"\nTrade guru Atul Mohan also posted: \"Don't forget it's IPL, election time and non-holiday release! 'Avengers: Endgame' proves that compulsive cinema content can outshine any other event that's happening in India.\"\nTalking about the good start that \"Avengers: Endgame\" has taken, Siddharth Bhardwaj, Chief Marketing Officer, UFO Moviez, said: \"Marvel has worked really hard to build each of its superhero franchise fan base. The film is drawing audiences of all these individual superheroes... The record-breaking box office numbers are expected not only from top cities but huge occupancy is being reported from tier I and tier II towns also.\"\nafp\n\"Avengers: Endgame\", the 22nd film of MCU, marks the end of an era that revolved around Iron Man, the Hulk and Captain America, among others. It is helmed by Russo Brothers Joe and Anthony.\nThe star-studded cast includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Bradley Cooper and Josh Brolin.\nap\nAccording to variety.com, the film is heading for a record-shattering opening weekend of about $300 million in North America.\nIt reported that the movie has taken in a stunning $305 million in its first two days of global release on Wednesday and Thursday in 46 markets, led by a powerful $154 million in China. The Chinese opening day broke a record, with $107 million. The UK is the second-largest international market with $15.3 million, followed by South Korea at $14.2 million and Australia at $13.9 million.\nInputs From IANS", "title": "'Avengers: Endgame' Has Earned Rs 53.10 crore & Become Biggest Hollywood Opener In India!", "date_publish": "27/04/2019, 15:03:07", "description": "What we expected has actually happened! Avengers: Endgame, the final chapter from the Avengers franchise, has broken box office records in India by registering an opening day collection of Rs 53.10 crore, becoming the biggest Hollywood opener in the country till date.", "authors": [], "url": "https://www.indiatimes.com/entertainment/avengers-endgame-has-earned-rs-53-10-crore-become-biggest-hollywood-opener-in-india-366191.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_1556361252_800x420.jpg"}