{"text": "It was a big night for actors like Alia Bhatt, Ranveer Singh, Ranbir Kapoor, Vicky Kaushal and Neena Gupta who were the top winners at the 64th Filmfare Awards in Mumbai on Saturday. The films that took away the biggest awards include Raazi, Andhadhun and Badhaai Ho.\nAfter winning the award, Alia said, “Meghna for me Raazi is you, your blood and sweat. You are my main chick. Vicky without you, the film wouldn’t be complete. Thank you my mentor Karan for being my mentor, father and my fashion police. Tonight’s all about love there my special one, I love you (Ranbir Kapoor).”\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nAfter the Filmfare awards last night, KJo partied with Ranveer Singh, Vicky Kaushal and Alia Bhatt and the pictures and videos that have paved way on the internet prove that all of them indeed had fun!\nApart from marrying his love Deepika Padukone last year, there are several reasons to celebrate. Last evening, Ranveer Singh went down on his knee to receive his the Best Actor award from wife and actor Deepika Padukone at the 64th Filmfare Awards. A video that is going viral on the internet has Ranveer Singh on his one knee as wife Deepika hands him the trophy.\nLast night, stars graced the 64th Filmfare award night to have an eventful night. Before they entered to win some big awards, we stopped some of them to play a quick rapid fire. Now we have all experienced cheesy pick up lines including celebrities. The one that I heard long back in College was, \"Are you french? Because Eiffel you.\" Another one that my friend heard recently was, \"Do you have Microsoft because I wish to crash at your place tonight.\"", "title": "Awards, Kisses And Party: Bollywood Came Together For Filmfare And More From Ent", "date_publish": "24/03/2019, 17:44:33", "description": "It was a big night for actors like Alia Bhatt, Ranveer Singh, Ranbir Kapoor, Vicky Kaushal and Neena Gupta who were the top winners at the 64th Filmfare Awards in Mumbai on Saturday. The films that took away the biggest awards include Raazi, Andhadhun and Badhaai Ho.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/awards-kisses-and-party-bollywood-came-together-for-filmfare-and-more-from-ent-364233.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_filmfare_awards_1553429826_800x420.jpg"}