{"text": "There was a phase when South Indian cinema was being remade into Hindi movies. From Ok Jaanu, Singham, Wanted to Drishyam, the movies that were mega hits down South raked in money with their Hindi versions as well.\nBut now there's going to be role reversal. Producer Boney Kapoor is all set to remake last year's hit Hindi film 'Badhaai Ho' in Tamil, Telugu, Malayalam and Kannada.\nTwitter\n'Badhaai Ho', which is based on the story of an elderly couple who are expecting their third child. According to IMDb customer ratings, 'Badhaai Ho' was among the top five Indian movies of 2018. And now, Boney will remake the Hindi film for the South Indian audience.\nDon't Miss 322 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n\"I have acquired the rights of 'Badhaai Ho' under my production house Bayview for all the south Indian languages. I was keen on remaking it as it is a film that resonates with both the masses and classes,\" Boney told IANS.\nThis is not the only film, he is also working on the remake of the 2016 Hindi film 'Pink' with Tamil star Ajith.\nAsked why he is remaking Hindi films, he said: \"Earlier I used to buy rights of south Indian films to make in Hindi. Now I am reversing the process.\"\nBCCL\nBoney had backed the Salman Khan-starrer 'Wanted', which was a remake of the Telugu film 'Pokiri'. It will be interesting to see the audience response for Badhaai Ho since the subject is sensitive. The movie raked in Rs 100 crore in 17 days its release.\nInputs from IANS", "title": "Ayushmann Khurrana's 'Badhaai Ho' To Be Remade In Four Languages For South Indian Audience", "date_publish": "20/03/2019, 12:58:36", "description": "Producer Boney Kapoor is set to remake last year's hit Hindi film 'Badhaai Ho' in Tamil, Telugu, Malayalam and Kannada. 'Badhaai Ho', which stars Neena Gupta, Gajraj Rao, Ayushmann Khurrana and Sanya Malhotra, is based on the story of an elderly couple who are expecting their third child.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/ayushmann-khurrana-s-badhaai-ho-to-be-remade-in-four-languages-for-south-indian-audience-364005.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/badhaai_ho_movie_1553064461_800x420.jpg"}