{"text": "Ayushmann Khurrana Recounts That They Found Out About Wife Tahira's Cancer On His Birthday!\nAyushmann Khurrana Recounts That They Found Out About Wife Tahira's Cancer On His Birthday!\nBollywood actor Ayushmann Khurrana kick-started his career with Vicky Donor and since then, there has been no looking back. He has been giving us back to back hits recently with Badhaai Ho and Andhadhun.\nscreengrab\nWhile his professional life was on an all time up swing, his personal life saw some issues. Ayushmann's wife Tahira was battling with cancer. People only found out when Tahira decided to talk about it on her Instagram.\nInstagram\nLooking back at the stressful phase of his life, Ayushmann spoke to a leading channel about Tahira's illness. “It was very difficult. In fact, thanks to her that she was brave enough to take that positively otherwise I would have broken, completely. Because I was in the middle of two films I was promoting Andhadhun and Badhaai Ho. And we got to know about this on my birthday. In fact, we saw Manmarziyaan that day... we saw Manmarziyaan on September 14 and we got to know of this disease.\"\nDon't Miss 862 SHARES 237 SHARES 122 SHARES 197 SHARES 2.5 K SHARES\n“She was like 'I want to just celebrate my life. I'll take it head on and we are together in this both fighting the disease and also in promoting the films.' So, it was a collective effort from both sides. But I am glad she's overcome this and as we speak she's giving a lecture on cancer, how to fight, how to combat it. She's a leader now to cancer patients and an inspiration,\" he added.\nTahira has time and again given interviews to various platforms talking about her emotional and physical journey and how she feels liberated after becoming bald.\nMore power to the already powerful couple.", "title": "Ayushmann Khurrana Recounts That They Found Out About Wife Tahira's Cancer On His Birthday!", "date_publish": "02/05/2019, 13:58:12", "description": "Bollywood actor Ayushmann Khurrana kick-started his career Vicky Donor and there has been no looking back. He has been giving us back to back hits recently with Badhaai Ho and Andhadhun.Bollywood actor Ayushmann Khurrana kick-started his career Vicky Donor and there has been no looking back. He has been giving us back to back hits recently with Badhaai Ho and Andhadhun.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ayushmann-khuranna-recounts-that-they-found-out-about-wife-tahira-s-cancer-on-his-birthday-366473.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/ayushmann_1556788179_800x420.jpg"}