{"text": "What happens when life pushes you towards a storm for which you're not ready? You can either give up on it or fight back. For Tahira Kashyap, this storm came in the form of cancer.\nOn September 22, Tahira revealed that she has been detected with pre-invasive breast cancer. She posted on Instagram that she was detected with DCIS (ductal carcinoma in situ) in her right breast with high grade malignant cells. “Simply put stage 0 cancer/pre-cancerous stage, with cancer cells multiplying in a contained area.\"\n(Also read: Ayushmann Khurrana Talks About The Art Of Balancing Professional Highs And Personal Lows!)\nAgencies\nShe had undergone a preventive mastectomy. And now, Writer-director and Bollywood actor Ayushmann Khurrana's wife Tahira Kashyap took to social media to reveal her breast cancer diagnosis on social media. In her emotional and brave note, Tahira reminded everyone that when cancer hits, you just have to show up. You fight back with all the courage and strength that you posses.\nDon't Miss 862 SHARES 322 SHARES 122 SHARES 197 SHARES 12.5 K SHARES\nRead her full post here:\n\"That’s what you do when cancer shows up. You show it the way out! It is a tough phase to be in, but then I would have never known my own strength, which is inherent in each one of us, and which we come to know off when tested. Like I said before, let’s choose to be the heroes of our own drama of life. I strongly believe if an obstacle comes in your life it is for you to deal with it, overcome it, beat the shit out of it and become a better version of yourself, which could be a bit worn out but would be experienced, a bit tattered but more wise, a bit left out but more to bring forth, a bit handicapped but better equipped!\nSo now the upgraded version of myself is dealing with cancer stage 1 a, which is still a result of early detection. I’ll be going through 12 sessions of chemotherapy. 6 down, and another 6 left. Hence the cap look nowadays.\nThis post is dedicated to my journey where half the battle is won and the other half I want to fight with each of you who is enduring it. Be resilient, be strong, we shall overcome and how! Also I have immense gratitude for people around me who have taken it in the right spirit and didn’t give up on me.\"\nTahira and Ayushmann have two children, Virajveer and Varushka. In an interview with IANS, Ayushmann had opened up about his equation with Tahira and how happy he was to have her in his life. \"I am glad I have a partner like Tahira who is very brave, strong, who is an inspiration. I have started seeing life through a different prism.\"\nWe hope they both find light at the end of the tunnel.", "title": "Ayushmann Khurrana's Wife Tahira's Brave Post On Cancer Is Something That Everyone Should Read", "date_publish": "29/11/2018, 17:45:40", "description": "Tahira Kashyap, actor Ayushmann Khurrana’s wife, has written about her cancer diagnosis in an Instagram post. Read it here.“It is a tough phase to be in,” she continued, “but then I would have never known my own strength, which is inherent in each one of us, and which we come to know off when tested. Like I said before, let’s choose to be the heroes of our own drama of life.”", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ayushmann-khurrana-s-wife-tahira-s-brave-post-on-cancer-is-something-that-everyone-should-read-357616.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/tahira_kashyap_1543492419_800x420.jpg"}