{"text": "After winning the hearts of the Indian audience, Sriram Raghavan’s Andhadhun is all set to release in China. The film will release with the title ‘Piano Player’ in China, which is emerging as a significant market for Indian mainstream films.\nTwitter\nProduced by Viacom18 Motion Pictures & Matchbox Pictures, Andhadhun stars Tabu, Anyushmann Khurrana and Radhika Apte.\nThe story of the film revolves around Simi, a desperate small time actor-turned wife to a yesteryear star. The story takes a turn when she is caught disposing of her husband’s body in front of a presumably blind pianist Akash.\nDon't Miss 623 SHARES 862 SHARES 322 SHARES 2.4 K SHARES 2.2 K SHARES\nIt is for the first time that Raghavan’s film is releasing in China and the director is suitably excited to present his film to a new audience.\n“I am super thrilled that ‘Andhadhun’ is releasing in China. Ten years back, on a visit to China, I walked into a Beijing Cafe and was zapped to see Nasir Husain’s ‘Caravan’ playing on a big screen. Dubbed in Chinese except for the songs. I was told the film was the favourite Indian film of that generation. I am curious how the Chinese audience responds to our musical thriller,” Raghavan said in a statement.\nViacom18 Studios along with Eros International has now partnered with Tang Media Partners to release the thriller in China.\n“I am happy to announce that Viacom18 Studios has secured its maiden release in China and that too with our favourite film ‘Andhadhun’. I am very excited about our film’s prospect at the China box office and celebrating what is a major first for the studio,” Ajit Andhare, COO, Viacom18 Studios, said.\n“China being a home to many Bollywood lovers, has made Andhadhun one of the most anticipated release. Fans in the country can now witness the magic of Andhadhun unfold in theatres across the country,” added Kumar Ahuja, President – Business Development, Eros International.\nKevin Tang of Tang Media Partners said Andhadhun would be the first Indian movie in thriller genre to release in China.", "title": "Ayushmann Khurrana & Radhika Apte's Andhadhun To Release In China As 'Piano Player'", "date_publish": "12/03/2019, 11:25:41", "description": "After winning the hearts of the Indian audience, Sriram Raghavan’s Andhadhun is all set to release in China. The film will release with the title ‘Piano Player’ in China, which is emerging as a significant market for Indian mainstream films. read more here.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ayushmann-khurrana-radhika-apte-s-andhadhun-to-release-in-china-as-piano-player-363551.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/andhadhun_1552370471_800x420.jpg"}