{"text": "Women’s Day is more than just shopping and salon discounts, according to Swara Bhasker and we definitely agree with her. Women do not need a day to celebrate their gender for being a woman itself is a celebration.\nBecause #WomensDay is not just about shopping discounts & salon discounts! ✊🏾 pic.twitter.com/0JxA6MkxlJ — Swara Bhasker (@ReallySwara) March 8, 2019\nEven in 2019, women are fighting for the basic rights which need to be addressed.\nToday the world is celebrating Women’s Day and even Bollywood celebrities had their messages. Some made a regular wish while others encouraged women to empower each other.\nInstagram\nBut Ayushmaan Khurrana and Vidya Balan’s messages are something that need instant attention. Ayushmaan narrates a hard-hitting poem on women which every woman can relate to, while Vidya talks about body shaming. A woman is judged for anything and everything, she is brutally trolled because her skin and body among other things.\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nOn Women’s Day, Vidya shared an interesting art of piece with a long message on Instagram and we all must read and follow it.\nHere’s what several other Bollywood celebrities have to say about Women’s Day 2019:\nHappy #womensday , thanks to my coach #RakeshYadav for making me stronger everyday, girls you’re not strong for a girl, you’re just strong, just keep pushing 💪🏽 #wallkick🌸 pic.twitter.com/UUSyOMbTTB — Disha Patani (@DishPatani) March 8, 2019\nHappy Women’s day!! Not just today but everyday of our Lives❤️ #happywomensday pic.twitter.com/jGx4nMD9v8 — Varun Sharma (@varunsharma90) March 8, 2019\nThis Women's Day, I stand for #EducationForEquality! Do you? Then support this movement for girl child education. Click this E pose and post it on your page. Ensure you add #EducationForEquality and #ICICIBankAURA. For every post @ICICIBank will contribute Rs 100.#nomakeupselfie pic.twitter.com/IQDyVkUA4C — Konkona Sensharma (@konkonas) March 8, 2019\nHappy Women's Day. Let’s empower each other ladies!", "title": "Ayushmann’s Hard Hitting Poem & Vidya's Message On Body Shaming Needs Special Attention This International Women's Day", "date_publish": "08/03/2019, 16:16:59", "description": "But Ayushmaan Khurrana and Vidya Balan’s message is something that needs instant attention. Ayushmaan narrates a hard-hitting poem on women which every woman will relate, while Vidya talks about body shaming. A woman is judged for anything and everything, she is brutally trolled of her skin, body and what not.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ayushmann-s-hard-hitting-poem-vidya-s-message-on-body-shaming-needs-special-attention-this-international-women-s-day-363392.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ayushmann_kurrana_1552043241_800x420.jpg"}