{"text": "The edge-of-the-seat thriller Ayushmann Khurrana’s Andhadhun was a wild trip for the audiences. Based on the French short film The Piano Tuner, the movie had many twists and turns, which made it an intriguing watch throughout.\nMoreover, the climax of the film, which also starred Tabu and Radhika Apte in prominent roles, was so complex and people left with only questions and no answers. Some of them are probably still scratching their heads.\nSriram Raghavan’s Andhadhun was one of a kind film and many people thought met Hollywood standards. Revolving around the story of a blind pianist, AndhaDhun has made it as the top Indian movie of 2018 based on IMDb customer ratings, who rank films and TV shows on a 10 point scale.\nBagging the next spots after AndhaDhun are Tamil films Ratsasan and 96, bilingual biographical film Mahanati and Ayushmann-starrer Badhaai Ho rounding up the top five. On the sixth spot is Akshay Kumar’s Padman which imparts a strong message on the importance of menstrual hygiene, along with a dose of entertainment.\n“I am thrilled to announce and celebrate the 10 incredible Indian movies that resonated most strongly with our customers in 2018 during my first-ever visit to India,” said Col Needham, IMDb Founder and CEO.\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nPressks\n“It was fun to follow the surge of audience interest and adoration for year-end releases like Andhadhun, Ratsasan, 96 and Badhaai Ho. I’m also delighted to see Tamil movies, Ratsasan and 96, and Telugu titles, Mahanati and Rangasthalam, appearing on our Top 10 list this year, revealing that IMDb customers worldwide are embracing diverse titles across India in a variety of Indian languages,” he added.\nWith inputs from IANS", "title": "Ayushmann Khurrana’s Andhadhun Beats Sanju And Padman To Become IMDb’s Top Indian Movie Of 2018", "date_publish": "12/12/2018, 17:20:22", "description": "Sriram Raghavan’s Andhadhun was one of a kind film and many thought met Hollywood standards. Revolving around the story of a blind pianist, AndhaDhun has made it as the top Indian movie of 2018 based on IMDb customer ratings, who rank films and TV shows on a 10 point scale.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ayushmann-khurrana-s-andhadhun-beats-sanju-and-padman-to-become-imdb-s-top-indian-movie-of-2018_-358457.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ayushmann_khurranas_andhadhun_beats_sanju_and_padman_to_become_imdbs_top_indian_movie_of_2018_1544615532_800x420.png"}