{"text": "Ayushmann Khurrana Is Open To Physical Transformation, Says He Can Go Bald If The Role Demands\nAyushmann Khurrana Is Open To Physical Transformation, Says He Can Go Bald If The Role Demands\nFor some people, life is all about and choices and not luck. In Ayushmann Khurrana's case, it has all been about making the right move at the right time. From picking up films like Andhadhun and Badhaai Ho to connecting well with the audience with his roles, he definitely hit jackpot last year.\nWith back to back successful films, the actor has become one of the most bankable stars.\nAfter doing films on sperm donation and erectile dysfunction, the actor has picked up another interesting project that includes him playing the role of a prematurely balding man.\nAyushmann spoke about his role and talking to Mid-Day, the actor said,\n\"If there is a need [to go bald], I will go for it. Physical transformation is imperative for any character that you play on screen. On my part, there will be no hiccups.”\nKhurrana is open to gaining weight also if needed. He adds, “We have yet to zero down on the final look. We are figuring out what will go well with the character, including the weight of the person.”\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nBala will be Ayushmann and Bhumi Pednekar's third film together after Dum Laga Ke Haisha (2015) and Shubh Mangal Saavdhan (2017).", "title": "Ayushmann Khurrana Is Open To Physical Transformation, Says He Can Go Bald If The Role Demands", "date_publish": "08/01/2019, 16:37:52", "description": "For some people, life is all about and choices and not luck. In Ayushmann Khurrana's case, it has all been about making the right move at the right time. From picking up films like Andhadhun and Badhaai Ho to connecting well with the audience with his roles, he has definitely hit jackpot last year.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ayushmann-khurrana-is-open-to-physical-transformation-says-he-can-go-bald-if-the-role-demands-360052.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ayushmann_1546948033_800x420.jpg"}