{"text": "He is a dependable star whose choices have been his biggest victories. Ayushmann Khurrana owned 2018 with hit films like Andhadhun and Badhaai Ho. However, he had to face personal lows too that came with the diagnosis of wife Tahira Kashyap's breast cancer scare. In a recent interview, Ayushmann Khurrana revealed how he now sees things through a different prism and has called life a \"great leveler\".\nJust to jog your memory a little, on September 22, Tahira Kashyap posted on Instagram, where she revealed how she was detected with DCIS (ductal carcinoma in situ) in her right breast with high-grade malignant cells.\nTalking to IANS about balancing personal and professional life, Ayushmann Khurrana said,\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\n\"It was very difficult. I have realized that life is never perfect. You have to celebrate the imperfections of life and you have to accept that there would be a void in your life every time, it cannot be perfect. So, this was just a small imperfection according to us. We are taking it as it is.\"\nHe added,\nTwitter\n\"I had two back-to-back films coming and I was going through a professional high and I was wondering life is so beautiful and suddenly this happened, so it is a great leveler. Life is a great leveler.\"\nOn Karva Chauth this year, Ayushmann kept a fast for the good health and long life of Tahira, whom he proudly calls his inspiration. He added,\n\"I am glad I have a partner like Tahira who is very brave, strong, who is an inspiration. I have started seeing life through a different prism. I was giving her my time, of course. In the morning I was promoting my films, in the nights I was with her in the hospital... It is not easy.\"\nHe entered the world of films in 2012 with Vicky Donor and in just six years, he has carved a niche for himself in Bollywood with movies like Dum Laga Ke Haisha, Nautanki Saala!, Bareilly Ki Barfi, Shubh Mangal Savdhan, Andhadhun and Badhaai Ho -- a film that has now crossed the Rs 200 crore mark worldwide.\nAyushmann further spoke about being tagged as an unconventional hero in Bollywood. He said,\n\"You have to be successful, that's it. Conventional, unconventional, action hero, comedy star -- you have to be successful in your zone. All I am looking for is a fine combination of critical and commercial acclaim. Whether conventional or unconventional -- does not matter.\"\nAt a time when several stars were trying their luck in the industry with formula films, Ayushmann dabbled in genres as different as chalk and cheese. Did that give him an edge over others? \"You make your own formula. I think that's my own formula of doing films which have no reference point. India does not have a reference point for Vicky Donor or Andhadhun or even Badhaai Ho. I am proud of the choices I have been making and I have made my own space in the industry,\" he said.\nHowever, Ayushmann did admit that he believes in adding his own touch to his films. He added,\n\"You bring something of your own into a film. You give a bit of yourself to every film you do. I had an edge in Andhadhun because, being a musician, I knew how to play a guitar so it was not difficult for me to learn a musical instrument.\"\n(With agency inputs)", "title": "Ayushmann Khurrana Talks About The Art Of Balancing Professional Highs And Personal Lows!", "date_publish": "23/11/2018, 16:04:02", "description": "Having tasted back-to-back success at the box-office with Andhadhun and Badhaai Ho and then facing the harsh reality of his wife Tahira Kashyap's breast cancer scare, actor Ayushmann Khurrana now sees things through a different prism and has called life a \"great leveller\".", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ayushmann-khurrana-talks-about-the-art-of-balancing-professional-highs-and-personal-lows-357254.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ayushmann_1542970819_800x420.jpg"}