{"text": "Baadhai Ho Actor Gajraj Rao Wants To Stay True To His Roots, Says Failure Is The Best Teacher\nBaadhai Ho Actor Gajraj Rao Wants To Stay True To His Roots, Says Failure Is The Best Teacher\nBaadhai Ho is one film that is only made once in a lifetime. Every character in the film is endearing but the most-loved character is Jeetender Kaushik played by the seasoned actor Gajraj Rao. The actor became popular overnight, thanks to Baadhai Ho.\nTwitter\nIndiatimes had a candid conversation with this versatile actor where he bared his heart out about life, movies and everything in between.\nBaadhai Ho Is A Game Changer For Me\nCutting to the chase, we asked him the question of the hour - did he ever imagine that this film will turn the tables for him? To which he replied,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I never thought it will be a game changer for me. When we were shooting the film, we had an inkling that something interesting is cooking, but we never thought that it will come out as such an amazing dish; we never imagined that this film will get so much appreciation.”\nBeing Called A Hero Is An Awkward Compliment\nWe informed Gajraj how audiences are raving about his performance and his onscreen son Ayushmaan too is overshadowed by powerful performance, he is in fact called the hero of the film. He said, “ This compliment is slightly awkward for me, because it’s an ensemble cast. Sometimes, it happens that one character shines among all, but when we were shooting it was not our intention to make these two characters (Kaushik and Priyamvada) more important.”\nAyushmann Khurrana Recommended Me For Baadhai Ho\nGajraj revealed how he got Baadhai Ho due to Ayushmaan, “ It was Ayushmaan who suggested my name to Amit for this film. In the beginning, Ayushmaan had told me 'Gajraj ji this film will bring you a lot of love and appreciation for you''. Every character in the film is very important, I am thankful to the audience for loving me more, but without Ayushmaan this film wouldn’t be a hit. Only he could be the one to star in this film because he understands such kind of cinema.\"\nThe Credit For The Chemistry Between Me And Neena Ji Goes To Her\nTwitter\nWe asked if there was any awkwardness between him and Neena Gupta to romance onscreen at this age, he said, “ When we started rehearsals I was slightly apprehensive about how our chemistry will shape, because in commercial cinema when our age of couple romance it’s funny or slapsticks, but our intention wasn’t to make it funny at all. The good thing is Neena ji too is from theatre and so we bonded very well. In fact the credit for the chemistry between me and Neena ji goes to her to an extent\".\nI Haven’t Got Success With Badhaai Ho, It’s Just I Am Being Appreciated More\nRao feels he hasn’t yet got the success with this movie, Badhaai Ho has only bought more recognition for him.\n“I come from a lower middle-class background and we have seen very limited resource. Our school uniform and shoes were used for 3 years. I never had a dream to become successful overnight. I have learnt to adjust from childhood. For my survival, I have done many odd jobs, right from being a freelance journalist, garment export company job and lot more. I didn’t want my family to get burdened because of my dreams. And even today I don’t feel I have become successful, it’s just I am being appreciated more, I feel success I something that you can bring change in people’s lives around me, hopefully after 5 or 10 years I will be successful and make a difference in somebody’s life.”\nI'm Not Just Being Appreciated For Portraying The Role Of A Good Husband But Also A Good Son And Father Too\nTwitter\nThe actor says he is not only being appreciated for portraying the role of a good father, but also a husband and son in the film.\n“I am not only getting appreciated for being a good father, but also for being good husband and son, I see it this way. I am getting lots of messages from my close friends about being such a loving husband to my wife, and a respectful son to my mom in Badhaai Ho.”\nThere's No Better Teacher Than Failure\nTwitter\nThe actor went on to share the best philosophy of life. He says there can be no best teacher than failure and we totally agree with him, “ There is no better teacher than failure when I shifted to Bombay I started assisting Pradeep Sarkar in Advertising; today I direct Ad films under my own advertising production(Codered Films). My dream is to direct my own film and I am working on it. While acting and directing there are lots of ups and downs in life. I am lucky to have friends who work as mirrors in my life, they don’t let be break. Also, I never ran to any directors for work. I have worked only my choices; right from working with Anurag Kashyap to Amit Sharma was my choice.”\nCelebrated Baadhai Ho Success With My Wife Over A Buffet Lunch\nTwitter\nThe celebration of Baadhai Ho for Gajraj was simple just like him, “I celebrated my Badhai Ho success with my wife over a buffet lunch where we discussed my working journey of 25 years and ups and downs, now I am waiting for the producers to throw a success bash where we can do some crazy fun.”\nWe are looking forward to see more of Gajraj Rao’s work.", "title": "Baadhai Ho Actor Gajraj Rao Wants To Stay True To His Roots, Says Failure Is The Best Teacher", "date_publish": "29/10/2018, 18:03:49", "description": "Badhai Ho is a film that is made once in a lifetime, every character in the film is endearing but the most loved character is Jeetender Kaushik played by the ace actor Gajraj Rao. The actor became popular over night, thanks to Badhai Ho. Indiatimes had a candid conversation with this versatile actor where he spoke his heart out.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/baadhai-ho-actor-gajraj-rao-wants-to-stay-true-to-his-roots-says-failure-is-the-best-teacher-355668.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/gajraj_1540816330_800x420.jpg"}