{"text": "Chitrangda Singh is one of the few actresses who is known for speaking her mind. Whether it was calling out big names during the #MeToo movement or her constant struggle to shine bright at the box office.\nBut now she has come to terms with the fact that some films don't earn well because they're progressive and ahead of its time.\nHaving started her film career in 2003 with Hazaaron Khwaishein Aisi, the actor has mostly been offered films in which she has portrayed a strong, idealistic and intelligent woman.\nChitrangda told IANS here in an interview, “I think the actor is perceived by their on-screen image in real life. I remember how after my debut film, people tend to think that I live my life wearing cotton saris like Geeta Rao of the film.\nbccl\nIf we are doing something on-screen and doing it conveniently, whether it’s the film fraternity or the audience — they start thinking about us like that. I am sure actors who are doing bold scenes if a character demands, they might be perceived in the same manner in real life, which is scary.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhether it’s a film like Sorry Bhai! or Inkaar while Chitrangda’s performance was appreciated, the titles never made it big at the box office.\nAsked if films that are close to reality find it hard to gain appreciation from the audience, Chitrangda said: “When it comes to a film like Mirch Masala, Hazaaron Khwaishein Aisi, Mandi and Masoom, more than looking at the commercial success of the film, these are important stories to be shown to the society.\nbccl\n“A commercially successful film that holds a strong entertainment value, may not be an important story, may not be a fragment of reality but that does not mean that the story is not worth telling.”\nDoes projecting reality in a serious manner keep the audience away from watching such films on the big screen?\nThe Soorma producer said, “Maybe… That’s true. Maybe that’s too much reality to digest on a Friday night! Some films do not earn a lot of money because they are ahead of its time, they are bending the formula of a commercial film. But with time, those films become cult.”\nbccl\nIn Baazaar, Chitrangda worked with Radhika Apte for the first time, and she has good things to say about the Sacred Games actor.\n“I think she is one of the secure talented actors who is very non-filmy by nature. I like her because she is real, she is natural. Though we did not have a lot of scenes in the film, it was nice working with her.”\nBaazaar, starring Saif Ali Khan, released on October 26.\nInputs From IANS", "title": "Baazaar Actor Chitrangda Singh Feels Some Films Don't Earn A Lot Of Money Because They're Progressive", "date_publish": "02/11/2018, 15:56:14", "description": "Chitrangda Singh, whose latest film to release is Baazaar, says actors get stereotyped by the film fraternity and audience alike based on their on-screen image, and this is “scary” at times. Having started her film career in 2003 with Hazaaron Khwaishein Aisi, the actor has mostly been offered films in which she has portrayed a strong, idealistic and intelligent woman. Chitrangda told IANS here in", "authors": [], "url": "https://www.indiatimes.com/entertainment/baazaar-actor-chitrangda-singh-feels-some-films-don-t-earn-a-lot-of-money-because-they-re-progressive-355941.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/chitrangda_singh_1541154479_800x420.jpg"}