{"text": "Just imagine being a woman and getting raped by a man who after years was hailed as the most Sanskari man of Bollywood. It gives me chills to just think of what Vinta Nanda went through. For 19 years, she hid this dark secret because the society was apparently not ready to listen to her story.\nAfter years, now that she has brought her story to the public attention, she is somewhere still bearing the burnt.\nSome time ago, the writer-producer has revealed how the onus is back on her, as the cops want her to undergo a medical test 20 years after the incident took place.\nRead More: After Filing Rape Case Against Alok Nath, Vinta Nanda Says Onus Is On Her To Prove Her Story\nDon't Miss 402 SHARES 449 SHARES 193 SHARES 1.4 K SHARES\nNow, according to a report on Mid-day, Alok Nath AKA Babuji is missing. He is untraceable, says a source at Oshiwara police station. Summons were issued to him last week, according to the report, but he was not at home. “We don't know where he is,” added the source.\nHe is reportedly “out of town” for “some important work”, Alok Nath’s counsel Ashok Saraogi told the publication.\nVinta Nanda filed a case against Alok Nath on October 19. Following which, Alok Nath was booked under Indian Penal Code's Section 376 (rape).", "title": "Babuji Goes Missing? After Vinta Nanda Filed FIR Against Alok Nath, He’s Reportedly Untraceable", "date_publish": "05/12/2018, 13:59:13", "description": "Vinta Nanda filed a case against Alok Nath on October 19. Now, according to a report on Mid-day, Alok Nath AKA Babuji is missing. He is untraceable, says a source at Oshiwara police station. Summons were issued to him last week, according to the report, but he was not at home. “We don't know where he is,” added the source.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/babuji-goes-missing-after-vinta-nanda-filed-fir-against-alok-nath-he-s-reportedly-untraceable-357985.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/babuji_goes_missing_after_vinta_nanda_filed_fir_against_alok_nath_hes_reportedly_untraceable_1543997458_800x420.png"}