{"text": "Singing was her passion, but life had different plans for Kanika Kapoor, the singer who is known for her chartbusters like Baby Doll and Chittiyan kalaiyaan among others. After she married NRI businessman at the age of 18 in 1997, she moved to London where she spent her days as a homemaker until one day when Meet Bros, her Rakhi brothers whom she has known since childhood, called her for an opportunity to sing a song for a movie.\nFrom that day onwards, her life changed completely.\npinimg.com\nRagini MMS 2 didn’t do quite well at box office, but Baby Doll was a chartbuster. Almost everyone was singing and dancing to its tunes.\nKanika Kapoor is now one of the most sought after singers in Bollywood, but did you that people called her a “sh** performer” when she had started off?\n“Now I am not only a playback singer but also a performing artiste. But at the beginning of my career, people said on my face that I am a 'sh** performer',” she said adding that she didn’t make it an ego issue.\nbizasialive.com\nDon't Miss 1.8 K SHARES 494 SHARES 12.5 K SHARES 5.5 K SHARES\nShe accepts she was a “bad live performer” earlier.\n“When I came to sing in Bollywood and my song became a superhit, I performed live on stage, and I was a bad live performer. Then, I learned the art of stage performance and now I am doing Kanika Kapoor Live across the globe.”\nKanika Kapoor doesn’t believe she has a perfect voice. She says it's about connecting with the audiences.\n“Perfect is a myth. Nobody is perfect... It is about the connect, the human connection. If you are an artiste -- whether a storyteller, a singer, a dancer, you are the best when you are engaging with your audience. If you are singing a love song, the listener should feel like falling in love... and feel the emotion through the song.\"\nCurrently, Kanika Kapoor is busy in grooming new talent for the reality television show The Voice of India - Season 3, which will go on air on STAR Plus from Sunday.\nWith inputs from IANS", "title": "Baby Doll Singer Kanika Reveals People Called Her A Sh** Performer Earlier, Accepts She Was Bad", "date_publish": "02/02/2019, 12:16:40", "description": "Kanika Kapoor is now one of the most sought after singers in Bollywood, but did you that people called her a “sh** performer” when she had started off? “Now I am not only a playback singer, but also a performing artiste. But at the beginning of my career, people said on my face that I am a 'sh** performer',” she said adding that she didn’t make it an ego issue.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/baby-doll-singer-kanika-reveals-people-called-her-a-sh-performer-earlier-accepts-she-was-bad-361452.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/baby_doll_singer_kanika_kapoor_says_people_used_to_call_her_a_shit_performer_when_she_had_started_1549088935_800x420.jpg"}