{"text": "There is much more than what meets the eye. Well, this is true in every case. Be it your boss, your co-worker or some of your friends, sometimes the reality is very different from what we see. Sometimes, it's better than what we see and notice and sometimes, the reality is completely contrasting in a negative way.\nJust a few days ago, an airport staffer made some striking revelations about the reality behind 'reel' celebrities. He anonymously shared some confessions on reddit, where he described how celebrity encounters are, in reality.\nAnd now, a few similar confessions have been made by a backstage manager of a reality show. This anonymous user decided to have a ‘Ask Me Anything’ session with the Reddit public and as hungry and curious we are for 'celebrity gossip', everyone flooded him with questions.\nScreengrab/Reddit\nHe went on to answer a lot of questions that unmasks the real face of celebrities and how they behave, when they're not in front of the camera. His confessions come across as allegations, where he has made some strong points about how rude or kind celebrities are when they are around people. Read on:\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n1. Ranveer Singh\nAgencies\n\"Ranveer is extra! And likes intimidating people...but tolerable. He is on the kinder list of celebs and dishes out advice here and there too.\"\n2. Shah Rukh Khan\nAgencies\n\"I ranked him as my 2nd best celeb encounter right. He is a good guy, especially to his fans. Obviously came late, but stayed for 15 minutes after the show ended too, to interact with the audience and click pics with them. Had my utmost respect from that moment.\"\n3. Priyanka Chopra\nPinterest\n\"Our equipment manager was a huge fan of hers, his hands started shaking so he couldn’t properly take a good selfie. She could have refused when he asked to take another one, but she shouted at him and pushed his hand which made him drop the phone. Our equipment manager couldn’t handle it and started crying. Priyanka told him to basically shut up or get fired. I trust this story 100% since it’s confirmed by multiple people.\"\n4. Karan Johar\nAgencies\n\"He basically pretends like people who work day and night to make sure his show goes well don’t exist. Edit: I am not joking by the way. Literally won’t face our direction or speak with spot boys or even glance at them when they do him favours.\"\n5. Akshay Kumar\nAgencies\n“From what I have heard from my colleagues who are women, he is a sakht launda who melts after he sees a girl. Compliments weird aspects about them, sometimes awkward interaction for a few minutes. Obviously meant to sound cheeky and to be taken in good spirit...but you never know if the woman found it too inappropriate. Most people find him cordial and co-operative though.\"\n6. Bhumi Pednekar\nTwitter\n\"Where am I supposed to start. Shows up late. Okay ...that's normal. Demands us to immediately cast all our attention to her. Okay...bit demanding and pushy here. Makes fun of how the spotboy said water, proceeds to ridicule him. (He pronounced it as Va-ta-rr) Proceeds to make him say water again and again and laughs on his face each time. Proceeds to get her co star to awkwardly laugh away during that cringeworthy moment and make him say water again even when the poor guy is saying sorry, please let me go ma'am again and again.\"\nIndiatimes independently could not verify the claims posted by the anonymous user on reddit.", "title": "Backstage Manager Of A Reality Show Makes Striking Revelations About Stars' Real Behaviour", "date_publish": "17/03/2019, 14:08:43", "description": "And now, a few similar confessions have been made by a backstage manager of a reality show. This anonymous user decided to have a ‘Ask Me Anything’ session with the Reddit public and as hungry and curious we are for 'celebrity gossip', everyone flooded him with questions.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/backstage-manager-of-a-reality-show-makes-striking-revelations-about-stars-real-behaviour-363856.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1552814125_800x420.jpg"}