{"text": "Deepika Padukone and Ranveer Singh were the talk of the town for the past two months. From their non-stop receptions, private wedding in Lake Como, the most entertaining episodes on Koffee With Karan to Simmba's trailer launch, Ranveer and Deepika have been hogging the limelight since forever now. And we are not complaining\nInstagram/Deepika Padukone\nThe couple who was together for 6 years before they tied the knot is enjoying every bit of their togetherness. The duo has got back to their professional commitments and in the midst of it, Ranveer is trying to work towards being the 'husband of the millennium'.\nTwitter\nAfter they made their relationship public with official ceremonies, Anil Kapoor seems to be elated. Speaking on Neha Dhupia's podcast, he revealed how Deepika especially visited Ranveer on the sets of Dil Dhadakne Do. Calling their relationship adorable, he recalls telling Deepika in reference to Ranveer, “Chhodna mat isko, mera ye ladka superb hai (Never leave this guy. My boy is superb). Perfect choice. You can’t get a better boy.”\nPinterest\nDon't Miss 7.9 K SHARES 159 SHARES\nAnd looks like she took that advice into consideration and married him. Anil wished the newly weds on their wedding, “They look great together, I wish them really well. They will make a beautiful and fantastic couple. I am very excited they are together.”\nAnil did not limit himself only to Deep-Veer but had an advice for other rumoured Bollywood couples as well. Talking about his niece Janhvi Kapoor, Anil said she should do another film with Ishaan Khatter and Ranbir Kapoor - Alia Bhatt should spend as much time together as possible.\nTwitter\nHe also spoke about his nephew Arjun Kapoor and Malaika Arora and said, “I know him very well. Whatever makes him happy, makes me happy. I don’t want to comment on anything as that’s personal whatever he does. We all family members have believed in that whatever makes the other person happy, makes us happy.”", "title": "Back In 2015, Anil Kapoor Told Deepika To Never Let Go Of Ranveer Because He's Superb", "date_publish": "05/12/2018, 12:10:20", "description": "deepika padukone, ranveer singh, bollywood, couples, a listers, celebrity, anil kapoordeepika padukone, ranveer singh, bollywood, couples, a listers, celebrity, anil kapoordeepika padukone, ranveer singh, bollywood, couples, a listers, celebrity, anil kapoordeepika padukone, ranveer singh, bollywood, couples, a listers, celebrity, anil kapoordeepika padukone, ranveer singh, bollywood, couples, a l", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/back-in-2015-anil-kapoor-told-deepika-to-never-let-go-of-ranveer-because-he-s-superb-357961.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anil_1543989429_800x420.jpg"}