{"text": "Badhaai Ho Beats Thugs of Hindostan By A Big Margin & We're Sure Aamir Didn't See This Coming!\nBadhaai Ho Beats Thugs of Hindostan By A Big Margin & We're Sure Aamir Didn't See This Coming!\nIndian cinema is currently undergoing a significant change. Digital streaming platforms including Netflix and Amazon Prime are a game changer. Good content and scripts are winning the hearts of the audiences. Good looks are no longer important, and talent is coming to the forefront.\nWhat’s hinting on this transitional phase of Indian cinema is the fading charm of the Khans of Bollywood. Shah Rukh Khan’s Jab Harry Met Sejal, Salman Khan’s Race 3 and Aamir Khan’s Thugs of Hindostan miserably failed at the box office. On the other hand, films including Badhaai Ho and AndhaDhun, are breaking box office records.\nYou cannot misjudge or underestimate the audience these days. Yeh public hain, yeh sab jaanti hain... #TOH #ThugsOfHindostan — taran adarsh (@taran_adarsh) November 13, 2018\nBoxoffice can be most unpredictable, but that’s the beauty of this business... #BadhaaiHo was down to 2/3 shows at several plexes during #Diwali weekend, but, today [Mon] onwards, the film is back in 4/5/6 shows... Content is King and the audiences are King Makers! — taran adarsh (@taran_adarsh) November 12, 2018\nDon't Miss 862 SHARES 322 SHARES 468 SHARES 1.7 K SHARES 4.1 K SHARES\nMoviegoers are extremely ruthless and in no mood to splurge on movies they hear is substandard... In this era of social media, the word of mouth spreads faster than fire and can make or break a movie within hours... #TOH #ThugsOfHindostan — taran adarsh (@taran_adarsh) November 13, 2018\nTouted as the most expensive film of Bollywood, Aamir Khan and Amitabh Bachchan starrer Thugs Of Hindostan opened well at the box office. Also starring Fatima Sana Shaikh, the movie crossed 100 crore mark in just three days, but the collections went down thereafter. So much so, that it is said that exhibitors are incurring huge loses and people are discussing if Aamir and Big B will compensate.\nMeanwhile, Badhaai Ho is scaling new heights at the box office. The movie is doing a great amount of business not only in India but also abroad. It has already crossed 200 crore mark. And according to trade analyst Taran Adarsh, the film’s lifetime collection, particularly in the international market, will soon exceed those of Aamir Khan’s Thugs of Hindostan.\nThis is a SHOCKER... #ThugsOfHindostan may be the most expensive Hindi film, with Aamir Khan enjoying an enviable following in international markets, but its *lifetime biz* in #USA + #Canada and #Australia will be lower than #BadhaaiHo... Content wins and how! #TOH — taran adarsh (@taran_adarsh) November 21, 2018", "title": "Badhaai Ho Beats Thugs of Hindostan By A Big Margin & We're Sure Aamir Didn't See This Coming!", "date_publish": "22/11/2018, 13:27:51", "description": "Touted as the most expensive film of Bollywood, Aamir Khan and Amitabh Bachchan starrer Thugs Of Hindostan opened well at the box office. Also starring Fatima Sana Shaikh, the movie crossed 100 crore mark in just three days, but the collections went down thereafter. So much so, that it is said that exhibitors are incurring huge loses and people are discussing if Aamir and Big B will compensate.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/badhaai-ho-beats-thugs-of-hindostan-by-a-big-margin-we-re-sure-aamir-didn-t-see-this-coming-357162.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_khan_fails_to_beat_ayushmann_khurrana_as_badhaai_ho_races_ahead_of_thugs_of_hindostan_at_b_1542872635_800x420.png"}