{"text": "The unthinkable is finally happening. The Khans are apparently losing their charm. Tubelight failed miserably at the box office. Race 3 was even worse. Jab Harry Met Sejal was a disappointment too. In fact, Aamir Khan’s Thugs Of Hindostan also found a lot of empty theatres.\nThe big-budget film of the Mr. Perfectionist failed at the box office so miserably that he had to apologise to the fans and take the entire responsibility on himself. While stars including Ayushmann Khurrana, Vicky Kaushal, Varun Dhawan etc are taking over Bollywood, the Khans' jobs are almost at stake.\nAlso Read: Badhaai Ho Beats Thugs of Hindostan By A Big Margin & We're Sure Aamir Didn't See This Coming!\nThe taste of the audiences is changing and how! They want good content and not a masala entertainer anymore. And so, Ayushmann Khurrana’s Badhaai Ho is touching new heights in terms of the business it is doing at the box office.\nNow, the movie has beaten SS Rajamouli’s magnum opus Baahubali. Badhaai Ho is successfully running in the theatres six weeks after its release, and the six week’s collection of the Neena Gupta starrer film is reportedly more than that of Baahubali 2: The Conclusion.\nBadhaai Ho has minted Rs 3.95 crore in the sixth week setting an all-time record. With that, it has broken the record of Baahubali 2: The Conclusion (Hindi) which had made Rs 3.35 crore in the sixth week.\nMinting Rs 132.35 crore, Ayushmann Khurrana starrer Badhaai Ho is now the six highest grossing movie of 2018, and that’s a good news indeed.\nDon't Miss 862 SHARES 812 SHARES 322 SHARES 468 SHARES", "title": "‘Badhaai Ho’ Beats ‘Baahubali 2: The Conclusion', Conquers Box Office, One Record At A Time!", "date_publish": "28/11/2018, 17:07:15", "description": "Now, Ayushmann Khurrana’s Badhaai Ho has beaten SS Rajamouli’s magnum opus Baahubali. Badhaai Ho is successfully running in the theatres six weeks after its release, and the six week’s collection of the Neena Gupta starrer film is reportedly more than that of Baahubali 2: The Conclusion.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/badhaai-ho-beats-baahubali-2-the-conclusion-conquers-box-office-one-record-at-a-time-357544.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/one_after_the_other_badhaai_ho_is_smashing_records_at_the_box_office_now_beats_baahubali_1543403904_800x420.png"}