{"text": "“This is not the end. Consider it an alternative path,” wrote Black Mirror: Bandersnatch star Will Poulter who plays the role of renowned video gamer named Colin Ritman in the Netflix’s interactive movie, as he said goodbye to his Twitter followers.\nTwitter\nBlack Mirror: Bandersnatch has been making quite a lot of buzz since the time it has been released on Netflix (on Dec 28). People have not been able to stop talking about it. The innovative series allows users to make decisions for the characters and take the story forward. However, it’s challenging to watch because of its unsettling storylines.\ncollider.com\nAmid all the hype, actor Will Poulter who plays the role of Colin Ritman has quit Twitter over \"inevitable negatives that are best avoided\". He says he wants to focus on his mental health.\nsyfy.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nOffering a heartfelt thank you to the viewers who watched his film, Will Poulter said, “I accept all criticisms and it's been a delight to learn that so many of you enjoyed what many people worked very hard to produce!.”\ngamer4k.com\n“As we all know there is a balance to be struck in our engagements with social media. There are positives to enjoy and inevitable negatives that are best avoided. It's a balance I have struggled with for a while now and in the interest of my mental health I feel the time has come to change my relationship with social media,” he wrote.\nRead his entire statement below.\nWhile Will Poulter didn’t reveal the reason for why he decided to step away from the social media platform, people have been speculating that it’s because of some people bullying him over his looks in the movie.\nY'all would hype up everyone and everything but when there's someone like Will Poulter who actually deserves all the praise and hype you all trash him for his looks — Bernie (@blueIilies) January 2, 2019\ni can’t believe twitter rly bullied will poulter for his looks and made him have to step back from social media because of it. this is disgusting. he is an amazing person and it’s not funny to make fun of someones appearance. it’s not okay. — julia (@blakescgriffin) January 2, 2019\nHave you watched Black Mirror: Bandersnatch yet? If yes, tell us about your experience in the comments section below.", "title": "Bandersnatch Actor Will Poulter Quits Twitter After Facing Backlash Over The Black Mirror Movie", "date_publish": "05/01/2019, 12:33:33", "description": "“This is not the end. Consider it an alternative path,” wrote Black Mirror: Bandersnatch star Will Poulter who plays the role of renowned video gamer named Colin Ritman in the Netflix’s interactive movie, as he said goodbye to his Twitter followers. “This is not the end. Consider it an alternative path,” wrote Black Mirror: Bandersnatch star Will Poulter who plays the role of renowned video gamer", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bandersnatch-actor-will-poulter-quits-twitter-after-facing-backlash-over-the-black-mirror-movie-359884.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bandersnatch_actor_will_poulter_quits_twitter_after_facing_backlash_over_the_black_mirror_movie_1546671310_800x420.jpg"}