{"text": "Band Baaja Baraat: SRK, KJo And Ranbir Dance Their Heart Out At Akash Ambani-Sholka Wedding!\nBand Baaja Baraat: SRK, KJo And Ranbir Dance Their Heart Out At Akash Ambani-Sholka Wedding!\nAkash Ambani and Shloka Mehta tied the knot in Mumbai last evening. Joining the celebrations were crème de la crème of the entertainment, tech, sports and the fashion industry. Among the guests were Former UN Secretary-General Ban Ki-moon, former British Prime Minister Tony Blair and his wife Cherie Blair came in for the celebrations.\nAgencies\nFrom the business world, present at the wedding were Anil Ambani, Ratan Tata, Lakshmi Niwas Mittal and Usha Mittal, Anand Mahindra and Gautam Singhania. Google CEO Sundar Pichai and Microsoft head honcho Satya Nadella were also among the invitees.\n(Also read: Photos From Akash Ambani & Shloka Mehta's Fairytale Wedding Are Finally In & They're Beautiful)\nAgencies\nThe wedding soon turned into a star-studded event and a Bollywood bash when all the A-listers from the industry turned up to bless the couple.\nAgencies\nBut celebrities who hogged the most spotlight were Shah Rukh Khan, Ranbir Kapoor and Karan Johar, who danced their heart out on singer Mika Singh's live tracks.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nFor the wedding, Jio World Centre, Bandra-Kurla Complex in Mumbai was heavily decked up and decorated with floral arrangements set according to a garden theme complete with a faux waterfall, floral figurines, a fountain and a grand stage with a huge Krishna idol was set up with flowers. The Ambani's and the Mehta's will be hosting a wedding reception for their family and friends on March 11th.", "title": "Band Baaja Baraat: SRK, KJo And Ranbir Dance Their Heart Out At Akash Ambani-Sholka Wedding!", "date_publish": "10/03/2019, 12:20:24", "description": "Akash Ambani and Shloka Mehta tied the knot in Mumbai last evening. Joining the celebrations were crème de la crème of the entertainment, tech, sports and the fashion industry. Among the guests were Former UN Secretary-General Ban Ki-moon, former British Prime Minister Tony Blair and his wife Cherie Blair came in for the celebrations.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/band-baaja-baraat-srk-kjo-and-ranbir-dance-their-heart-out-at-akash-ambani-sholka-wedding-363462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ambani_bash_1552200759_800x420.jpg"}