{"text": "Bappi Lahiri's Song To Feature In A Marvel Film, Akki To Raise Funds For CRPF Families & More From Ent.\nBappi Lahiri's Song To Feature In A Marvel Film, Akki To Raise Funds For CRPF Families & More From Ent.\nAccording to a latest report in Times Now, Bollywood's Khiladi Kumar is travelling across the country to generate funds for the Bharat Ke Veer initiative. The report claims that Akshay is urging people to contribute for the families of Central Armed Police Force (CAPF).\n\"It's very important to make films with good stories. If tomorrow, there's a great patriotic film, I would love to do it. But I would not like to do jingoistic films. I am not anti any other country, I am not anti any other religion. I'm very pro-secular and I would like to make films that reflect the true nature of this country,\" John said.\nDon't Miss 862 SHARES 346 SHARES\nOver the years, some of the Indian elements have managed to find their way in Marvel superhero films. Remember Robert Downey Jr.'s character Tony Stark (aka Iron Man) attending an Indian wedding in Spider-Man: Homecoming or the Indian slum scenes in The Avengers?\nHe is the only celebrity who hasn’t changed in the way he looks since ages. No, we are not exaggerating. Remember, the 10-year challenge? For Anil Kapoor, it was 20-year challenge with no change at all!\nThe three-day party in Switzerland was attended by a large number of Bollywood A-listers that include Shah Rukh Khan, Gauri Khan, Alia Bhatt, Ranbir Kapoor, Arjun Kapoor, Malaika Arora in St. Mortiz, Switzerland.", "title": "Bappi Lahiri's Song To Feature In A Marvel Film, Akki To Raise Funds For CRPF Families & More From Ent.", "date_publish": "05/03/2019, 17:36:49", "description": "According to a latest report in Times Now, Bollywood's Khiladi Kumar is travelling across the country to generate funds for the Bharat Ke Veer initiative. The report claims that Akshay is urging people to contribute for the families of Central Armed Police Force (CAPF). According to a latest report in Times Now, Bollywood's Khiladi Kumar is travelling across the country to generate funds", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/bappi-lahiri-s-song-to-feature-in-a-marvel-film-akki-to-raise-funds-for-crpf-families-more-from-ent-363217.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1551788294_800x420.jpg"}