{"text": "A Star Is Born was nothing less than a masterpiece. A stellar cast, amazing music, breathtaking performances and impeccable directing – everything about the movie was simply excellent. The movie was not only thought-provoking but also enthralling for fans.\nwmagazine.com\nDespite five nominations at the Golden Globe, Bradley Cooper's directorial debut only took home one trophy for Best Original Song for Shallow, which was written by Lady Gaga and Mark Ronson. Fans were left disappointed, of course.\npinimg.com\nHowever, now all eyes are glued to the BAFTA Awards, where A Star Is Born has been nominated under seven categories. What’s worth noting down here is that five out of these seven nominations are in the name of Bradley Cooper for best film, actor, best director, adapted screenplay and original music. And this has never happened before.\n“What we think is a first is that Bradley Cooper has been nominated for producer, director, writer, actor and composer,” Emma Baehr, BAFTA's director of awards and memberships said.\nmamamia.com.au\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBradley Cooper has broken George Clooney's 2005 record where he had received four BAFTA nominations across multiple disciplines including best director, best supporting actor and best screenplay for Good Night, and Good Luck and best supporting actor for Syriana.\nWith inputs from ANI", "title": "Beating George Clooney's Record, Bradley Cooper Bags 5 Nominations In Major Categories At BAFTA", "date_publish": "10/01/2019, 14:55:03", "description": "A star is born was not less than a masterpiece. The movie was stuck with people for several days after they watched it. A stellar cast, amazing music, breathtaking performances and impeccable directing – everything about that movie was simply excellent. The movie was not only thought-provoking but also enthralling for fans.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/beating-george-clooney-s-record-bradley-cooper-bags-5-nominations-in-major-categories-at-bafta-360167.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bradley_cooper_makes_history_with_bafta_awards_nominations_scores_a_whopping_5_nominations_1547111536_800x420.png"}