{"text": "Beating Padmaavat, Ranveer Singh Starrer Simmba Becomes The Biggest Opener Of His Career!\nBeating Padmaavat, Ranveer Singh Starrer Simmba Becomes The Biggest Opener Of His Career!\nCruising through negative reviews and a lukewarm response from the critics, Ranveer Singh's Simmba has already registered an opening of around Rs 20 crore.\nAccording to Boxofficeindia.com report, Rohit Shetty's Simmba has registered itself a massive opening in the Mumbai circuit with collections of around Rs 8 crore.\nDharma Productions\nOn the other hand, Simmba has become Singh's highest opener of the year, beating Padmaavat's opening collection by around Rs 2.50 crore.\n#Simmba heading to a $400K+ Opening at the #USA Box Office.. Day-1 — Ramesh Bala (@rameshlaus) December 29, 2018\nTrade analyst Taran Adarsh took to social media to update about the same. He wrote,\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“#Simmba gathered momentum during the course of the day, with evening/night shows supporting the film... Mumbai circuit is rocking... Emerges Ranveer Singh’s biggest opening day... Day 2 performing better than Day 1... Fri ₹ 20.72 cr. India biz.”\nTrade analysts are estimating brighter days ahead for the film. The film is getting a positive response from overseas audiences. The film has already raked in $ 180,253 in Australia on its first day.", "title": "Beating Padmaavat, Ranveer Singh Starrer Simmba Becomes The Biggest Opener Of His Career!", "date_publish": "29/12/2018, 15:05:50", "description": "Cruising through negative reviews and a lukewarm response from the critics, Ranveer Singh's Simmba has already registered an opening of around Rs 20 crore. According to Boxofficeindia.com report, Rohit Shetty's Simmba has registered itself a massive opening in the Mumbai circuit with collections of around Rs 8 crore.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/beating-padmaavat-ranveer-singh-starrer-simmba-becomes-the-biggest-opener-of-his-career-359476.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/simmba_1546077699_800x420.jpg"}