{"text": "Sunil Grover and Kapil Sharma’s fight was perhaps the biggest one in the Television industry – that led to the highest-rated comedy show coming to an end, and the leader of the clan falling into depression.\nNo one still knows what exactly happened on the flight that led to the downfall of India’s most popular comedian Kapil Sharma, but all people are hoping is to see them both come together.\nTwitter\nFor long, Kapil Sharma was missing from the limelight. Rumours suggested that he has been in a rehab in Delhi and now he has stopped drinking. He came back to Mumbai and got married to his long-time girlfriend Ginni Chatrath.\nAnd he’ll soon be back with his new show with Salman Khan and Ranveer Singh.\nDon't Miss 106 SHARES 346 SHARES 185 SHARES 764 SHARES\nMeanwhile, Sunil Grover who did a lot of live shows and also featured in movies like Patakha, is also back on TV with another show called Kanpur Wale Khuranas, which has already made its debut on Dec 15.\nWhile some people loved the fact that Sunil Grover is back on TV doing what he does the best, there were others who compared his performance to the roles he has done in his previous show. Take a look!\n@WhoSunilGrover What an episode #legendSunil King of Comedy is back. Gotta change the leauge this time #KanpurWaleKhuranas — AKHIL SHARMA (@akhilsharma09) December 15, 2018\nHe was missing from the screen for a long time but he is back with a bang like he never left @WhoSunilGrover , and you will never leave our hearts . Keep entertaining us it was great watching you today and great show @StarPlus !! #KanpurWaleKhuranas — Mukul Kumar (@WhiteCoat_no_48) December 15, 2018\nYou were really awesome @WhoSunilGrover great to see u back on television. #SunilGrover #KanpurWaleKhuranas — Hital Solanki (@SolankiHital) December 16, 2018\nSuper cheap version of Comedy Nights being tried but #KanpurWaleKhuranas get a band of rejected actor's n try replacing the top show, pl think again, Comedy n cheapness r 2 different things @WhoSunilGrover @KapilSharmaK9 , best u are with eachother, baaki aap bade log — Ashish Bajpai Indian 🇮🇳 (@er_ashishbajpai) December 15, 2018\n#KanpurWaleKhuranas As expected it is very difficult for @WhoSunilGrover to run a show alone. First 30min full over acting and poor jokes. Only @RanveerOfficial can make people laugh and not the #khuranas tonight.\nBesides, unsuccessful attempt to copy #TKKS . — Lal Saurabh Vikram S (@lal_saurabh) December 15, 2018\n#KanpurWaleKhuranas first of all time is clashing with #BigBoss12 and #IGT8 and second its good in parts only and @RanveerOfficial only saved the show. @WhoSunilGrover you were much bettet as gulati and rinku bhabhi, but sry sir khurana nahi jame hume. — Amit thakur (@Amtthakur) December 16, 2018\nSuper cheap version of Comedy Nights being tried but #KanpurWaleKhuranas get a band of rejected actor's n try replacing the top show, pl think again, Comedy n cheapness r 2 different things @WhoSunilGrover @KapilSharmaK9 , best u are with eachother, baaki aap bade log — Ashish Bajpai Indian 🇮🇳 (@er_ashishbajpai) December 15, 2018\n@WhoSunilGrover its time for you to make people \"laugh\" - NOT RUN AWAY FROM TV. Such low format dialogues with high expectations made me really disappointed this weekend. #kanpurwalekhuranas (extreme bakwas) — Akrishma Chatterjee (@AkrishmaJi) December 16, 2018\n#KanpurWaleKhuranas As expected it is very difficult for @WhoSunilGrover to run a show alone. First 30min full over acting and poor jokes. Only @RanveerOfficial can make people laugh and not the #khuranas tonight. — Vijay Kumar (@vjshivamkr) December 15, 2018", "title": "Sunil Grover:Before Kapil Sharma, Sunil Grover's Talk Show Hits The Small Screen & Fans Have Mixed Reactions", "date_publish": "17/12/2018, 12:01:48", "description": "Sunil Grover who did a lot of live shows and also featured in movies like Patakha, is also back on TV with another show called Kanpur Wale Khuranas, which has already made its debut on Dec 15. While some people loved the fact that Sunil Grover is back on TV doing what he does the best, there were others who compared his performance to the roles he has done in his previous show. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/before-kapil-sharma-s-comeback-sunil-grover-s-show-hits-the-small-screen-fans-have-mixed-reactions-358740.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ahead_of_kapil_sharmas_comeback_sunil_grover_is_back_with_his_own_show__heres_what_fans_think_ab_1545029454_800x420.png"}