{"text": "Before The Finale, Maisie Williams Re-Watched Game Of Thrones S1. Here's Why You Should Too!\nBefore The Finale, Maisie Williams Re-Watched Game Of Thrones S1. Here's Why You Should Too!\nJust a couple of weeks left for Game Of Thrones season 8 to air, and if you have been planning to re-watch all the past seven seasons, it’s time you do that soon. And if not all the seven seasons, at least re-watch the first one, says Maisie Williams AKA Arya Stark.\nfanpop.com\nIn order to be ready for the Game of Thrones season 8, Maisie Williams says the first season plays a huge role in what happens in the Game of Thrones season 8. In fact, she herself did the same after having read the script of the finale season, she said.\nmymodernmet.com\n“After reading the scripts I went back and watched season one again because so much of it refers back to that season. There are so many scenes that will look similar. And also I watched just to remind myself of the arc I've taken already. I wanted Arya to go full circle and try for some kind of normalcy like when she was younger,” she was quoted as saying to Entertainment Weekly.\nIf you remember the first season, it was quite slow and brooding, right? That is perhaps because there was a lot of set-up that will all make sense in Game of Thrones season 8.\nDon't Miss 596 SHARES 246 SHARES 3.1 K SHARES 406 SHARES\nvia GIPHY\nFurthermore, talking about season 8 and her character, here’s what she said:\n“This year it's like she has a dual personality there are so many emotions and memories that come flooding back when you're with your family and the things that you fight for becoming very different, yet she's also remaining on this path to try and kill Cersei and remembering her list and getting closer to that. So there's this split with Arya between trying to be who she wants to be getting back to the naivete and innocence with her family and unfinished business.”\nvia GIPHY\nThe cast and the crew of the show have hinted in the past that the show will have a “bitter-sweet ending” and that not everyone will be happy with it. So, are you ready for Game Of Thrones season 8? It’ll start airing on April 14.", "title": "Before The Finale, Maisie Williams Re-Watched Game Of Thrones S1. Here's Why You Should Too!", "date_publish": "28/03/2019, 16:00:34", "description": "Just a couple of weeks left for Game Of Thrones season 8 to air, and if you have been planning to re-watch all the past seven seasons, it’s time you do that soon. And if not the all the seven seasons, at least re-watch the first one, says Maisie Williams AKA Arya Stark.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/before-the-finale-maisie-williams-re-watched-game-of-thrones-s1-here-s-why-you-should-too-364479.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/its_time_to_rewatch_game_of_thrones_season_1_because_maisie_williams_says_finale_has_a_lot_of_refe_1553767029_800x420.jpg"}