{"text": "Being A Young Parent, Ayushmann Khurrana Feels He Has The Energy To Enjoy And Grow With The Kids\nBeing A Young Parent, Ayushmann Khurrana Feels He Has The Energy To Enjoy And Grow With The Kids\nHe's one of the few actors in Bollywood who entered into the industry when he was married. Yes, after Shah Rukh Khan, Ayushmann Khurrana, too made his debut when he was already married and had children.\nAnd as per the actor, he has zero regrets. In fact, he feels it is good to have children at a young age. The Badhaai Ho star opened up about his equation with his children during the chat show Famously Filmfare Season 2.\nBCCL\nOn how it was for him to be a hands-on parent, Ayushmann said, \"Today, I had to wear glasses because I got up early in the morning for a shoot. It was also her (his daughter Varushka’s) sports day and I was all ready and geared up to win that 100-meter race with fellow parents as I was one of the youngest out there.\n\"I was really excited, but sadly that didn't happen. Even though I've under-slept today, it is alright. It is good to be a young father, a young parent. You have that energy and you are growing up with them.\"\nTwitter\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nAyushmann and Tahira Kashyap have a daughter Varushka and a son Virajveer. He feels his son is more talented than him when it comes to playing the piano.\n\"Being a young parent, I can play cricket, football and chess with my son. In fact, he plays the piano better than I do. We got the piano installed because of my film AndhaDhun. He started learning recently and already has a concert coming up\" said Ayushmann, who will next be seen in Bala as a man dealing with premature balding.\nInputs from IANS", "title": "Being A Young Parent, Ayushmann Khurrana Feels He Has The Energy To Enjoy And Grow With The Kids", "date_publish": "21/12/2018, 17:39:16", "description": "Actor Ayushmann Khurrana says it is good to have children at a young age. The Badhaai Ho star opened up about his equation with his children during the chat show Famously Filmfare Season 2. On how it was for him to be a hands-on parent, Ayushmann said, \"Today, I had to wear glasses because I got up early in the morning for a shoot.", "authors": [], "url": "https://www.indiatimes.com/entertainment/being-a-young-parent-ayushmann-khurrana-feels-he-has-the-energy-to-enjoy-and-grow-with-the-kids-359057.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ayushmann_khurrana_1545394492_800x420.jpg"}