{"text": "Ben Affleck told us this when we asked him what patriotism means to him.\n\"One example of patriotic service that i got to see myself, was to work alongside some Indian peacekeepers who were working, thousands of miles away from home, in the democratic Republic of Congo where many Indians soldiers were serving in order to make the transition of another country to democracy more peaceful. I found that admirable and to me that form of service is the true act of patriotism.\"\nBhavya Sadhwani/Indiatimes\nWe met Affleck, Charlie Hunnam and Garrett Hedlund, all part of the new Netflix movie Triple Frontier. The movie revolves around former war veterans undergoing a mission for their own selves after having served the country for over 17 years.\nBhavya Sadhwani/Indiatimes\nBen Affleck took it upon himself to share his bit on the same. He said, “This is a question that has no great one answer to this but i can tell you one thing, you know the acts of patriotism in service when you see them. War-mongering is something that is engaged in by the political class.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nBhavya Sadhwani/Indiatimes\nThe military folks are there serving, so whatever service they do is in the name of their country and they put their trust in their commanding officer to make the right decision and the politicians who lead them to make the right decisions. But naturally there is a line - Patriotism, nationalism, jingoism. We have to be mindful of that.\"\nBhavya Sadhwani/Indiatimes\nThe movie is all set to premier on Netflix on March 13th.\nTalking about prepping that it took for the film, Ben Affleck said, “It’s not just for the military but for a particular brand of service- the special operations, so we did some training with those guys, where they taught us their techniques, how they move and how they shoot, that was definitely the most interesting and the most challenging part of the role and we tried to do it very realistically.”\nBhavya Sadhwani/Indiatimes\nWithout giving away any spoilers, Charlie Hunnam said, “I won’t give anything away but there’s a sequence in the movie which involves swimming with the mules, with horses and it was sort of one of those things, sometimes as a director you need to be Machiavellian and by any means necessary ,get your actors to do what you need them to do.\nOur director JC needed two people to do the sequence, so he went to Ben first with the scene and he said - “NOPE”, then he went to Pedro and Oscar they also said no.\nBhavya Sadhwani/Indiatimes\nSo Garrett and I, like idiots, said yes to it and found ourselves swimming in olympic sized pools with mules and I can tell you this that mules can swim really fast.”\nBen Affleck gave an overview about the film, he said, \"It’s a couple of different films in one actually. On one level, it’s a very exciting action heist movie with a lot of cool stunts.\nBhavya Sadhwani/Indiatimes\nUnderneath that, it’s really a character story of these professional operatives of many many years, bonded together quite closely and who now take a mission that is outside of what they usually do and is morally questionable.\nUnderneath that, it's also a parable about war and military intervention. Therefore, there's something for everyone in this film.\"\nWe saw the special screening of the film and it won't be wrong to say that the audience is in for a treat!", "title": "Ben Affleck Perfectly Defines The Line Between Patriotism & War-Mongering & It's A Must Read For Everyone", "date_publish": "12/03/2019, 12:41:31", "description": "Triple Frontier is a movie based on five former special operatives who are now on a mission for their own selves, not the country. Starring some of Hollywood’s A-listers including Ben Affleck, Charlie Hunnam, Garrett Hedlund, Oscar Isaac and Pedro Pascal, this movie revolves around former war veterans undergoing a mission for their own selves after having served the country for over 17 years. Ind", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/ben-affleck-perfectly-defines-the-line-between-patriotism-war-mongering-it-s-a-must-read-for-everyone-363422.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ben_affleck_1552375032_800x420.jpg"}