{"text": "1. Not Khans, But Beyonce Stole The Thunder With Her Sizzling Dance Moves At Isha Ambani's Bash\nShe sang, she danced and she twerked and turned the event into one of the biggest musical nights!\n2. Vicky Donor Director Fell Off His Chair After Ayushmann Khurrana Told Him He’s Donated Sperms For Real\nBut did you know that he wasn’t the first choice for the role? Vivek Oberoi and Sharman Joshi were courted for the film but they refused for reasons unknown. And also, did you know that Ayushmann Khurrana has donated sperms in real life too? Well, he spilled the beans about this little secret on Karan Johar’s Koffee With Karan. He revealed that when he told director Shoojit Sircar about this, he “fell off his chair.”\n3. After Aquaman Breaks Wonder Woman's Box Office Record In China, Talks Of A Sequel Are On!\nDirected by James Wan, Aquaman is not only garnering good reviews from fans but also critics. So much so, that the movie has surpassed Gal Gadot starrer Wonder Woman’s opening collection at the box office, which means it has made more money in the opening weekend than that of the entire collection of Wonder Woman.\nDon't Miss 862 SHARES 322 SHARES 174 SHARES\n4. NASA Responds To Fans' Plea About Saving Tony Stark From Space & It Couldn’t Get Funnier!\nHe has been going without food and water for days and now his oxygen is also about to deplete. Fans were so angry at that, that they rang NASA for help. Bring him back to Earth, they exclaimed.\n5. 13 Times Sonali Bendre & Irrfan Khan Taught Us How To Live Life While Battling Cancer!\nYou might have planned every single thing about your life – from finances to your future kids – but cancer will always come unexpectedly. Change is the only constant. All you need to learn in life is to adapt to this change quickly. That’s what Irrfan Khan and Sonali Bendre did.", "title": "Beyonce Adds Spice To Ambani’s Bash, Ayushmann Donated Sperms In Real Life & More From Ent", "date_publish": "10/12/2018, 18:27:03", "description": "From Shah Rukh Khan, Aamir Khan and Salman Khan grooving at Isha Ambani and Anand Piramal’s pre-wedding festivities to Ayushmann Khurrana revealing about the time when he donated sperms in real life and told Vicky Donor director Shoojit Sircar about it, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/beyonce-adds-spice-to-ambani-s-bash-ayushmann-donated-sperms-in-real-life-more-from-ent-358306.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/beyonce_adds_spunk_to_ambanis_bash_ayushmann_donated_sperms_in_real_life__more_from_ent_1544446645_800x420.png"}