{"text": "Queen Bey is here in India. Yes, the Grammy-award winning singer Beyonce has arrived in the city of lakes. What for? Well, a private concert of course! Fans are going bonkers!\n2. After Paying Off Loans Of 1398 Farmers, Amitabh Bachchan Donates Rs 50 Lakh For Welfare Of Senior Citizens\n“It was a most moving experience for me and indeed all present during the KBC Karmveer programme that you honoured us with, some days back. Hearing you narrate your stories, was a most horrifying moment for all,” Bachchan said in a letter to NGO founder Ravi Kalra.\nDon't Miss 8.5 K SHARES 814 SHARES 555 SHARES 144 SHARES 1.7 K SHARES\n“In the last three-four days I have found out that I have fallen out of a magazine's list of rich people. I've become dearer on Twitter and poorer according to the (Forbes) survey. I just hope with this film (Zero) I become nearer! So dearer, poorer and nearer in one day! That's the life of a star,” he was quoted as saying by Khaleej Times.\n4. 9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale!\nThe end of Game of Thrones is inching closer with every passing day! The winter is finally coming and it’s bringing along an end to the most loved fantasy-drama show with it. The finale is going to be “spectacular, inspiring, satisfying,” as David Nutter said.\n5. 'Aquaman' Jason Momoa Says He Hasn't Worked Out In A Year & Fans Are Finding It Hard To Believe\nJason Momoa who has been gearing up for the release of Aquaman was interviewing with Entertainment Weekly, when his co-star Amber Heard revealed that he \"loves working out\". To which, Jason Momoa replied, “Absolutely f*****g not I love rock climbing, but I do not love working out. I haven't worked out in at least a year and it's been awesome.”", "title": "Beyonce Arrives In India, Amitabh Donates Rs 50 Lakh To NGO For Senior Citizens & More From Ent", "date_publish": "09/12/2018, 18:01:16", "description": "From Beyonce arriving in India for Isha Ambani and Anand Piramal’s wedding in udaipur for a personal concert to Amitabh Bachchan donating Rs 50 lakhs to an NGO for senior citizens, here is all that rocked the world of entertainment and Bollywood today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/beyonce-arrives-in-india-amitabh-donates-rs-50-lakh-to-ngo-for-senior-citizens-more-from-ent-358246.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/beyonce_arrives_in_india_amitabh_donates_rs_50_lakh_to_ngo_for_senior_citizens__more_from_ent_1544357512_800x420.png"}