{"text": "Beyonce Offers Free Tickets To Her Concerts For Life If Fans Go Vegan & Everyone Is Losing It\nBeyonce Offers Free Tickets To Her Concerts For Life If Fans Go Vegan & Everyone Is Losing It\nBeyonce hasn’t really done a concert in India for reasons unknown. However, last year, she came to India for private concert for Ambanis. The diva performed all her popular songs but fans went into a tizzy catching glimpses of the snippets being shared on social media.\nLooks like, in order to attend her concerts, you will have to fly abroad. But what if we tell you that she is offering free tickets to all her concerts for a lifetime? No, we are not kidding.\nBeyonce has just revealed that there’s a free chance for everyone to win free tickets for her concerts for life. But it’s not as simple as it sounds. There’s a catch.\nTwitter\nAll you have to do is give up meat and turn vegan.\nbillboard.com\nThis is actually a part of The Greenprint Project, which Beyonce and Jay Z are promoting. The Greenprint Project is dedicated to showing us all how eating just one plant-based meal a day can help the environment.\n“Our Greenprint is the positive impact we can have on the world by eating plant-based meals,” reads its website.\n“What is your Greenprint? Click the link in my bio for a chance to win tickets to any JAY and/or my shows for life,” wrote Beyonce in an Instagram post and fans are going bonkers since then.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nFans are all set. Take a look!\nIf Beyoncé & JAY-Z thinks i’m gonna eat their vegan shit for free tickets, they absolutely right. pic.twitter.com/BHf6REBKKU — BTK (@BTKTHERAPPER) January 30, 2019\nMe: I hate vegetables & healthy food.\nBeyonce: Free tickets for life if you become a vegan!!\nMe: #GreenPrintProject pic.twitter.com/joW1HbLGMN — Brett Butler (@br3tt_butler) January 31, 2019\nWait...Beyoncé giving out free tickets for life for going vegan?! pic.twitter.com/7CpzxW3nTY — Raincloud Anderson (@unprECEded) January 31, 2019\nme forcing myself to go vegan to win those free beyoncé tickets pic.twitter.com/rFOybqOrBo — alexis (@alexiswellss) January 31, 2019\nDid Beyonce just make me vegan pic.twitter.com/Y1omk8i3Nv — kat (@LilMissBoojiee) January 31, 2019\nI’m really considering going vegan for these Beyoncé tickets pic.twitter.com/laayBLRWS5 — Bri (@GayFentyy) January 31, 2019\nYou think Ima go vegan for Jay and/or Beyoncé tickets for life? YUHHH pic.twitter.com/eeI7Sl36pq — Melanin Monroe (@ScammbyJayde) January 31, 2019\nbeyonce really tryna make us go vegan i- let me go throw all the meat in my fridge pic.twitter.com/5GqXP9HVqF — iii. gucci green (@chuntargaryen) January 31, 2019\nBeyoncé wants us to go vegan & enter to win lifetime tickets to her and Jay’s shows.\nMe on Pinterest looking up vegan recipes: pic.twitter.com/0I8eAOSho6 — Susie B. (@FitBeautySuzy) January 31, 2019\nQueen Bey for life? Hell yeah!", "title": "Beyonce Offers Free Tickets To Her Concerts For Life If Fans Go Vegan & Everyone Is Losing It", "date_publish": "01/02/2019, 17:02:40", "description": "Beyonce has just revealed that there’s a free chance for everyone to win free tickets for her concerts for life. But it’s not as simple as it sounds. There’s a catch. All you have to do is give up meat and turn vegan. This is actually a part of The Greenprint Project, which Beyonce is promoting. The Greenprint Project is dedicated to showing us all how eating just one plant based meal a day can he", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/beyonce-offers-free-tickets-to-her-concerts-for-life-if-fans-go-vegan-everyone-is-losing-it-361424.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/beyonce_offers_free_tickets_to_her_concerts_for_life_if_fans_go_vegan__everyones_losing_it_1549017903_800x420.png"}