{"text": "There are some people who can never let go of a grudge against you and looks like Bhubaneshwar's Kalinga Sena follows this too.\nAccording to agency reports, local outfit Thursday threatened to throw ink at Bollywood star Shah Rukh Khan and show him the black flag when he visits Bhubaneshwar next week during the 2018 Men’s Hockey World Cup.\nAgencies\nThe report further claims that Hemant Rath, the chief of the outfit which calls itself Kalinga Sena, has demanded an apology from Khan for allegedly insulting Odisha and its people in his film Asoka that was made 17 years ago.\nPinterest\nThe outfit had also filed a complaint with the police here on November 1 alleging that Khan has hurt the sentiment of Odia people and dishonored the state’s culture by portraying the Kalinga war in a wrong manner. The Kalinga (historical name of Odisha) war was fought in 265 BC in which Emperor Ashoka defeated the Kalinga king and the kingdom was annexed to the Mauryan empire.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nThe war is considered one of the bloodiest battles and had prompted Asoka to embrace Buddhism.\n“We have made preparation to throw ink on the actor’s face and show him black flag at any place from the airport to the stadium. Our activists will remain present all along the road where Khan is likely to visit,” the press statement issued by Kalinga Sena general secretary Nihar Pani said.\nJust to jog your memory a little, Ashoka, which was released in 2001, could not run in the theatres in the state for more than seven days due to protests. Chief minister Naveen Patnaik has invited Khan, who is slated to be present at the Kalinga Stadium on November 27 during the inauguration of the Men’s Hockey World Cup.\nKalinga Sena even held a rally on November 11 and burnt SRK’s effigy as a mark of protest. A senior police officer said adequate security arrangements will be made for all the visiting VVIPs including Khan.\n(With PTI inputs)", "title": "Bhubaneswar Kalinga Sena Threatens To Throw Ink At SRK For Allegedly Distorting History In 'Asoka'", "date_publish": "24/11/2018, 11:16:28", "description": "Just to jog your memory a little, Ashoka, which was released in 2001, could not run in the theatres in the state for more than seven days due to protests. Chief minister Naveen Patnaik has invited Khan, who is slated to be present at the Kalinga Stadium on November 27 during the inauguration of the Men’s Hockey World Cup.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/bhubaneswar-kalinga-sena-threatens-to-throw-ink-at-srk-for-allegedly-distorting-history-in-asoka-357284.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shah_rukh_khan_1543038525_800x420.jpg"}