{"text": "Bhumi Pednekar And Rajkummar Rao Brew Up An Entertaining Cup Of 'Koffee' At KJo's Chat Show!\nBhumi Pednekar And Rajkummar Rao Brew Up An Entertaining Cup Of 'Koffee' At KJo's Chat Show!\nThe clouds of controversies might continue to hover over Karan Johar's chat show but one fact that can't be turned down is- it's one of India's most entertaining chat shows. The show is in its sixth season and even though there have been a few hits and misses with controversies, the upcoming episodes look quite promising.\nIn today's episode, KJo will brew another cup of piping hot Koffee with some gossip and anecdotes and two stars in the spotlight today would be Bhumi Pednekar and Rajkummar Rao. Known for their unconventional choice of roles and delivering some memorable performances, both actors will grace KJo's couch today.\nStar World India\nAs per videos of what's stored for us in tonight's episode, it looks like one hell of a ride. While Rajkummar Rao took to Twitter to share his thoughts about the episode, he wrote:\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I love coffee but this Koffee was special. Had a great time with the most wonderful Karan Johar and the brilliant Bhumi Pednekar on Koffee With Karan today.”\nBhumi too looked pretty pepped up about her debut on the show. She wrote,\n“Had a great cup of coffee today with my favorite Karan Johar and the brilliant Rajkummar Rao. Fun fun fun.”\nA lot of secrets will be unveiled and Pednekar, who started her journey as a casting assistant, reveals the names of stars who she had auditioned during her beginning days.\nStar India\nKJo would ask, “Have you auditioned any people who are actors today?” and she will spill the beans and reveal names like Disha Patani, Randeep Hooda, Kriti Sanon, Pareeniti Chopra and Ranveer Singh. Well, there is another name on the list and that's e Rajkummar Rao.\nPednekar went on to add how she applauded Parineeti Chopra when she was auditioning for Ladies vs Ricky Bahl.\nTalking about his choice of films, Rajkummar Rao added that for him, choosing film for a script is more important than money. He added that he has never chosen a film just for the sake of money.\nWell, just a few hours to go before we see all this madness! This one looks like one joyful ride that we wouldn't want to miss. Agree?", "title": "Bhumi Pednekar And Rajkummar Rao Brew Up An Entertaining Cup Of 'Koffee' At KJo's Chat Show!", "date_publish": "27/01/2019, 14:34:15", "description": "Talking about his choice of films, Rajkummar Rao added that for him, choosing film for a script is more important than money. He added that he has never chosen a film just for the sake of money. Well, just a few hours to go before we see all this madness! This one looks like one joyful ride that we wouldn't want to miss. Agree?", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/bhumi-pednekar-and-rajkummar-rao-brew-up-an-entertaining-cup-of-koffee-at-kjo-s-chat-show-361122.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/koffee_with_karan_1548582269_800x420.jpeg"}