{"text": "Big B Is Upset With The Industry For Not Acknowledging Badla's Success, SRK Gives A Witty Reply\nBig B Is Upset With The Industry For Not Acknowledging Badla's Success, SRK Gives A Witty Reply\nAmitabh Bachchan and Shah Rukh Khan just made our day with their hilarious banter. Their twitter chat is something everyone will relate to.\nBig B complained on twitter about keeping mum on Badla success to the producer of the film, Shah Rukh Khan. He mentioned how big Badla has become but there is not even a single appreciation post about the success.\nHe wrote, “. About time someone started talking about this silent success .. !! because neither the Producer, nor the distributor, nor the on line Producer, or any else in the Industry, in general .. has even spent a nano second to compliment the success of this film #Badla .. thk u”.\nBut as usual SRK had the wittiest reply on it, he wrote, “Sir hum toh wait kar rahein hain ki aap party kab de rahein hain hum sabko! We r waiting outside Jalsa every nite! “. Isn’t he just hilarious?\nDon't Miss 343 SHARES 555 SHARES 144 SHARES 263 SHARES\nTaking the conversation ahead, Amitabh Bachchan won the round with his comeback, he replied, ““oye .. फ़िल्म में काम हमने kiya , produce आपने किया , promotions में निस्वार्थ योगदान humne diya , अब party भी हम दें !!!??? .. outside Jalsa every night koi nahin aata !!”.\nClearly, their camaraderie is the best. Coming back to Badla, it was one of the best suspense thrillers Bollywood has seen. Amitabh and Taapsee Pannu have done a fabulous job and definitely deserve a party for being so amazing.", "title": "Big B Is Upset With The Industry For Not Acknowledging Badla's Success, SRK Gives A Witty Reply", "date_publish": "10/04/2019, 16:35:23", "description": "Amitabh Bachchan and Shah Rukh Khan just made our day with their hilarious banter. Their twitter chat is something everyone will relate. Big B just complained on twitter about keeping silence on Badla success to the producer of the film Shah Rukh Khan. He mentioned how big Badla has become but there is no single appreciation over the success. He wrote, “. About time someone started talking about t", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/bollywood/big-b-is-upset-with-the-industry-for-not-acknowledging-badla-s-success-srk-gives-a-witty-reply-365197.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/big_b_upset_with_srk_1554892354_800x420.jpg"}