{"text": "Bollywood superstars Amitabh Bachchan, Aamir Khan and Ranbir Kapoor united and featured in a tribute song dedicated to the 40 slain CRPF troopers who died in a terror attack in Pulwama, Jammu and Kashmir, in February.\n\"Commendable work has been done by Amitabh Bachchan, Aamir Khan and Ranbir Kapoor for the tribute song 'Tu Desh Mera' dedicated to the martyrs of Pulwama.\nWe would like to thank you all for showing your support towards the martyrs,\" read a post on the official Twitter account of Central Reserve Police Force.\nCommendable work has been done by @SrBachchan, @aamir_khan and #RanbirKapoor for the tribute song #TuDeshMera dedicated to the Martyrs of Pulwama.\nWe would like to thank you all for showing your support towards the Martyrs. pic.twitter.com/sw6MpDP05b — 🇮🇳CRPF🇮🇳 (@crpfindia) April 18, 2019\nIn images shared along with the post, the actors are dressed in white, sending out a message of peace.\nThe February 14 terror attack was widely condemned by the Indian film fraternity. Artistes and technicians representing 24 film associations had even held a two-hour protest against the incident, and doubled up as a warning to filmmakers against working with Pakistani talent or releasing their films in Pakistan.\nDon't Miss 837 SHARES 468 SHARES 2.1 K SHARES 247 SHARES 144 SHARES\nInputs From IANS", "title": "Big B, Aamir Khan And Ranbir Kapoor Unite To Pay A Musical Tribute To Pulwama Martyrs!", "date_publish": "19/04/2019, 16:18:39", "description": "The February 14 terror attack was widely condemned by the Indian film fraternity. Artistes and technicians representing 24 film associations had even held a two-hour protest against the incident, and doubled up as a warning to filmmakers against working with Pakistani talent or releasing their films in Pakistan.", "authors": [], "url": "https://www.indiatimes.com/entertainment/big-b-aamir-khan-and-ranbir-kapoor-unite-to-pay-a-musical-tribute-to-pulwama-martyrs-365763.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/big_b_aamir_ranbir_pay_tribute_to_pulwama_victims_characters_1555671046_800x420.jpg"}