{"text": "1. Amitabh Bachchan To Donate Rs 5 Lakh Each To Families Of 49 CRPF Martyrs Of Pulwama Attack\nConfirming the news, his spokesperson told IANS, “Yes, Mr Bachchan will be giving Rs 5 lakh to each of the martyr's families and is currently finding out the correct process to do so.”\n2. After His Comment On Pulwama Attack, Navjot Singh Sidhu Gets Sacked From The Kapil Sharma Show\n“For a handful of people, can you blame the entire nation and can you blame an individual?,” he had said adding, “It (the attack) is a cowardly act and I condemn it firmly. Violence is always condemnable and those who did it must be punished.”\n3. Just Like The Rest Of Us, Will Smith Can't Get Enough Of Ranveer, Is All Praises For Gully Boy!\n“Yo, Ranveer. Congrats Man. I’m loving what you’re doing with Gully Boy. For me, old school hip hop it is and I’ve seen hip hop all over the world and I’m loving it (Gully Boy) Man. Congrats, Go Get them!,” said Will Smith in the video. The Hollywood star had also shared the trailer of the movie on his Instagram story.\n4. To Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nThe entire nation including the Bollywood celebs have strongly condemned the ghastly terror attack. In order to pay tribute to the martyrs, Bollywood celebs have decided to observe February 17 as black day.\nAfter celebrating Valentine’s Day in Delhi, the much-loved celebrity couple, Virat Kohli and Anushka Sharma have returned to Mumbai. Engrossed in a conversation, Virushka, as they are fondly called, walked hand-in-hand as they were snapped at the airport.", "title": "Big B Donates Rs 5 Lakh To Martyrs, Navjot Singh Sidhu Sacked From TKSS & More From Ent", "date_publish": "16/02/2019, 17:54:22", "description": "Bollywood celebrities stand in solidarity with the families of the martyrs. Everyone is shaken and angry. Pulwama Terror Attack was the worst ever in Jammu and Kashmir since militancy erupted in 1989. At least 44 troopers were killed after a Jaish-e-Mohammed (JeM) suicide bomber rammed an explosives-laden vehicle into a CRPF bus.", "authors": [], "url": "https://www.indiatimes.com/entertainment/big-b-donates-rs-5-lakh-to-martyrs-navjot-singh-sidhu-sacked-from-tkss-more-from-ent-362283.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/big_b_donates_rs_5_lakh_to_martyrs_navjot_singh_sidhu_sacked_from_tkss__more_from_ent_1550319968_800x420.png"}