{"text": "Bigg Boss contestant Deepak Thakur is glad that the four months of the reality show finally came to an end. The Bihari singer was elated go back to his hometown after taking the prize money of Rs 20 lakhs.\nDeepak was in top five and eventually during the finale made it to top three. During the show, the host Salman Khan asked him if he wants to choose Rs 20 lakh over the trophy. Either ways, the one with maximum votes would bag the trophy.\nDeepak quit the game to take the money and lucky so, because he had the least amount of votes in comparison to Sreesanth and Dipika Kakar. He won many hearts with his honest nature and his sweet voice.\nDon't Miss 106 SHARES 5.1 K SHARES 2.1 K SHARES 3.9 K SHARES 468 SHARES\nAnd now, a video of him visiting his hometown has gone viral. Well, he's going to meet his folks not by car, flight or train but in a boat. That's right, Deepak went live on his social media account thanking his fans for showering so much love.\nBut what his followers noticed instead was that he travelled in a boat to reach his village. He can be heard saying in the video, “It feels very solid to come home after four months.”\nWell, the admiration for Deepak Thakur has only increased and people are glad he chose the prize money. The video so far gas garnered around 118,770 views.", "title": "Bigg Boss 12 Contestant Deepak Thakur Travels In A Boat To Visit His Village, Video Goes Viral", "date_publish": "03/01/2019, 17:38:15", "description": "Well, the admiration for Deepak Thakur has only increased and people are glad he chose the prize money. The video so far garnered around 118,770 views. But what his followers noticed instead was that he travelled in a boat to reach his village. He can be heard saying in the video, “It feels very solid to come home after four months.”", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/bigg-boss-12-contestant-deepak-thakur-travels-in-a-boat-to-visit-his-village-video-goes-viral-359788.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/deepak_1546514820_800x420.jpg"}