{"text": "It’s been over a month since the most-awaited reality show of the year premiered and I have officially given up. Before you go all judgmental on me and start a bitch fest, hear me out. No offence to the other shows, but do you really use your Television sets for non-netflix, Amazon and several other streaming channels programmes? No, right? Okay i know it’s lame but still, it’s fun to watch people fight over nonsensical issues which in turn makes us look hell lot of normal.\nTwitter\nAnyway, the point is that the ONE show that i would eagerly wait for the entire year, even that has failed me and how! It’s such a snoozefest that during last night’s episode, i got so fried that i switched the damn thing off and went back to my good ol' web series. Truth be told, i think even Salman Khan must be going through similar emotions. The only difference, however, is that the guy gets crores and crores of rupees to actually show up and be a part of this snoozefest.\nMoving on, as unwanted as it may sound, i decided to come up with 7 reasons as to why it’s time that we bid farewell to this show for good. 12 years and 12 seasons are enough. Even Big Brother UK got shut down after 19 seasons. Let’s take a look at why this season could be the end of the celebrated reality show.\n1. Dud contestants and poor content\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 12.5 K SHARES 5.5 K SHARES\nGiphy\nFirst and foremost, the channel/makers have failed to rope in interesting contestants\nIn the name of the celebrity club, all we got were 5 ‘celebs’ - Srishty Rode, Sreesanth, Dipika Kakkar, Neha Pendsee and Karanvir Bohra. In a twisted way, despite being a celeb himself, Bhajan king Anup Jalota has been put under the commoners category but that’s a discussion for some other day. From a super entertaining season of Dolly Bindra to an explosive season of Pooja Mishra, we have come to a season where all we see is Sreesanth crying and crying and then some more crying.\nTwitter\nIf all this wasn’t enough, even the commoners aren’t promising. The vakil - Romil once wanted to try his hand at roadies and even gave an audition. The farmer - Saurabh is a casting agent IRL and made up a sob story to stand out and go further in the game. Ahem! Look where it took him - straight out of the house.\n2. Redundant tasks and repetitive performances\nGiphy\nThe tasks have become so redundant that even the one where two teams torture each other by throwing weird stuff on each other’s faces is not interesting anymore. Well, spinning 12 seasons can be very exhausting creativity wise. We get it, but how can you expect us to be entertained with the same thing over and over and over again? As if lousy contestants weren’t enough, we have to endure the same tasks every season too. It this isn't double whammy then i don't know what is.\n3. Lackluster performances by celebrities and commoners alike.\ngfycat.com\nFirst things first, i appreciate Karanvir Bohra’s humility and honesty, but please don’t be the ‘Daani Karn’, it’s a reality show for crying out loud not a charity game. In a quest to look good and maintain their image, the celebs, in particular, are not showing their real side. And on the other hand, the commoners are trying too hard to be seen and notice. Case in point - Deepak Thakur and Surbhi Rana. It’s such a confused mix this time and one cannot help but sleep with open eyes while watching the show.\n4. Fake relationships are so passe. We need originality!\ncolors\nOver the seasons, one sure shot formula to stay longer in the Bigg Boss house is to be in a relationship. Love is always a big sellout. Don’t we all dig the jodis that are formed inside the house? Our silly little brains, despite knowing the fact that it’s all a fallacy, still want to believe that the love blossoming inside the house is for the keeps. Well, forming pairs inside was one thing but this season’s lovesick couple definitely falls under the category of overkill.\nreactiongifs.me\nNot only does it sound unbelievable in theory, the execution is shoddy. If you’re still wondering who is the couple in question, it’s none other than Jasleen Matharu and Anup Jalota\n5. Sreesanth - no explanation needed.\nMy fellow twitter folks are in full agreement.\nBhaji ko ek Thapar nahi Sreesanth ko dus Thapar Marne chaye the — Mahesh (@khatwani24m) October 16, 2018\nSahi Thapar maara that bhaji ne diaper baby Sreesanth Ko😜least deserving candidate. Boring #BiggBoss12 — sukhmeet (@sukh8457) October 15, 2018\nToday I got answer why bhaji @harbhajan_singh rightly Slapped Sreesanth ,planning physical attack on Deepak.\nNo respect for women\nLost all respect @DeepakThakurFC @isalilsand #EvictShivashish — Lubna Lah 💎🎙 (@Lubna_Lah) October 9, 2018\nThe most flaky contestant this season has to be Sreesanth. The man’s middle name is eccentric. He cries over anything and everything. Call him emotional - and the waterworks begin. Call him mentally strong and he’ll again burst into tears for being called insensitive. There’s no way a normal person can reason with Sreesanth. As if this wasn’t enough the man holds a record of trying to quit the show thrice in one week. Five weeks on, the audience has lost count.\ncolors\nEarlier, it used to be entertaining but now it has become super-annoying. Turns out the man realised the same himself and couple of days ago, he confessed that giving empty threats to quit is a part of his strategy. Slow claps? Not.\n6. Bheja Fry wild card contestants\nGif finder\nAs if the initial contestants weren’t enough, even the wild card entries this year are enough to push you from the edge. More like push you down from the terrace. There used to be a time when people like Sky Walker AKA Akashdeep Saigal, Sunny Leone and Nora Fatehi among others were the game-changer wild cards but this season all we got was Surbhi Rana, who mind you, is trying way too hard to be the vamp of this season.\ntwitter\nHowever, she is failing miserably in doing so. She yells, acts crazy, cries and then fades away in the background. If this wasn’t enough, we were introduced to two other contestants who entered this week - Rohit Suchanti and Bigg Boss Marathi winner Megha Dhade. By the looks of it, i doubt if they’ll even be able to make the game interesting if anything else.\n7. Even Salman bhai looks bored to death\ncolors\nLove, hate him, make fun of him, criticise him etc etc but the main attraction of this show is definitely Salman Khan. In the past, the Weekend Ka Vaar episodes were something that every BB fan used to look forward too. Alas, that’s not the case anymore. I am no body language expert but as a viewer, it’s not difficult to make out that even he looks bored. His interaction with the contestants look forced and he hardly indulges in a fun banter with any one of them.\ntenor\nAs a whole this year, the energy of the show is almost non-existent. If only they could take advantage of the prime time slot of 9 PM given to them. I’m sure people would rather watch an over dramatic soap over this one to get their dose of entertainment from the small screen.\nGoing by this drag of a season, either the makers have to up their game or make a graceful stop to it. After all, it’s important for shows to end on a high note for people to remember it fondly for years to come.", "title": "Bigg Boss Season 12 Is So Drab That Even Bhai Looks Bored To Death, Time To Shut This Show Down", "date_publish": "24/10/2018, 14:10:46", "description": "It’s been over a month since the most-awaited reality show of the year premiered and i have officially given up. Before you go all judgemental on me and start a bitch fest, hear me out. No offence to the other shows, but do you really use your Television sets for non-netflix, Amazon and several other streaming channels programmes? No, right? Okay i know it’s lame but still, it’s fun to watch peopl", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/bigg-boss-season-12-is-so-drab-that-even-bhai-looks-bored-to-death-time-to-shut-this-show-down-355350.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bigg_boss_12_1540372752_800x420.jpg"}