{"text": "Sreesanth is one of the most aggressive contestants on Bigg Boss 12. He has often wanted to quit the show, but gradually, it seems, he is understanding the game and is showing the willingness to play it too. In last night’s episode, he was eliminated only to be kept in a secret room with Anup Jalota. He'll be back in the house soon.\ni0.wp.com\nIf rumours are to be believed, Sreesanth has dated quite a few known names in the past including Sanjana, Daisy Bopanna, Surveen Chawla and Shahzahn Padamse among others. However, now he is now a married man. He is happily married to Bhuvaneshwari, who he misses a lot while his time on the show.\nOne of Sreesanth’s former girlfriends and actress Nikesha Patel has recently revealed that he was in a live-in with her while he was dating Bhuvaneshwari, his now wife, who was his girlfriend then.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I've not met Sreesanth after the break-up, but I have been watching him on Bigg Boss. Sreesanth claimed on national television that he was in love with Bhuvneshwari for seven years before he got married to her. This makes me wonder, why was he in a live-in relationship with me for over a year around that time,” Nikesha told Bangalore Times.\nThe actress also claimed that Sreesanth broke off with her without giving her a closure and that she has many unanswered questions. She also said that he is not as “mahaan” as he pretends to be on the show.", "title": "Bigg Boss 12 Contestant Sreesanth’s Ex-Girlfriend Hints He Was Two-Timing His Wife Before Their Wedding", "date_publish": "11/10/2018, 18:46:47", "description": "Sreesanth is one of the most aggressive contestants on Bigg Boss 12. One of Sreesanth’s former girlfriends and actress Nikesha Patel has recently revealed that he was in a live-in with her while he was dating Bhuvaneshwari, his now wife who was his girlfriend then.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bigg-boss-12-contestant-sreesanth-s-ex-girlfriend-hints-he-was-two-timing-his-wife-before-their-wedding-354631.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sreesanths_exgirlfriend_hints_he_was_twotiming_with_his_wife_before_his_wedding_1539263850_800x420.png"}