{"text": "Hollywood copied Bollywood?!\nThis year's Academy Awards have finally been concluded and people have a lot of things to talk about. From Rami Malek’s win and fall post win, Lady Gaga and Bradley Cooper’s scintillating performance to red carpet looks, a lot went down at Oscars 2019.\ne! news\nAmid all this, one person who stood out the most was Billy Porter, the American stage performer brewed up a storm at the red carpet when he strutted around the Dolby Theatre in a tux-gown. Yes, you read that right! The singer looked dapper in a tux but it wasn’t a conventional one in any sense. The tux had a full skirt which had a personality of its own, mind you.\nagencies\nNow, once the hoo-haa subsided, many people (Indians, to be specific) started saying the same thing. Billy Porter might have worn the Tux-Gown but it was our homeboy Ranveer Singh who introduced this trend. Yes, it was Singh who started this fad of wearing a skirt under a jacket. It was during the promotions of his period drama Bajirao Mastani in 2015, that he started wearing skirts.\nDon't Miss 185 SHARES 544 SHARES 263 SHARES 411 SHARES\nSo much so, that right before his wedding people made the same joke - What if Ranveer and Deepika wore the same lehenga for their ceremony?\ntwitter\nNow, it’s not just us but the internet is in full agreement to this fact and we do believe that due credit must be given to our Gully Boy.\nActually Ranveer singh billy porter ka mask pahenke gaya tha!!! https://t.co/frPr6cVHCv — Bhaskar Goswami (@Bhaskar247) February 25, 2019\nRanveer Singh's Hollywood fashion soulmate is Billy Porter, and we have enough proof — Bizma Gul (@BismaaGul) February 25, 2019\nWhat Billy Porter did today, our man Ranveer Singh did years back ! #Oscars pic.twitter.com/rynuBF5bFt — Angel (@rowdybabyno1) February 25, 2019\nSpread the word, folks! Singh trumps Porter. Period.", "title": "Billy Porter Wore Tux-Gown At Oscars But Our Gully Boy Ranveer Started This Trend 3 Years Back!", "date_publish": "26/02/2019, 13:52:04", "description": "Billy Porter Wore Tux Gown At Oscars But Our Man Ranveer Singh Introduced This Trend Years Back This years Academy Awards have finally been concluded and people have a lot of things to talk about. From Rami Malek’s win and fall post win, Lady Gaga and Bradley Cooper’s scintillating performance to red carpet looks, a lot went down at Oscars 2019. Amid all this, one person who stood out the most wa", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/celebs/billy-porter-wore-tux-gown-at-oscars-but-our-gully-boy-ranveer-started-this-trend-3-years-back-362816.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1551169580_800x420.jpg"}