{"text": "On April 25, 2018, Bapuji AKA self-style godman Asaram was convicted of raping a 16-year-old girl (hailing from from Shahjahanpur in Uttar Pradesh) who was studying at his ashram in Madhya Pradesh. But what was shocking was that for his devotees, he as still as innocent as a lamb.\nBCCL\nFor the longest time his massive bhakts thought the spiritual Guru was wrongly convicted, but more cases and instances came into the limelight, and it was hard to ignore them.\nBCCL\nNow, a biopic based on the novel God of Sin: The Cult, Clout and Downfall of Asaram Bapu, Asaram Bapu’s journey to spiritual godhood, his massive fan following, downfall and rape conviction is in the works.\nTOI\nProducer Sunil Bohra, who has bankrolled projects like Gangs of Wasseypur and Tanu Weds Manu among others, has bought the rights of the Ushinor Majumdar’s novel, according to a TOI report.\nBCCL\nDon't Miss 727 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nConfirming the news, he told the publication, “I read the book and was taken in by lawyer PC Solanki who fought the case for the victims against Asaram Bapu for free. The two lady police officers — one from Jodhpur and the other from Surat — are inspiring, too. In my eyes, they are the real heroes. We will focus on these people and the rest will be based on facts. I bought the rights of the book last month. I have started meeting writers and shall lock the team soon. I want the movie to have an international appeal. The cast will be decided once the script is ready.”\nAlso Read: Jailed Godman Asaram's Son Narayan Sai Convicted For Raping His Father's Disciple", "title": "Biopic On Rape Convict Godman Asaram Bapu Is On Cards, Gangs Of Wasseypur Producer Buys Rights", "date_publish": "30/04/2019, 11:29:04", "description": "Now, a biopic based on the novel God of Sin: The Cult, Clout and Downfall of Asaram Bapu, Asaram Bapu’s journey to spiritual godhood, his massive fan following, downfall and rape conviction is in the works. Producer Sunil Bohra, who has bankrolled projects like Gangs of Wasseypur and Tanu Weds Manu among others, has bought the rights of the Ushinor Majumdar’s novel, according to a TOI report.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/biopic-on-rape-convict-godman-asaram-bapu-is-on-cards-gangs-of-wasseypur-producer-buys-rights-366313.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/asaram_bapu_biopic_1556604148_800x420.jpg"}