{"text": "Best known for his roles in Ek Phool Do Mali and Abdullah, veteran actor Sanjay Khan’s stint in Bollywood has been a mix of ups and downs. Once referred as the poster boy of B-Town, Khan’s recently published autobiography - The Best Mistakes Of My Life candidly portrays his formative years, relationships with co-stars and family, drama and controversies that surrounded him and how he had overcome all of that with utmost courage and grace.\nA survivor in his own right, Khan also pens down the major fire accident on the sets of Tipu Sultan and the helicopter crash of 2003 that changed his outlook towards life. The Best Mistakes Of My Life mirrors a story of a great star, a loving husband, a doting father and a loyal friend who never backed out from any battle that life threw at him. But before you give this heartwarming book a read, take a look at these rare photos of Sanjay Khan that define his life and the man he is.\nThe One With Raj Kapoor\nIt's not an unknown fact that Sanjay Khan thinks very highly of Raj Kapoor. In fact, in his book - The Best Mistakes Of My Life, Khan dedicates a chapter to the veteran actor and shows how films like Awara has shaped the very meaning of Bollywood. This photo marks Khan's first meeting with Raj Kapoor. He was 17 and this meeting brought him closer to his dream of becoming a part of the tinsel town.\nDon't Miss 3.5 K SHARES 832 SHARES\nThe One With Sunil Dutt\nIn 1984, Sunil Dutt was nominated for the north-west parliamentary constituency in Bandra for Indian National Congress. Sanjay Khan decided to show his support to the party and Dutt.\nThe Fire Accident\nOn February 8 1989, a major fire broke on the sets of The Sword Of Tipu Sultan in the Premier Studios of Mysore. In his autobiography, he remembers the painful time (during the fire) when he gave his Rolex watch to an assistant director and requested him to call Zarine (Khan's wife) to tell her that he was okay. He blacked out immediately after that. Later it was found out that Khan suffered third degree burns and had to undergo 73 surgeries.\nThe One From The Wedding Day\nSanjay and Zarine Khan's love story has seen its fair share of struggles and good times. But on their special day, when Khan welcomed several guests from the film fraternity, he knew in his heart that they were accepted. Khan was quite ecstatic to see superstars like Raj Kapoor, Shammi Kapoor, Nargis, Saira Banu, Meena Kumari, Kamal Amrohi and Sara Singh join the celebrations as the new couple embark on an adventurous journey.\nThe Helicopter Incident\nIn 2003, Sanjay Khan and Vijay Mallya were travelling by helicopter to Balkhot, Karnataka to address a political rally. As they were approaching their destination, Khan heard a horrific sound and the helicopter nosedived towards the ground. The tail broke off and it was impossible for the pilot to control the chopper. At that point, all Khan remembers Mallya shouting at him, ‘Sanjay bhai, we are going down!’ Call it fate but he and the crew miraculously survived the crash with minor injuries.\nThe Khan Family Portrait\nSanjay Khan has always been a big family man. He is married to Zarine Khan and have three daughters and a son - Farah Ali Khan, Simone Arora, Sussanne Khan and Zayed Khan.", "title": "Blast From The Past: 6 Rare Photos That Define Sanjay Khan’s Life", "date_publish": "09/11/2018, 12:00:54", "description": "The Best Mistakes Of My Life - autobiography by veteran actor Sanjay Khan candidly portrays his formative years, relationships with co-stars and family, drama and controversies that surrounded him and how he had overcome all of that with utmost courage and grace", "authors": ["Sneha Dey"], "url": "https://www.indiatimes.com/entertainment/bollywood/blast-from-the-past-6-rare-photos-that-define-sanjay-khan-s-life-356307.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/the_best_mistakes_of_my_life_1541743944_800x420.jpeg"}