{"text": "An actor known for his contribution to Hindi Cinema as a notable villain was found dead at his Mumbai home. Mahesh Anand, 57, was found in his Andheri flat here on Saturday morning, police said.\nLiving alone for many years and virtually jobless, he is suspected to have died at least two days ago, and the decomposed body has been sent for autopsy to the Cooper Hospital to ascertain the time and cause of death.\nA popular actor in the late 1980s and 1990s, known for his tall and tough body frame, he was usually seen as the main henchman of the villains in several films, but was facing huge financial constraints for many years.\nAnand acted with top actors such as Amitabh Bachchan, Govinda, Sanjay Dutt, in major films like 'Ganga Jamuna Saraswati' and 'Shahenshah' (1988), 'Majboor' (1989), 'Thanedaar' (1990), 'Betaaj Badshah' (1994), 'Coolie No. 1' (1995), 'Vijeta' (1996), 'Lal Badshah,' 'Aaya Toofan' (1999), 'Baaghi' and 'Kurukshetra\" (2000), 'Pyaar Kiya Nahin Jaata' (2003).\nAfter a long gap of over 15 years, he was recently seen in Pahlaj Nihalani's 'Rangeela Rajaa' with Govinda, released in January this year.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe Versova Police have registered a case of accidental death and informed Anand's sister who lives in Mumbai, an official said.", "title": "Bollywood Villain Mahesh Anand Found Dead In Mumbai Home, Body Was Totally Decomposed", "date_publish": "10/02/2019, 12:28:14", "description": "Mahesh Anand, 57, was found in his Andheri flat here on Saturday morning, police said. Living alone for many years and virtually jobless, he is suspected to have died at least two days ago, and the decomposed body has been sent for autopsy to the Cooper Hospital to ascertain the time and cause of death.", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood-villain-mahesh-anand-found-dead-in-mumbai-home-body-was-totally-decomposed-361877.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/mahesh_anand_1549782085_800x420.jpg"}