{"text": "It was Valentines Day, the day of love. Who knew it will be turned into a day of bloodshed and violence.\nAnger and outrage filled India yesterday when an SUV carrying more than 350kgs of explosives was rammed into a convoy in Jammu & Kashmir that had more than 40 jawans. It was the deadliest of all attacks in last two decades.\ntimesnownews.com\nClaiming the responsibility for the brutal act was Pakistan-based Jaish-e-Mohammed (JeM) terror group. The car that rammed a CRPF bus was driven by terrorist Aadil Ahmad AKA Adil Ahmad Gaadi Takranewala AKA Waqas Commando of Gundibagh.\nRight before the deadly attack, he said in a video that surfaced later on, “My name is Adil, I joined the Jaish e Mohammad a year ago. After a year's wait, I have got the chance to do what I joined the Jaish for... By the time this video reaches you, I will be in heaven... this is my last message for the people of Kashmir.”\n40 CRPF Men Killed In Blast In Kashmir's Pulwama, Worst Attack In Decades\nIED blast: Terrorist group Jaish-e-Mohammed has claimed responsibility for the Pulwama terrorist attack today. pic.twitter.com/YrYgzy14FY — Jagdish Chauhan (@Jagdish965148) February 14, 2019\nDon't Miss 837 SHARES 862 SHARES 4.3 K SHARES\nOn the day when everyone celebrated love, more than 44 families lost their loved ones. The pain was unbearable. The tears were unstoppable. The entire nation was heartbroken yet angry yesterday, including the Bollywood celebs who condemned the terror attack.\n#Pulwama Who are these people who are celebrating a win after this dastardly and cowardly attack..is just condemning this enough..wipe out not just their smiles but their faces.. show us our revenge, instill dismay and dread with the retaliation.🇮🇳 — Ranganathan Madhavan (@ActorMadhavan) February 14, 2019\nNumb beyond belief at the dastardly terror attack on #CRPF soldiers in #Pulwama. May God give peace to their souls, and strength to their grieving families. Wishing the injured a speedy recovery. We can’t let this be forgotten. — Akshay Kumar (@akshaykumar) February 14, 2019\nThe Pulwama attack is despicable. My heartfelt condolences to the families of the martyrs. I pray for the recovery of the injured. — Alia Bhatt (@aliaa08) February 14, 2019\nAbsolutely shocked by the attack in #Pulwama...Hate is NEVER the answer!!! Strength to the families of the martyred jawans and the CRPF soldiers injured in the attack. — PRIYANKA (@priyankachopra) February 14, 2019\nShameful shocking reprehensible . Absolute act of cowardice. Perpetrators of this heinous crime cannot be be friends with people of Kashmir. We stand by the bereaved families. — Rishi Kapoor (@chintskap) February 14, 2019\nMy heart goes out for the Jawans of our beloved country and their families who lost their lives as martyrs to save our families... #YouStandForIndia — Salman Khan (@BeingSalmanKhan) February 14, 2019\nSuch terrible news coming from #Pulwama. Today when people are celebrating love, hate raises it’s ugly head too. My thoughts and prayers for the martyrs and their families. — Abhishek Bachchan (@juniorbachchan) February 14, 2019\nThe #PulwamaTerrorAttack is a cowardly attack on our soldiers. Heart goes out to our heroes saving our country who have to face an enemy who will hide and attack. — Varun Dhawan (@Varun_dvn) February 14, 2019\nWhat a deeply sad and dark day... Shocked and pained by the dastardly attack on our CRPF convoy. My heart is with the families of our jawans... my deepest condolences 🙏🏻 #PulawamaTerrorAttack — Dia Mirza (@deespeak) February 14, 2019\nHeartbreaking & devastatingly shocking. To resort to such measures & kill people. Praying for the families of our hero soldiers who lost their lives #PulwamaAttack — Shraddha (@ShraddhaKapoor) February 14, 2019\nWhat a dark dark day.. Can’t stop thinking of the mindless violence, evil hate & sinister politics that has killed 40 working class bravehearts today.. Thinking of their bereaved families. May they find the strength to deal with this cruel tragedy. Prayers. #PulawamaTerrorAttack https://t.co/CAvjFIL2jt — Swara Bhasker (@ReallySwara) February 14, 2019\nJust learnt of the horrific and cowardly terror attack in Pulwama. Disgusted and saddened.\nUnited in grief with families of the CRPF jawans who lost their lives. My deepest condolences to them. — Farhan Akhtar (@FarOutAkhtar) February 14, 2019", "title": "Bollywood Celebs Condemn Pulwama Terror Attack That Claimed The Lives Of Atleast 44 CRPF Jawans", "date_publish": "15/02/2019, 11:44:06", "description": "Anger and outrage filled India yesterday when an SUV carrying more than 350kgs of explosives was rammed into a convoy in Jammu & Kashmir that had more than 40 jawans. It was the deadliest of all attacks in last two decades. The entire nation was heartbroken yet angry yesterday, including the Bollywood celebs who condemned the terror attack.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood/bollywood-celebs-condemn-pulwama-terror-attack-that-claimed-the-lives-of-atleast-44-crpf-jawans-362197.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/we_cant_let_this_be_forgotten_bollywood_expresses_anger_over_pulwama_terror_attack_1550210137_800x420.png"}