{"text": "Ayushmann Khurrana's wife Tahira Kashyap shared the heartbreaking news of being diagnosed with Stage1A breast cancer last year.\nWhile this was something they may have never imagined but that hasn't deterred or stopped Tahira from chasing her dreams or leading a normal life.\nTahira is an inspiration in the true sense and we have yet another example. Just one day ago, she shared a picture of her shaved head and she shared a strong message about self-love.\nShe wrote,\nDon't Miss 122 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"That’s a new me with the old self! Was getting tired of the extensions, so this is how it is and it’s so liberating in every sense of the word, so much so that I don’t have to duck the shower while bathing or while picking up the soap! I never thought I had go bald, was stretching my time with the good ol’ cap for too long. But this feels so good\"\nThat's not all. Like a doting husband that he is, Ayushmann had the sweetest thing to say about Tahira's post about shaving her head and self-love.\nThat's not all. Ayushmann's friends from the film fraternity showered love and deemed her as an inspiration.\nSo inspiring are you @tahira_k 🤗🤗 much love 💚 — sonalikulkarni (@sonalikulkarni) January 16, 2019", "title": "Bollywood Showers Love And Extends Support To Ayushmann's Wife Tahira Amidst Cancer Treatment", "date_publish": "17/01/2019, 11:40:31", "description": "Ayushmann Khurrana's wife Tahira Kashyap shared the heartbreaking news of being diagnosed with Stage1A breast cancer last year. While this was not something they had may have never imagined but that hasn't deterred or stopped Tahira from chasing her dreams or leading a normal life.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/bollywood-showers-love-and-extend-support-to-ayushmann-s-wife-tahira-amidst-cancer-treatment-360553.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/tahira_1547705947_800x420.jpg"}