{"text": "For the uninitiated, Ashvin Kumar is Bollywood’s youngest Oscar-nominated and two times national award winning director. He was nominated at the Academy Awards for his shot film titled Little Terrorist in 2004. However, for his next film titled No Fathers In Kashmir, which is a coming-of-age love story revolving around two teenagers who lost their father after they were picked up by the armed forces, he is facing the wrath of the censor board.\nTwitter\nNo Fathers In Kashmir had earlier been denied a U certificate. Ashvin Kumar said that movie didn’t have any nude or vulgar scenes, and hence, he took his fight forward to FCAT and appealed against the fact it got an A certificate. However, he is juggling between the demands of the two bodies, which are reportedly ordering fresh cuts.\nTwitter\nAmid all this, Bollywood celebs including Swara Bhaskar and Soni Razdan, who is also a part of the film, lashed out at CBFC.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe film 'No Fathers in Kashmir' - Directed by Academy Award Nominee & two time National Award Winner #AshvinKumar - has been stuck with the Censor Board for over 6months now, delaying its release. Film is now gng bak & forth betwn #CBFC & FCAT. @prasoonjoshi_ pls take note! — Swara Bhasker (@ReallySwara) January 12, 2019\nAshvin Kumar’s film #NoFathersinKashmir is facing CBFC problems. It’s stuck for months and despite FCAT orders he is not being given a hearing. The man is a fine film maker, an Oscar nominee in the past, and someone needs to help him. @prasoonjoshi_ Will you please? — Pritish Nandy (@PritishNandy) December 29, 2018\nOscar nominee & 2-time National Award winner @ashvinkumar’s new film @nofathers_movie #NoFathersInKashmir (tipped as 1 of 10 eagerly awaited films of 2019) remains banned over 6 months, delaying its release & forfeiting application for NationalAwards this year. Unconscionable! — Shashi Tharoor (@ShashiTharoor) January 10, 2019\nAshvin @ashvinkumar knows Kashmir so well. That’s the first thing I thought when I read this script. And that’s exactly why I so wanted to be a part of this project. For once I felt that here is a film that doesn’t pretend ... doesn’t mislead ... and most importantly doesn’t lie. pic.twitter.com/nYeIOMIFXg — Soni Razdan (@Soni_Razdan) January 16, 2019\n2/3 It does so gently, with a lot of ironies, with tongue in cheek humour and a wonderful story full of courageous, innocent and sometimes foolish characters. No one is demonised. @prasoonjoshi_ @PritishNandy @ashvinkumar @ShashiTharoor @MaheshNBhatt — Soni Razdan (@Soni_Razdan) January 16, 2019\n3/3 But everyone is real and human and so we feel that finally we are perhaps getting to know this wonderful place called Kashmir just a little bit better. Whoever sits on this board I do implore you to give truth and integrity a chance @prasoonjoshi_ @PritishNandy @ashvinkumar — Soni Razdan (@Soni_Razdan) January 16, 2019\nNo Fathers In Kashmir also stars Kulbhushan Kharbanda in a prominent role.", "title": "Bollywood Celebs Lash Out At CBFC For Delaying Oscar-Nominated Director Ashvin Kumar’s Film", "date_publish": "16/01/2019, 17:12:21", "description": "For the uninitiated, Ashvin Kumar is Bollywood’s youngest Oscar-nominated and two times national award winning director. He was nominated at the Academy Awards for his shot film titled Little Terrorist in 2004. However, for his next film titled No Fathers In Kashmir, which is a coming-of-age love story revolving around two teenagers who lost their father after they were picked up by the armed forc", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood-celebs-lash-out-at-cbfc-for-delaying-oscar-nominated-director-ashvin-kumar-s-film-360528.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_celebs_lash_out_at_cbfc_for_delaying_oscarnominated_director_ashvin_kumars_film_1547639009_800x420.png"}