{"text": "In the wake of the attack, Ajay Devgn took to Twitter to announce that his upcoming film ‘Total Dhamaal’ the team has unanimously decided that they will not be releasing the film in Pakistan. Directed by Indra Kumar, ‘Total Dhamaal’, the film is all set to hit the theaters on February 22.\nNow, according to a report in Hindustan Times, Akshay Kumar has vowed to donate ₹5 crore through Bharat Ke Veer — a fundraising initiative of the Union Ministry of Home Affairs.\nKaushal said, \"It is a great loss of human lives. If in any possible way, we can support the family of martyrs, it would be a great contribution from our end, as a society. The whole incident should not be forgiven and forgotten.\"\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nCondemning the attack, she said, \"I think people over here shouldn't show off that they really care for the nation. If they want to express their grief, then they should spend their time with the martyrs' families. I have also been associated with them in my constituency. There are many boys in my Mathura constituency who are sons of farmers, but they have sacrificed their lives for the country, so I know what their families go through in such scenarios. People should contribute financially towards their families instead of creating havoc here. What will they get by doing all this nonsense?\"\nRecently, Courteney Cox took to social media and posted a photograph with Jennifer Aniston and the fans had a mini deja-vu! The internet couldn't handle the Monica-Rachel PDA and they dropped some really adorable lovey-dovey comments on their bond! To take you to a nostalgia trip, here are the deets on some of the major reunions of the cast!", "title": "Bollywood Extends Support To The Families Of Pulwama Martyrs And More From Ent World", "date_publish": "18/02/2019, 18:28:21", "description": "In the wake of the attack, Ajay Devgn took to Twitter to announce that his upcoming film ‘Total Dhamaal’ the team has unanimously decided that they will not be releasing the film in Pakistan. Directed by Indra Kumar, ‘Total Dhamaal’, the film is all set to hit the theaters on February 22.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/bollywood-extends-support-to-the-families-of-pulwama-martyrs-and-more-from-ent-world-362373.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/entertainment_stories_1550494802_800x420.jpg"}