{"text": "Bollywood Scriptwriters Were The True Stars Of 2018 And Here's Why They Should Get Their Due\nBollywood Scriptwriters Were The True Stars Of 2018 And Here's Why They Should Get Their Due\nContent is king, not the Khans!\nShah Rukh Khan’s Zero, Aamir Khan’s Thugs Of Hindostan and Ayushmann Khurrana’s Badhaai Ho – that’s how we have been addressing the Bollywood films for the longest time. The directors get applauded, actors are hailed as star-performers, and but what about script-writers? The people who sit down to write such amazing thought-provoking masterpieces – do they ever get their dues?\nWhen the trailer of Helicopter Ela starring Kajol was released, renowned screenwriter Varun Grover was quick to point out the issue that is mostly brushed under the carpet. The makers gave credit to everyone excepting the lyrics writers including Swanand Kirkire.\nThis new film's trailer is cut mostly on songs. They have credited everybody in the title-plate at the end EXCEPT the lyrics writer(s) (including Swanand Kirkire). All you need to know how dispensable they think we are. Shameful. pic.twitter.com/2USiQP1Iix — वरुण (@varungrover) August 5, 2018\nAmid all the glitz and glamour, stardom and frenzy, writers have often taken the backseat. You sure know that Ayushmann Khurrana gave a stellar performance in the role of a visually impaired musician in AndhaDhun. You might as well know that the man who directed the best movie of 2018 (according to IMDb) is Sriram Raghavan. But do you who came up with this amazing script that had so many twists and turns that made it a treat to watch on screen?\nSriram Raghavan, Arijit Biswas, Pooja Ladha Surti, Yogesh Chandekar and Hemanth Rao – these are the names who wrote the beautiful movie.\nAnd this has been happening for a very long time. From Javed-Salim to Gulzar, the gratitude to the writers has been missing since a very long time. We all rave about the epic cult classic that Mughal-e-azam was, but do we know who wrote the movie? Wajahat Mirza has written several classics including Ganga Jamuna, Mughal-E-Azam, Leader, Shatranj. Or have you even heard of Sachin Bhowmick, the man who gave Bollywood films such as An Evening in Paris, Karan Arjun, Koi Mil Gaya, Krrish and Kisna? Khwaja Ahmad Abbas, Pt. Mukhram Sharma, Gulshan Nanda, Akhtar Mirza, Ismat Chugtai and Prayag Raj are some other notable scriptwriters that Bollywood has ever had.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nTwitter\nWriters aren’t a new addition to this industry. They have been in the business for the longest time, but they barely got any recognition, praise or attention that they rightfully deserve.\nWhat is the most important part of the movie? The lead actor, you say? But the time has gone when the presence of a mere star in the movie would ensure a blockbuster. That’s what happened with the Khans this year. Race 3 received the worst-ever reviews, Thugs of Hindostan failed miserably at the box office and Zero was a flop too. Movies led by Khans fell flat at the box office.\nTwitter\nAre actors the deciding factor for a film's success? Vidhu Vinod Chopra says that Dangal would have been a hit despite Aamir Khan presence in it. He, of course, rubbed Mr. Perfectionist the wrong way by saying so.\n“If the film had Hrithik Roshan in it, even then it would have worked. But if it was a bad film, it wouldn’t have worked,’\" he had said at Aamir Khan's success bash for Dangal.\n\"Then Aamir called me and said, ‘You are taking a dig at me at my own party.’ Now ask him what has happened? Whatever I had said back then was true or false?” Vidhu Vinod Chopra was quoted as saying by IANS after the failure of Thugs Of Hindostan.\n“I think all the so-called stars must realise that the script comes first,” he said, and rightly so!\n“The first thing is, the script should be written devoid of big stars. The trouble is when you start thinking, ‘This is the story that I’m going to do for this guy.’ That is where you start making compromises which is the disaster that is hitting you all now, in your face,” he added.\nYouTube\nSimilarly, Tigmanshu Dhulia believes that big budget films will also fall flat at the box office if they don't have a good script. And this he said, shortly after the failure of Zero, in which he played the role of Shah Rukh Khan’s father.\n“Big budget films have started to face this challenge of just being big budget and loaded with stars. But even big budget films need a good script now. Look at 'Thugs of Hindostan'. The stars delivered what they promised because the first day collections were phenomenal. So people went to see Amitabh Bachchan and Aamir Khan, but from the second day the collections sank,” he said.\nFilmmakers are finally realising the same. They have started giving credit to the scriptwriters finally. Remember when Karan Johar had made the announcement for his multi-starrer historical drama Takht, he made sure he gave credit to the writers as well. He called Hussain Haidry (dialogue) and Sumit Roy (screenplay, dialogue) as the “heartbeat and soul” of the movie.\nThe Screenplay is by SUMIT ROY! Dialogues by HUSSAIN HAIDRY,SUMIT ROY! And thanks to @NotSoSnob for bringing these talents to us at @DharmaMovies ! An exciting journey ahead....WRITERS are the heartbeat and soul of a film! These gentlemen lead all the way.... pic.twitter.com/hyTucBmKaG — Karan Johar (@karanjohar) August 9, 2018\nAnd this move was welcomed by everyone.\nThat's so classy, to put forward the names of the writers in the very first announcement.\nAnd many congratulations @sumit_roy_ and @hussainhaidry. https://t.co/MuA01TAawY — वरुण (@varungrover) August 9, 2018\nBox office collections are unpredictable, but one thing is for sure, audiences can’t be fooled anymore. With the advent of OTT platforms including Netflix, Amazon Prime and Hotstar, the competition is getting tougher than ever. And it's only the script that decides the success of a movie/show.\nDo you even think that Sacred Games would have been a hit worldwide had Varun Grover, Smita Singh and Vasant Nath not lent their writing to it? Or had Badhaai Ho panned out the way it did if Akshat Ghildial wouldn’t have contributed to it?\nWithout Raj Nidimoru, Krishna DK and Sumit Arora, Stree would have been boring, don’t you think? Manmarziyaan would have failed to keep you intrigued without Kanika Dhillon’s contribution?\nRaazi wouldn’t have been so great without Bhavani Iyer and Sanju wouldn’t have been the same without Abhijat Joshi? And the same goes for all the films.", "title": "Bollywood Scriptwriters Were The True Stars Of 2018 And Here's Why They Should Get Their Due", "date_publish": "17/01/2019, 17:50:03", "description": "Shah Rukh Khan’s Zero, Aamir Khan’s Thugs Of Hindostan or Ayushmann Khurrana’s Badhaai Ho – that’s how we have been addressing the Bollywood films. The directors gets applauded, the actors are star-performers, and but what about script-writers? The people who sit down write such amazing thought-provoking stories – do they ever get their dues?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood-scriptwriters-were-the-true-stars-of-2018-and-here-s-why-they-should-get-their-due-360191.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/scriptwriters_were_true_stars_of_2018__its_high_time_they_get_the_credit_they_duly_deserve_1547719582_800x420.png"}