{"text": "Prostitution, substance abuse and alcohol addiction – Bollywood has a lot of dark secrets that people are apparently unaware of. Behind the fascinating glitz and glamour in the industry, there are a lot of dirty secrets that remain hidden.\nMumbai crime branch’s anti-extortion cell recently arrested Agnes Hamilton, 56-year-old choreographer, who has worked on films including Salman Khan’s Tubelight and also runs a dance class in Lokhandwala in Andheri, for running a global prostitution racket.\nfacebook/agnes.hamilton.507\nAllegedly, she would send young girls abroad on the pretext of dance and acting assignments. However, the girls would be forced into sex trade there. For every girl, she would receive Rs 40,000, it is said.\nAccording to a report on Times Now, she has been running the sex racket for quite a few years now. It all came to notice, when Kenyan government had deported a trafficked woman recently.\nfacebook/agnes.hamilton.507\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“The woman said Hamilton told her she would get good work in a Kenyan hotel. After reaching Kenya, though, one Razia Patel took her to Nairobi and forced her into prostitution,” the report quoted Ajay Sawant, senior inspector of the anti-extortion cell, as saying.\nShe has been booked under sections of the IPC and Immoral Traffic Prevention Act for allegedly sending women abroad.", "title": "Bollywood Choreographer Arrested For Allegedly Running A Global Prostitution Racket", "date_publish": "18/11/2018, 15:34:57", "description": "Mumbai crime branch’s anti-extortion cell recently arrested Agnes Hamilton, 56-year-old choreographer, who has worked on films including Salman Khan’s Tubelight and also runs a dance class in Lokhandwala in Andheri, for running a global prostitution racket.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood-choreographer-arrested-for-allegedly-running-a-global-prostitution-racket-356899.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/salman_khan_with_bollywood_choreographer_agnes_hamilton_whos_arrested_for_running_sex_racket_1542534601_800x420.png"}