{"text": "What goes around comes around. Pahlaj Nihalani who was the CBFC chief and was known to put censor in films is now dealing with the same issues now as a director.\nBombay High Court's vacation bench on Tuesday refused to urgently hear Pahlaj Nihalani's plea against Central Board of Film Certification's (CBFC) suggestion of approximately 20 cuts in his upcoming production 'Rangeela Raja.'\nThe former CBFC chairman will now mention his plea before the court again on November 12.\nNihalani has claimed that the cuts suggested for his film were completely illogical and meaningless. \"There is no vulgarity, no double meaning dialogues. Still I've been asked to delete a massive number of dialogues and scenes,\" he had told ANI on Monday.\ntwitter/ani\nThe producer had also alleged that the censor body did not give a timely review to his upcoming production, while multi-starrer 'Thugs Of Hindostan' was given preference by the film body as chairman Prasoon Joshi is friends with Aamir Khan.\n\"My film was reviewed 40 days after applying. I was going to release my film on November 8. Thugs of Hindostan had applied 20 days after me. However, Prasoon Joshi who is good friends with Aamir Khan so he gave preference to his movie before my film,\" said Nihalani.\nHe had also stated that the CBFC did not follow the set guidelines for reviewing a film within 21 days of the makers approaching the board.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nbccl\nWith 'Rangeela Raja', Nihalani is reuniting with Bollywood actor Govinda after 25 years. They have earlier worked together in films including 'Ilzaam', 'Shola Aur Shabnam' and 'Aankhen'.\nGovinda's comeback film, 'Rangeela Raja' also stars Shakti Kapoor, Digangana Suryavanshi, Mishika Chourasia, and Anupama Agnihotri. It is scheduled to hit the big screens on November 16.\nAs the censor board chairman, Nihalani had faced flak for objecting to the word 'intercourse' in the promo of Anushka Sharma and Shah Rukh Khan starrer 'Jab Harry Met Sejal' and also for refusing to clear the women-centric film 'Lipstick Under My Burkha'.\nInputs From ANI", "title": "Bombay HC Refuses To Hear Pahlaj Nihalani’s Plea Against CBFC Cuts On Urgent Basis", "date_publish": "06/11/2018, 18:00:09", "description": "Bombay High Court's vacation bench on Tuesday refused to urgently hear Pahlaj Nihalani's plea against Central Board of Film Certification's (CBFC) suggestion of approximately 20 cuts in his upcoming production 'Rangeela Raja.' The former CBFC chairman will now mention his plea before the court again on November 12. Nihalani has claimed that the cuts suggested for his film were completely illogical", "authors": [], "url": "https://www.indiatimes.com/entertainment/bombay-hc-refuses-to-hear-pahlaj-nihalani-s-plea-against-cbfc-cuts-on-urgent-basis-356192.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/bombay_hc_refuses_urgent_hearing_of_pahlaj_nihalani_1541507529_800x420.jpg"}