{"text": "It’s oscar season! Almost. The Academy announced the much awaited nominations just recently. While some were hits, many others were snubbed. However, let’s not get into the whole Oscar politics. It’s time we celebrate good cinema and jump in headfirst.\nIt’s almost a month to go before the grand ceremony takes place, so we have plenty of time to catch up on the movies and decide which ones are worthy of taking the coveted trophy home.\ngiphy\nTherefore, we have curated a list of all the movies nominated this year with a little preview of their plots. You can thank us later!\n1. A Star Is Born - 8 nominations\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nofficial poster\nPersonally, this one is my favorite from the lot. While i do agree that we have seen the same story more than once but the lead couple was a breath of fresh air. Could you ever imagine Bradley Cooper singing his own songs? Or see Lady Gaga in her most natural form and portraying emotions so beautifully? No, right? Special mention for the music score. The entire album has been created so magnificently. The song Shallow even went on to bag a Golden Globe earlier.\nThe plot revolves around a successful country music artist Jackson Maine who is battling alcohol and drug addiction. He is in a self destruction mode when fate makes him cross paths with an amateur singer Ally. He is not just mesmerised with her voice but falls in love with her almost instantly. The story then unfolds with Maine helping Ally become a Star!\n2. Bohemian Rhapsody - 5 nominations\nglamour.com\nAn extravagant celebration of the band Queen and it’s lead singer, this film took us on a tour of Freddie Mercury’s life. The man’s journey consisted of shattering stereotypes and conventional methods to become one of the world class entertainers! The unprecedented rise of this band, creating iconic songs and revolutionary sound is a treat for fans. However, their meteoric success takes an unexpected turn when Freddie shuns the band to pursue his solo career. Dark influences, Aids diagnosis and a flailing solo career, makes Mercury join the band once again and just in time for Live Aid. To see Queen’s legacy come to life on the big screen was not just a bonanza for aspiring singers but for their fans alike!\nInterestingly, Rami Malek, who played Freddie Mercury bagged the Best Actor Golden Globe in the Motion Picture category.\nFun Fact: Rami Malek also played Mr Robot in the hit drama thriller series.\n3. BlacKkKlansman - 6 nominations\nPacific standard\nHelmed by legendary filmmaker Spike Lee, this movie is based on the true story of an American Hero. Based on the 2014 memoir Black Klansman by Ron Stallworth, this film revolves around Stallworth who is trying to make a name for himself and in pursuit of the same, he takes up a dangerous mission of exposing Ku Klux Klan, an American hate group. This turns into an undercover investigation of a lifetime.\n4. Black Panther - 8 nominations\ncnet\nThis movie wasn’t just appreciated for its spectacular plot but it also created history for fronting an all-black cast! This Marvel blockbuster also became the first superhero film to bag the Best Picture nomination at the Oscars. Directed by Ryan Coogler, this film starring Chadwick Boseman and Michael B Jordon in pivotal roles received a total of 7 Academy nominations.\nSet in the fictional African country of Wakanda, this film tell the story of T’Challa who returns to the county to take his place as King after the death of his father. The throne obviously doesn’t come easy and he has to beat the enemy and prove himself as the rightful heir and the beloved Black Panther of his subjects. This film became a blockbuster hit by earning 1.3 billion USD worldwide.\n5. Vice - 8 Nominations\npop sugar\nA biopic-comedy, Vice narrates the story of former US Vice President Dick Cheney played by none other than Christian Bale. It follows the journey of Cheney of becoming the most powerful Vice President in the history of America. Boasting of an impressive resume which includes stints of working as White House chief of staff, House Minority Whip and Defence secretary. Bale is known for attempting some of the most difficult roles throughout his career and this one was no different.\nHe gained 40 plus pounds and shaved his head to look like the man who was second in command during some of the darkest days in American history. Despite getting beaten by George W Bush by a narrow margin, Cheney uses his power to reshape the country. Bale is touted to take his second Oscar home with this film and so are the makeup and other technicians for transforming lead characters to look like their real counterparts.\n6. First Man - 4 nominations\ntwitter\nAptly titled First Man takes you on the journey of Astronaut Neil Armstrong, the first man to reach the moon. Helmed by six-time Academy Award winning director Damien Chazelle. Teaming up with Ryan Gosling once again after La La Land, the riveting story of NASA’s mission to land a man on the moon, this film is a visceral first-hand account from Armstrong’s perspective. Showcasing the time between 1961-1969, it exhibits the sacrifices and difficulties that Armstrong and the nation went through to accomplish the historic mission. Even thought First Man didn’t bag nominations in the major categories, it got three nods in the technical ones.\n7. Mary Poppins Returns - 4 nominations\ntwitter\nA sequel to the original film, Mary Poppins Returns takes the story forward and embarks on the events after 25 years. Bank teller Michael Banks is now an adult with three children working as a bank teller who is about to be evicted from his home if he doesn’t pay back a loan. He ties all his hope to a missing certificate that is a proof of valuable shares that his father left him years ago. Just when he meets a dead end, he and his family have a visitor Mary Poppins, the beloved nanny from his childhood who not only saves the day but also take the family on a magical adventure.\nA fairly recent release, this musical drama bagged 4 Academy nominations mostly in the music and technical categories. The film won’t just make you reminiscent of your childhood days but will also entertain you with it’s foot-tapping music. What’s more Emily Blunt’s performance is definitely the highlight of this film.\n8. Roma - 10 nominations\nvulture\nRoma isn’t a conventional film for Oscars. However, it has still become the frontrunner this year.First things first, Roma is a Netflix film and it is in Spanish. Oh and also, it’s a black and white film! This hasn’t deterred the film from bagging as many as 10 nominations at the Academy awards this year.\nCalled a masterpiece and one-of-a-kind film by many critics, this movie follows the life of Cleo, a housekeeper in Roma of Mexico city in the 1970s. She is much-loved by her boss’ family including their four children. Taking off by showcasing a picture perfect life, it slowly transcends into the hardships that she faces in both professional and personal life. It also shows Mexico undergoing civil and political unrest.\n9. Green Book - 5 nominations\nthe ringer\nThis road trip comedy has been getting a lot of attention at several award ceremonies including Golden Globes and the Producers Guild Awards.\nNarrating the relationship between real-life classical musician Dr Don Shirley played by Mahershala Ali and his Italian-American driver Tony ‘Lip’ Vallelonga played Viggo Mortensen, it’ll take you on a two-month long concert tour through the American south in the early 1960s. Now, it brought a storm of controversies in the recent weeks before the Oscars nominations announcement. The family of the late Dr Shirley had objections with the accuracy of the story, and challenged the creative team for not contacting them during the making of the film.\nHowever, that got resolved soon after and now the film is all set to contest for some lead Oscars categories.\n10. The Favourite - 10 nominations\npinterest\nWhile Ryan Gosling won hearts with his emotional performance in First Man, his La La Land co-star is not far behind. Starring in The Favourite, this movie is perhaps the most intriguing and entertaining one from this lot.\nBased in Britain in the early 18th century, England is at war with the French. Queen Anne, a fraile ruler sits on her throne along with her confidante Lady Sarah who is her advisor and her lover too. Yes, you read that right! She tends to the Queen’s ill health and her temperamental behaviour to help her govern the country. With a new servant Abigail played by Emma Stone, entering the scenario , Lady Sarah founds her endearing and decides to train her and eventually she returns to her aristocratic roots.\nApart from the above list, other movies that have also been nominated in Academy Awards this year are A Quiet Place, If Beagle Street Could Talk, At Eternity's Gate, Avengers: Infinity War and Can You Forgive Me? among others.", "title": "Bring Out The Popcorn! 10 Oscar-Nominated Movies That You Need To Watch Before The Ceremony", "date_publish": "02/02/2019, 12:08:36", "description": "It’s Oscars season! Almost. Yesterday saw a big reveal from the Academy as they announced the much awaited nominations. While some were hits, many others were snubbed. However, let’s not get into the whole Oscars politics. It’s time we celebrate good cinema and jump in headfirst. It’s almost a month to go before the grand ceremony takes place, so we have plenty of time to catch up on the movies", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/bring-out-the-popcorn-10-oscar-nominated-movies-that-you-need-to-watch-before-the-ceremony-360865.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/oscars_2019_1548161961_800x420.jpg"}