{"text": "One day after all the fan protests, Britney Spears went on social media to comfort worried admirers, saying she will be \"back very soon\". Fans of the pop star assembled outside City Hall in West Hollywood, California, on Monday demanding to release her from the facility.\nReuters\nThe protest was live-streamed on YouTube, with attendees shouting, \"Hey, ho, Larry Rudolph has got to go,\" claiming it was her longtime manager's decision to put the star in the facility. The protesters were also seen holding signs that read \"Free Britney\" and \"Truth Will Set Her Free\".\nOn Wednesday, Spears released a video on Instagram in which she said she and her family needed some time off \"to heal\".\n\"Hi guys, just checking in with all of you who are concerned about me. All is well. My family has been going through a lot of stress and anxiety lately, so I just needed time to deal. But don't worry, I'll be back very soon,\" she said in a short selfie video.\nDon't Miss 153 SHARES 1.1 K SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES\nReuters\nThe clip was accompanied by a lengthy caption breaking down the speculation and shutting down rumours.\n\"I wanted to say hi, because things that are being said have just gotten out of control! Wow! There's rumors, death threats to my family and my team, and just so many things crazy things being said. I am trying to take a moment for myself, but everything that's happening is just making it harder for me. Don't believe everything you read and hear. These fake emails everywhere were crafted by Sam Lutfi (producer) years ago... I did not write them.\n\"He was pretending to be me and communicating with my team with a fake email address. My situation is unique, but I promise I'm doing what's best at this moment. You may not know this about me, but I am strong, and stand up for what I want! Your love and dedication is amazing, but what I need right now is a little bit of privacy to deal with all the hard things that life is throwing my way. If you could do that, I would be forever grateful. Love you (sic),\" Spears wrote.\nReuters\nAccording to Billboard, the singer checked herself into a 30-day programme in March in the midst of her father Jamie Spears' ongoing health issues. On Easter Sunday, she was granted a one-day leave to celebrate with her family, reported People magazine.\nSpears, 37, opened up to fans in January on Instagram about her dad's health, saying she was taking an indefinite hiatus ahead of her planned Domination residency in Las Vegas, which was set to kick off in February, because her father had \"almost died\".\n(With agency inputs)", "title": "Britney Spears Responds To 'Out Of Control' #FreeBritney Allegations And Asks Fans For Privacy!", "date_publish": "24/04/2019, 16:28:00", "description": "According to Billboard, the singer checked herself into a 30-day programme in March in the midst of her father Jamie Spears' ongoing health issues. On Easter Sunday, she was granted a one-day leave to celebrate with her family, reported People magazine. Spears, 37, opened up to fans in January on Instagram about her dad's health, saying she was taking an indefinite hiatus ahead of her planned Dom", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/britney-spears-responds-to-out-of-control-freebritney-allegations-and-asks-fans-for-privacy-366029.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/britney_spears_fans_1556102448_800x420.jpg"}