{"text": "Bryan Cranston AKA Heisenberg To Return In Breaking Bad Movie & Here’s All That We Know So Far\nBryan Cranston AKA Heisenberg To Return In Breaking Bad Movie & Here’s All That We Know So Far\n‘Yo! What up, Biat**?’\nHave you heard that Breaking Bad movie is in the works? Yes, six years after the show, which holds a Guinness World Records as the highest-rated TV series, is returning with a film, this time. Looks like all our prayers were heard!\nTwitter\nWhile not many details about the movie were released. A reported cast list for Breaking Bad movie has revealed several characters including Bryan Cranston's Walter White will be a part of the movie.\nvia GIPHY\nShortly after the announcement of Breaking Bad movie was made, Bryan Cranston had expressed his interest in reprising the character of Walter White.\n“Yes, there appears to be a movie version of 'Breaking Bad', but honestly I have not even read the script. I have not gotten the script, I have not read the script. And so, there's the question of whether or not we'll even see Walter White in this movie. Ohhhhh! Think about that one...”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nvia GIPHY\nHowever, due to Broadway commitments, people thought it wouldn’t happen. But now after the reported cast list has been leaked, it seems that Walter White is definitely a part of the movie. According to the list, Breaking Bad movie will feature Krysten Ritter, Jonathan Banks, Jesse Plemons, Charles Baker, Matt Jones, and Robert Forster among others.\nvia GIPHY\n“Not only will the story [to] find a way bring back Ritter's Jane - with whom Jesse had a tragic love affair way back during the show's first season - but series star Cranston is set to play some sort of role in the new film as well. This, despite both characters having met their ends on the show,” states a report on Revenge of the Fans.\nvia GIPHY\nWhat’s more? The movie might be called Greenbrier.\nAccording to reports, that’s the title of the movie that is doing the rounds. Well, that could be a working title as well. Furthermore, it is also said that the movie will follow the story of a man who escapes kidnapping.\nvia GIPHY\nThe creator of the hit drama series Vince Gilligan will take full charge of the script of Breaking Bad movie. People are suspecting that it could be a prequel to the show.", "title": "Bryan Cranston AKA Heisenberg To Return In Breaking Bad Movie & Here’s All That We Know So Far", "date_publish": "25/01/2019, 14:24:42", "description": "While not many details about the movie were released. A reported cast list for Breaking Bad movie has revealed several characters including Bryan Cranston's Walter White will be a part of the movie. Shortly after the announcement of Breaking Bad movie was made, Bryan Cranston had expressed his interest in reprising the character of Walter White.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bryan-cranston-aka-heisenberg-to-return-in-breaking-bad-movie-here-s-all-that-we-know-so-far-361025.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bryan_cranston_aka_heisenberg_to_return_in_breaking_bad_movie_heres_all_that_we_know_so_far_1548405031_800x420.png"}