{"text": "Bryan Adams Thanks ‘Magical India’ With A Photo Of His Shadow In The Toxic Delhi Air\nBryan Adams Thanks ‘Magical India’ With A Photo Of His Shadow In The Toxic Delhi Air\nBryan Adams finally concluded his three-day concert with his last performance in Gurugram last night, and fans are still hungover and are singing Summer of 69.\nFrom singing his popular tracks to expressing his love for India, the Grammy Award-winning singer-songwriter gave his Indian fans a joyful night to remember.\n“My name is Bryan. It's been a very long time since I wanted to play here. We have been coming to India since 1994 and every time I was here I used to ask our promoters awhere is my New Delhi show,” he said as he began the gig. He played at the NCR region for the first time.\nDon't Miss 767 SHARES 662 SHARES 110 SHARES 283 SHARES\nAP\nAnd as he concluded his performance, he witnessed something “magical”. Can you spot what’s unusual in the picture below?\nHis massive shadow right above the crowd was a proof of air pollution in the city. Yes, that shadow was made of the toxic air. Well, did he just call that magical?\nBryan Adams performed at the Leisure Valley Park on Sunday sending the fans into a tizzy.", "title": "Bryan Adams Thanks ‘Magical India’ With A Photo Of His Shadow In The Toxic Delhi Air", "date_publish": "15/10/2018, 17:16:09", "description": "Bryan Adams finally concluded his three-day concert with his last performance in Gurugram last night, and fans are still hungover and are singing Summer of 69. And as he concluded his performance, he witnessed something “magical”. Can you spot what’s unusual in the picture below? His massive shadow right above the crowd was a proof of air pollution in the city. Yes, that shadow was made of the tox", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bryan-adams-thanks-magical-india-with-a-photo-of-his-shadow-in-the-toxic-delhi-air-354826.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bryan_adams_thanks_magical_india_with_an_unusual_photo_of_his_shadow_made_of_polluted_air_1539601615_800x420.png"}