{"text": "Bryan Cranston Says He Will Agree To Star In The Breaking Bad Movie ‘In A Second'\nBryan Cranston Says He Will Agree To Star In The Breaking Bad Movie ‘In A Second'\nHe's best known for his role as Walter White in the phenomenal Breaking Bad series. Bryan Cranston played the main protagonist and since then there has been no looking back.\nThere are rumours that they could be a possibility of a Breaking Bad and fans can't contain excitement. Bryan Cranston said he would agree to featuring in the big-screen adaptation of Breaking Bad “in a second”.\nIt was announced last November that a film on the hit drama series is underway with creator Vince Gilligan. It was also reported by Slashfilm that the movie would be a sequel and will centre around Aaron Paul’s Jesse Pinkman.\nScreengrab\nThe AMC show, headlined by Cranston, was about the transformation of Walter White, a chemistry teacher, into a methamphetamine-making drug lord.\nTalking to Entertainment Weekly Radio on SiriusXM, the actor also gave a shout-out to the series spin-off Better Call Saul, starring Bob Odenkirk in the lead.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“From a realistic standpoint, if I got called to do the movie or Better Call Saul which I don’t know would ever happen – I really don’t – I would do it in a second,” he said.\nCranston also called working on the show a life-changing experience.\nTwitter\n“My experience on Breaking Bad changed my life and my professional life. It gave me opportunities that would not have come,” he said.\nThe show ran for six seasons till 2013 and ended with White’s death. Over five seasons, the show clinched 16 Primetime Emmy Awards and 7 Golden Globes. It regularly features in the list of best television dramas ever made.\nInputs From PTI", "title": "Bryan Cranston Says He Will Agree To Star In The Breaking Bad Movie ‘In A Second'", "date_publish": "15/01/2019, 11:27:33", "description": "Bryan Cranston has said that he would agree to featuring in the big-screen adaptation of Breaking Bad “in a second”. It was announced last November that a film on the hit drama series is underway with creator Vince Gilligan. It was also reported by Slashfilm that the movie would be a sequel and will centre around Aaron Paul’s Jesse Pinkman. The AMC show, headlined by Cranston, was about the transf", "authors": [], "url": "https://www.indiatimes.com/entertainment/bryan-cranston-says-he-will-agree-to-star-in-the-breaking-bad-movie-in-a-second-360419.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bryan_cranston_1547532373_800x420.jpg"}