{"text": "Did you know that Breaking Bad holds a Guinness World Records as the highest-rated TV series? So, it’s officially the world’s best TV series. Those of you who have watched it, would seldom disagree.\nThe story of the student-teacher meth-makers Walter White (played by Bryan Cranston) and Jesse Pinkman (Aaron Paul), Breaking Bad is simply one of the greatest TV series ever made.\nTwitter\nIt was one show that was consistently good and kept audiences hooked. It was crazy good from start to end – not to forget the finale was a masterpiece.\nTwitter\nBut have you heard the good news yet? Breaking Bad, the show that ended years ago, is making a comeback in the form of a movie. Yes, a movie adaptation on the hit drama series is in the works with creator Vince Gilligan, and Bryan Cranston AKA Heisenberg is for sure starring in it.\nindependent.co.uk\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“Yes, there appears to be a movie version of 'Breaking Bad', but honestly I have not even read the script. I have not gotten the script, I have not read the script. And so, there's the question of whether or not we'll even see Walter White in this movie. Ohhhhh! Think about that one...\n\"There's a lot of people who felt that they wanted to see some kind of completion to some of these storylines that were left on. And this idea, from what I'm told, gets into those at least a couple of the characters who were not completed as far as their journey,” the actor said on The Dan Patrick Show.\nWhat’s more, he called Breaking Bad as \"the greatest professional period of my life\" and said he would love to come back.\n“There is an appearance, or what kind of appearance flashbacks, flash-forwards, I have no clue. But I'm excited about it because it's 'Breaking Bad' and it was, and I can't wait to see all those people again, even if I just come by to visit.”\ncollider.com\nBreaking Bad movie is expected to follow the events of the series finale which aired in 2013. We are already skittering away in excitement. What about you?\nAlso Read: 7 Reel-Life Bromances From Popular Shows That Can Put Your Real-Life Friendships To Shame!\nWith inputs from PTI", "title": "Bryan Cranston AKA Walter White To Star In ‘Breaking Bad’ Movie & We're Jumping With Joy!", "date_publish": "12/11/2018, 14:00:45", "description": "Have you heard the good news yet? Breaking Bad, the show that ended years ago, is making a comeback in the form of a movie. Yes, a movie adaptation on the hit drama series is in the works with creator Vince Gilligan, and Bryan Cranston AKA Heisenberg is for sure starring in it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bryan-cranston-aka-walter-white-to-star-in-breaking-bad-movie-we-re-jumping-with-joy-356495.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/bryan_cranston_aka_walter_white_confirms_hell_star_in_breaking_bad_movie__hes_as_excited_as_we_1542009451_800x420.jpg"}