{"text": "It takes a lot of courage and bravery to come out and share stories of mental and sexual harassment. Tanushree Dutta became the torch-bearer of the #MeToo movement in India and we're sure there are many women who want to thank her to begin this in India.\nA lot of sexual predators in the industry were called out and dismissed from their respective jobs. The industry stood in solidarity with the movement proving that better working standards should be set for everyone.\nJoining the #MeToo movement in India, Former Miss India, and actor Niharika Singh has come out to share her ordeal and story.\nIn a long-post penned by Singh, she has shared experiences of her stint with the glamour industry. Journalist Sandhya Menon took to Twitter to share Niharika's story and she wrote how she was writing the piece to “expand my own understanding of what constitutes abuse, who we choose to punish and whom we are willing to forgive”.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn her story, she wrote about her experiences as a model, becoming a beauty queen and then struggling as an actor. Niharika begins with accusing T-Series head, Bhushan Kumar. She writes,\n“Bhushan Kumar called me to his office to sign ‘A New Love Ishtory’ where he gave me an envelope as a signing amount for the film. It contained two 500 Rupee notes (less than 14$). I got a text from him later that night- ‘I would love to know you more. Let’s get together sometime.’ I wrote back saying- ‘Absolutely! Let's go on a double date. You bring your wife. I’ll bring my boyfriend.’ He never wrote to me again.”\nShe then mentions her ex-boyfriend and actor Nawazuddin Siddiqui, with whom she came across on the sets of the film, Miss Lovely.\nTwitter\n“One morning, when I was home and he had been shooting all night, Nawaz sent me a text saying he was near my building. I invited him over and asked him to come and have breakfast with me. When I opened the door, he grabbed me.\nSilverscreen\nI tried to push him away but he wouldn’t let go. After a little coercion, I finally gave in. I wasn’t sure what to make of this relationship. He told me it was his dream to have a Miss India or an actress wife, just like Paresh Rawal and Manoj Bajpayee. I found his little confession funny but endearing.\"\nShe further alleges how Nawazuddin Siddiqui used to engage himself in multiple women. She adds,\nGQ India\n\"Nowaz(Nawaz) had engaged multiple women, giving each one a different story; one of them even called me from his phone and started yelling at me. I also found about out about a woman he'd married in Haldwani whose family sued him for making dowry demands. I told him to clean up his mess, be honest with himself and everyone around him.\"\nIn her note, she further mentions her brief interaction with Sajid Khan. She mentions,\n\"Last but not the least, filmmaker Sajid Khan, who I met a couple of times while he was dating an actress I knew years ago, made a few predictions when a close friend of ours was opening her second restaurant - ‘This place will shut down within a year, mark my words.’ To his actress girlfriend he said, ‘She won’t survive a day without me in Bollywood’. ‘And, this one’, looking at me straight, ‘will soon commit suicide.’\"\nRead Niharika's full-confession in these following tweets:\n2005 Miss India Niharika Singh's experiences in Bollywood but especially with Nawazuddin Siddiqui and Mayank Singh Singvi\nNiharika and other women accused Siddiqui of making up lies in his autobiography, due to which he withdrew the book.\nThis is her side of the story. pic.twitter.com/XBVGgE3r0c — Sandhya Menon (@TheRestlessQuil) November 9, 2018", "title": "Calling Nawazuddin Siddiqui A 'Sexually Repressed Man', Model-Actor Niharika Singh Shares Her #MeToo Story", "date_publish": "10/11/2018, 09:53:20", "description": "A lot of sexual predators in the industry were called out and dismissed from their respective jobs. The industry stood in solidarity with the movement proving that better working standards should be set for everyone. Joining the #MeToo movement in India, Former Miss India, and actor Niharika Singh has come out to share her ordeal and story.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/calling-nawazuddin-siddiqui-a-sexually-repressed-man-model-actor-niharika-singh-shares-her-metoo-story-356376.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nawazuddin_siddiqui_1541827103_800x420.jpg"}