{"text": "Tanushree Dutta started a fight that now many are willing to carry forward. In the wake of #MeToo movement, new stories of sexual harassment are coming out every day and with every story, your heart will only sink more.\nAgencies\nJust one day before, Shweta Pandit, in a Twitter post, recounted her ordeal with Anu Malik in an incident dating back to 2000. She claims once in a cabin at a studio, he told her he would give her a song with Sunidhi Chauhan and Shaan \"but first give me a kiss now\".\nTwitter\n\"He then smiled, what I would recall the most evil grin I've seen,\" Shweta Pandit said of the incident when she was all of 15 years old. Before Shweta Pandit, singer Sona Mohapatra called out Anu Malik.\nReacting to these allegations, Singer Anu Malik has blatantly denied that he sexually harassed singer Shweta Pandit, who has called him a \"pedophile\" and \"sexual predator\".\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\n\"The allegations made against my client are emphatically denied as completely false and baseless. My client respects the #MeToo Movement but to use this movement to start a character assassination mission is obnoxious,\" Malik's lawyer Zulfiqar Memon told IANS.\nAnu Malik went on to address the allegations and called them “ridiculous”. In a media statement, Anu Malik said, “No comments. This is ridiculous. I don’t want to talk about it. Today anyone says anything.”\nThat's not all. Lyricist Sameer spoke in defense of his friend Anu Malik.", "title": "Calling Shweta Pandit's Allegations 'False', Anu Malik's Lawyer Responds To #MeToo Allegations", "date_publish": "18/10/2018, 17:46:38", "description": "Singer Anu Malik has denied allegations that he sexually harassed singer Shweta Pandit, who has called him a \"pedophile\" and \"sexual predator\". Shweta Pandit, in a Twitter post, recounted her ordeal with Anu Malik in an incident dating back to 2000. She claims once in a cabin at a studio, he told her he would give her a song with Sunidhi Chauhan and Shaan \"but first give me a kiss now\".", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/calling-shweta-pandit-s-allegations-false-anu-malik-s-lawyer-responds-to-metoo-allegations-355043.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anu_malik_1539864612_800x420.jpg"}