{"text": "Calling It The First Big Rejection, Rajkummar Rao Recalls He Couldn't Get Through 'Boogie Woogie'\nCalling It The First Big Rejection, Rajkummar Rao Recalls He Couldn't Get Through 'Boogie Woogie'\nStardom and fame might be two important perks of being an actor but it doesn't come easy for people who enter the industry without any connections. Often tagged as 'outsiders', these people enter Mumbai with suitcase full of dreams and begin their journey with the uncertainty of reaching their destination.\nFor Rajkummar Rao, his journey began when he was 16. A Gurgaon guy came to Mumbai with dreams of becoming a dancer. Yes, you read that right. Today, he might be one of the most bankable actors but all he wanted to become back then was a dancer.\n(Also read: Rajkummar Rao Feels The Era Of Superstardom That SRK, Salman & Aamir Enjoyed Isn't Coming Back)\nInstagram\nIn a recent interaction with DNA for the promotions of his latest film Ek Ladki Ko Dekha Toh Aisa Laga, Rao confessed that his aim in life was to become a dancer. Talking about his dream to become a dancer and his first biggest rejection, Rajkummar Rao said,\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“I was in tenth standard when I came to Mumbai from Gurgaon for the first time, I always wanted to be a dancer and came here for the auditions of Boogie Woogie where I got rejected. I was sixteen years old when I came here. I was very disheartened by that rejection then but today I am so glad that I got rejected. It got me to a better career that I am in today.”\nWell, every rejection comes with a silver lining and we are glad Rao managed to find his.\nAfter a spectacular 2018 with back to back hits, Rajkummar Rao is geared up for some big releases of 2019.\n(Also read: Rajkummar Rao Was Once Replaced By An Actor In A Movie But He Didn’t Take It Personally)", "title": "Calling It The First Big Rejection, Rajkummar Rao Recalls He Couldn't Get Through 'Boogie Woogie'", "date_publish": "04/02/2019, 11:57:38", "description": "For Rajkummar Rao, his journey began when he was 16. A Gurgaon guy came to Mumbai with dreams of becoming a dancer. Yes, you read that right. Today, he might be one of the most bankable actors but all he wanted to become back then was a dancer. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/calling-it-the-first-big-rejection-rajkummar-rao-recalls-he-couldn-t-get-through-boogie-woogie-361538.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/rajkummar_rao_1549262611_800x420.jpg"}