{"text": "When it comes to selecting films, script is the most important aspect for Bollywood actor Ayushmann Khurrana. He has given two consecutive hits in 2018 – with Badhaai Ho and Andhadhun. In his next titled Article 15, for which he is collaborating with Mulk fame director Anubhav Sinha, he will be seen playing the role of a cop for the first time ever.\nTwitter\nArticle 15 of the Indian constitution prohibits decriminalisation on the grounds of caste, religion, race, sex or place of birth. Going by the title, looks like the film will address the address the issue discrimination, just like how Anubhav Sinha’s last film Mulk had. This one, reportedly, is Anubhav Sinha’s most ambitious project until date.\nAs Ayushmann Khurrana wrapped up the shoot of Article 15, he penned down an heartwarming note and called it most “important” and “relevant” film of Indian cinema.\nWrapped up a film which will become the most relevant and important film of Indian cinema. Thank you @anubhavsinha sir for giving me this gem and also writing the most real cop role ever. #Article15 pic.twitter.com/W4h83LLuko — Ayushmann Khurrana (@ayushmannk) April 9, 2019\nAyushamann is happy to have bagged the opportunity to work with Sinha. “Anubhav Sinha is one such director who understands the complexities of our country. I loved Mulk. It was the most balanced film based on communalism and extremism and it will be an absolute pleasure to work with him on Article 15,” he had earlier told IANS.\nThanks to the entire cast and crew, esp #RonjiniChakraborty and @Ashishsverma for this wonderful 3D mini model of mine. Love. It’s a wrap! #Article15 pic.twitter.com/wwn2JGgfgn — Ayushmann Khurrana (@ayushmannk) April 9, 2019\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nApart from Ayushmann Khurrana, Article 15 also stars Isha Talwar, Manoj Pahwa, Sayani Gupta, Kumud Mishra, M Nassar, Ashish Verma, Sushil Pandey, Shubrajyoti Bharat, Ronjini Chakraborty and Zeeshan Ayyub.", "title": "Calling It 'Most Important Film Of Indian Cinema', Ayushmann Khuranna Predicts 'Article 15' Is A Gem", "date_publish": "09/04/2019, 17:07:05", "description": "When it comes to selecting films, script is the most important aspect for Ayushmann Khurrana. He has given two consecutive hits in 2018 – with Badhaai Ho and Andhadhun. In his next titled Article 15, for which he is collaborating with Mulk fame director Anubhav Sinha, he will be seen playing the role of a cop for the first time ever.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/calling-it-most-important-film-of-indian-cinema-ayushmann-khuranna-predicts-article-15-is-a-gem-365139.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ayushmann_khurrana_wraps_up_cop_drama_article_15_calls_it_the_most_important_film_of_indian_cine_1554809908_800x420.png"}