{"text": "Priya Prakash Varrier might be a popular name, thanks to her overnight success after her viral 'wink'. The song 'Manikya Malaraya Poovi' from her Malayalam movie Oru Aadar Love made her an internet sensation last year.\nHer popularity must have sky-rocketed after viral wink but the actor is back in the news and not for all the right reasons.\nThe trailer of her debut Bollywood film directed by Prasanth Mambully directed was released today and it has landed itself in a big controversy.\nScreengrab\nReports claim that Boney Kapoor has already issued a legal notice to the makers for the evident similarities between the trailer and his wife Sridevi's actual life.\nFrom the name to the last scene in the trailer, where the lead actress is seen inside the bathtub, the similarities are too prominent to be ignored.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nConfirming the same to an online portal, Mambully said, “We received a legal notice from Mr Boney Kapoor last week. And we will face it. My film is a suspense thriller. I told him (Boney Kapoor) that Sridevi is a common name. My film’s character also happens to be an actress. We will face it.”\nThat's not all. Even people on the internet are giving the film a big thumbs down for being 'sleazy' and 'disgusting'.\nI’m shocked and deeply saddened by the insensitivity of filmmaker’s who made a film on Sridevi’s tragic death, #SrideviBungalow shd never get released,how can the actors and makers even think of cashing on Sridevi’s tragic death ..Boneyji r u listening it’s insane. — officiallyNADZ (@naughtiestnadz) January 15, 2019\nUtter nonsense and cheap trailer. Such a disrespect to the departed soul #Sridevibungalow — Kritika Jain (@Happy_ladki) January 15, 2019\nIn this disgusting film u tried to show #Sridevi as a lonely person and pathetic but the fact that Sri hated to be alone and her family was always beside her and in another shot u tried to show her smoked cigar and this was the most thing she hated. Shame on u😡 #SrideviBungalow pic.twitter.com/nMFYFrM1JT — N_KH∇🌟 (@NK_Alh7) January 15, 2019", "title": "Calling It A 'Sleazefest', Internet Slams The Trailer Of Priya Varrier's Controversial Film Sridevi Bungalow", "date_publish": "15/01/2019, 17:17:03", "description": "Priya Prakash Varrier might be a popular name thanks to her overnight success after her viral 'wink'. The song 'Manikya Malaraya Poovi' from her Malayalam movie Oru Aadar Love made her an internet sensation. Her popularity must have sky-rocketed after viral wink but the actor is back in the news and not for all the right reasons.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/calling-it-a-sleazefest-internet-slams-the-trailer-of-priya-varrier-s-controversial-film-sridevi-bungalow-360463.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sridevi_1547554876_800x420.jpg"}