{"text": "The people in Sri Lanka were in a mood to celebrate. Worshippers gathered at Roman Catholic churches across the country to celebrate Easter Mass, the culmination of Holy Week, but a wave of explosion rocked the worshippers.\nAround 8:45 am, eight bombing attacks at, at least three churches, took the lives of more than 207 people injuring 400 others at churches and hotels, according to BBC. Hotels including Shangri-La, Kingsbury, Cinnamon Grand and another one were also hit. Police have arrested three people so far, according to theguardian.com. People all over the world are in a state of shock.\nCelebrities are appealing for swift action from authorities and appealing for peace.\nExtremely sad at the news of bombings in Sri Lanka. It’s unfortunate that one is not able to see that violence is like a chain reaction. This has to stop ! — Jacqueline Fernandez (@Asli_Jacqueline) April 21, 2019\nPrayers for SriLanka 🙏🏽 https://t.co/bY1EI3AsHP — Vicky Kaushal (@vickykaushal09) April 21, 2019\nDon't Miss 166 SHARES 6.4 K SHARES 6.8 K SHARES 2.2 K SHARES 14.9 K SHARES\nShocked to hear the extremely disturbing news coming in from #SriLanka. Had stayed at the hotels & it‘s heartbreaking to even imagine the situation.\nMy heartfelt condolences to the near & dear ones of those who lost their lives & praying for a speedy recovery of the ones injured. — Boman Irani (@bomanirani) April 21, 2019\nMy heartfelt condolences & prayers are with the families affected in #Srilanka. Here's praying & hoping for a terror free world! — Sidharth Malhotra (@SidMalhotra) April 21, 2019\nWhat a sad day !! To attack families and children going to church on #EasterSunday ??!!! This is terrible ... what is happening to our world ??? #SriLanka — Huma Qureshi (@humasqureshi) April 21, 2019\nReally disturbed to hear about the monstrous attack in #SriLanka on such an auspicious day. My thoughts and prayers to the families of the affected ❤ — Arjun Kapoor (@arjunk26) April 21, 2019\nSaddened to hear about the terror attacks in various parts of Sri Lanka. Strongly condemn these acts of terror. Hatred and violence will never overpower love, kindness and compassion. 🙏🏻 #SriLanka — Sachin Tendulkar (@sachin_rt) April 21, 2019\nStay strong #SriLanka!!\nThoughts and prayers. 🙏 — Abhishek Bachchan (@juniorbachchan) April 21, 2019\nWhat is happening to this world 😞😞May God help us all .. really .. #SriLanka — Sania Mirza (@MirzaSania) April 21, 2019\nCould never have thought a quiet country like #Srilanka could be attacked like this. What is the world coming to? Thinking of all the families affected. All my love and prayers always ... — Parineeti Chopra (@ParineetiChopra) April 21, 2019", "title": "Celebs Condemn Bomb Blasts That Shook Sri Lanka Amid Easter Celebrations, Offer Condolences", "date_publish": "21/04/2019, 19:11:04", "description": "It was just another day for people in Sri Lanka. They were in the mood to celebrate. Worshippers gathered at Roman Catholic churches across the country to celebrate Easter Mass, the culmination of Holy Week, but a wave of explosion rocked the worshippers. Around 8:45 am, eight bombing attacks at, at least three churches, took the lives of more than 207 people injuring 400 others at churches and h", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs-condemn-bomb-blasts-that-shook-sri-lanka-amid-easter-celebrations-offer-condolences-365858.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/celebs_condemn_bomb_blasts_that_rocked_sri_lanka_amid_eater_celebrations_offer_condolences_1555853449_800x420.png"}