{"text": "Aamir said, \"What I like most about this festival is the gambling (laughs)! I’m a reckless gambler. I love it but do it (play cards) only once during this time of the year. I like poker and I’m looking forward to playing it.\"\nHer rumoured boyfriend Rohman Shawl has been spending the Diwali week with her and Sushmita has kind of introduced him on social media as well\nDrake wrote, \"Happy birthday to my Shetty a true Goddess. Guess who is watching Mubakaran 3 times on the tour bus in your honour.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThat's not all, his wishes also included 'heart' emojis that might again spark dating rumors around the two of them.\nThe couple has managed to get into the spotlight after paps clicked them exiting from a cafe in Bandra. Whether it was a date or not, it's difficult to decode but the way Arjun shielded Malaika from the photographers and the crowd was indeed chivalrous and sweet! Have a look at the pictures.\nVictoria Beckham, who won't be a part of it, has sent the rest of her former bandmates love and luck for the shows. \"I won't be joining my girls on stage again but being in the Spice Girls was a hugely important part of my life and I wish them so much love and fun as they go back on tour next year,\" Beckham posted on Instagram, reported eonline.com.", "title": "Celebrities Celebrate Diwali With Friends And Family And More From Ent World", "date_publish": "07/11/2018, 15:35:54", "description": "Aamir said, \"What I like most about this festival is the gambling (laughs)! I’m a reckless gambler. I love it but do it (play cards) only once during this time of the year. I like poker and I’m looking forward to playing it.\" Sushmita Sen Kick-starts Diwali Celebrations With Daughters And Rumoured Boyfriend Rohman Shawl", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/celebrities-celebrate-diwali-with-friends-and-family-and-more-from-ent-world-356236.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/diwali_1541585628_800x420.jpg"}