{"text": "1. Celebrities Take The Viral '10 Year Challenge' And The Results Will Inspire You To Take It Too\nHere's taking a look at 25 such celebrities who took the 10 year challenge that is going viral on the internet right now and proved that age is just a number. Seriously, they are only becoming better with age. Starting with Bollywood stars, check out their then and now.\n2. As A Mark Of Respect On Army Day, The Makers Of 'Uri' Donate 1 Crore To Army Widows\nOn the occasion of Army Day, on 15th of January, the entire team of Uri including Vicky Kaushal, Yami Gautam, and the director of Uri, Aditya Dhar attended the parade in Delhi.\n3. Raageshwari Supports Rajkumar Hirani After Sexual Assault Allegations, Calls Him The Most Cultured Man\nDon't Miss 185 SHARES 460 SHARES 870 SHARES\n“After knowing Raju for almost 20 years, I can safely say that he is amongst the most cultured, refined and peerless man I have met in the film industry. I’m not speaking as an actress cementing bonds, hence I speak with utmost honesty and with zero agenda here. I speak as a family friend and most importantly, as a woman,” she was quoted as saying by TOI.\n4. Ranveer Singh Jokes About Taking His Wife Deepika Padukone’s Last Name, Calls It A 'Legendary Surname'\nWhen Ranveer Singh was asked about how Deepika joked that he is getting a new surname, he laughed it off saying, “Since I have dropped my surname, I need a new one, so why not! It’s a legendary surname.”\n5. Mela Actor Faissal Khan Looks Like A Carbon Copy Of His Brother Aamir Khan & Everyone’s Stunned\nFaissal Khan is all set to make his Bollywood comeback. He will be seen in a film called Factor. It is said that he will be lending his voice to a romantic song titled Ishq Tera as well.", "title": "Celebs Take '10 Year Challenge', Makers Of 'Uri' Donate 1 Crore To Army Widows & More From Ent", "date_publish": "16/01/2019, 17:48:00", "description": "From Bollywood celebrities taking #10YearChallenge to makers of Uri The Surgical Strike donating Rs 1 crore to army widows, here’s all that rocked the world of entertainment today. On the occasion of Army Day, on 15th of January, the entire team of Uri including Vicky Kaushal, Yami Gautam, and the director of Uri, Aditya Dhar attended the parade in Delhi.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs-take-10-year-challenge-makers-of-uri-donate-1-crore-to-army-widows-more-from-ent-360538.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/celebs_take_10_year_challenge_makers_of_uri_donate_1_crore_to_army_widows__more_from_ent_1547641140_800x420.png"}