{"text": "We all have been waiting for Game Of Thrones season 8 with bated breath ever since the last episode of Season 7 was aired, which seems ages ago now.\nScreengrab\nJust 24 hours and the wait will be over. The finale will air on April 14 in the US, which is early morning on April 15 for Indian viewers. The excitement level of fans is rising every hour now. We have watched the re-runs and we are all set to know who wins the game of ice and fire.\nScreengrab\nMaking a desi version of Game Of Thrones, Lilly Singh AKA Superwoman has made a hilarious spoof recently. From Cersei & Jamie Lannister celebrating Rakshabandhan to Jon Snow AKA Jatinder Snow dancing on Malhari, this one is will crack you up. Take a look!\nDon't Miss 159 SHARES\nOn the other hand, singer Shalmali Kholgade, known for lending voice to songs including Balam Pichkari, Pareshan and Lat Lag Gayi among others, also paid a tribute to the show which is coming to end post this season.\nScreengrab\nShe has released her version of the Game Of Thrones theme song and it will amp up your excitement level!\nAll Indian Game Of Thrones fans, are you ready to wake up early tomorrow to watch season 8 of the biggest show ever Game Of Thrones?", "title": "Cersei-Jamie Celebrating Rakhi To Jon Snow's Malhari Dance, This Desi GoT Spoof Is Everything!", "date_publish": "14/04/2019, 11:43:39", "description": "Making a desi version out of Game Of Thrones, Lily Singh AKA Superwoman has made a hilarious spoof recently. From Cersei & Jamie Lannister celebrating Rakshabandhan to Jon Snow AKA Jatinder Snow dancing on Malhari, this one is will crack you up. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/cersei-jamie-celebrating-rakhi-to-jon-snow-s-malhari-dance-this-desi-got-spoof-is-everything-365411.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/cerseijamie_celebrating_rakhi_jon_snow_dancing_on_malhari_lily_singhs_desi_game_of_thrones_spoof_1555221609_800x420.png"}