{"text": "Chaiyya Chaiyya With SRK To Jumma Chumma With Big B, DeepVeer Partied Like Rockstars Last Night\nChaiyya Chaiyya With SRK To Jumma Chumma With Big B, DeepVeer Partied Like Rockstars Last Night\nRanveer Singh and Deepika Padukone’s Mumbai reception for friends from the showbiz took place last night, and it was one crazy affair full of fun, frolic and madness.\nThe star-studded party of DeepVeer brought together the biggest Bollywood stars including Amitabh Bachchan, Shah Rukh Khan, Sanjay Dutt, Kareena Kapoor, Katrina Kaif, Rekha, Jaya Bachchan, Vicky Kaushal, Rajkummar Hirani, and many more under the same roof.\nRanveer Singh and Deepika Padukone were in the party mode as they posed for the paps before the party began. These pictures defined all the craziness and mad fun that went down last night.\nVoral Bhayani\nA lot of celebrities made heads turn as they walked in to attend the crazy bash of the much-in-love couple. Katrina Kaif turned out to be a vision in white, Farhan Akhtar walked hand-in-hand with rumoured girlfriend Shibani Dandekar, Munna Bhai and Circuit reunited, Katrina Kaif attended the bash too – there’s a lot that grabbed a lot of eyeballs last night.\nAnd then the real party began. Every woman’s dream man, Ranveer Singh proclaimed last night that he is one “obedient husband” and will always listen to what his better half says.\nDon't Miss 185 SHARES 343 SHARES 460 SHARES 544 SHARES 814 SHARES\n“The key to success in life is to yes to everything she says… So when baby says ‘babe change the vibe of the music’, I have to oblige… babe this one is for you!”\nRanveer Singh was high on happiness. So much so, that he showcased his inner Bollywood buff, flaunted his high-voltage dance moves and pulled everyone to the dance floor.\nHe made the legendary Amitabh Bachchan groove with him on Jumma Chumma! Yeah, only Ranveer Singh can do that!\nWhat’s more? He even recreated the iconic Chaiyya Chaiyya with Shah Rukh Khan and Malaika Arora.\nDeepika Padukone also partied like a boss on Disco Dancer.\nNot only did he dance, but Ranveer Singh also sang at his party! While last time he took over the DJ console at his reception, in this one, he turned into a rapper.\nLetting bygones be bygones, Katrina Kaif also arrived at the DeepVeer's reception!\nYo Yo Honey Singh was also seen at the bash!\nIt was fun, laughter and happiness!\nIt was a certainly a night to remember!", "title": "Chaiyya Chaiyya With SRK To Jumma Chumma With Big B, DeepVeer Partied Like Rockstars Last Night", "date_publish": "02/12/2018, 11:35:39", "description": "Ranveer Singh and Deepika Padukone’s Mumbai reception for friends from the showbiz, and it was one crazy night full of madness. The star-studded party of DeepVeer brought together the biggest Bollywood stars including Amitabh Bachchan, Shah Rukh Khan, Sanjay Dutt, Kareena Kapoor, Katrina Kaif, Rekha, Jaya Bachchan, Vicky Kaushal, Rajkummar Hirani, and may more under the same roof.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/chaiyya-chaiyya-with-srk-to-jumma-chumma-with-big-b-deepveer-partied-like-rockstars-last-night-357762.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/chaiyya_chaiyya_with_srk_to_jumma_chumma_with_big_b_deepveer_partied_like_rockstars_last_night_1543728135_800x420.png"}