{"text": "It took 20 years for this reunion, but it’s never too late. The Charlie’s Angels Cameron Diaz & Drew Barrymore reunited at Luci Lui’s Hollywood Walk Of Fame Ceremony and it’s a big deal for the fans. The trio was getting clicked together after such a long time and it was indeed full of nostalgia.\nTwitter\nTake a look at how these ladies are having a gala time together. Isn’t this a perfect picture frame?\nLuci Liu who was honored for the Hollywood Walk Of Fame looked extremely happier the company of the girls. Both Cameron and Drew said she totally deserves this honor, and they cannot think of anyone else to receive this honour other than her. Their friendship and bond has been intact since 20 years and definitely, they are giving us friendship goals and how.\nLucy Liu, Cameron Diaz, and Drew Barrymore pose with Lucy Liu's star on the Hollywood Walk of Fame pic.twitter.com/zpdEXvkPXp — Variety (@Variety) May 1, 2019\nDon't Miss 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhile receiving this honour Luci said, “Sometimes people talk about my mainstream successes as groundbreaking for an Asian, but Asians have been making movies for a long time. We just weren’t making them here because we weren’t invited to the table.”\nTwitter\nShe continued, “If my body of work somehow helped bridged the gap between the stereotypical roles first given to Anna May and mainstream success today, I’m thrilled to have been part of that process”. She even gave a shoutout to the girls who cheered for her, “My dear Angels, it’s a 20-year reunion”.\nCameron Diaz, Drew Barrymore, and Demi Moore cheer on Lucy Liu as she takes the stage at her Hollywood Walk of Fame star ceremony pic.twitter.com/xy2W3tsIs8 — Variety (@Variety) May 1, 2019\nIt’s definitely a surreal moment for fans.", "title": "Charlie’s Angels Cameron Diaz & Drew Barrymore Reunite At Luci Lui’s Hollywood Walk Of Fame Ceremony", "date_publish": "03/05/2019, 14:51:51", "description": "It merely took 20 years for this reunion, but it’s never too late. The Charlie’s Angels Cameron Diaz & Drew Barrymore reunited at Luci Lui’s Hollywood Walk Of Fame Ceremony and it’s a big deal for the fans, as the trio were getting clicked together after such a longgg time and it’s was indeed full of nostalgia. Take a look at how these ladies are having a gala time together. Isn’t this the perfec", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/charlie-s-angels-cameron-diaz-drew-barrymore-reunite-at-luci-lui-s-hollywood-walk-of-fame-ceremony-we-couldn-t-be-happier-366556.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/cameron_diaz_1556875843_800x420.jpg"}