{"text": "Chhapaak Will Be A Tight Slap On The Attacker's Face, Says Acid-Attack Survivor Laxmi Agarwal\nChhapaak Will Be A Tight Slap On The Attacker's Face, Says Acid-Attack Survivor Laxmi Agarwal\nWith Chhapaak, Deepika Padukone isn't just turning a producer for the first time but she is all geared up to tell a story that's brave in every sense of the word. Padukone began shooting for the film in March and she flew down to Delhi with the crew. DP has been in Delhi and several videos from her shooting found its way on the internet.\nIn the film, Deepika will be seen playing the role of acid attack survivor Laxmi Agarwal and the film is being directed by Meghna Gulzar.\nLaxmi, who has been lauded for her journey in life after the incident that changed her life, she spoke to the Times Of India, where she opened up about her feelings regarding the film.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTalking about the film, she said,\n\"I have never won a medal in school. Who would have thought about a biopic being made on me? I am thankful to Meghna Ji for considering my work worthy enough to be converted into a film.\"\nShe added that the film will be like a tight slap on her attacker's face. She added,\n\"I am also elated that a celebrity like Deepika is playing me. I just want to say that this film will be a tight slap on that attacker who thought he has ruined my life and to the society who looked at me like a criminal.\"\nShe also explained how she felt when the first look of the film was out. She had said,\n\"I saw a lot of makeup artists on social media recreating Deepika's look from the film. Unhone vaisa makeup karke apni photos mujhe bheji hui hain. Kabhi socha nahi tha ki ek acid-attack survivor ke face ko bhi log recreate karenge.\"\nThe film is already being touted as one of the most promising films and Meghna Gulzar is targeting an early January release in 2020.", "title": "Chhapaak Will Be A Tight Slap On The Attacker's Face, Says Acid-Attack Survivor Laxmi Agarwal", "date_publish": "20/04/2019, 14:36:28", "description": "With Chhapaak, Deepika Padukone isn't just turning a producer for the first time but she is all geared up to tell a story that's brave in every sense of the word. Padukone began shooting for the film in March and she flew down to Delhi with the crew. DP has been in Delhi and several videos from her shooting found its way on the internet.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/chhapaak-will-be-a-tight-slap-on-the-attacker-s-face-says-acid-attack-survivor-laxmi-agarwal-365807.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/chhapaak_1555753855_800x420.jpg"}