{"text": "Kabir Khan's upcoming film 83 is turning out to be an ambitious project. While Ranveer Singh has been roped in to play the role of Kapil Dev, former cricketer Sandeep Patil's son Chirag Patil too is on-board for the film. Reports have confirmed that Chirag play the role of his father in the film.\n(Also read: Deepika Padukone Offered The Role Of Ranveer Singh's Onscreen Wife In Kapil Dev's Biopic '83')\nJust to jog your memory a little, Sandeep was a middle-order batsman of Team India.\nChirag is an actor and has acted in Marathi and Hindi films. Confirming the reports, he spoke to media and said,\nTwitter\n“I’m really excited, the ’83 World Cup win is considered a milestone in Indian history and to be a part of that team is a dream come true and playing my father who’s my hero is just awesome. I don’t think any actor has ever played his father on screen, I’m a first.\"\nEven though his father was into Cricket, Chirag confirmed that he himself has never played cricket professionally and that made him a little hesitant to take up the role. He added,\nDon't Miss 185 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“Ballu uncle (Balwinder Sandhu) and his team have been training us since August. I also took some training sessions at Chandrakant Pandit’s Cricket Academy (CPCC) whenever free time. The best cricket coach in India stays in my house and that’s a big help. Right now the focus is to train well and get my father’s style right.” And after that-Sachin Tendulkar had once told me, 'Give your best and leave the rest to God.' I follow that philosophy.\"\nApart from Chirag, Punjabi actor and Ammy Virk too was roped in for the project and he will be playing the role of Balwinder Singh Sandhu. It is supposed to be Virk’s Bollywood debut.\n(Also read: Kapil Dev To Train Ranveer Singh For His Biopic '83', Preparations Begin On Full Swing!)", "title": "Chirag Patil Roped In To Play His Father Sandeep Patil's Role In Ranveer Singh Starrer '83'", "date_publish": "04/02/2019, 15:40:47", "description": "Kabir Khan's upcoming film 83 is turning out to be an ambitious project. While Ranveer Singh has been roped in to play the role of Kapil Dev, former cricketer Sandeep Patil's son Chirag Patil too is on-board for the film. Reports have confirmed that Chirag play the role of his father in the film. Just to jog your memory a little, Sandeep was a middle-order batsman of Team India.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/chirag-patil-roped-in-to-play-his-father-sandeep-patil-s-role-in-ranveer-singh-starrer-83_-361561.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/83_1549277673_800x420.jpg"}