{"text": "Chitrangda Singh who had reportedly walked out of Nawazuddin Siddiqui starrer Babumoshai Bandookbaaz has once again spoken of the harassment she had to face on the sets of the 2017 movie. If reports are to be believed, Chitrangda was asked to “take off her sari, get on top of her hero and rub herself”. She protested, spoke about it, but in the end, she had to bear the brunt as she was declared “troublesome” and “moody”, she said.\nOnce again, talking about the incident to Bollywood Hungama, Chitrangda Singh said that Nawazuddin Siddiqui didn’t take a stand for her. She said instead of extending support to her, he waited for the storm to blow over.\nfirstpost.com\n“I pleaded that this was not in my comfort zone. I said I was wearing only a petticoat underneath the saree. The director told me not to fuss and just do what was required. I was intimidated, bullied and threatened into doing it. Some crew members were mortified. But, Nawaz just sat there waiting for the storm to blow over,” she added.\ntownnews.com\nShe said later Kushan Nandy paid a visit and didn’t even inquire if she was okay. “He didn’t ask me if I was okay. He just asked, ‘Are you doing the scene?’ I said no. He left. Nawaz could’ve taken a stand against my harassment. He didn’t. When empowered men in the film industry do not take a stand, the harassers feel encouraged,” she said.\nPointing out that Bidita Bag was soon roped in for the role, she said the women in the industry need to join hands and extend support to each other.\nDon't Miss 193 SHARES 769 SHARES 12.5 K SHARES 5.5 K SHARES", "title": "Chitrangada Singh Shares Her #MeToo Story, Says Nawazuddin Didn’t Take A Stand For Her When She Was Harassed Two Years Ago", "date_publish": "16/10/2018, 10:40:11", "description": "Chitrangda Singh, who had reportedly walked out of Nawazuddin Siddiqui starrer Babumoshai Bandookbaaz has once again spoken of the harassment she had to face on the sets of the 2008 movie. If reports are to be believed Chitrangda was asked “take off her sari, get on top of her hero and rub herself”. She protested, spoke about it, but in the end she had to bear the brunt as she was declared “troubl", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/chitrangada-singh-shares-her-metoo-story-says-nawazuddin-didn-t-take-a-stand-for-her-when-she-was-harassed-two-years-ago-354851.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/chitrangada_singh_says_nawazuddin_siddiqui_didnt_take_a_stand_for_her_when_she_was_harassed_1539666678_800x420.png"}