{"text": "After 11 years and 21 movies, Marvel Cinematic Universe will never be the same. It will mark the end of phase three in the Marvel Cinematic Universe. A lot of actors will retire from their roles. So, basically, it’s a very big deal.\nAlso Read: And The Frenzy Begins! People Are Selling Avengers: Endgame Tickets On eBay For Rs 6,35,260\nReuters\nNot only the fans are sad, but it’s quite an emotional moment for the cast of the movie too. Just imagine how it would have been shooting on the last day. Mark Ruffalo (Hulk) and Chris Evans (Captain America) recently spilled beans on the emotional last day of the shoot.\nReuters\nEight years after first playing Captain America, Chris Evans had an emotional last day. “I was pretty teary-eyed. It has nothing to do with the plot. It's just the fact that it's the culmination of a really long endeavour. It wraps up the journey for a lot of the characters,” he was quoted as saying in an interview with AP.\nWhen asked as to who was most emotional on the sets, Mark Ruffalo said, “That was probably Scarlett. She usually gets really emotional.”\n“Bring a box of Kleenex and a diaper,” Ruffalo said on Good Morning America.\nDon't Miss 264 SHARES 233 SHARES 583 SHARES 4.3 K SHARES 4.3 K SHARES\nTalking about his heartwarming goodbye to the movie and his role in a tweet, which had sent the fans into a tizzy, here’s what he said:\n“It is the end of a 22, 21 movie tapestry, a 10-year process. This has been an enormous part of my life, it’ll follow me till the day I die. And when you think about it, it’s easy to get emotional about it. You try to prepare yourself for the completion and the day came and it was more than I thought it was gonna be. I was really, really beside myself. It just, it got me. I’m an emotional guy.”\n“this has been an enormous part of my life and it’ll follow me til the day i die” i’m SOBBING, it was so hard for chris to say goodbye to playing cap. this role for the past 10 years means so much to him and it really shows pic.twitter.com/aIyGd4JVLq — ariana (@capsheroes) April 8, 2019\nAvengers: Endgame is releasing in India on April 26.\nAlso Read: Marvel Officially Screened 10 Minutes Of Avengers: Endgame & Internet Is Brimming With Spoilers", "title": "Chris Evans Recalls The ‘Emotional’ Last Day On Avengers Endgame Sets, Says ‘I Was Teary-Eyed’", "date_publish": "09/04/2019, 12:02:58", "description": "Not only the fans are sad, but it’s quite an emotional moment for the cast of the movie too. Just imagine how it would have been shooting on the last day. Mark Ruffalo (Hulk) and Chris Evans (Captain America) recently spilled beans on the emotional last day of shoot.After 11 years and 21 movies, Marvel Cinematic Universe will never be the same. It will mark the end of phase three in the Marvel Cin", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/chris-evans-recalls-the-emotional-last-day-on-avengers-endgame-sets-says-i-was-teary-eyed-365101.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/chris_evans_gets_emotional_about_avengers_endgame_says_he_got_teary_eyed_shooting_on_the_last_day_1554792863_800x420.jpg"}