{"text": "Christian Bale Takes Home First Best Actor Golden Globe, Thanks Satan For The Inspiration\nChristian Bale Takes Home First Best Actor Golden Globe, Thanks Satan For The Inspiration\nIn a first, Christian Bale won the award for Best Actor in a Musical or Comedy Golden Globe award for his performance as Dick Cheney in \"Vice\" and thanked \"Satan\" for inspiring him to play the role of the former US vice president. Known for transforming himself physically to get under the skin of his characters, the actor gained over 40 pounds and bleached his eyebrows for Adam McKay's political satire.\nBale, 44, thanked McKay for casting him to play someone who was \"absolutely charisma-free and reviled by everybody\".\nReuters\nHe joked that from here on out, he will be \"cornering the market\" on playing \"charisma-free a**holes,\" adding, \"What do you think, Mitch McConnell (politician) next?\"\n\"Thank you to Satan for giving me inspiration on how to play this role,\" he added.\nAgencies\nIt was Bale's fourth Globe nomination. He has previously won Best Supporting Actor in 2011 for \"The Fighter\".\n\"Thank you to Satan for giving me inspiration on how to play this role.\" - Christian Bale with the official 2019 mood 😂😂#GoldenGlobes pic.twitter.com/sUM1PMyLZn — UPROXX (@UPROXX) January 7, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe actor beat out Lin-Manuel Miranda for \"Mary Poppins Returns\", Viggo Mortensen for \"Green Book\", Robert Redford for \"The Old Man and the Gun\", and John C Reilly for \"Stan & Ollie\". This is how the internet reacted to the speech. His 'fake' British accent didn't go down too well with people it seems!\nI am surprised by Christian Bale’s accent every award season. — Shantel Gabrieal Buggs, Ph.D. (@sgbuggs) January 7, 2019\nno British person has ever seemed like they are doing a terrible fake British accent as much as Christian Bale — Helena Fitzgerald (@helfitzgerald) January 7, 2019\nWow. Literally none of you knew that Christian Bale was Welsh. Like. First of all, an male American actor who ACTS? And with those teeth? Honey. Please. — Brandon (@brandonlgtaylor) January 7, 2019\nRT IF YOU FORGOT CHRISTIAN BALE HAD A BRITISH ACCENT — Anne T. Donahue (@annetdonahue) January 7, 2019\nChristian Bale's accent always throws me off lmfaoooo — nicole will write for money (@NicoleFroio) January 7, 2019\nI feel like if you drop Christian Bale's accent in water you get a fully grown Michael Caine — Sady Doyle (@sadydoyle) January 7, 2019\n(With agency inputs)", "title": "Christian Bale Takes Home First Best Actor Golden Globe, Thanks Satan For The Inspiration", "date_publish": "07/01/2019, 11:08:55", "description": "Christian Bale won his first Best Actor in a Musical or Comedy Golden Globe award for his performance as Dick Cheney in \"Vice\" and thanked \"Satan\" for inspiring him to play the role of the former US vice president. Known for transforming himself physically to get under the skin of his characters, the actor gained over 40 pounds and bleached his eyebrows for Adam McKay's political satire.", "authors": [], "url": "https://www.indiatimes.com/entertainment/christian-bale-takes-home-first-best-actor-golden-globe-thanks-satan-for-the-inspiration-359957.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/christian_bale_1546840236_800x420.jpg"}