{"text": "For the uninitiated, Marvel's God of Thunder and man of several women's dreams, Chris Hemsworth is in India. He is shooting for his Netflix debut movie with Manoj Bajpayee and Randeep Hooda. And looks like he is having a ball!\nHe recently posted a picture with kids on a street, along with a beautiful caption that read, \" Beyond thankful for the kindness and generosity that the people of India have extended to us while making our little film here.\"\nAnd guess who left a funny comment on the picture? Ranveer Singh!\nHollywood star Chris Hemsworth was overwhelmed when he saw cars, auto-rickshaws and bikes criss-crossed causing a traffic jam in front of his car - a scene he described as a 'beautiful chaos'. Nevertheless, he has expressed gratitude for the love he has received in the country.\nIn one image, he is seen clicking a selfie with the crowd, and in the other, he is warmly holding hands with some children.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nHemsworth, who famously plays Thor, is in India to shoot Netflix film Dhaka. An Instagram story shared by him on Sunday night shows him panning the camera from the backseat of his car, to show the scene outside the window.\n'Beautiful chaos', he wrote along with his first Story in which he is also heard imitating the cacophony of horns by saying: \"beep beep.\"\nIn another video captioned 'Traffic is flowing', he says, \"It's a good system this one... Here we are in the intersection, and no one is really moving, except our car going on the wrong side of the road... What is happening? Oh, the tuk tuks are out... The horns are on.\"\nHemsworth flew to India last week and started shooting for Dhaka on November 3. He even shared some glimpses from on and off the sets with his Instagram followers.\nHe especially loved the 'welcome package' in his hotel room. It included an edible chocolate picture frame with his Thor look and a chocolate version of Thor's iconic hammer.\nThe actor is also likely to shoot in Mumbai. The film is reportedly an action movie in which he plays a character who has to liberate a kidnapped Indian boy. Physically brave but an emotional coward, the man has to come to terms with his identity and sense of self.\nWith inputs from IANS", "title": "Chris Hemsworth Calls India's Traffic 'Beautiful Chaos' As He Shoots For A Film In Ahmedabad", "date_publish": "05/11/2018, 18:17:44", "description": "Hollywood star Chris Hemsworth was overwhelmed when he saw cars, auto-rickshaws and bikes criss-crossed causing a traffic jam in front of his car here -- a scene he described as a \"beautiful chaos\". Nevertheless, he has expressed gratitude for the love he has received in the country.", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/chris-hemsworth-calls-india-s-traffic-beautiful-chaos-as-he-shoots-for-a-film-in-ahmedabad-356109.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/chris_hemsworth_calls_traffic_in_india_a_beautiful_chaos_as_he_shoots_for_a_film_in_ahmedabad_1541420304_800x420.png"}