{"text": "Citing Piracy As A Legit Reason, Tigmanshu Dhulia Says Indian Films Should Never Release In Pak\nCiting Piracy As A Legit Reason, Tigmanshu Dhulia Says Indian Films Should Never Release In Pak\nCiting piracy as a reasonable reason, filmmaker Tigmanshu Dhulia says his upcoming Milan Talkies will not release in Pakistan. He believes Indian films should never be screened in the neighbouring country, since it is one of the hubs of piracy.\nIn the aftermath of Pulwama terror attack, which claimed the lives of at least 40 CRPF personnel, the makers of several upcoming projects including Total Dhamaal, Luka Chuppi, Arjun Patiala, had announced that they will not be releasing the films in Pakistan.\nWhen asked if he plans to release the film in Pakistan, Tigmanshu told reporters,\nTwitter\n\"No, it will not release in Pakistan. For two reasons. First, we stand in solidarity. Second, piracy originates from Pakistan. So, we should never release our films there, irrespective of any reasons.\"\nHe was present at the trailer launch of his upcoming film and the movie stars Ali Fazal, Shraddha Srinath, Sikander Kher and Ashutosh Rana, among others.\nWhen asked for his take on the ban on Pakistani artiste, the filmmaker said it should stay as of now.\nDon't Miss 8.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n\"Right now, there should be a ban considering the situation. When the situation gets better, we will open our arms.\"\nAli Fazal said right now everyone has become an expert on how to solve the crisis but one must trust the Army.\n\"During demonetisation, we all had become an economist. I think we should trust the Army. They are doing their job. We have a great army and we should stand in solidarity.\"\nWritten by Tigmanshu and Kamal Pandey, the film is scheduled to release on March 15.\n(With agency inputs)", "title": "Citing Piracy As A Legit Reason, Tigmanshu Dhulia Says Indian Films Should Never Release In Pak", "date_publish": "20/02/2019, 17:44:48", "description": "Citing piracy as a reasonable reason, filmmaker Tigmanshu Dhulia says his upcoming Milan Talkies will not release in Pakistan. He believes Indian films should never be screened in the neighbouring country, since it is one of the hubs of piracy. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/citing-piracy-as-a-legit-reason-tigmanshu-dhulia-says-indian-films-should-never-release-in-pak-362500.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/tigmanshu_1550662365_800x420.jpg"}