{"text": "1. Comedian Aditi Mittal Issues Apology For 'Jokingly' Kissing Kaneez Surka Without Her Consent\nFemale comedian Kaneez Surka took to Twitter to reveal that she was “forcefully kissed” by her fellow comedian Aditi Mittal, in front the audience during the show. She accused that she put her tongue inside her mouth. All this happened without her consent, she said.\n2. Kangana Ranaut Targets Hrithik Roshan Once Again, Insists That No One Should Work With Him\n“People who keep their wives as trophies and keep young girls as their mistresses should also be punished,” she told Zee News in an interview.\n3. After Vinta Nanda & Sandhya Mridul, Deepika Amin Accuses Alok Nath Of Harassment, IFTDA Issues Notice\nDon't Miss 193 SHARES 862 SHARES 126 SHARES\nTaking to Twitter, Deepika wrote, \"Everyone in the industry knows that #AlokNath is an obnoxious drunkard who harasses women. Years ago on a telefilm outdoor shoot he tried to barge into my room. He slobbered over women, drunk and created a scene. The unit rallied around me and made sure I was safe. #metoo\n4. Aamir Khan Opts Out Of Gulshan Kumar Biopic Due To Sexual Abuse Allegations Against Director\nYesterday, Aamir Khan also announced his departure from upcoming project saying that he has been informed of “sexual misconduct” on the part of a collaborator.\n5. Tanushree Dutta Finally Records Her Statement, Files FIR Against Nana Patekar & Others\nIn a new development, Tanushree who has been vocal about Nana's misconduct on that film's sets, has now finally filed FIR against him. Not only Nana, but the FIR has also been lodged against director Rakesh Sarang, choreographer Ganesh Acharya and producer Sami Siddiqui for being witnesses and not taking a stand.", "title": "Comedian Aditi Mittal Issues Apology, Kangana Ranaut Targets Hrithik Roshan & More From Ent", "date_publish": "11/10/2018, 19:00:45", "description": "The #MeToo movement is going a lasting change, it seems, especially in the entertainment industry. After comedian Kaneez Surka accused Aditi Mittal of “forcefully kissing” her without consent, the latter has issued and apology along with clarification. On the other hand, Kangana Ranaut has once again targeted Hrithik Roshan, and now the actress wants people not work with him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/comedian-aditi-mittal-issues-apology-kangana-ranaut-targets-hrithik-roshan-more-from-ent-354624.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/comedian_aditi_mittal_issues_apology_kangana_ranaut_targets_hrithik_roshan__more_from_ent_1539259444_800x420.png"}