{"text": "Audience at the Bicester bar The Atic continued to laugh at UK comedian Ian Cognito, originally named Paul Barbieri, for about five minutes while he breathed heavily sitting on his chair before collapsing. They thought it was a part of his comedy act. Apparently, they found it funny.\ntimeincuk.net\nShortly after cracking a joke about having a stroke, Ian Cognito died on the stage, and it took five minutes for people to actually figure that he wasn’t joking as he fell silent. When the paramedics arrived, the comedian who was in his early 60s was pronounced dead.\ntribktla.files.wordpress.com\n“He sat down, put his head and arms back; his shoulders were twitching,” mid-way through his act, Ryan Mold, the venue owner, who was also watching Ian Cognito’s performance, told CNN.\nTwitter\nDon't Miss 479 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"Audience thought it was part of his set\" because he had spoken about having a heart attack or a stroke only moments before and his behaviour didn't come off as unusual to those used to his flamboyant character, he added.\nTwitter\nShocked and disheartened by the sad news, several comedians and fans took to the social media to pay a tribute to Ian Cognito, who won an award for Stand-up Comedy in 1999.\nStand up comedian Jimmy Carr took to Twitter and condemned the loss of Cognito. He wrote \"Veteran stand-up comedian Ian Cognito has died on-stage, literally. The audience thought it was part of the act. Died with his boots on. That's a commitment to comedy.”\nVeteran stand-up comedian Ian Cognito has died on-stage - literally. The audience thought it was part of the act. Died with his boots on. That’s commitment to comedy. I’ll never forget his kindness when I started out & how god damn funny he was. — Jimmy Carr (@jimmycarr) April 12, 2019\nI’m absolutely blown away by the tributes today to @TheIanCognito. Reading the memories of other people have of him has helped wring a few smiles out of a shit day. A great comedian but to @WillBarbieri1 and I, the best Dad you could ask for. #IanCognito — Ollie Barbieri (@OllieBarbieri) April 12, 2019\nI am so very sad that comedy has lost one of its most visceral voices, Ian Cognito. He was the King Lear of our circuit. When he was good, he was very very good. When he was bad, he was trying to piss out of the passenger side window on the M5. RIPCogs — John Robins (@nomadicrevery) April 12, 2019\nlooks like I missed a great. Died on stage last night, if you missed my previous post.\nYes, like literally died. Made a joke about having a stroke, then went and sat down on... https://t.co/4y47ogjuDc — Scott Hollingsworth (@SpaiNgaroo) April 12, 2019\n\"I hope when I am gone, that you will remember me for all the things I didn’t do, but could have done so easily\"-@theiancognito\nThank you everyone, my life won't be the same without my best friend and dad. Enjoy that warehouse in the sky, Love and laughter always. #IanCognito — Will Barbieri (@WillBarbieri1) April 12, 2019\nSo shocked to hear about the passing of Ian Cognito a comedian revered by so many other comics. Unpredictable and brilliant. The world has lost an amazing comedian. Rest in peace https://t.co/FOyzYbVkU6 packed several lifetimes into one. Our heartfelt condolences to your family x — Andy Askins (@AndyAskins) April 12, 2019\nI was hosting a night that Ian Cognito headlined, club were strict on finish time. First I reluctantly cut the mic, then the lights, he carried on shouting in the dark! Legend. — Lewis Bryan (@lewisbryan) April 12, 2019\nIan Cognito has passes away. Gigged with him when i first started out and he was always so much fun, had his own mythology on the circuit his exploits where legendary. A true maverick. Hope he’s found somewhere to hang his coat in heaven. — Jack Whitehall (@jackwhitehall) April 12, 2019\nWhat has happened is really sad!\nWith inputs from ANI", "title": "Comedian Ian Cognito Dies Onstage During Performance, Audience Thought It Was A Part Of His Set", "date_publish": "14/04/2019, 12:28:12", "description": "Audience at the Bicester bar The Atic continued to laugh at UK comedian Ian Cognito, originally named Paul Barbieri, for about five minutes as he breathed heavily sitting on his chair before collapsing. They thought it was a part of his comedy act. Apparently they found it funny.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/comedian-ian-cognito-dies-onstage-during-performance-audience-thought-it-was-a-part-of-his-set-365418.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/uk_comedian_ian_cognito_dies_on_stage_during_his_standup_performance_audience_think_he_was_joking_1555224033_800x420.png"}