{"text": "Giving his two cents on #MeToo, Bollywood actor Ajay Devgn has said he was shocked by the #MeToo allegations against some of the prominent names in the Indian film industry but he believes a due course of law should be followed in such cases.\nTalking to PTI, he said,\nTwitter\n\"A couple of things came out and some people are like this but everybody is not like that. I would say some names did shock me but then I can’t be judgmental completely till somebody proves someone guilty or not.\"\nKickstarted by Tanushree Dutta, several A-list Bollywood personalities including directors Rajkumar Hirani, Subhash Ghai, Sajid Khan, Vikas Bahl and Rajat Kapoor, actors Alok Nath, Nana Patekar, singer Kailash Kher and music composer Anu Malik were called out for sexually harassing women over the years.\nAFP\nAjay, who has supported the movement in the past, believes the power game does not work anymore in the industry. “New generation is thinking differently, they are not going to accept the bullshit what people used to accept couple of years back. They are changing and we are changing and that change is for better. With the media coming in, everything is out in the open. “You can’t say ‘I am very powerful and you can’t mess with me’, you cannot mess with anybody as everybody is at the same platform, at the same stage. So big or small doesn’t matter anymore, which is a good thing,” he said.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nEarlier, Ajay had told IANS,\nBCCL\n“I would also like to mention that it is good that many stories are coming out (in the public), but one also has to understand that while most of the accounts are possibly real, some might have taken advantage of the gaining momentum. Therefore, investigation is needed. When people take advantage of the movement, it harms the purpose of the actual cause. Not all people are bad. But if we are only projecting one side, the next generation might get scared to step into the industry. That is why it is important to be responsible.”\n“I’m disturbed by all the happenings with regards to #MeToo. My company and I believe in providing women with utmost respect and safety. If anyone has wronged even a single woman, neither ADF nor I will stand for it.” he tweeted last year.\nI’m disturbed by all the happenings with regards to #MeToo. My company and I believe in providing women with utmost respect and safety. If anyone has wronged even a single woman, neither ADF nor I will stand for it. — Ajay Devgn (@ajaydevgn) October 12, 2018\nSpeaking about the #MeToo movement, Ajay’s wife and actor Kajol, had told NDTV in an interview, “I’ve never seen it but I have heard about it and it’s always in rumour form. You never know it, no one is going to come up to you and say ‘Hey, I did this!’ I don’t know how much of it is actually the truth or not. If it had happened in front of me, I’m sure I would have stood up or done something about it. Never happened to me. I don’t think it would have happened in front of me.”\nOn the work front, the 49-year-old actor will be next seen in “Total Dhamaal” that releases on February 22. He is also working on “De De Pyaar De” with Tabu, “Taanaji: The Unsung Warrior”, “Chanakya” with Neeraj Pandey, a biopic on the legendary football coach Syed Abdul Rahim and a Luv Ranjan’s film with Ranbir Kapoor.\n(With agency inputs)", "title": "Ajay Devgn On MeToo In Bollywood", "date_publish": "11/02/2019, 17:30:22", "description": "Bollywood actor Ajay Devgn has said he was shocked by the #MeToo allegations against some of the prominent names in the Indian film industry but he believes a due course of law should be followed in such cases. A couple of things came out and some people are like this but everybody is not like that. I would say some names did shock me but then I can’t be judgmental completely till somebody proves", "authors": [], "url": "https://www.indiatimes.com/entertainment/commenting-on-metoo-movement-in-india-ajay-devgn-says-some-names-did-shock-him-361975.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ajay_devgn_1549886608_800x420.jpg"}