{"text": "Comparing Pankaj Tripathi To An Ice Cream, Janhvi Kapoor Shares 'Creepy' Details Of Her Equation With Him\nComparing Pankaj Tripathi To An Ice Cream, Janhvi Kapoor Shares 'Creepy' Details Of Her Equation With Him\nAfter Dhadak, Janhvi Kapoor has some interesting projects in her kitty. She is making heads turn with her appearances on the award shows and chat shows, proving she indeed is the star to watch out for.\nJanhvi recently appeared on designer Anaita Shroff Adajania show, Voot’s Feet up with the Stars where she was at her candid best. She confessed that actor Pankaj Tripathi thinks she is a creep. During a conversation with host Anaita Shroff Adajania, she said she has great respect for Pankaj.\nThe daughter of late Sridevi narrated an incident from a party where she heard Pankaj drawing similarities between acting and cooking mutton. Janhvi joined the conversation and expressed her views.\nInstagram\n“Sir, par aap toh ice cream ho, aap sabko pasand ho (You are like an ice cream. Everyone likes you). Right after I said it, he gave me a look,” Janhvi said.\n“He probably thinks I am a creep, but yes I feel he is a legendary actor and there is no one like Pankaj sir. I couldn’t hold back and immediately expressed my fondness for him,” she added.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nOn the film front, Janhvi will be seen in producer Dinesh Vijan’s film Rooh-Afza and Karan Johar’s multi-starrer Takht. She is also said to be working on a biopic of Gunjan Saxena, an Indian Air Force combat pilot, where Pankaj plays her father.\n(With agency inputs)", "title": "Comparing Pankaj Tripathi To An Ice Cream, Janhvi Kapoor Shares 'Creepy' Details Of Her Equation With Him", "date_publish": "06/04/2019, 16:19:13", "description": "Bollywood actor Janhvi Kapoor feels actor Pankaj Tripathi thinks she is a creep. During a conversation with host Anaita Shroff Adajania on an episode of Voot’s Feet up with the Stars, the Dhadak actor said that she has great respect for Pankaj. Read more here.", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/comparing-pankaj-tripathi-to-an-ice-cream-janhvi-kapoor-shares-creepy-details-of-her-equation-with-him-364998.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/janhvi_kapoor_1554549578_800x420.jpg"}