{"text": "Condom Brands Wish Newly Weds Ranveer-Deepika With Quirky Posts, Amul Pays Them A Tribute Too\nCondom Brands Wish Newly Weds Ranveer-Deepika With Quirky Posts, Amul Pays Them A Tribute Too\nIt has been a magical week. Bollywood witnessed a fairytale wedding of the two mega stars. Ranveer Singh and Deepika Padukone tied the knot in a private ceremony in Italy yesterday.\nThe couple who has been dating for the past 6 years planned a stunning all white wedding in the picturesque locales of Lake Como. While we managed to grab our hands on some grainy shots of their wedding, we're still awaiting clearer pictures of the couple.\nAs per reports, the couple is expected to release their wedding snaps at 6 PM today. Meanwhile Bollywood celebrities have been pouring wishes for their favourite couple on social media.\nDon't Miss 7.9 K SHARES 159 SHARES\nTake a look.\nSuch a stunning gorgeous and beautiful couple!!!! Nazar utar lo! @deepikapadukone and @RanveerOfficial !! Badhai ho !!! Love you both!!! Here’s to a lifetime of love and joy!❤️❤️❤️❤️❤️ — Karan Johar (@karanjohar) November 14, 2018\nHeartiest Congratulations to the newly weds @deepikapadukone & @RanveerOfficial - wishing you both a happy married life. 🎉🎉🎊🎊🎉🎉🎊🎉🎊⚡️⚡️ -it’s blissful to see love culminate into marriage. Loads of love & big hug to you guys. — Riteish Deshmukh (@Riteishd) November 14, 2018\nWishing you guys a lifetime of togetherness, love and happiness @deepikapadukone & @ranveerofficial 🎊👩‍❤️‍👨🎊 May this be the best chapter of your life. Make the most of it. God bless! ✨ — Madhuri Dixit Nene (@MadhuriDixit) November 14, 2018\nHeartiest congratulations dearest @RanveerOfficial n @deepikapadukone on ur wedding. The most beautiful couple of this world. May god bless u with all the happiness n love. Love u both 😘😘😘😘😘 #RanveerWedsDeepika pic.twitter.com/wU6HRQbvu6 — KAPIL (@KapilSharmaK9) November 14, 2018\nHuge congratulations @deepikapadukone and @RanveerOfficial !! Here’s to the blissful ever after of every step you walk together... 🤵🏻♥️👰🏻 — Nimrat Kaur (@NimratOfficial) November 14, 2018\nCongratulations Deepika Padukone @deepikapadukone and Ranveer Singh @RanveerOfficial on tying the knot. May God bless both of you with a long and happy married life. #DeepikaWedsRanveer #DeepVeer — URVASHI RAUTELA (@UrvashiRautela) November 14, 2018\nNot only A-listers, condom brands also decided to wish the power couple with fun posts.\nAmul too took to Twitter to wish the superstars.\nWell, that's the kind of love, social media has been showering on the most loved on-screen and off-screen couple, Ranveer and Deepika.", "title": "Condom Brands Wish Newly Weds Ranveer-Deepika With Quirky Posts, Amul Pays Them A Tribute Too", "date_publish": "15/11/2018, 12:00:47", "description": "deepika padukone, ranveer singh, bollywood, couples, a listers, celebritydeepika padukone, ranveer singh, bollywood, couples, a listers, celebritydeepika padukone, ranveer singh, bollywood, couples, a listers, celebritydeepika padukone, ranveer singh, bollywood, couples, a listers, celebritydeepika padukone, ranveer singh, bollywood, couples, a listers, celebritydeepika padukone, ranveer singh, bo", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/condom-brands-wish-newly-weds-ranveer-deepika-with-quirky-posts-amul-pays-them-a-tribute-too-356699.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_1542261122_800x420.jpg"}