{"text": "Well, here's a piece of news that will sadden you and get you excited at the same time. The good news is that there's going to be a brand new installment of Pirates Of The Caribbean. However, the sad news is that this one won't have Johnny Depp in it. Yes, you read that right. As unbelievable as it may sound, Depp has been officially dropped from the reboot of 'Pirates of the Caribbean'.\nDepp, who has played the role of Captain Jack Sparrow in five films across 14 years, would not be a part of the upcoming project - set to be written by Deadpool's Paul Wernick and Rhett Reese.\nThe development was confirmed by Disney's film chief Sean Bailey. In an interview with The Hollywood Reporter, Bailey said, \"We want to bring in a new energy and vitality.\nI love the [Pirates] movies, but part of the reason Paul and Rhett are so interesting is that we want to give it a kick in the pants. And that's what I've tasked them with.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe first 'Pirates' film, 'The Curse of the Black Pearl', hit the big screens in 2003, the most recent movie in the franchise, 'Dead Men Tell No Tales', was released in 2017.\nInputs From ANI", "title": "Confirmed! Pirates of The Caribbean Reboot To Set Sail But The Ship Has Off-Loaded Johnny Depp", "date_publish": "23/12/2018, 18:05:32", "description": "It's confirmed! Johnny Depp has been officially dropped from the reboot of 'Pirates of the Caribbean'. Depp, who has played the role of Captain Jack Sparrow in five films across 14 years, would not be a part of the upcoming project - set to be written by Deadpool's Paul Wernick and Rhett Reese. The development was confirmed by Disney's film chief Sean Bailey. In an interview with The Hollywood Rep", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/confirmed-pirates-of-the-caribbean-reboot-to-set-sail-but-the-ship-has-off-loaded-johnny-depp-359142.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/johnny_depp_dropped_from_pirates_of_the_caribbean_reboot_1545565006_800x420.jpg"}