{"text": "It's Official! Makers Confirm That Thanos Has Retired After 'Avengers: Infinity War'\nIt's Official! Makers Confirm That Thanos Has Retired After 'Avengers: Infinity War'\nAfter giving us Captain America: The Winter Soldier, Captain America: Civil War and then leaving us scratching our heads in Avengers: Infinity War, director duo Joe and Anthony Russo are gearing up for the release of Avengers: Endgame. And fans are pondering over every detail to decode what we’ll see in the movie.\nAlso Read: This Crazy Avengers Endgame Theory Suggests No Hero Really Died & We Totally Want To Believe It\nWe know when Avengers: Infinity War hits the cinema halls, a lot of Marvel fans will be left shattered. Fans will have to bid adieu to their favourite superheroes. But who all, no one has the clarity on that.\nIn a recent interview, Russo brothers, who are otherwise very careful of not revealing any potential spoiler, spilled some detail on the fate of Thanos.\nThey revealed that Thanos has been taking it easy since the day he harnessed the power of the Infinity Stones and wiped out half of the universe.\n\"He's retired… He’s succeeded in the thing he has set out to do. He’s done. He did it,” Joe said in a new interview with Empire Magazine.\nThe director duo also revealed the runtime of Avengers: Endgame.\n“There’s a high probability that this movie will clock in at around three hours. It’s a big movie with a lot of story,” Joe said.\nDon't Miss 4.3 K SHARES 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES\nAlso Read: This Avengers: Endgame Theory Confirms A Shocking Death & We Don’t Want To Believe This", "title": "Infinity War? That’s What Director Duo Russo Brothers Said", "date_publish": "24/12/2018, 18:20:25", "description": "In a recent interview, Russo brothers, who are otherwise very careful of not revealing any potential spoiler, spilled some detail on the fate of Thanos. They revealed that Thanos has been taking it easy since the day he harnessed the power of the Infinity Stones and wiped out half of the universe.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/confirmed-director-duo-russo-brothers-reveal-thanos-has-retired-after-avengers-infinity-war-359206.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/has_thonos_retired_after_avengers_infinity_war_thats_what_director_duo_russo_brothers_says_1545655159_800x420.jpg"}