{"text": "Bollywood actor Anupam Kher is all set to release his much anticipated 'The Accidental Prime Minister.' Ever since the trailer launched, the film has been facing a backlash from the opposition Congress party around the controversies it might evoke. Some are claiming that it's showing Sonia Gandhi and Rahul Gandhi in a wrong light.\nBut the actor feels the facts have not been changed. \"We can't change the facts,\" said veteran actor Anupam Kher, who plays the role of Dr. Manmohan Singh in the upcoming biopic 'The Accidental Prime Minister.'\nscreen grab/youtube\nHowever, Kher, in an exclusive interview, stated that the film is based on facts as chronicled in a book by Sanjaya Baru Manmohan Singh's media advisor between 2004 and 2008.\n\"If we make a film on the issue of Jallianwala Bagh or The Holocaust or any historic incident, we can't change the history or the facts. That's what we have done here,\" the 63-year-old said.\n\"The book is written by a man who was very close to the prime minister at that time. This book was either ignored or people moved on after its release. So why this hue and cry now?\" he questioned.\nDon't Miss 233 SHARES 6 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nscreen grab/youtube\nKher further said he is just an actor in this movie and has tried to play his part in the most efficient way.\n\"I have worked so hard in this movie and has tried to play his part in the most efficient way. \"I have worked so hard in this movie for my look and everything that even my mother could not identify in this look,\" he added.\nscreen grab/youtube\nKher's comment comes a day after Maharashtra Youth Congress raised objections to the film and asserted that if the film is released without prior screening for their office bearers, they will resort to 'other options' to stop the screening of the film.\nStating that the trailer features incorrect representation of the facts, the youth wing has demanded a special screening of the film to ensure that none of the scenes is factually incorrect.\nInputs From ANI", "title": "Congress Continues Protest Around 'The Accidental Prime Minister', Anupam Kher Says We Can't Change Facts", "date_publish": "28/12/2018, 14:36:39", "description": "\"We can't change the facts,\" said veteran actor Anupam Kher, who plays the role of Dr. Manmohan Singh in the upcoming biopic 'The Accidental Prime Minister.' The trailer of the movie, which recently came out, drew a lot of flak from the opposition Congress party which holes in the portrayal of the former prime minister. The party also criticised the teaser saying that the movie shows Sonia Gandhi", "authors": [], "url": "https://www.indiatimes.com/entertainment/congress-continues-protest-around-the-accidental-prime-minister-anupam-kher-says-we-can-t-change-facts-359415.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anupam_kher_1545988144_800x420.jpg"}