{"text": "Hardik Pandya and KL Rahul made a comeback on the cricket field after being suspended for their “sexist and misogynistic” comments on Koffee With Karan in ODI series against New Zealand and England respectively. However, the controversy surrounding the show isn’t over yet.\nAlso Read: Priya Malik Slams Hardik Pandya With Her Powerful Poetry, Schools Him On Why Misogyny Isn’t Cool\nNow a case has been registered in Jodhpur against Hardik Pandya and KL Rahul and also Bollywood filmmaker Karan Johar in the same regard. The case has been filed by D R Meghwal at a police station in Luni in Jodhpur under various sections of the Indian Penal Code.\nAlso Read: Karan Johar Apologises For Hardik Pandya Row, Says He Had Sleepless Nights Wondering How To Undo It\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nPandya, who shared the couch with Rahul on the latest episode of Karan Johar's show, faced backlash for what netizens termed 'sexist' and 'disrespectful' remarks on women. On the show, he bragged about not asking the names of women at parties and how he watched them move on the dance floor.\nHardik Pandya had also issued an apology for the remarks saying he \"may have got a bit carried away with the nature of the show\".\nAlso Read: Hardik Pandya Wasn’t The Only One! 11 Times Celebs Made Sexist & Misogynistic Remarks On Koffee With Karan", "title": "Controversy Isn't Over Yet! Case Registered Against Hardik Pandya, KL Rahul & Karan Johar In Jodhpur", "date_publish": "06/02/2019, 15:17:42", "description": "Now a case has been registered in Jodhpur against Hardik Pandya and KL Rahul and also Bollywood filmmaker Karan Johar in the same regard. The case has been registered by D R Meghwal at a police station in Luni in Jodhpur under various sections of the Indian Penal Code.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/controversy-isn-t-over-yet-case-registered-against-hardik-pandya-kl-rahul-karan-johar-in-jodhpur-361687.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/case_registered_against_hardik_pandya_kl_rahul__karan_johar_in_jodhpur_1549446533_800x420.png"}