{"text": "It’s officially the year that Game of Thrones comes back (for the last time)-- that’s how HBO wished new year to its fans. There couldn’t have been a better way to cheer fans on the first day of 2019, right?\nIt’s now officially the year that Game of Thrones comes back. — HBO (@HBO) January 1, 2019\nBut eager fans couldn’t hold up their excitement. They all demanded the trailer. The wait for it has been longer than ever. And to whet the appetite of the fans, makers indeed released a small clip that took fans by surprise. After all, Sansa Stark and Daenerys Targaryen were seen on the same screen for the first time.\nIf you don’t know what we’re talking about, watch the teaser below!\n#1 HBO CEO Richard Plepler has watched all the episodes of Game of Thrones season 8, and he says they will be like six epic films.\nvia GIPHY\n“It’s a spectacle. The guys have done six movies. The reaction I had while watching them was, ‘I’m watching a movie,’” Plepler told Variety.\nDon't Miss 161 SHARES 842 SHARES\nAbout showrunners David Benioff and D.B. Weiss, Plepler said, “They knew the bar was high. They’ve exceeded the bar. I’ve watched them twice without any CGI and I’m in awe. Everybody’s in for an extraordinary treat of storytelling and of magical, magical production.\n#2 Kit Harington says Game of Thrones season 8 seems to be “designed to break us”\nvia GIPHY\n“The last season of Thrones, seemed to be designed to break us. Everyone was broken at the end. I don’t know if we were crying because we were sad it was ending or if we were crying because it was so fucking tiring. We were sleep deprived. It was like it was designed to make you think, Right, I’m fucking sick of this. I remember everyone walking around towards the end going, ‘I’ve had enough now. I love this, it’s been the best thing in my life, I’ll miss it one day – but I’m done,’” Kit Harington told GQ Australia in an interview.\n#3 The ending will surprise you. It is going to have bigger twists and turns than the Red Wedding.\nvia GIPHY\n“As far as season [eight] compared to the Red Wedding I just have to tell you—hang onto your seat cause it's going to be special,” David Nutter said in a Reddit AMA.\n#4 Not everyone is going to be happy at the end of the show!\nvia GIPHY\nIt’s not a Black Mirror Bandersnatch, after all. The show won’t end the way you would want it to. There’s going to be a surprise for you all, but not everyone’s going to like it. The ending of Game of Thrones won’t be a happy ending for all fans.\n“I think not everyone's going to be happy, you know, and you can't please everyone. My favorite TV shows are Sopranos, Breaking Bad, and The Wire, and they all ended in a way that…It's never going to satisfy you,\" Kit Harington had told MTV.\n#5 Keep tissues handy for season finale! It made the cast and the crew cry – are you ready too?\nCo-executive producer Bryan Cogman said the end will be “incredibly emotional haunting bittersweet”.\n#6 For one last time, you’ll get to see all the dead characters back in the show!\nvia GIPHY\nNo, they’ll not be a part of the storyline, but they’ll be a part of the reunion episode. Game of Thrones makers will treat their fans with a special reunion episode, and all the dead characters included Ned Stark will reportedly be a part of it. However, if reports are to be believed, Khal Drogo and Richard Madden who plays Robb Stark won’t be a part of it. Why? They couldn’t shoot for it because of prior commitments.\n#7 Better be prepared coz you’ll need therapy after watching season 8, says Gwendoline Christie AKA Brienne Of Tarth.\nvia GIPHY\n“You’re going to need therapy. I think just the show ending is going to send all of the world into professional help,” she said adding, “I think it’s going to make me incredibly emotional. We’re all emotional about the fact that this is the end, and this is the end of something incredibly significant for all of us, and it’s been a truly incredible thing to be a part of.”\nApril 2019, come soon!", "title": "Countdown Begins! 7 Latest Developments That'll Make You Excited For GoT If You Aren't Already!", "date_publish": "09/01/2019, 17:11:37", "description": "It’s officially the year that Game of Thrones comes back – that’s how HBO wished new year to its fans. There couldn’t have been a better way to cheer fans on the first day of 2019, right? But eager fans couldn’t hold up their excitement. They all demanded the trailer. The wait for it has been longer than ever. And to whet the appetite of the fans, makers indeed released a small clip that took all", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/countdown-begins-7-latest-developments-that-ll-make-you-excited-for-got-if-you-aren-t-already-360105.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/winters_coming_7_things_revealed_by_cast__crew_of_game_of_thrones_to_amp_up_your_excitement_for_s_1547032448_800x420.jpg"}