{"text": "There’s no other show like FRIENDS, and it can never ever be made. The American sitcom changed our lives. Each character made us fall in love with its own quirky habits and mannerisms. With Rachel, Monica, Phoebe, Joey, Chandler and Ross, we all laughed when they laughed. When they cried, we all cried with them. And we grew up with them too.\nvia GIPHY\nCan you believe that it has been 24 years since the first season of the show aired? Friends is never getting old for us, right?\nvia GIPHY\nRemember Rachel’s daughter Emma? The twins who played this role are now 16 years old now.\nTime flies, but Courteney Cox (Monica) and Lisa Kudrow’s(Phoebe) friendship is as strong as ever before. The duo was recently spotted on a lunch date together, and we were reminded of the times when they wanted to start their own catering business?\nTwitter\nTwitter\nPhoebe: “So, did Hilda show you the place?”\nChandler: *smiling* “Yeah, it’s beautiful”\nPhoebe: “I can’t believe you’re gonna ask Monica to marry you”\nSaan po makakahanap ng Chandler Bing? ❤️😍 #ALDUB184thWeeksary #ADN184thWeeksary — KS TINIDOR™ (@KS_Tinidor) January 24, 2019\nDon't Miss 1 K SHARES 738 SHARES 699 SHARES 1.2 K SHARES 16.6 K SHARES\nWe want a FRIENDS reunion soon. PLEASE.", "title": "Courteney & Lisa AKA Monica-Phoebe Went On A Lunch Date & It Proves They Are FRIENDS For Life!", "date_publish": "24/01/2019, 16:13:25", "description": "Can you believe that it has been 24 years since the first season of the show aired? Time flies, but Courteney Cox (Monica) and Lisa Kudrow’s(Phoebe) friendship is as strong as ever before. The duo was recently spotted on a lunch date together, and we were reminded of the times when they wanted to start their own catering business?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/courteney-lisa-aka-monica-phoebe-went-on-a-lunch-date-it-proves-they-are-friends-for-life-360981.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/monica__phoebes_mini_friends_reunion_for_a_lunch_date_proves_their_bond_is_as_strong_as_ever_1548320082_800x420.png"}