{"text": "Sandeepa Dhar is one actress who chose to walk away from her success to live her dreams. The actress made her debut with Is Life Mein in 2010 opposite Akshay Oberoi, she was then nominated for the best debutante and the most promising actress, but soon after this film, she faded away into oblivion.\nTwitter\nAfterwards, was seen in a few films like Heropanti or Dabangg 2 doing small roles. Now, she is coming with a web series named Abhay. It's an 8-episode finite series. The series' first episode is already out and everyone is raving about her performance. Sandeepa will be seen playing a cop who is from the special task force alongside Kunal Khemmu.\nInstagram\nIndiatimes had a chat with the actress where she spoke about her current stint and why she left movies and decided to venture into the digital space.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nShe spoke about her 9-year long journey from being nominated as the most promising debut in 2010 to now and how things have shaped up for her. she said, “As soon as my first film came out, I left and moved to Australia to study dance for 3 years, and was totally away from films, but I used to come once in a year to India for a vacation, and during that time I did Dabangg 2 and Heropanti, because my vacation used to be of 20 or 25 days and that’s the kind of stuff I could do. A full-fledged film needs time and I couldn’t give it, because I had studies in Australia.\nTwitter\n\"And now to be back , I have a lot of things to do, I think my journey has been quite interesting because when I left, everyone said, ‘ what’s wrong with you, why are you leaving. 'You can encash and have everything you want,’ but I had to take that risk because I had got a scholarship to study dance, that was a once in a lifetime opportunity for me. I am so glad I did it, because the kind of exposure I got when I moved out was amazing, it nurtured me as a person that I am right now.”\nSandeepa says she has no regrets on taking such a drastic decision because she believes her talent, “Also I feel it’s just matter of that one Friday which changes everything, so I really don’t think that way. I was the most promising thing in 2010 and I fizzled away, and now I am trying my best to do stuff. I am doing the kind of work which I always wanted, and it hopefully changes all the criticism away that I took all these years.”\nTwitter\nThe actress is happy to be a part of cinema at this time, “I think right now, it’s a great time for anyone to come and make a mark because there is so much content that you make digitally, you don’t need to rely on films to make a mark. In fact, so many actors have gone from digital to films, and if you are good irrespective of the competition, you will do well and if you have potential, people will notice you. Because now people are more about content than big names. I feel now films are a very limited space, and digital is the next big thing and it is only going to get bigger and bigger.”\nWhen asked about how things have changed from 2010 to 2019, Sandeepa says, “I feel it’s much better now, you are taken on a test, as it happens in the west, no matter how big a star you are, you give your audition and if you are good you are selected. Even Tom Cruise still has to give a screen test and the same thing is happening within our industry and that’s such a fair way of doing things. But obviously, it is still going to happen that a certain actor got the film because he had a backing, but if you are good, you will find your way, there is no way that you are going to be ignored.”\nWe even quizzed her if she introspects her past work, she said, “Absolutely. In fact, I always say this to my first director that what were you thinking, why did you take me because I knew nothing about acting, I was so raw, but now I am much more aware and prepared, but everyone has gone through that phase, even you see Kareena Kapoor then and now, she will also say I don’t know what was I doing in that film, everybody grows.”\nWe asked her about how women in films were objectified unlike now, to which her perspective was, “ I blame the actors for this, it’s not like stories were not out there, but actors were choosing to do that, and now they are choosing to play Chhapaak or Badhaai Ho or whatever, but this case should have been right from the beginning, why should they do it later on, they should have done it in beginning, you can’t say 'wow! she is doing this real character', arrey baba who tumhara kaam hai, isike liye tum actor bane ho”.\nTwitter\nThe actress will be also seen in another web-series called Massage where she and Jim Sarbh are romantically involved with each other.", "title": "Dabangg 2 Star Sandeepa Believes If You Have Potential, Sooner Or Later You'll Make Your Mark", "date_publish": "27/03/2019, 17:39:57", "description": "Sandeepa Dhar is one actress who chose to walk away from her success to live her dreams. The actress had made her debut with Is Mein in 201 opposite Akshay Oberoi, she was then nominated for the best debut and the most promising actress, but soon after this film, she vanished. And was seen in a few films like Heropanti or Dabangg 2 doing smaller roles. And now she coming with a web series space", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/dabangg-2-star-sandeepa-dhar-says-actors-should-have-opted-for-content-driven-films-from-the-beginning-364415.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/sandeepa_dhar_1553688439_800x420.jpg"}