{"text": "Tiger Shroff and Disha Patani have been in a steady relationship for a long time now. From being each other's best friends to being spotted at Bastian, Mumbai on a Sunday afternoon, everything is happy and stable in their paradise.\nNeither Tiger nor Disha have ever opened up or confirmed their relationship status but their PDA have spoken volumes about their relationship.\n(Also read: These Pics Of Tiger Shroff & Disha Patani Prove Their 'Happily Ever After' Is Not Far Away!)\nTwitterIn a recent interview, Daddy Jackie Shroff opened up on his son's relationship status for the very first time. His reaction proves that he's indeed the coolest dad one can ever have. When he was quizzed on how he handles the news of his son's relationship, he said,\nDon't Miss 1.1 K SHARES 3.1 K SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES\nTwitter\n\"I don’t deal with it. Main khaali dheel de deta hoon. Tiger has spent 25 years of his life without a girlfriend. Abhi ek hai toh usko rehne do na… he’s found a girlfriend and I am very happy about it. Lekin usko ek tichki diya hai maine. He understands the meaning of life, and how it’s led within a social framework. He knows that he can never cross that line of decency and he never does\".\nWell, even though he didn't take Disha's name but it's a very evident fact that the couple is indeed enjoying their courtship period.", "title": "Daddy Jackie Shroff Has The Coolest Reaction To Tiger Shroff-Disha Patani's Relationship", "date_publish": "01/04/2019, 13:14:46", "description": "Tiger Shroff and Disha Patani have been in a steady relationship for a long time now. From being each other's best friends to being spotted at Bastian, Mumbai on a Sunday afternoon, everything is happy and stable in their paradise. Tiger Shroff and Disha Patani have been in a steady relationship for a long time now. From being each other's best friends to being spotted at Bastian.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/daddy-jackie-shroff-has-the-coolest-reaction-to-tiger-shroff-disha-patani-s-relationship-364666.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/tiger_and_disha_1554105187_800x420.jpg"}