{"text": "Daddy David Dhawan Calls His Son An 'Insecure' Actor As He Gets Over-Attached To His Roles\nDaddy David Dhawan Calls His Son An 'Insecure' Actor As He Gets Over-Attached To His Roles\nFor the first time ever, David Dhawan and son Varun Dhawan made an appearance together as they addressed the crowd at IFFI, Goa this year. Their session was an insightful one as the Daddy-son duo were at their candid best. They dismissed nepotism, as Varun called himself a “Left-leaning” actor.\nTalking about his initial dream and goals, he said that he always wanted to own a channel or become a comedian. He said,\nAgencies\n“In every group, there is always this one guy who is the joker, the life of the group. If you ask me, that has been my lifelong dream.\"\nEven Daddy Dhawan denied having played any role in his son’s career. He said,\nAgencies\n“He (Varun) assisted Karan Johar but I didn’t know about it. He has shocked me actually. I thought he would get a job in a bank or something.”\nHe added how while directing his son later in life (in Judwaa 2), he had saved his “worst behavior for his son”. “But I was never treating him like a newcomer. I used to save the worst for him,” he said.\nDon't Miss 207 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nAnother revelation that they both made about each other was how they offered an insight into each other’s working style. David Dhawan called his son the “most insecure actor” who gets emotionally attached to the characters he essays.\nTwitter\nOn the other hand, talking about his father, he labeled him as a “director with the most clarity”.\n(Read more about their session here.)", "title": "Daddy David Dhawan Calls His Son An 'Insecure' Actor As He Gets Over-Attached To His Roles", "date_publish": "27/11/2018, 13:30:29", "description": "For the first time ever, David Dhawan and son Varun Dhawan made an appearance together as they addressed the crowd at IFFI, Goa this year. Their session was an insightful one as the Daddy-son duo were at their candid best. They dismissed nepotism, as Varun called himself a “Left-leaning” actor.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/daddy-david-dhawan-calls-his-son-an-insecure-actor-as-he-gets-over-attached-to-his-roles-357462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/varun_dhawan_and_david_1543305776_800x420.jpg"}