{"text": "After ruling the TV screen for years with her show 'Kahaani Ghar Ghar Ki', Sakshi Tanwar made her transition into films and with Dangal, she proved that she is here to stay. A true feminist by heart, Tanwar is clearly one of the most loved and popular actresses.\nUTV\nSakshi is back in news and this time for a very different reason. The 45-year-old actress recently confirmed the news of adopting a baby girl. She shared the news with the world that and announced that she has named her Dityaa.\nAgencies\nConsidering how Dityaa is a blessing of Goddess Lakshmi, she expressed that she named her so because it means Goddess Lakshmi’s name. Talking to TOI, Sakshi said,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAgencies\n\"With the blessings of my parents and the support of my family and friends, I have adopted a baby girl who would soon turn 9 months old. I am extremely delighted to share my happiness with you as I welcome the bundle of joy in my life. This is undoubtedly the greatest moment of my life and I and my entire family are elated to embrace Dityaa. She is the answer to all my prayers and I feel blessed to have her in my life..\"\nWell, here's another excellent example of how young progressive women are taking the adoption route and proving that you don't have to be married to listen to your maternal instincts. Congrats, for this new addition in your life, Sakshi!", "title": "Dangal Actress Sakshi Tanwar Adopts A Baby Girl, Calls It The 'Greatest Moment' Of Her Life", "date_publish": "20/10/2018, 17:03:14", "description": "After ruling the TV screen for years with her show 'Kahaani Ghar Ghar Ki', Sakshi Tanwar made her transition into films and with Dangal, she proved that she is here to stay. A true feminist by heart, Tanwar is clearly one of the most loved and popular actresses.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/dangal-actress-sakshi-tanwar-adopts-a-baby-girl-calls-it-the-greatest-moment-of-her-life-355140.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sakshi_1540036004_800x420.jpg"}