{"text": "For everyone who enters the film industry without a godfather or a rock-solid connection, their first project is crucial. It decides their journey ahead. For Fatima Sana Shaikh, this journey of films began with Aamir Khan's Dangal. The film turned out to be blockbuster and her journey began!\nHowever, in a recent interview, Fatima Sana Shaikh says getting a perfect launch pad was not a cakewalk as people told her she did not have the \"looks\" of a heroine like Deepika Padukone and Katrina Kaif.\nFatima, who started her journey in the movies as a child actor with Kamal Haasan's 1997 film \"Chachi 420\", says the rejections shifted her focus from waiting for a conventional lead role to searching for a good character.\n\"I have been a child actor. I quit but making a comeback after that was difficult. I was not getting any work. People used to tell me I don't look like Deepika Padukone or Katrina Kaif. They said, since I didn't have the looks of a heroine, I should do whatever I'm offered.There have been many incidents where I was told that I was not good enough,\" Fatima told PTI in an interview.\nThe actor says her desire to perform in front of the camera was so strong that she did not pay heed to what people thought of her.\n\"I only had acting on my mind. The reason why I used to go for every audition was because I would get to perform in front of the camera, even if the set-up was small. The success of Aamir Khan-starrer \"Dangal\", however, made things easier for Fatima as it gave her the option to choose.\n\"Before 'Dangal', I never had the chance to choose my projects. I even did 'Dangal' because that was my only option at that time. Every actor goes through this. That's how things function. But I am happy that post the film and especially after 'Thugs of Hindostan', I have the space to choose,\" she says.\nFatima's last film Thugs Of Hindostan with Aamir Khan was a big dud but she looks all geared up to keep her head high and look forward to more projects.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n(With agency inputs)", "title": "'Dangal' Actress Fatima Sana Shaikh Reveals A Heartbreaking Truth About Her Struggling Days", "date_publish": "26/03/2019, 11:11:16", "description": "For everyone who enters the film industry without a godfather or a rock-solid connection, their first project is crucial. It decides their journey ahead. For Fatima Sana Shaikh, this journey of films began with Aamir Khan's Dangal. The film turned out to be blockbuster and her journey began!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/dangal-actress-fatima-sana-shaikh-reveals-a-heartbreaking-truth-about-her-struggling-days-364295.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/fatima_sana_shaikh_1553579744_800x420.jpg"}