{"text": "Daniel Radcliffe Knows He's Not The Only Harry Potter We'll Ever See & We Have Mixed Feelings!\nDaniel Radcliffe Knows He's Not The Only Harry Potter We'll Ever See & We Have Mixed Feelings!\nHe made his debut with the Tailor Of Panama but he rose to fame with the mega series of Harry Potter. Not one, or two, Daniel has starred as a lead actor in all the eight films culminating with the final film in the series, Harry Potter and the Deathly Hallows – Part 2, released in 2011.\nTwitter\nHe went onto become the highest paid actor during the filming of Potter films. We're talking about none other than, Daniel Radcliffe who received immense love and recognition during his tenure as Harry Potter.\nBut going forward, Daniel feels that even if he may not continue playing the titular role based on Rowling’s books, somebody else surely will.\nShemazing\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 151 SHARES\nSpeaking to IGN in an interview that he is certain someone else will definitely play the role in the future.\n“I’m sure there will be some other version of it; I know I’m not the last Harry Potter I’m gonna see in my lifetime – we’ve already got a few more,” he said while referring to the Harry Potter and the Cursed Child play.\nSmooth.com\n“It will be interesting to see how long those films stay… It feels like there’s a sacredness around them at the moment, but that’ll go, the shine will wear off at some point. It’ll be interesting if they reboot them and just do the films again or do a series; I’m fascinated to watch,” he added.\nWell, there may be many more Harry Potters in the future but we are not sure if we will like them as much as we did Daniel Radcliffe.", "title": "Daniel Radcliffe Knows He's Not The Only Harry Potter We'll Ever See & We Have Mixed Feelings!", "date_publish": "14/02/2019, 15:36:00", "description": "Daniel Radcliff Feels He's Not The Last Harry Potter We're Going To See In Our Lifetime And We're Not Sure How We FeelDaniel Radcliff Feels He's Not The Last Harry Potter We're Going To See In Our Lifetime And We're Not Sure How We FeelDaniel Radcliff Feels He's Not The Last Harry Potter We're Going To See In Our Lifetime And We're Not Sure How We FeelDaniel Radcliff Feels He's Not The Last Harry", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/daniel-radcliffe-knows-he-s-not-the-only-harry-potter-we-ll-ever-see-we-have-mixed-feelings-362162.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/daniel_1550136241_800x420.jpg"}