{"text": "Daughter Sara Ali Khan's Take On Her Parents' Separation Proves Her Heart Is In The Right Place!\nDaughter Sara Ali Khan's Take On Her Parents' Separation Proves Her Heart Is In The Right Place!\nWe have no reason to complain about nepotism if the product is as promising as Sara Ali Khan. She is just two films old but Sara is not just paps' favourite but her graceful and poised aura in the interviews has made her one of the most talked-about celebrities.\nInstagram/Sara Ali Khan\nHer credentials are more than her last name and her work is speaking for her. Even though her role in Simmba wasn't a significant one, she managed to stand out in her short and brief stint.\nAgencies\nSara Ali Khan is topping the favorite list of a lot of people and there are plenty of reasons behind her. Be it her Koffee debut with Daddy Saif Ali Khan where she won hearts with her mature take on her parents' separation or her take on how important it is for her to prove herself with every film-Sara has all the traits that make her one of the most likable newbies.\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nInstagram\nOnce again the actress is in news and this time it's for an interview with Filmfare. She appeared on Jitesh Pillai's Famously Filmfare where she elaborated her views on her parents' separation.\nNow, in an interview with Filmfare, Sara Ali Khan explained that she is happy that after her parent’s separation, she has two homes. She also feels that both Saif and Amrita are happy as individuals. She said,\n“It is not nice to live in a home where people are not happy. They are both, happy, bindaas and cool people, but individually. Together, they are not. And I think they too realized that. Fortunately, now I have two happy and secure homes to myself instead of one.”\nRecently, Sara Ali Khan also gave her first ever stage performance as she performed at Umang 2019.\nHer performance was a hit and she performed on her hit track from Simmba- Aankh Maarey.", "title": "Daughter Sara Ali Khan's Take On Her Parents' Separation Proves Her Heart Is In The Right Place!", "date_publish": "28/01/2019, 14:08:48", "description": "Once again the actress is in news and this time it's for an interview with Filmfare. She appeared on Jitesh Pillai's Famously Filmfare where she elaborated her views on her parents' separation. Now, in an interview with Filmfare, Sara Ali Khan expressed a sense of happiness that post her parent’s separation, she has two homes and how she feels that her parents are a lot happier individually.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/daughter-sara-ali-khan-s-take-on-her-parents-separation-proves-her-heart-is-in-the-right-place-361161.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sara_ali_khan_1548666110_800x420.jpg"}