{"text": "1. Maroon 5's Adam Levine Performs At Akash Ambani-Shloka Mehta's Post-Wedding Function!\nAfter popular bands and artists including Coldplay singer Chris Martin and The Chainsmokers played that performed at their pre-wedding bash in Switzerland's St Moritz, this comes as another bonus addition for the guests.\n2. After Judwaa 2, Daddy David Dhawan Is All Set To Cast Varun Dhawan In The Remake Of 'Coolie No 1'\nThe news was confirmed by Varun Dhawan himself as he spoke to BBC. He added that the remake would be directed by his father, veteran Director David Dhawan, who had directed the original film. The film also starred Karisma Kapoor.\n3. 'Captain Marvel' Fans Get An Epic Surprise, Brie Larson Crashes The Screening To Serve Popcorn!\nDon't Miss 862 SHARES 346 SHARES\nThe pictures that shared by the official social media accounts of the movie has Larson sipping a soda from a cup with her own face on it.\n4. Salman Makes A 'Dabangg' Entry At Akash-Shloka Wedding & Gets A Warm Welcome From Ranveer!\nSalman being Salman arrived late for the ceremonies that evening but something very sweet happened! A video that has resurfaced on the internet has Salman Khan walking in and arriving in his 'Dabangg' style and he is seen being greeted by an excited Ranveer Singh.\n5. I've Lost Many Roles To Star Kids In The Last 12 Years, Admits 'Made In Heaven' Actor Arjun Mathur\nDuring these twelve years of being in the film industry, Arjun has worked as an AD for over four Bollywood films and later, he went on to do commercials, short films and a few brief roles in big-budget banners as well.", "title": "David Dhawan To Remake Coolie No. 1, Adam Levine Performs At Akash Ambani's Wedding & More From Ent.", "date_publish": "11/03/2019, 18:30:21", "description": "David Dhawan To Remake Coolie No. 1, Adam Levine Performs At Akash Ambani's Wedding & MoreDavid Dhawan To Remake Coolie No. 1, Adam Levine Performs At Akash Ambani's Wedding & MoreDavid Dhawan To Remake Coolie No. 1, Adam Levine Performs At Akash Ambani's Wedding & MoreDavid Dhawan To Remake Coolie No. 1, Adam Levine Performs At Akash Ambani's Wedding & MoreDavid Dhawan To Remake Coolie No. 1, Ada", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/david-dhawan-to-remake-coolie-no-1-adam-levine-performs-at-akash-ambani-s-wedding-more-from-ent-363539.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1552309460_800x420.jpg"}