{"text": "One of the worst things to have happened this year is the news of CID ending after entertaining India for over 21 years. Undeniably India's favourite show, CID is going off-air from 28th October 2018. If you think that only fans are affected by this news, you're mistaken. This news has left even the team heartbroken and for obvious reasons.\nIn an interview with Times now, Actor Dayanand Shetty, who has been playing the role of Daya bared his heart out about the show. From talking about how abruptly the channel decided to end the show to what's ahead for the brand CID, here are the excerpts from the interview. Confirming the news that the show is not coming back, Dayanand said,\nSony TV\n\"No, I don’t think it’s coming back. I doubt it’s coming back. There can’t be a break. It’s just a convenient way of killing the show.\"\nWhen he was asked to recall his fondest memory of being associated with the show, he said,\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"21 years and you’re asking for one favorite memory, all of them have been good. We have shot outdoors and a lot of other places; we have spent so much time together. The entire unit gets along like a family. I think it’s very difficult to talk about one particular moment. All us male artists had one common make-up room or vanity, we were like a family. Shivaji (Satam) Sir is the head of the family. We respect and love each other.\"\nHe further added how this news has left the entire team of CID crestfallen. He added,\nSony TV\n\"Everybody was numb for quite some time. They didn’t know what hit them. Some are thinking even today that maybe it was just a prank. No one anticipated it. Even I am speechless.\"\nAnd then he was asked a question that was on everyone's mind. Is CID ever coming back. He hinted at the fact that CID might return as a web-show or the team might return with some other show. He adds,\nSony TV\n\"Let’s see. Our producers will get back to us if they are planning for something because everyone working for CID, the cast and crew are a big brand in their own way. So let’s see how they can use this brand, CID, with another title. Whether on television or digital, we’re trying to work it out, because CID is also an expensive show. So meetings are happening right now and we’re waiting for things to materialise now.\"\nWell, this news will surely make all the CID fans happy!", "title": "Dayanand Shetty Drops A Major Hint About CID Returning As A Web-Show And We Are Excited!", "date_publish": "27/10/2018, 11:01:45", "description": "\"Let’s see. Our producers will get back to us if they are planning for something because everyone working for CID, the cast and crew are a big brand in their own way. So let’s see how they can use this brand, CID, with another title. Whether on television or digital, we’re trying to work it out, because CID is also an expensive show. So meetings are happening right now and we’re waiting for things", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/dayanand-shetty-drops-a-major-hint-about-cid-returning-as-a-web-show-and-we-are-excited-355544.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/cid_1540619668_800x420.jpg"}