{"text": "“Dear future husband... Here's a few things... You'll need to know if you wanna be... My one and only all my life”\nYears after she released this song, Meghan Trainor found her ‘Dear Future Husband’. On her 25th birthday (on Dec 22, 2018), she tied the knot to Spy Kids actor Daryl Sabara. It was a dreamy affair for sure. But there was more to it that we hadn’t seen until recently.\nprimedia.co.za\nDaryl Sabara had surprised his wife with a special dance routine and the video is so gorgeous that it will make your heart melt to mush.\neonline.com\nDaryl Sabara has recently shared the video in three parts on his official Instagram account and fans, since then, cannot stop gushing over the sweet adorable video that it is.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMeghan Trainor was joyfully shocked when hubby Daryl Sabara started off with his dance routine on Pop! Goes My Heart. “Oh my God”, she screamed.\nDaryl Sabara and crew wrapped up the performance on Justin Timberlake’s Suit and Tie.\nIf this wasn’t enough to make your heart flutter, let us tell you that Daryl Sabara had surprised Trainor with a proposal on her 24th birthday. The couple got engaged in 2016, and got married on her 25th birthday. And then, began their happily ever after.\nWatch the video below.\nDear future husband, are you watching this? Please take notes.", "title": "Meghan Trainor:Dear Future Husband, Watch Daryl Sabara’s Surprise Wedding Dance For Meghan Trainor And Take Notes", "date_publish": "01/02/2019, 14:24:08", "description": "Meghan Trainor has finally found her ‘Dear Future Husband’. On her 25th birthday, she tied the knot with Spice Kids actor Daryl Sabara, on Dec 22, 2019. Daryl Sabara had surprised his wife with a special dance routine and the video is so gorgeous that it will make your heart melt to mush. Daryl Sabara has recently shared the video in three parts on his official Instagram account and fans, since", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/dear-future-husband-watch-daryl-sabara-s-surprise-wedding-dance-for-meghan-trainor-take-notes-361417.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/dear_future_husband_watch_daryl_sabaras_surprise_wedding_dance_for_meghan_trainor_and_take_notes_1549009085_800x420.png"}