{"text": "1. Chaiyya Chaiyya With SRK To Jumma Chumma With Big B, DeepVeer Partied Like Rockstars Last Night\nThe star-studded party of DeepVeer brought together the biggest Bollywood stars including Amitabh Bachchan, Shah Rukh Khan, Sanjay Dutt, Kareena Kapoor, Katrina Kaif, Rekha, Jaya Bachchan, Vicky Kaushal, Rajkummar Hirani, and many more under the same roof.\n2. PC Literally Dancing On Nick Jonas' Tunes For Their Pre-Wedding Shoot Is A Sight For Sore Eyes!\nPriyanka Chopra and Nick Jonas also did a pre-wedding shoot with Vogue. The couple is the first one to be on the Vogue’s digital cover.\n3. Rakhi Sawant Thanks 'MacDonald Trump' For Gifting Charter Planes For Her & Deepak Kalal's Wedding\nYesterday, she held a press conference where she thanked “MacDonald Trump” for sending her a saree (the one that she’s wearing) and also four charter planes so that the guests won’t have a problem in travelling to Los Angeles, which if you’ve forgotten is their wedding destination.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 185 SHARES 460 SHARES\n4. John Abraham Takes Time Out From His Busy Schedule To Meet Acid Attack Victims In Lucknow\nIn Lucknow yesterday, during an event near Gomti Nagar, the acid attack survivors were told that a special dish is waiting for them and to be given that as a surprise, they were blindfolded. Little did they know that as they would open their eyes, a bigger surprise would be waiting for them – JOHN ABRAHAM!\n5. 'Bhabhi Mat Bulao Na', Deepika Padukone Blushes As She Requests Paparazzi To Not Call Her That!\nAnd this time, at Ranveer-Deepika’s second reception in Mumbai, she finally requested the paparazzi to not call her bhabhi. “Bhabhi mat bulao na”, she said with a smiling face, reminding us of the infamous “Aunty mat kaho na” line from classic TV show Hum Paanch.", "title": "Deepika-Ranveer Partied Like Rockstars, Priyanka-Nick’s Pre-Wedding Shoot & More From Ent", "date_publish": "02/12/2018, 17:55:12", "description": "From Deepika Padukone and Ranveer Singh throwing a wedding reception for their friends from the Bollywood industry and partying like rockstars all night to Priyanka Chopra and Nick Jonas dancing and singing together for their pre-wedding shoot for Vogue, here’s all that rocked the world of entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/deepika-ranveer-partied-like-rockstars-priyanka-nick-s-pre-wedding-shoot-more-from-ent-357793.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepikaranveer_partied_like_rockstars_priyankanicks_prewedding_shoot__more_from_ent_1543753671_800x420.png"}