{"text": "Deepika Padukone Spills Secrets About Hubby Ranveer Singh, Says He Takes More Time Than Her To Get Ready!\nDeepika Padukone Spills Secrets About Hubby Ranveer Singh, Says He Takes More Time Than Her To Get Ready!\nRanveer Singh and Deepika Padukone are one of the most favourite couples of the tinsel town. Ever since they are married, they both just can’t get enough of each other. Their PDA often makes headlines.\nThis time, when they appeared together for Femina Beauty Awards 2019, fans couldn’t stop gushing over the love that they share. The lovebirds were honoured with the Beautiful Couple Of The Year award. In addition to that, Deepika also won the Woman of the Year award.\nIt is at the event that Deepika spilled quite a lot of secrets about Ranveer Singh. In one of the videos doing the rounds, she can be seen saying, “He takes longer in the shower, longer in the loo, longer to get ready, longer to get into bed...”. At this the audiences erupted in laughter, to which she clarified, “I said longer to get into bed.”\nTake a look!\nDon't Miss 365 SHARES 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES\nHere are some of the more videos from the event.\nThe way she calls him baby! There’s so much love in the air, right?", "title": "Deepika Padukone:Deepika Padukone Spills Secrets About Hubby Ranveer Singh, Says He Takes Longer To Get Ready", "date_publish": "21/02/2019, 18:15:36", "description": "Ranveer Singh and Deepika Padukone appeared together to for Femina Beauty Awards 2019, fans couldn’t stop gushing over the love that they share. The lovebirds were honoured with the Beautiful Couple Of The Year award. In addition to that, Deepika also won the Woman of the Year award.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/deepika-padukone-spills-secrets-about-hubby-ranveer-singh-says-he-takes-more-time-than-her-to-get-ready-362533.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/deepika_padukone_spills_secrets_about_hubby_ranveer_singh_says_he_takes_longer_to_get_ready_1550734636_800x420.png"}