{"text": "Deepika And Ranveer To Host A Grand Wedding Reception In Mumbai For Bollywood Celebrities On December 1\nDeepika And Ranveer To Host A Grand Wedding Reception In Mumbai For Bollywood Celebrities On December 1\nIt indeed is the happiest phase for Ranveer Singh and Deepika Padukone. The couple dated for six years and have finally decided to get hitched. Their wedding announcement bought a smile on everyone’s faces. After all, they are the most loved couple in Bollywood.\nInstagram\nThe on-screen Ram Leela will be tying knot this November 13 and 14 in Italy and we cannot contain our excitement to have a glimpse of their wedding pictures.\nTwitter\nAfter their wedding, DeepVeer will be hosting two receptions, one in Bangalore and one in Mumbai. Their Mumbai reception date is out and it’s on December 1, 2018. This reception will be nothing but GRAND. Bollywood biggies will be invited for Bajirao Mastani’s reception. This reception will definitely be one grand and memorable affair.\nTwitter\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES 185 SHARES\nDeepika and Ranveer have already started distributing their wedding cards to friends and family. Everyone in Bollywood is showering their blessings to this adorable couple.\nOnce again, hearty congratulations to this beautiful couple. We can't wait to see Deepika in her bridal avatar.", "title": "Deepika And Ranveer To Host A Grand Wedding Reception In Mumbai For Bollywood Celebrities On December 1", "date_publish": "09/11/2018, 15:41:49", "description": "It’s indeed the happiest phase for Ranveer Singh and Deepika Padukone. The couple dated for six years and has finally decided to get hitched. Their wedding announcement bought a smile on everyone’s faces, after all, they are the most loved couple in B Town.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/deepika-and-ranveer-to-host-a-grand-wedding-reception-in-mumbai-for-bollywood-celebrities-on-december-1_-356354.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_ranveer_1541759042_800x420.jpg"}