{"text": "Deepika Padukone And Ranveer Singh Will Enter The Bond Of Holy Matrimony At This Picturesque Villa In Italy!\nDeepika Padukone And Ranveer Singh Will Enter The Bond Of Holy Matrimony At This Picturesque Villa In Italy!\n14th and 15th November will be the grandest days of the year as one of Bollywood's most powerful couples will tie the knot in one of the world's most picturesque locations.\nThe couple confirmed the news of their marriage on 21st October when they shared this happy news with the world. While the couple has not confirmed the location of the wedding, reports hint at the fact that this grand wedding will take place in Italy. The location isn't Lake Como but it's Villa del Balbianello, which is situated in the province of Como, Italy.\nPinterest\nSurrounded by terraced gardens, the villa is situated on the western shore of the south-west branch of Lake Como.\nThis Villa has been in news for being a location where films like Right from A Month by the Lake (1995), His Demise starring Paul Zukowski (2016 disaster movie), Casino Royale (2006) and also in Star Wars: Episode II Attack of the Clones (2002) have been shot.\nThese pictures and videos prove that this villa is definitely like a cutout straight out of a fairytale book.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES", "title": "Deepika Padukone And Ranveer Singh Will Enter The Bond Of Holy Matrimony At This Picturesque Villa In Italy!", "date_publish": "01/11/2018, 12:28:49", "description": "Surrounded by terraced gardens, the villa is situated on the western shore of the south-west branch of Lake Como. Ranveer and Deepika have booked Villa del Balbianello in Italy for the wedding ceremonies.These pictures and videos prove that this villa is definitely like a cutout straight out of a fairytale book.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-padukone-and-ranveer-singh-will-enter-the-bond-of-holy-matrimony-at-this-picturesque-villa-in-italy-355836.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1541052467_800x420.jpg"}