{"text": "The award-winning actress behind recent box-office hits such as Padmaavat and Bajirao Mastani beat off competition from around the world as part of a list compiled annually by UK-based Eastern Eye weekly, which highlighted that the 32-year-old’s “dream year” included marrying fellow actor Ranveer Singh and a stunning turn on the Cannes Film Festival red carpet.\nWalking hand-in-hand, the couple was present at the Bumble's launch party event in New Delhi. Donning a blush pink dress complete with a chain belt around her waist this was PC's first official work outing after their wedding.\n\"I don't even want to react or comment. It's not even in my stratosphere. I'm in a happy place at this moment. These kinds of random things can't disturb it.\"\nAnd one such song that is making its way back in the market is 'Aankh Maare'. The original song featured Arshad Warsi in Tere Mere Sapne was quite a hit and looks like the brand new remix will just double its popularity. In fact, it already has.\nAnil Kapoor, her brother-in-law and co-star, misses Sridevi terribly too. In fact, he was called to a dance reality show to watch performances and pay tribute to Sridevi. Recalling how he used to touch feet every time they met, Anil mentioned she used to feel awkward seeing him do that.\nDon't Miss 862 SHARES 346 SHARES", "title": "Deepika Padukone Voted Sexiest Asian Woman, Aankh Maare Remix Is Here & More From Ent.", "date_publish": "06/12/2018, 17:33:13", "description": "Anil Kapoor, her brother-in-law and co-star, misses Sridevi terribly too. In fact, he was called to a dance reality show to watch performances and pay tribute to Sridevi. Recalling how he used to touch feet every time they met, Anil mentioned she used to feel awkward seeing him do that.Anil Kapoor, her brother-in-law and co-star, misses Sridevi terribly too. In fact, he was called to a dance reali", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-padukone-voted-sexiest-asian-woman-aankh-maare-remix-is-here-more-from-ent-358089.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wrap_1544098603_800x420.jpg"}