{"text": "1. Finally! Ranveer Singh & Deepika Padukone Announce Their Wedding Date, Seek Everyone's Blessings\nDeepika Padukone and Ranveer Singh have revealed on social media that they are getting married on Nov 14-15.\n2. Anu Malik Likely To Be Ousted From ‘Indian Idol 10’ Post Several Sexual Harassment Allegations Against Him\nNot one, but four women including singers Sona Mohapatra and Shweta Pandit have accused Anu Malik of sexual harassment. While he denies all claims and calls them baseless stories, one of the crew memberes of reality show Indian Idol has recently revealed that high-ups were aware of him abusing his power. Furthermore, speculations are rife that he might be ousted from the singing reality show.\n3. If Taimur’s Pics Are Your Guilty Pleasure Then You Just Can't Miss His Nanny’s Parody Account!\nSo, now that you know Taimur’s Nanny, who accompanies Taimur to all foreign locales, is no less than a celebrity, here’s her Instagram fan account that will leave you in splits.\n4. From Hinting About Having Kids To Chilling With AR Rahman, Here’s What Priyanka Chopra Is Up To\nEveryone’s asking the same question – when are Priyanka Chopra and Nick Jonas getting married? However, we feel that the day is quite near when PC and Nick will be seen tying the knot. Talking about Meghan Markle’s pregnancy, PC’s says she needs to catch up. “I just have a few of my friends who are having babies right now and I'm like, 'God I need to catch up,” she was quoted as saying by E! News.\n5. Neena Gupta Recalls Her Tough Journey As A Single Mother, Says She Had No Money Or A Husband\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES 185 SHARES\n\"My journey was very tough. I had no money. Money is the most important thing, I have realised in this world. I didn't have a husband and relatives. So it was really tough, but the joy Masaba gave me... The joy of motherhood... She was a very good child she did not trouble me much. The joy she gave me was enough to go through anything,\" said Neena, who raised Masaba as a single mother.", "title": "Deepika-Ranveer Confirm Their Wedding Date, Anu Malik Quits Indian Idol 10 & More From Ent", "date_publish": "21/10/2018, 17:55:56", "description": "From Deepika Padukone and Ranveer Singh confirming their wedding date on Nov 14-15 to Anu Malik stepping down as the judge of Indian Idol 10 after sexual harassment allegations against him by several women including Shweta Pandit and Sona Mohapatra, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/deepika-ranveer-confirm-their-wedding-date-anu-malik-quits-indian-idol-10-more-from-ent-355179.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/deepikaranveer_confirm_their_wedding_date_anu_malik_quits_indian_idol_10__more_from_ent_1540124784_800x420.png"}