{"text": "Deepika Padukone Couldn’t Stop Laughing When She Was Called ‘Bhabhiji’ By The Paparazzi\nDeepika Padukone Couldn’t Stop Laughing When She Was Called ‘Bhabhiji’ By The Paparazzi\nDeepika Padukone and Ranveer Singh are leaving the world mesmerized with their joyful appearance after marriage. The couple, who were back in town on November 18 after their marriage in Italy at Lake Como, has now yet again left for their reception in Bengaluru.\nIndiatimes\nThe paparazzi went crazy to catch a glimpse of them at the airport. The couple, too, happily posed for the shutterbugs till they got their good pictures. But something unusual happened which left Deepika blushing.\nAlso read: All Set For Their Wedding Reception, Ranveer-Deepika Beam With Joy As They Leave For Bengaluru\nViral Bhayani\nWell, she was called Bhabhiji by the photographers at the airport, which left Deepika laughing and blushing. In fact, the moment she was called Bhabhiji by the papz, Ranveer too happily called her Bhabhiji. Ranveer’s pride of being the one and only one for Deepika was clearly seen on his face, while Deepika too looked happy being called Bhabhiji. After all, she is ‘Baba’s bae'.\nWatch the video of the adorable couple leaving for their reception together.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nTalking about their reception in Bengaluru (November 21), it will again be a private family affair, where Deepika’s parents have invited all the close friends and family members to shower their blessings to the newlyweds.\nIndiatimes\nHopefully, unlike wedding pictures, we would be able to get our hands on their reception snaps.", "title": "Deepika Padukone Couldn’t Stop Laughing When She Was Called ‘Bhabhiji’ By The Paparazzi", "date_publish": "20/11/2018, 12:50:03", "description": "Deepika Padukone and Ranveer Singh are leaving the world mesmerized with their joyful appearance after marriage. The couple who were back in town on November 18 after their marriage in Italy at Lake Como has now yet again left for their reception in Bengaluru.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/deepika-padukone-couldn-t-stop-laughing-when-she-was-called-bhabhiji-by-the-paparazzi-357008.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_1542698930_800x420.jpg"}