{"text": "Deepika Says Ranveer Is A Different Person At Home, Wonders What Happens When He Steps Outside!\nDeepika Says Ranveer Is A Different Person At Home, Wonders What Happens When He Steps Outside!\nDeepika Padukone and Ranveer Singh give couple goals a whole new definition. The lovebirds are head over heels in love with each other since last 6 years and it looks like it will last forever.\nTwitter\nDuring the course of their relationship, Ranveer openly showered his love for Deepika, while DP chose to keep it a secret. But now after their marriage, the actress never shies away from talking about her beloved husband and we love it.\nAt a recent event in Mumbai, Deepika was asked about Ranveer’s magnificent energy that he has, to which she replied,\n“I don’t know what happens when he leaves the house as he’s an extremely different person which I think people will also start seeing. Like if you see him in his work mode, which is that, there’s an extremely quiet side to him, there’s an extremely intelligent side to him, there’s a very sensitive and emotional side to him, there’s a vulnerable childlike innocence, so there are so many facets to him”.\nThe wifey is all praises for her hubby.\nShe even joked that she doesn’t mix anything in his coconut water which he has every morning. These two are just LOVE.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nTalking about life after marriage, Ranveer had said, “I’m loving it and highly recommend it. I have been married to Deepika in my head for years now. Just a few months into our relationship, I knew she was the one for me and I wanted to spend the rest of my life with her. I had committed my life to her well before the rituals. I was waiting for her to be ready for it”.\nClearly, Ranveer and Deepika are giving all the lovers major marriage goals.", "title": "Deepika Says Ranveer Is A Different Person At Home, Wonders What Happens When He Steps Outside!", "date_publish": "01/03/2019, 15:34:05", "description": "“I don’t know what happens when he leaves the house as he’s an extremely different person then which I think also people will start seeing. Like if you see it in his work, which is that there’s an extremely quiet side to him, there’s an extremely intelligent side to him, there’s a very sensitive and emotional side to him, there’s a vulnerable childlike innocence, so there are so many facets to him", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/deepika-says-ranveer-is-a-different-person-at-home-wonders-what-happens-when-he-steps-outside-362985.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/deepika_padukone_1551428521_800x420.jpg"}