{"text": "Deepika Is Happy For Her Friend, Feels Priyanka Finally Got What She Always Wanted With Nick\nDeepika Is Happy For Her Friend, Feels Priyanka Finally Got What She Always Wanted With Nick\nBollywood’s two beauties Deepika Padukone and Priyanka Chopra tied the knot this year. Their weddings were nothing less than a dreamy affair. Deepika had a lavish wedding in Italy while our desi girl chose Umaid Bhawan Palace to take her vows with beau Nick Jonas.\nBoth are happily married today and enjoying this special time of their life.\nDeepika who has been giving interviews after her marriage revealed a lot of secrets of her relationship with Ranveer. Not only that, she even spoke about Priyanka and Nick’s wedding.\nTwitter\nIn an interview with a leading magazine, she revealed how her Bajirao Mastani co-star Priyanka too craved for stability in a relationship,\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 460 SHARES 161 SHARES\n“She’s also someone, who has craved stability in a relationship. I don't know Nick (Jonas) that well but you can tell that she feels settled”.\nTwitter\nFurther adding,\n“Whatever little I know of her, I know these things were important to her. Like to find love, to find a person who gives it his hundred percent, who gives the stability you look for in a relationship. She has craved it. I'm thrilled she's found it. It's been a rollercoaster for her as well”.\nWell, all we can say is that these ladies are lucky to find the love of their lives. Talking about Priyanka and Nicks’ wedding reception in Mumbai, it was one crazy affair to remember and the highlight of that night was PC and Deepika’s Pinga dance-off.", "title": "Priyanka Chopra Craved Stability In A Relationship, Reveals Deepika Padukone", "date_publish": "31/12/2018, 13:06:35", "description": "Bollywood’s two beauties Deepika Padukone and Priyanka Chopra tied the knot this year. Their weddings were nothing less than a dreamy affair. Deepika has a lavish wedding in Italy while our desi girl chose Umaid Bhawan Palace to talk her vows with her beau Nick Jonas. Both are happily married today and enjoying this special time of their life.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/deepika-is-happy-for-her-friend-feels-priyanka-finally-got-what-she-always-wanted-with-nick-359559.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_padukone_1546241070_800x420.jpg"}