{"text": "Deepika Padukone Believes Gone Are The Days When Mere Presence Of A Superstar Would Ensure A Blockbuster\nDeepika Padukone Believes Gone Are The Days When Mere Presence Of A Superstar Would Ensure A Blockbuster\n2018 was a year of experimental content. While films like Badhaai Ho, Andhadhun, Stree and Raazi among others struck a chord with the audiences and did a great business at the box office, others, that of the Khans including Aamir Khan’s Thugs Of Hindostan, Salman Khan’s Race 3 and Shah Rukh Khan’s Zero failed miserably at the box office.\nContent is king, it was proven once again. Gone are those days when mere the presence of a Khan in a film would ensure a blockbuster. Ask Deepika Padukone if script is the most important part of a film, and she says everything boils down to a script.\nTwitter\n“It's about the film. It's a different thing that the films that the 'Khans' did, didn't work but there was film like 'AndhaDun' which was led by Ayushmann Khurrana that did wonder at the box office so I think everything boils down to the script itself. But yes, I see a trend where films that are being led by women are doing much better,” she was quoted as saying by IANS.\nbrecorder.com\nDon't Miss 862 SHARES 812 SHARES 322 SHARES\nShe believes that the Indian audiences have evolved over the years.\n“Now you can't blindly say that so and so is in the film, then let's go and watch. I think year 2018 was clear indication of that. Right from the promo, poster all of that, I think that the audience has that pulse,” she added.\nAlso Read: Bollywood Scriptwriters Were The True Stars Of 2018 And Here's Why They Should Get Their Due\nWith inputs IANS", "title": "Deepika Padukone Believes Gone Are The Days When Mere Presence Of A Superstar Would Ensure A Blockbuster", "date_publish": "17/01/2019, 18:28:59", "description": "Content is king, it was proven once again. Gone are those days when mere the presence of a Khan in a film would ensure a blockbuster. Ask Deepika Padukone if script is the most important part of a film, and she says everything boils down to a script.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/deepika-padukone-believes-gone-are-the-days-when-mere-presence-of-a-superstar-would-ensure-a-blockbuster-360607.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/deepika_padukone_believes_gone_are_the_days_when_mere_presence_of_a_superstar_would_ensure_a_blockbu_1547730330_800x420.jpg"}