{"text": "Deepika-Ranveer To Host A Reception For Their Industry Friends On Dec 1 & Here Are The Deets!\nDeepika-Ranveer To Host A Reception For Their Industry Friends On Dec 1 & Here Are The Deets!\nRanveer Singh and Deepika Padukone tied the knot in Italy's Lake Como and the couple flew back down to India a few days back.\nThe couple gave us a glimpse of their celebrations by sharing a few pictures from their wedding album. These pictures didn't just break the internet but people collectively had just one reaction: We also want a love story like theirs.\nInstagram\nWell, the celebrations have just begun for Ranveer and Deepika. The couple hosted a reception at Leela Palace, Bengaluru. The couple redefined royalty in every sense of the word.\nInstagram\nAnd now the couple is prepping up for their another reception that is scheduled to take place in Mumbai.\nDeepVeer will be hosting another reception for their friends in the film industry in Mumbai on December 1. This reception is going to be grand as a lot of their industry friends have been invited to be a part of the grand celebrations.\nInstagram\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nManisha Koirala also shared the wedding invite on Twitter.\nHang in there, you all. Your social media feeds will soon be bombarded with pictures that will make you feel #foreveralone like never before!", "title": "Deepika-Ranveer To Host A Reception For Their Industry Friends On Dec 1 & Here Are The Deets!", "date_publish": "22/11/2018, 11:56:58", "description": "Ranveer Singh and Deepika Padukone tied the knot in Italy's Lake Como and the couple flew back down to India a few days back. The couple gave us a glimpse of their celebrations by sharing a few pictures from their wedding album. These pictures didn't just break the internet but people collectively had just one reaction: We also want a love story like theirs.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-ranveer-to-host-a-reception-for-their-industry-friends-on-dec-1-here-are-the-deets-357142.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542866361_800x420.jpg"}