{"text": "Deepika Padukone And Ranveer Singh Top The Internet Today And More From The World Of Ent!\nDeepika Padukone And Ranveer Singh Top The Internet Today And More From The World Of Ent!\nRecently, the lovebirds were spotted at Mumbai airport as they were heading to fly for London, where they will unveil her wax statue at Madame Tussaud's museum. Going the pictures, DeepVeer, as they are fondly called by their fans, couldn’t let go of each other’s hands. They flashed big smiles on their faces. Take a look!\nFor an actor, there are several perks of being successful and being good at what they have chosen to do. Apart from a luxurious life, there are several lucrative offers that come their way. For Deepika Padukone, one such offer came from luxury Swiss brand Chopard.\nDon't Miss 10.9 K SHARES\nBoth the Khans might star in the remake of 1952 Meena Kumari classic Baiju Bawra.\nIt all started with Avengers: Infinity War. The craze of the film was so high that almost everyone was talking about it. Ben Mekler also posted a fake review, which surprisingly was carried by a lot of entertainment portals. In the tweet, he wrote, Iron Man and Captain Marvel have sex in the movie.\nShe wrote, ‘Despite the many years that have passed since this happened my night terrors and PTSD symptoms continue to get worse. I am a domestic violence survivor and #IAmNotOk.’", "title": "Deepika Padukone And Ranveer Singh Top The Internet Today And More From The World Of Ent!", "date_publish": "13/03/2019, 18:35:41", "description": "Recently, the lovebirds were spotted at Mumbai airport as they were heading to fly for London, where they will unveil her wax statue at Madame Tussaud's museum. Going the pictures, DeepVeer, as they are fondly called by their fans, couldn’t let go of each other’s hands. They flashed big smiles on their faces. Take a look!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-padukone-and-ranveer-singh-top-the-internet-today-and-more-from-the-world-of-ent-363666.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/top_bollywood_news_1552480210_800x420.jpg"}