{"text": "Deepika Initially Wanted An Open Relationship But Ended Up Falling For Ranveer in Six Months!\nDeepika Initially Wanted An Open Relationship But Ended Up Falling For Ranveer in Six Months!\nDeepika Padukone and Ranveer Singh left all their fans gushing when they finally got married after dating for six years on Nov 14 and 15 in Italy. And since then, they have been giving us couple goals. They are beaming with joy and they just can’t stop gushing about each other.\nAFP\nDeepika Padukone and Ranveer Singh kept their relationship hush-hush for a very long time. However, now they are gradually spilling the beans on how it happened. Their love story began on the sets of Ram Leela, and it wasn’t the love-at-first-sight kind of love.\nRecently, Deepika revealed that when she met Ranveer Singh, she wanted an open relationship – not because she wasn’t sure about him, but because she was reeling from a major heartbreak and was not ready for a committed relationship.\nPTI\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n“I’d been in several relationships before and many times my trust was broken. When I met Ranveer, I was exhausted. I’ve never casually dated anyone. I’ve been in relationships since I was13. Now that I’m married I can say this. Whether it was one year, two years or three years, they were always proper relationships. It was always if you like someone you give it your hundred percent,” she told Filmfare.\nHowever, six months after dating, Deepika said that she knew she has found the love of her life. \"After that it was when do we get married? I was never unsure about him,\" she said.\nIsn't Deepika and Ranveer the most adorable couple of B-Town?", "title": "Deepika Initially Wanted An Open Relationship But Ended Up Falling For Ranveer in Six Months!", "date_publish": "30/12/2018, 15:20:30", "description": "Recently, Deepika revealed that when she met Ranveer Singh, she wanted an open relationship – not because she wasn’t sure about him, but because she was reeling from a major heartbreak and was not ready for a committed relationship. Recently, Deepika revealed that when she met Ranveer Singh, she wanted an open relationship – not because she wasn’t sure about him, but because she was reeling from a", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/deepika-initially-wanted-an-open-relationship-but-ended-up-falling-for-ranveer-in-six-months-359512.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_initially_wanted_an_open_relationship_with_ranveer_but_eventually_fell_for_him_1546162783_800x420.jpg"}