{"text": "DeepVeer Turn Heads As They Ditch Ethnic Wear & Sizzle In Black & Red At Their Last Reception!\nDeepVeer Turn Heads As They Ditch Ethnic Wear & Sizzle In Black & Red At Their Last Reception!\nCelebrations and joy double up when shared and Ranveer Singh and Deepika Padukone think exactly the same. After a dreamy fairytale wedding in Lake Como, Italy, Ranveer and Deepika are now celebrating this union in ways more than one.\nAfter two receptions-one in Bengaluru and one in Mumbai, the last leg of celebrations begins with film fraternity celebrating this wedding together.\nTonight's party is for Deepika and Ranveer's friends from the industry and it consists of creme de la creme of the B-Town.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nWhile the guest list consists of SRK, Bachchan family, Farah Khan, Bhansali, Anil Kapoor and family and a lot of their other co-stars and people they have worked with.\nFor this celebration, they ditched ethnic wear and sizzled in black and red for the final reception. The lovebirds looked adorable as they were again spotted giggling, smiling and looking at each other while posing for their pap friends. Have a look at the pictures that speak for itself.", "title": "DeepVeer Turn Heads As They Ditch Ethnic Wear & Sizzle In Black & Red At Their Last Reception!", "date_publish": "01/12/2018, 21:37:04", "description": "Deepika-Ranveer Turn Heads Again As They Twin In XYZ At Their Mumbai ReceptionDeepika-Ranveer Turn Heads Again As They Twin In XYZ At Their Mumbai ReceptionDeepika-Ranveer Turn Heads Again As They Twin In XYZ At Their Mumbai ReceptionDeepika-Ranveer Turn Heads Again As They Twin In XYZ At Their Mumbai Reception", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepveer-turn-heads-as-they-ditch-ethnic-wear-sizzle-in-black-red-at-their-last-reception-357743.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_1543680108_800x420.jpg"}