{"text": "Bollywood actress Deepika Padukone and Priyanka Chopra will certainly not stop making news anytime soon. Right from their super lavish wedding to being called as the sexiest ladies in Asia, the actresses are nailing it in very sphere.\nBollywood star Deepika Padukone has topped a list of ‘50 Sexiest Asian Women’ released on Wednesday.\nThe award-winning actress behind recent box-office hits such as Padmaavat and Bajirao Mastani beat off competition from around the world as part of a list compiled annually by UK-based Eastern Eye weekly, which highlighted that the 32-year-old’s “dream year” included marrying fellow actor Ranveer Singh and a stunning turn on the Cannes Film Festival red carpet.\n“Apart from being the undisputed queen of Bollywood and a strikingly beautiful star, what really makes Deepika Padukone special is how big her heart is and how grounded she has remained throughout her remarkable rise,” said Asjad Nazir, the newspaper’s Entertainment Editor behind the annual list, which is now in its 15th year.\n“Deepika’s humility has been inspirational and the way she makes a positive impact through raising awareness about mental health is showing everyone that being yourself and letting your inner light shine is the new sexy,” he said.\nLast year’s topper, actress Priyanka Chopra, came in second as she celebrated another year of being a great global ambassador for India, including her own high-profile nuptials to singer Nick Jonas in Rajasthan over the weekend.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 460 SHARES 161 SHARES\nTelevision actress Nia Sharma came in at number three as she held onto her position as the sexiest TV star in the list for the third year in a row. “As much as I want to hide my excitement right now, I cannot help but smile brightly and let out a big hurray because it truly feels awesome,” said Sharma, in reference to her entry.\nPakistani actress Mahira Khan came in fourth and held onto her title as the sexiest Pakistani as she marked another strong year as a strong symbol of girl power and raising money for charity.\n“I am grateful to be part of this list once again. My fans are my strength so thank you to them. I think personally sexy is what sexy does and I hope to continue to work hard at what I do with as much as passion as I have been from the start,” she said.\nThe rest of the top 10 completing the 2018 list includes Shivangi Joshi (5), Alia Bhatt (6), Sonam Kapoor (7), Hina Khan (8), Katrina Kaif (9) and Niti Taylor (10). The highest-placed newcomer in the list is rising star Ashi Singh (18) and the youngest in the list is 20-year-old television actress Shivangi Joshi (5).\nOne of two editor’s choices for 2018 is actress Sanam Saeed (19), for “pushing the creative boundaries in Pakistan and regularly speaking about a wide array of important social issues including women’s empowerment”.\nThe second editor’s choice, and the oldest in the list, is 51-year-old actress Madhuri Dixit (45). Other highlights include Helly Shah (11), Drashti Dhami (12), Jennifer Winget (13), Erica Fernandes (15), Surbhi Chandna (16), Gauahar Khan (17), Anushka Shetty (22), Armeena Rana Khan (24), Aishwarya Rai Bachchan (30), Athiya Shetty (31), Jameela Jamil (34), Jasmin Walia (38), Mehwish Hayat (40), Iqra Aziz (46) and Jacqueline Fernandez (47).\nThe ‘50 Sexiest Asian Women’ list, which is compiled through a series of social media and related polling, will be formally released next Friday.\nInputs From PTI", "title": "Deepika Padukone Voted 'Sexiest Asian Woman' In UK Poll, Priyanka Chopra Comes Second", "date_publish": "06/12/2018, 10:46:36", "description": "Bollywood star Deepika Padukone has topped a list of ‘50 Sexiest Asian Women’ released here on Wednesday. The award-winning actress behind recent box-office hits such as Padmaavat and Bajirao Mastani beat off competition from around the world as part of a list compiled annually by UK-based Eastern Eye weekly, which highlighted that the 32-year-old’s “dream year” included marrying fellow actor Ranv", "authors": [], "url": "https://www.indiatimes.com/entertainment/deepika-padukone-voted-sexiest-asian-woman-in-uk-poll-priyanka-chopra-comes-second-358032.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_1544077222_800x420.jpg"}