{"text": "Deepika Is Impressed With The Trailer Of Ranveer's Simmba, Feels It'll Be A Blockbuster!\nDeepika Is Impressed With The Trailer Of Ranveer's Simmba, Feels It'll Be A Blockbuster!\nRanveer Singh and Deepika Padukone's relationship has set some high benchmark for other millennial couples to follow. From respecting each other to being highly supportive of each other's personal and professional choices, their relationship is rock-solid and purely because of these factors.\nAfter their wedding celebrations in Italy, Bengaluru, and Mumbai, the couple is back to business and fulfilling their work commitments.\nAgencies\nWhile Singh is busy promoting his upcoming Masala film Simmba, Padukone is busy juggling between endorsements and events.\nViral Bhayani\nShe was recently attending a Kids' Awards show when she was asked to comment on Ranveer's film Simmba. Deepika, who has been fond of Rohit Shetty since Chennai Express was all gaga over the film and husband Ranveer.\nShe claimed that the film will be a blockbuster. She was quoted as saying,\nTwitter\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n\"I think it has success written all over it. So, I think we are just focused on his film's release and then, we will figure out honeymoon and birthday all after that.\"\nJust to jog your memory a little, when Ranveer was addressing the media at the trailer launch of Simmba, he had mentioned that he made Deepika watch few rushes of the film and she had complimented him saying \"Hot lag raha hai\".\nOn Thursday, reiterating that, Deepika said,\n\"Yes, I did when I watched the trailer. Of course, I loved it. It's a signature Rohit Shetty film and I have had the pleasure of working with him (in \"Chennai Express\") in creating one of my most memorable characters. But having said that, Simmba is on its way to becoming a blockbuster.\"\nStarring Sara Ali Khan, Ashutosh Rana and Sonu Sood in pivotal roles, the film is scheduled for December 28 release.", "title": "Deepika Is Impressed With The Trailer Of Ranveer's Simmba, Feels It'll Be A Blockbuster!", "date_publish": "15/12/2018, 11:15:20", "description": "She said, \"It's a signature Rohit Shetty film and I have had the pleasure of working with him (in \"Chennai Express\") in creating one of my most memorable characters. But having said that, \"Simmba\" is on its way to becoming a blockbuster.\"The film also features Sara Ali Khan, Ashutosh Rana and Sonu Sood in pivotal roles.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-is-impressed-with-the-trailer-of-ranveer-s-simmba-feels-it-ll-be-a-blockbuster-358637.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_1544853774_800x420.jpg"}