{"text": "Deepika's First Look From Chhapaak Is Out, Big B's Sweetest Gesture And More From Ent\nDeepika's First Look From Chhapaak Is Out, Big B's Sweetest Gesture And More From Ent\nOne such risk is taken by Meghna Gulzar and Deepika Padukone. Apart from acting in Chhapaak, Deepika will also be donning the producer's hat for this one. Today, Deepika shared the first look as an acid attack survivor and people are impressed. Her friends from the film fraternity started pouring lovely messages.\nBut what's winning our hearts is how Big B was the most adorable Daddy! Amitabh and Jaya Bachchan were sitting at the front row as they cheered for their daughter Shweta who sported two ensembles - a bridal lehenga and a trademark Abu Sandeep chikankari creation for the ramp show. Have a look at the pictures and videos right here.\nFor all the Bird Box fans, here's a good news! After its successful on-screen adaptation on Netflix, the \"Bird Box\" book franchise is heading for a sequel, titled \"Malorie\", author Josh Malerman has confirmed. The new book, which releases on October 1, derives its name from Sandra Bullock's character, Malorie Hayes in the acclaimed 2018 post-apocalyptic horror.\nDon't Miss 10.9 K SHARES\nAfter missing his flight, Keanu was seen waiting and interacting at the airport. He later took a bus ride with them. Someone who was present shot a video of the entire experience. And people are absolutely bowled away by his niceness.\nThe Game of Thrones star on Saturday took to Instagram to express gratitude towards the audience after she shared her secret health scare in an essay for The New Yorker, which she faced soon after the success of the first season of the HBO epic-fantasy drama.", "title": "Deepika's First Look From Chhapaak Is Out, Big B's Sweetest Gesture And More From Ent", "date_publish": "25/03/2019, 17:31:42", "description": "One such risk is taken by Meghna Gulzar and Deepika Padukone. Apart from acting in Chhapaak, Deepika will also be donning the producer's hat for this one. Today, Deepika shared the first look as an acid attack survivor and people are impressed. Her friends from the film fraternity started pouring lovely messages.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-s-first-look-from-chhapaak-is-out-big-b-s-sweetest-gesture-and-more-from-ent-364280.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/entertainment_stories_1553515484_800x420.jpg"}