{"text": "DeepVeer Are Fulfilling Work Commitments Like Pros, Prove Their Marriage Is Easy Breezy So Far\nDeepVeer Are Fulfilling Work Commitments Like Pros, Prove Their Marriage Is Easy Breezy So Far\nAfter a five-day wedding at Lake Como, Italy, Ranveer and Deepika returned to India for their second round of celebrations. They hosted three wedding receptions in India where guess who enjoyed the most? DeepVeer themselves!\nThey danced like no one's watching and made sure their celebrations are all about happiness and joy!\nThat's not all- They flew down to Udaipur for Isha Ambani and Anand Piramal's pre-wedding festivities, where they made heads turn again with their love and dance!\nWell, this is just the beginning of a new phase in their lives and they are making the most of it by striking a great balance between work and personal life.\nDon't Miss 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nAgencies\nNothing much has changed for either of the two and their marriage looks easy-breezy as they juggle between partying, chilling, having fun and enjoying their lives as a married couple.\n1. Ranveer is busy promoting his upcoming film Simmba, where he is mostly seen chilling, dancing, having a great time and going gaga over his marriage and gushing over Wifey Deepika Padukone.\nScreengrab\nTwitter\nDuring a recent Conclave in Mumbai, Singh went on to talking about wife Deepika and how 'perfect' a person she is.\n2. Marriage celebrations continue for DeepVeer but she's fulfilling work commitments like a pro, that she is already is. Deepika too is back to the normal grind. She shot for an episode of Filmfare's show and is busy attending events.\nAgencies\nAgencies", "title": "DeepVeer Are Fulfilling Work Commitments Like Pros, Prove Their Marriage Is Easy Breezy So Far", "date_publish": "14/12/2018, 17:38:33", "description": "Nothing much has changed for either of the two and their marriage looks easy-breezy as they juggle between partying, chilling, having fun and enjoying their lives as a married couple. 1. Ranveer is busy promoting his upcoming film Simmba, where he is mostly seen chilling, dancing, having a great time and going gaga over his marriage and gushing over Wifey Deepika Padukone.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepveer-are-fulfilling-work-commitments-like-pros-prove-their-marriage-is-easy-breezy-so-far-358617.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_and_ranveer_1544789497_800x420.jpg"}