{"text": "The Indian film fraternity showed up in high numbers to exercise their franchise in the fourth phase of the Lok Sabha elections. Actors Aamir Khan, Shabana Azmi, Farhan Akhtar, Kangana Ranaut, filmmaker Madhur Bhandarkar and several other celebrities on Monday thronged polling stations in Mumbai to exercise their franchise in the fourth phase of the Lok Sabha elections.\nScreengrab\nActor Aamir Khan and his wife Kiran Rao cast their vote at St Anne’s High School. Khan urged people to come out in big numbers and vote.\n\"Each day of the voting, in a different part of the country, is the day you are selected for the voting, is an important day. It is very important for each and every Indian to be a part of it. So, cast your vote. Both Kiran and I are here to do that today. We have just done that,\" he said while speaking to media here.\nDon't Miss 638 SHARES 255 SHARES 664 SHARES\nKhan also shared a joke while highlighting the importance of voting. He said: \"Once American president went for a walk and met a man on the way. They started talking and the man asked what do you do? To which he replied that I am the President. Now the president asked the man what he does. The man replied I choose the president.\"\nActress Deepika Padukone on Monday cast her vote for the Lok Sabha elections and shared a selfie with her inked finger, setting aside speculation about her citizenship.\n\"Never has there been any doubt in my mind about who I am or where I'm from. So for those of you confused on my behalf... please don't be! Jai Hind! Proud to be an Indian go vote,\" Deepika wrote in her tweet.\nHer post was in reference to speculation about her citizenship since she was born in Copenhagen, Denmark. In a video online, Deepika is also seen fielding a question on her citizenship at a press event. She added,\n\"I hold an Indian passport... from where do you get this information anyway.\"\nWhen she was cross-questioned about having been born in Denmark, Deepika said: \"But I still have an Indian passport. There's a lot of complication and I am very much an Indian, a proud Indian citizen.\"\nFor casting her vote on Monday, Deepika chose a casual look in a pair of jeans and a white loose shirt. Her husband, actor Ranveer Singh also cast his vote and took to social media to share a picture of his inked finger.\nOn the professional front, Deepika will next be seen in Chhapaak, a film based on an acid attack survivor and directed by Meghna Gulzar. It also stars Vikrant Massey.\n(With agency inputs)", "title": "Deepika Padukone Sets Aside Speculation About Her Citizenship, Casts Vote In Mumbai!", "date_publish": "30/04/2019, 15:18:18", "description": "For casting her vote on Monday, Deepika chose a casual look in a pair of jeans and a loose shirt. Her husband, actor Ranveer Singh also cast his vote and took to social media to share a picture of his inked finger. When she was cross-questioned about having been born in Denmark", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-padukone-sets-aside-speculation-about-her-citizenship-casts-vote-in-mumbai-366347.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/deepika_padukone_1556619032_800x420.jpg"}