{"text": "Security at both venues is on a par with that provided for a meeting of world leaders. At the CastaDiva resort, for instance, any and all guests or visitors have to present a special wristband while security guards cover up the camera lenses on mobile phones with stickers.\nThe fairytale wedding celebrations kickstarted two days ago with Deepika and Ranveer's family in attendance and the details that have come out prove that the bride and groom are very emotional with so much love and support around them.\nAs per reports, heavy patrolling is done in and around their wedding venue and celebs, family, staff and florists are all required to submit their phones at the entrance to avoid any pictures getting leaked.\nDon't Miss 10.9 K SHARES\nThe couple will return to India and host a grand reception for their industry friends and family. Their fraternity friends are full of joy and happiness and they poured wishes for the couple.\nWondering what has she done now? To give you a bit of context, she was at a Continental Wrestling Entertainment (CWE) match in Panchkula, Haryana. She was supposed to perform there but she waged a war. She challenged a wrestler and got knocked out so bad that she landed in a hospital soon after. It is said that she suffered a lumbar injury in the tailbone area. But has that put a stop to the motor mouth that she is? Of course, NOT!", "title": "Deepika-Ranveer Finally Get Hitched In Traditional Konkani Style And More From Ent World", "date_publish": "14/11/2018, 18:01:54", "description": "Security at both venues is on a par with that provided for a meeting of world leaders. At the CastaDiva resort, for instance, any and all guests or visitors have to present a special wristband while security guards cover up the camera lenses on mobile phones with stickers.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-ranveer-finally-get-hitched-in-traditional-konkani-style-and-more-from-ent-world-356679.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_1542197467_800x420.jpg"}