{"text": "DeepVeer To Enter The Bond Of Holy Matrimony In Konkani Ceremony Today. Here Are All The Deets!\nDeepVeer To Enter The Bond Of Holy Matrimony In Konkani Ceremony Today. Here Are All The Deets!\nAfter dating for over six years, Bollywood's most graceful and popular couple Ranveer Singh and Deepika Padukone are all set to tie the knot today at Lake Como in Italy.\nSecurity at both venues is on a par with that provided for a meeting of world leaders. At the CastaDiva resort, for instance, any and all guests or visitors have to present a special wristband while security guards cover up the camera lenses on mobile phones with stickers.\nTwitter\nAccording to agency reports, the couple has taken strict measures to ensure security.\nRanveer's event took place at the ultra-luxurious CastaDiva Resort overlooking Lake Como while Deepika's ceremony took place at the even more glamorous Villa d' Este about 5 kilometers away.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nThe couple officially exchanged rings post a Phool Muddi ceremony and reports claimed that couple welcomed their guests personally at the entrance of the venue. Both chose western outfits.\nPinterest\n(Read more about Ranveer-Deepika's first day of wedding celebrations here.)\nWhile Deepika donned a white dress, Ranveer chose black. After the engagement ceremony, a formal sit-down dinner took place.\nToday, a Konkani-style wedding ceremony is expected to take place. ANI has reported that Shah Rukh Khan, Farah Khan and Sanjay Leela Bhansali will be the only ones from the fraternity who have been invited to attend the ceremonies.\nTwitter\nAccording to a Filmfare report, Deepika will be dressed in a traditional white and gold silk sari for the Konkani ceremony and will wear a red lehenga on day two.\nWhile we are eagerly waiting to catch a glimpse of the couple, for now, we can only wish them lifelong happiness and love.", "title": "DeepVeer To Enter The Bond Of Holy Matrimony In Konkani Ceremony Today. Here Are All The Deets!", "date_publish": "14/11/2018, 11:49:59", "description": "Today, a Konkani-style wedding ceremony is expected to take place. ANI has reported that Shah Rukh Khan, Farah Khan and Sanjay Leela Bhansali by be the only ones from the fraternity who have been invited to attend the ceremonies. According to a Filmfare report, Deepika will be dressed in a traditional white and gold silk sari for the Konkani ceremony and will wear a red lehenga on day two.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/deepveer-to-enter-the-bond-of-holy-matrimony-in-konkani-ceremony-today-here-are-all-the-deets-356618.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542175802_800x420.jpg"}