{"text": "DeepVeer Pre-Wedding Rituals Are In Full Swing As Ranveer Singh Shines Bright At His Haldi Ceremony\nDeepVeer Pre-Wedding Rituals Are In Full Swing As Ranveer Singh Shines Bright At His Haldi Ceremony\nThe wedding festivities have begun for Deepika Padukone and Ranveer Singh. The couple who is head over heels in love with each other are gearing up to begin their new happy phase of life together, and of course, they are on cloud nine.\nWhile we were all prepping up for Diwali, a few days ago designer Sabyasachi gave us a glimpse inside bride-to-be Deepika Padukone’s wedding rituals at her Bangalore home. She beamed with happiness at the Nandi Pooja.\nAnd today, Ranveer Singh was spotted at his house amid his Haldi ceremony reportedly. According to the reports, today Ranveer Singh celebrated Haldi ceremony at his home. He was happily smiling while casting director Shanoo Sharma from Yash Raj Films took selfies with him. Take a look at the pictures below.\n#1\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES 185 SHARES\n#2\n#3\n#4\n#5\nRanveer Singh and Deepika Padukone will tie the knot on Nov 14- 15 in Italy reportedly.\nAlso Read: Finally! Ranveer Singh & Deepika Padukone Announce Their Wedding Date, Seek Everyone's Blessings", "title": "DeepVeer Pre-Wedding Rituals Are In Full Swing As Ranveer Singh Shines Bright At His Haldi Ceremony", "date_publish": "04/11/2018, 17:51:04", "description": "And today, Ranveer Singh was spotted at his house amid his Haldi ceremony reportedly. According to the reports, today Ranveer Singh celebrated Haldi ceremony at his home. He was happily smiling while casting director Shanoo Sharma from Yash Raj Films took selfie with him. Take a look at the pictures below.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/deepveer-pre-wedding-rituals-are-in-full-swing-as-ranveer-singh-shines-bright-at-his-haldi-ceremony-356041.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/groomtobe_ranveer_singh_beams_with_happiness_as_he_celebrates_his_haldi_ceremony_at_home_1541334194_800x420.png"}