{"text": "This is one of the most anticipated movies of Bollywood. Deepika Padukone has taken a one year break after her marriage to fully get into the skin of acid attack survivor for her upcoming film, Chaapaak. Yes, we won't be seeing any of her releases this year as the actress is preparing for the toughest role of her career.\nThe actress plays the role of Laxmi Agarwal who was attacked in 2005 at age 15 by 2 men whose advances she had rejected. The movie has been helmed by Meghna Gulzar and produced by Deepika Padukone.\nThis marks DP's debut as a producer and this is an important project for her. The actress is currently shooting with Vikrant Massey in Delhi. With the prosthetic make up, no one could recognise the leggy lass. Take a look at the photos that resurfaced.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nIndiatimes\nTwitter\nIndiatimes\nThe paparazzi managed to get their hands on some footage and video as well.\nThe movie is slated to release on 10th January, 2020 and we can't wait to see the response of the audience on such a sensitive topic. More power to Deepika for taking on such brave role.", "title": "Deepika Padukone & Vikrant Massey Spotted Filming 'Chhapaak' On The Streets Of Delhi And She's Unrecognisable", "date_publish": "10/04/2019, 13:20:44", "description": "The duo were shooting in Rajouri Garden when they paparazzi got videos and photos of them. Take a look.The duo were shooting in Rajouri Garden when they paparazzi got videos and photos of them. Take a look. The duo were shooting in Rajouri Garden when they paparazzi got videos and photos of them. Take a look.The duo were shooting in Rajouri Garden when they paparazzi got videos and photos of them.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/deepika-padukone-vikrant-massey-spotted-filming-chhapaak-on-the-streets-of-delhi-and-she-s-unrecognisable-365173.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/deepika_1554878710_800x420.jpg"}