{"text": "Aditya Dhar's Uri is unstoppable at the box-office as it continues to get love from the audience and the fraternity.\nVicky Kaushal and Yami Gautam's film has already registered itself as the first official hit of 2019. Uri: the surgical strike is in its third week of running and the cinema halls are still full as fans continue to hoot the popular dialogue: How's the Josh!\n(Also read: From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood)\nDon't Miss 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nThis fever is spreading like a wildfire and the new member in this josh club is Defence Minister Nirmala Sitharaman.\nAccording to a video that has resurfaced online, Nirmala Sitharaman watched Uri with war veterans and even she couldn't stop herself from saying the dialogue aloud.\nTwitter\nIn the video, she is seen saying “How’s the Josh?” and to that, there is a quick response by the war veterans who reply “High Sir.”\nAfter Modi, this is just another instance that proves how the film and the dialogue went on to become a rage! The film has already crossed the 150-crore mark as it continues to run successfully in the theatres.\nWatch the video right here:\n(Movie stills: RSVP Films)", "title": "Defence Minister Nirmala Sitharaman Watches The Film And Asks The Audience 'How's The Josh'!", "date_publish": "28/01/2019, 13:38:57", "description": "Aditya Dhar's Uri is unstoppable at the box-office as it continues to get love from the audience and the fraternity. The film has already registered itself as the first official hit of 2019. Uri: the surgical strike is in its third week of running and the cinema halls are still full as fans continue to hoot the popular dialogue: How's the Josh!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/defence-minister-nirmala-sitharaman-watches-the-film-and-asks-the-audience-how-s-the-josh-361159.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_movie_1548663072_800x420.jpg"}