{"text": "Even Thugs Of Hindostan didn’t work, that doesn’t make Aamir Khan or Amitabh Bachchan bad actors, says the ace singer Sonu Nigam who had an unsuccessful career in acting.\nTalking exclusively with Indiatimes, Sonu Nigam clarifies why he didn’t continue to pursue acting. Sonu Nigam is undoubtedly the most talented and loved singer in the industry. However, he was unsuccessful as an actor. Nigam who has acted in films like Jaani Dushman, Kaash Aap Hamare Hote, and Love In Nepal, defends his flop acting career saying,\nTwitter\n\"The thing is I never made a film for myself, Himesh Reshammiya made a film for himself, everybody made films for themselves, I didn’t launch myself, people came to me, so they must have seen something in me. They had seen me performing in my music videos, so they found something in me and came to me, but the films didn’t do well, even Thugs Of Hindostan didn’t work, that doesn’t make Aamir Khan or Amitabh Bachchan a bad actor.\nTwitter Twitter\n\"Films not working is a different thing, I know what I am, public perception doesn’t matter to me at all. There are people who do not even deserve to be on screen and you guys are still watching them.”\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nNigam admits acting wouldn’t take him places so he stopped for good, “ Also I lead a very busy and productive life, to invest 100 days for a film without even knowing the outcome is not good for me, the actors can afford this, if I do this I will be missing out from music and concerts. I have a career running, I can’t afford a Thugs Of Hindostan, Aamir or Amitabh will start something again because they are only actors. I am not only an actor, people are expecting so much of music from me, how can I give time to something which doesn’t have any guarantee, so that is why I didn’t allow anyone to give me a movie. Even now I get lots of offers but I don’t do it.\"\nTwitter\nWell, Nigam’s experience as an actor was not at all melodious.", "title": "Defending His Unsuccessful Acting Career, Sonu Nigam Says Even Thugs Of Hindostan Didn’t Work That Doesn’t Mean Amitabh Or Aamir Are Bad Actors", "date_publish": "18/01/2019, 12:06:53", "description": "Even Thugs Of Hindostan didn’t work, that doesn’t make Aamir Khan or Amitabh Bachchan a bad actor, says the ace singer Sonu Nigam who had an unsuccessful career in acting.Talking exclusively with Indiatimes, Sonu Nigam clarifies why he didn’t continue acting. Sonu Nigam is undoubtedly the most talented and loves singer in the industry. But he was unsuccessful as an actor. Nigam who has acted in fi", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/defending-his-acting-career-sonu-nigam-draws-comparison-with-big-b-aamir-the-thugs-of-hindostan-debacle-360601.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sonu_nigam_1547793393_800x420.jpg"}