{"text": "With every passing minute, #MeToo movement has been gaining strength in the country. The culture which showed up in the West has seeped into Bollywood and it's only increasing.\nAfter Sajid Khan, Alok Nath, Nana Patekar, the latest to join the bandwagon of being accused is Karim Morani. The survivor recalled the incident of how Karim promised to marry her but never did.\nShe's equally shocked at how SRK continues to work with the man who has been allegedly involved with the 2G scam and sexual harassment. Speaking to a leading channel Republic, the Delhi based actress said,\nTwitter\nDon't Miss 862 SHARES 346 SHARES 357 SHARES\nThe actress shifted to Mumbai in 2014 and knew Morani’s family. It was in 2015, when Morani came over to her place with a bottle of wine and forced her to drink.\n\"Next thing I know, I wake up at 4am. I was numb and shocked. Physically and mentally, I was in a state of shock. Karim was not there. I saw there were marks on my body when I woke up,” she recounted.\n“I found the courage and called him next day. I confronted him and asked him - what did you do to me? I told him I'd call his wife and brother. He just laughed over the phone. Can't forget that laughter. I felt helpless. I was 21,” the actress continued.\nBollywoodCat\nShe revealed that later Morani started blackmailing her by saying, \"I'll get you killed by the underworld.\" She further said that Morani allegedly harassed her several times afterwards using her pictures as a ploy.\n“The after effects were that I stopped talking to people, stopped working, became a recluse. It wasn't just one time. He came over a couple of times more. It was 12th Sept 2015 and he calls me and says I want you to come here. I was scared he'd circulate my nude pictures to family. He sneaked me into the room. He didn't even let me leave.\"\nIt did not happen once but multiple times. No one supported her or backed her up.\nInstagram\nFor many who don't know, Morani is a top producer, having financed films like Shah Rukh Khan and Deepika Padukone-starrer Chennai Express. He co-produced Rohit Shetty's Dilwale, which featured Shah Rukh Khan, Kajol, Varun Dhawan and Kriti Sanon. He has also been the associate producer of Farah Khan's Happy New Year and Anubhav Sinha's Ra.One.", "title": "Delhi-Based Actress Accuses Karim Morani Of Allegedly Raping Her, Questions Why SRK Worked With Him", "date_publish": "12/10/2018, 18:13:00", "description": "With every passing minute, Me Too movement has been gaining strength in the country. The culture which showed up in the West has seeped into Bollywood and it's only increasing. After Sajid Khan, Alok Nath, Nana Patekar, the latest to join the bandwagon of being accused is Karim Morani. The survivor recalled the incident of how Karim promised to marry her but never did.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/delhi-based-actress-accuses-karim-morani-of-allegedly-raping-her-questions-why-srk-worked-with-him-354682.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/karim_morani_1539346416_800x420.jpg"}