{"text": "Denying Reports Of Stone Pelting During Assam Concert, Singer Shaan Says He Had A Great Time\nDenying Reports Of Stone Pelting During Assam Concert, Singer Shaan Says He Had A Great Time\nDenying all existing reports that he was pelted with stones during a concert here on Sunday night, Singer Shaan took to Twitter to share his side of the story. He wrote,\nTwitter\n“Complete lies!!! One Paper ticket folded up was thrown on stage by One Person after vigorously gestering and shouting to stop singing. That’s all ... please stop these wild speculations and lies.\"\nA few days ago also he had tweeted,\n“My outcry was not directed to that One Individual but to all who are harbouring these ‘Regional Divide’ Sentiments!!\nDon't Miss 5 K SHARES 174 SHARES\nA mole was turned into a mountain when a paper ball that was thrown on the stage was misconstrued as the stone that was reportedly pelted at the singer,\nAssistant commissioner of police, Basistha, Nandini Kakati, who was present at the venue, was quoted in The Telegraph saying,\n“I don’t know who spread these rumors but no stone was thrown at the singer, it is absolutely false.”\nHowever, this incident triggered on Sunday, and it was reported that Shaan lost his cool after the paper ball dropped beside him on stage.", "title": "Denying Reports Of Stone Pelting During Assam Concert, Singer Shaan Says He Had A Great Time", "date_publish": "31/10/2018, 14:12:18", "description": "Shaan took to Twitter to clarify that he was not pelted with stones during the concert at Guwahati’s Sarusajai stadium on Sunday as reported. An ANI report claimed that the singer Shaan was pelted with stones and paper balls after he sang a Bengali song during the performance. “Please respect the performing artist, ”Shaan was quoted as saying before walking off the stage after his performance.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/denying-reports-of-stone-pelting-during-assam-concert-singer-shaan-says-he-had-a-great-time-355785.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/shaan_1540974023_800x420.jpg"}