{"text": "In the ongoing wake of the #MeToo movement in India, national-award-winning writer-lyricist-comedian Varun Grover was accused of ‘touching’ a fellow student inappropriately while studying at IIT-BHU, Varanasi in 2001.\nInstagram\nGrover had reacted to the accusations. Reacting to them, he had tweeted a statement. Calling them “misleading” and “defamatory”, he had earlier written,\nHere's my detailed statement about the completely fabricated, misleading, and defamatory allegations against me. Am absolutely willing to cooperate and clear my name. Let's not allow such agenda-driven tactics to derail this movement please. pic.twitter.com/VTFeIjygcl — वरुण (@varungrover) October 9, 2018\nGrover has again stood up for himself. Maintaining his stance of not being ‘involved in any such incident with anybody’ in his entire life, Grover wrote an open letter.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn his open letter, Varun Grover mentions how there were only 36 women studying with him in the university, out of which only four were a part of the theater group. In his letter, he explains his stand and mentions how according to him, all these four women not only expressed their solidarity but also checked with the remaining 32 if such an incident happened.\nTwitter\nIn his open letter, Varun wrote,\n'Revolutions are beautiful. They are cathartic, powerful, necessary, and like #metoo — inevitable. And revolutions, inevitably, have some collateral damage too.\nLast week has been a whirlwind of sorts in my life. Amidst the distress and confusion, I have discovered the kind solidarity of many strangers. I was at the receiving end of an anonymous allegation that I know and can prove to be false. In the macro perspective, the wave is bigger and way more important than my isolated small case. Centuries of patriarchy and oppression have created a system that cannot be taken down through polite means.\nHowever, at the same time, my isolated small case does mean the world to me, my family and friends. It affects not just my mental health and professional life but my ability to take a social stand on every injustice I want to speak about.\nAnd therefore, I feel this earnest need to present my side even though no formal complaint has been filed against me. This closure is needed to maintain my own sanity.\nThe allegations:\nOn 9th October 2018 at around noon, two screenshots sent by an anonymous account on Twitter alleged that I had sexually harassed the person, a junior to me in college (IT-BHU, Varanasi) in 2001. Within minutes the screenshots went viral and within an hour, news channels framed me as a sexual assaulter bundled with other prominent names. It was hurtful and disappointing that the media did not even make the simple distinction while reporting this allegation and other cases. The charges were made by a single anonymous account in my case and multiple well-known women they could reach directly for comments in many of the other cases.\nMy stance:\nI categorically deny the allegations in their entirety as completely baseless fabrications. I have never been involved in any such incident with anybody in my entire life.\nThe evidence of my innocence:\nAs stated in my initial statement, I will be readily available to face any independent inquiry to present the facts and help bring the truth out.\nUntil that happens, I can only present some new findings from my side that refute the allegations made.\nA female junior in college in 2001:\na) I joined IT-BHU in July 1999 for a 4-year under-grad course in Civil Engineering. New batches arrive in July every year. So a junior to me in 2001 would mean two batches — 2000–2004 and 2001–2005.\nAs per official records, in the batch of 2000–2004, a total of 25 females joined the under-grad course and in the batch of 2001–2005, the total female strength was 11. That makes it a total of 36 female students that were my junior at that time.\nOut of these 36, my theatre group worked with only four during the course of our stay at the institute and they have remained friends. As the news broke out, these four reached out to me and expressed their solidarity.\nExtending their support further, these 4 women reached out to the rest 32 of the female students (spread across the globe) that were my junior at that time and have received confirmation from each one of them that such an incident did not happen. These confirmations can be verified by any independent inquiry.\nThis proves clearly that the person making the allegations on twitter did not even attend the same college as mine at the time of the incident stated in the allegation.\nb) The same check can be done by any independent authority asking the person making the allegations to furnish any valid id card (Engineering completion degree from IT-BHU, semester mark-sheets, original college ID card) to see if they even went to IT-BHU in the batches of 2000–2004 or 2001–2005.\nThe deadlock:\nI completely understand and support the need for anonymity in #metoo stories as our highly biased societal systems and male toxic behavior leave most women no space or platform to speak of their traumas openly or even in private.\nNo account should be stopped from being published because of its anonymity — but once fact-based counter-claims are made by the accused, the movement as a collective can perhaps make space for the intent to verify them. Further, if the allegations are found untrue, the movement can announce them to be considered removed or at the very least the account can be labeled as ‘pending verification’, till the contested claims are checked.\nOver the last 5 days on social media — my requests for carrying out these basic checks have been met with silence, leaving me in a constant state of mental trauma and anguish.\nWell-wishers have repeatedly suggested going the legal route to force a solution but I respect the movement, its volunteers, and all the brave women speaking out (openly or anonymously) immensely and won’t intend to affect it negatively. We all will be better allies if the closure is reached mutually.\nI understand the excruciating lengths every volunteer and supporter of the movement is traversing to make this cathartic moment in our history happen. I also understand that men have, throughout history, paid very little price even when found guilty while women have constantly suffered even by the faintest of rumors made on their character. A few factually inconsistent cases like mine won’t matter in the larger success of the movement. I am just a number, an abstract concept for the world outside.\nBut I am not an abstract concept for myself — my family and friends, suffering with me, deserve clarification. We deserve the same fairness this movement stands for.\nThe resolution:\nI’ve said all that I can on this situation and shared the facts that clearly refute the allegations made. If someone still has any concerns, I urge them to reach out to the National Commission for Women (NCW) or an independent commission and file a formal complaint. I will be grateful to present my case.\nAnd one last thing:\nAm I angry? Yes. Is my mental health in shambles? Yes. Do I occasionally feel like a victim of an agenda? Yes. And would I still say “Believe All Women”? Yes. But please bring in the checks to differentiate it from “Believe All Screenshots”.\nRevolutions can be messy but they can’t be perceived as unjust.\"\nRead Grover's statement here.", "title": "Denying All Sexual Harassment Charges Pressed Against Him, Varun Grover Writes An Open Letter", "date_publish": "16/10/2018, 12:02:53", "description": "In his open letter, Varun Grover mentions how there were only 36 women studying with him in the university, out of which only four were a part of the theater group. In his letter, he explains his stand and mentions how according to him, all these four women not only expressed their solidarity but also checked with the remaining 32 if such an incident happened.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/denying-all-sexual-harassment-charges-pressed-against-him-varun-grover-writes-an-open-letter-354864.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/varun_grover_1539672700_800x420.jpg"}