{"text": "Priyanka Chopra and Nick Jonas' romance is all set to take another turn. The couple who got engaged in August in Mumbai will tie the knot in Jodhpur amidst close friends and family.\nThe Hindu wedding on December 2, 2018, and the other one will be on December 3, 2018, as per Christian wedding rituals at the palatial Umaid Bhawan Palace, Jodhpur, Rajasthan.\nApart from the traditions and rituals for the couple, there are some deets on what they will wear. While PC has reportedly opted for Ralph Lauren custom-made gown. The report has been confirmed in Vogue’s January cover featuring two stars. The report states,\n\"Chopra will wear a custom gown by Ralph Lauren, very likely more than one.\" The magazine further went on to share that the ace designer himself “personally came to Chopra with sketches.”\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nAnd added, “Before this, Lauren has made wedding dresses only for his daughter, his daughter-in-law, and his niece. But he personally came to Chopra with sketches.”\nEven Nick will be seen in a desi dulha avatar, wherein he will “dress like royalty, as is customary—turban, sword—and he’ll ride in on a horse.” For all those who are waiting for this fairytale wedding to turn to reality, you are free to set your expectations high!\n(Also read: Nick Jonas To Go All Desi, Will Reportedly Whisk Away Priyanka Chopra In A Horse-Drawn Chariot!)", "title": "Desi Dulha Nick To Don A Turban, PC To Wear Ralph Lauren's Custom-Made Gowns For Wedding Functions", "date_publish": "30/11/2018, 11:48:17", "description": "Priyanka Chopra and Nick Jonas' romance is all set to take another turn. The couple who got engaged in August in Mumabi will tie the knot in Jodhpur amidst close friends and family. The Hindu wedding on December 2, 2018, and the other one will be on December 3, 2018, as per Christian wedding rituals at the palatial Taj Umaid Bhawan Palace, Jodhpur, Rajasthan.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/desi-dulha-nick-to-don-a-turban-pc-to-wear-ralph-lauren-s-custom-made-gowns-for-wedding-functions-357643.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_jonas_1543559058_800x420.jpg"}