{"text": "Bollywood actor Saif Ali Khan might have been in the industry for long and does not think twice before taking a plunge like the one in Sacred Games but when it comes to his daughter, he is nervous.\nYes, daddy Saifu is petrified to watch daughter Sara Ali Khan’s first film Kedarnath.\nTwitter\nThe film released today and it has been receiving a lot of accolades and everyone is especially praising Sara’s performance. In fact, many critics claim that she is so good that you will make you wonder if this is her first film.\nTwitter\nBut Saif is still worried and scared to watch his daughter on the silver screen. In fact, filmmaker Abhishek Kapoor had invited him and Amrita Singh for the Kedarnath screening but he didn’t budge. Saif was also asked by the media if he has watched the film and he said, “No I haven’t seen Kedarnath yet. But, I will very soon”.\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nHowever, a close source to an entertainment revealed the real reason behind this, “He is just petrified to watch Sara on screen. Kareena keeps urging him to watch Kedarnath. But, Saif keeps putting it off.”\nWe hope after reading such wonderful reviews about daughter Sara, Saif will watch the film and feel PROUD.", "title": "Despite Kareena's Request, Saif Ali Khan Is Too Nervous To Watch Sara's Debut Film Kedarnath", "date_publish": "07/12/2018, 14:58:56", "description": "Before you jump the gun, let us tell you Saif Ali Khan is petrified to watch daughter Sara Ali Khan’s first film Kedarnath. He is being like just any other father. The film as released today and it has been receiving a lot of accolades, especially everyone is praising Sara’s performance in the film. In fact, many critics claim that she is so unbelievable that you will make you wonder if this is h", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/despite-kareena-s-request-saif-ali-khan-is-too-nervous-to-watch-sara-s-debut-film-kedarnath-358130.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_1544175467_800x420.jpg"}