{"text": "Bollywood actor Kangana Ranaut has been making headlines ever since her controversial film Manikarnika released on the silver screen. The actress bashed her colleagues from the fraternity who did not come out to support the film.\nPicking Alia Bhatt, Ranbir Kapoor and Karan Johar, the actress didn't bat an eye lid before slamming them in public for bullying her. Her sister Rangoli Chandel, who is also Kangana's mananger, took to social media to lash out at star kids who have otherwise taken the 'silence' stance. But that did not go down well with Rangoli too.\nWhile whole world propagating speak up or me too Alia ji is going ‘ main chup rahoongi aur zulm sahoongi 😂 How regressive is that, coming from a British girl sounds strange 😜, if you take a leaf from Papa Jo’s book obviously it will be melodramatic 😂 — Rangoli Chandel (@Rangoli_A) April 23, 2019\nBut from the film fraternity, one celebrity has no qualms in admitting that Kangana is brave and quite a role model. Dharma launch actress Tara Sutaria. Speaking to an entertainment daily, the actress who is promoting her film Student Of The Year 2, said, 'Kangana has achieved everything on the basis of her talent and without any support whatsoever. And being an upcoming actor, for me, Kangana Ranaut is a role model as she has inspired me.'\nDon't Miss 106 SHARES 7.4 K SHARES\nAn elated Rangoli was quick to acknowledge the praise.\nTara so beautiful and kind ❤❤❤, wish you all the best with your debut 😘 https://t.co/C416qrLoKQ — Rangoli Chandel (@Rangoli_A) April 24, 2019\nStudent Of The Year is directed by Punit Malhotra and produced by Dharma Productions and we all know the equation KJo and Kangana shared once on the sets of Koffee With Karan. So this statement from Tara comes as a breath of fresh air.\nThe movie also stars Tiger Shroff, Ananya Pandey and a special appearance by Alia Bhatt. Infact, the Highway actress will be seen grooving alongside Tiger. Speaking about the experience, Tiger, at a promotional event, said,\n\"We had so much fun shooting the song. Personally, I have never done a dance number like that. Working with Alia was an amazing experience. Though she is such a big star, she was open and cooperative on set while shooting the song,\" Tiger told the media in Mumbai on Wednesday.\n\"She is better than me in this one,\" added Tiger, who is known for his dancing skills. For Tiger, who is considered the Indian MJ, this must come across as a huge compliment to Alia. We can't wait to see the dance number", "title": "Despite Getting A Dharma Launch, Tara Sutaria Considers Kangana Ranaut As Her Role Model", "date_publish": "25/04/2019, 13:07:30", "description": "Bollywood actor Kangana Ranaut has been making headlines ever since her controversial film Manikarnika released on the silver screen. The actress bashed her colleagues from the fraternity who did not come out to support the film.Bollywood actor Kangana Ranaut has been making headlines ever since her controversial film Manikarnika released on the silver screen. The actress bashed her colleagues fro", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/despite-getting-a-dharma-launch-tara-sutaria-considers-kangana-ranaut-as-her-role-model-366066.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kangana_1556177809_800x420.jpg"}