{"text": "Despite Raking In Over Rs 150 Crore In Two Days, '2.0' Falls Prey To Hilarious Memes & Jokes!\nDespite Raking In Over Rs 150 Crore In Two Days, '2.0' Falls Prey To Hilarious Memes & Jokes!\nIt was a long, long wait. Rajinikanth and Akshay Kumar starrer much-delayed and much-awaited sci-fi action movie, which was also one of the most ambitious projects of director Shankar, 2.0, has finally made its way into the cinema halls.\nWhile in the southern part of the country, the movie has received a stellar response from the audiences, in the northern part of India, the movie hasn’t been able to garner many praises. It’s Rajinikanth’s movie, after all. He is demi-god for many down south.\nNevertheless, 2.0 has minted over 150 crores worldwide in just two days, reports IMDb. And it is expected that the movie will gross over Rs 250 crore at the global box office in three days.\nTwitter\nBut people aren’t giving up on memes. Since the day the trailer of the movie was released, it became a butt of jokes on social media. Now that the movie is finally out, it’s raining memes and jokes on Twitter.\n#1\nDon't Miss 365 SHARES 402 SHARES\n#2\nsochta hu ki wo kya se kya ho gye\nkitne masum the dekhte dekhte @akshaykumar #2Point0 pic.twitter.com/9Y8oySbeHt — •。Śάητσśђ •。 (@SuperADianSP) September 13, 2018\n#3\n#2Point0Review reminds of #SHAKTHIMAAN after every episode there will be an advise to kids. Same formula here too. with less budget #Eindhiran was far better (technically also) — Sir Ramesh Kannan (@I_am_Also_SRK) November 29, 2018\n#4\n#5\n#2Point0 will give a tough competition to #ThugsOfHindostan .\nI wish it did some justice to such an insightful theme.#2Point0Review #2PointO — Sabornee Chakraborty (@sabychakraborty) December 2, 2018\n#6\n#7\n#8\n#2Point0Review Movie Review 2.0: I came out with a mixed feeling. Visual spectacle in some parts and average in the rest. 6.5 stars out of 10 #2Point0FDFS — Nausi Ali (@nausi_ali) November 29, 2018\n#9\nHaters sucide rate increasing day by day 😜#2Point0 ✌🏻️ is another milestone in Indian Cinema pic.twitter.com/xElwn9NHiT — Light Yagami (@army_aishu) December 3, 2018", "title": "Despite Raking In Over Rs 150 Crore In Two Days, '2.0' Falls Prey To Hilarious Memes & Jokes!", "date_publish": "03/12/2018, 13:52:50", "description": "Nevertheless, 2.0 has minted over 150 crores worldwide in just two days, reports IMDb. And it is expected that the movie will gross over Rs 250 crore at thBut people aren’t giving up on memes. Since the day the trailer of the movie was released, it became a butt of jokes on social media. Now that the movie has been released, it’s raining memes and jokes on Twitter. e global box office in three day", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/despite-raking-in-over-rs-150-crore-in-two-days-2-0-falls-prey-to-hilarious-memes-jokes-357826.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/20_mints_over_rs_150_crore_in_just_two_days_but_its_raining_memes__jokes_on_social_media_1543826922_800x420.png"}