{"text": "Despite Criticism & Bad Reviews, 'Zero' Becomes The 10th Highest Grossing Film Of 2018 Globally\nDespite Criticism & Bad Reviews, 'Zero' Becomes The 10th Highest Grossing Film Of 2018 Globally\nThe SRK starrer Zero was released with much anticipation in Bollywood, however it tanked almost immediately. Directed by Anand L Rai, the movie is about a man featuring Shah Rukh Khan, who is short in stature but big on love and how he meets two different women who help him broaden his horizon.\nScreengrab\nThe movie was launched with high expectations as it was a Khan film and after a very long time, fans were looking forward to the SRK-Anand L Rai collaboration. King Khan, who was last seen in Jab Harry Met Sejal came back with this movie and it was touted to be a mega hit with the coolest VFX.\nHowever, as per trade analyst Taran Adarsh, after opening with Rs 20 crore, the movie saw a dip in the first weekend only and was called 'disappointing'. The movie barely managed to get the crowd in the hall and the word of mouth ruined it further.\nDon't Miss 862 SHARES 5.1 K SHARES 346 SHARES\nBut in the recent turn of events, Zero has actually surpassed the worldwide figures of Rajkummar Rao starrer blockbuster Stree at the worldwide box office by making Rs 178 crore.\nIn fact, it has reached the top 10 films of 2018 globally. Don't believe us, take a look.\n1. Sanju - Rs 578 crore\n2. Padmaavat - Rs 546 crore\n3. Simmba - Rs 310 crore (10 Days)\n4. Race 3 - Rs 306 crore\n5. 2.0 (Hindi) - Rs 269 crore (still running)\n6. Baaghi 2 - Rs 249 crore\n7. Thugs Of Hindostan - Rs 247 crore\n8. Badhaai Ho - Rs 215 crore\n9. Raazi - Rs 192 crore\n10. Zero - Rs 178 crore (still running)\nThe actor will next be seen in Saare Jahan Se Acha opposite Fatima Sana Shaikh.", "title": "Despite Criticism & Bad Reviews, 'Zero' Becomes The 10th Highest Grossing Film Of 2018 Globally", "date_publish": "10/01/2019, 18:04:27", "description": "zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema, zero, srk, bollywood, cinema,", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/despite-criticism-bad-reviews-zero-becomes-the-10th-highest-grossing-film-of-2018-globally-360187.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/srk_1547122217_800x420.jpg"}