{"text": "Ranveer Singh who is right now the most bankable actor, whose films Padmavaat and Simmba have become a huge hit is still complaining that he isn't getting good roles. In an interaction with us, he said, \"\nIt's strange actually, now people maybe have this perception that one is inaccessible so I'd like you to write so that new directors and promising talent start approaching me, like when I see Ayushmann's scripts and I am like 'ye filmein mere paas kyun nahi aati'.\"\nRanveer who is gearing up for his most ambitious film Gully Boy says, he has always endeavored to become a versatile actor who can do anything and everything, \"\nTwitter\n\"I believe acting is subjective, there is no good or bad acting, I may like some performance which you may not, so in that case I want to be a versatile actor where I can be effective in all the genres. I have consciously endeavored to be one, like in 2013 I did Lootera, so introverted and brooding and then I did an absolute raw and rambunctious peacock in Ram Leela in the very same year.\"\nHe further added, \"In 2015, it was Dil Dhadakne Do and Bajirao Mastani, and then Khijli and Simmba with the back of that is Gully Boy, I am understanding this because I have been getting all the feedback from social media about it, I know what the talk is going on about me, I know all the aspects now and it's very heartening to me. I want to be recognized as the most versatile actor.\"\nDon't Miss 185 SHARES 336 SHARES 460 SHARES 544 SHARES 247 SHARES\ntwitter\nRanveer says he understands people have hope from him and that's a huge responsibility he is carrying on his shoulders, \"Now people come with a believe if my name is attached that there will be some quality of work, so I have to rise up to their trust. I understand the responsibility on me and so I am choosing my scripts wisely.\"\nThe actor was asked if he enthusiastically jumped on Gully Boy offer to which he took a pun on him and said, \" I tend to enthusiastically jump at the opportunities\". Well, he was recently trolled for jumping on fans in one of his media event.\ntwitter\nOn a serious note he said, \"I wanted to rap but Zoya was not sure, she was like I don't know if you are going to be good enough, I am not letting you give vocals to my music album, you have to give a test, while she was unsure, I was keen and I did it and rapped Meri Gully Mein and she was like game on. And today it's heartening to see the music charts on top.\"\nRanveer is playing a vulnerable character in Gully Boy which is totally opposite his image in public. When asked how comfortable he was about portraying this character, he said, \" One has to become comfortable as an actor on revealing that side of yours because it's a very real and an authentic side.\ntwitter\nIt's something that you protect from people and that side of you comes out only in front of the people you trust like family, friends, my wife, so initially I wasn't really comfortable being that emotionally naked in front of the camera, but Zoya has that ability in peeling away the layers and dabbing the real part of me.\nI think it's because of the relationship we have cultivated, she is more than just a filmmaker to me, she is my friend, I have tremendous warm and affection for her and which is why she has been able to reach that part of me, she takes all my from me, cuts my hair, takes my beard off , there is no costumes, it's just a very real and authentic version of me. \"\ntwitter\nAfter Gully Boy, Ranveer is gearing up for 83 which is a story based on India winning the first Cricket World Cup Match, the excited actor says, \"I am very excited that I am doing a sports film which I wanted to do since long.\"\n\"I wanted to play the role of an athlete and I am only lucky and blessed to play the living legend. I am fortunate to be a part of perhaps the most extraordinary story of human will and triumph, the story is so potent that you don't really need to do.\"\ntwitter\nIt's the most unreal, unbelievable and spectacular underdog story that you will ever get and there is a whole generation that doesn't know who these guys were and the magnitude of what they achieved and how they did it and I am very honoured and privileged to be a part of this film.\"", "title": "Despite Being Successful, Here's Why Ranveer Singh Feels He's Not Getting The Desired Film Offers", "date_publish": "10/02/2019, 15:02:02", "description": "Ranveer Singh who is right now the most bankable actor, who's films like Padmavaat and Simmba has become a huge hit is still complaining that he isn't getting good roles and that's strange. In an interaction with us he said, \" It's strange actually, now people may be have this perception that one is inaccessible so it's actually the reverse has happened, but I'd like you to write so that some new", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/despite-being-successful-here-s-why-ranveer-singh-feels-he-s-not-getting-the-desired-film-offers-361849.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_1549782673_800x420.jpg"}