{"text": "Rajinikanth and Akshay Kumar's film 2.0 was one of the most anticipated films of the year but did it manage to live up to the hype it created? The film opened to mix-reviews but it has still managed to shatter box-office reports.\nAgencies\nIn just one day of its release, the film is dominating the box office. Reports claim that the Hindi dubbed version of the movie has earned Rs 38.25 crore after two days.\nAgencies\nAccording to trade analyst Taran Adarsh, 2.0 (Hindi) earned Rs 18 crore on the second day of its release, which was again a working day. This brings the film’s total collection Hindi to about Rs 38.25 crore, showing a minor drop on day-to-day comparison. “#2Point0 remained strong on Day 2... Although the film has declined on Day 2, the biz should gather momentum on Day 3 [Sat] and Day 4 [Sun]… Thu 20.25 cr, Fri 18 cr. Total: ₹ 38.25 cr. India biz. Note: HINDI version,” he tweeted.\n#2Point0 remained strong on Day 2... Although the film has declined on Day 2, the biz should gather momentum on Day 3 [Sat] and Day 4 [Sun]… Thu 20.25 cr, Fri 18 cr. Total: ₹ 38.25 cr. India biz. Note: HINDI version. — taran adarsh (@taran_adarsh) December 1, 2018\nDon't Miss 282 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nOn Thursday, 2.0 took a super start at the box office with its Hindi version alone earning Rs 20.25 crore. Film critic and trade analyst Taran Adarsh took to Twitter to share the news, “Non-holiday release... Non-festival period... Yet, #2Point0 takes a SUPER START... Keeping in mind the fact that it’s a dubbed film + advance bookings opened very late, the biz is STRONG... Thu ? 20.25 cr. India biz. Note: HINDI version.”\nAgencies\nOn day one, 2.0 collected around Rs 64 crore nett and Rs 80 crore gross in India, making it the second highest opener ever after Baahubali: The Conclusion, which earned over Rs 150 crore.\nConsidering how popular Rajinikanth is in India, these numbers are not surprising at all.", "title": "Despite Average Reviews, Rajinikanth-Akshay Kumar's 2.0 Is Breaking Box-Office Records!", "date_publish": "01/12/2018, 15:11:46", "description": "2.0 box office day 2: Rajinikanth, Akshay Kumar film earns Rs 38.25 cr in Hindi, is second highest opener ever. In Chennai, the collection has almost doubled on the second day of release. It has grossed Rs 4.77 crore in the city while 2.0 minted Rs 2. 37 crore on day 1.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/despite-average-reviews-rajinikanth-akshay-kumar-s-2-0-is-breaking-box-office-records-357736.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/20_1543657410_800x420.jpg"}