{"text": "Shah Rukh Khan’s most anticipated film Zero released on Decemeber 21, 2017 and the fate of the film was decided in a day. The film was declared a flop by the critics and the audiences alike.\nDespite all the hate, many from the industry supported the film and called it SRK’s career-best performance. Well, there is no denying that Shah Rukh is outstandingly good in the film but there was a lack of storyline. Shah Rukh gave his best to make Baua Singh win hearts and it definitely did.\nTwitter\nHowever, seeing back to back failures, SRK is still not ready to get back to his comfort zone, he wants to experiment and is adamant about it.\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES 555 SHARES\nTwitter\nTalking about the biggest takeaway from Zero, he said that, in the light of this movie, he hopes more abnormal and experimental cinema will be encouraged in future.\nTwitter\nHe even said that he is not interested in doing the same normal commercial films anymore as it doesn’t push him as an artist. The actor even revealed how his close friends and family keep asking him to do safer films but he doesn’t listen to them.\nTwitter\nKudos to him for taking up some brave choices despite being the bonafide superstar he is.", "title": "Despite Zero's Failure, SRK Wants To Dabble With Experimental Cinema & Abandon His Comfort Zone", "date_publish": "31/12/2018, 13:20:30", "description": "Shah Rukh Khan’s most anticipated film Zero released Decemeber21, 2017 and the fate of the film was decided in a day. The film was declared flop by the critics and the audiences. Despite all the hate, the film received many of the industry supported the film and called it SRK’s career-best performance. Well, there is no denying Shah Rukh is outstandingly good in the film but there was a lack o", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/despite-zero-s-failure-srk-wants-to-dabble-with-experimental-cinema-abandon-his-comfort-zone-359564.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_1546242850_800x420.jpg"}