{"text": "TamilRockers Leak 'Uri' On Torrent, Setback For Film Producers Who Tried A Surgical Strike On Piracy\nTamilRockers Leak 'Uri' On Torrent, Setback For Film Producers Who Tried A Surgical Strike On Piracy\nTamilRockers.com is infamous for leaking movies online for a long time. From South Indian films to Bollywood movies, almost all films fall prey to blatant piracy by the website. And despite making all possible efforts to stop it, even Vicky Kaushal's 'Uri: The Surgical Strike' could not be saved from falling into the piracy net.\nTwitter\nThe makers of the film came up with a unique strategy – by trolling those who tried to download the pirated version of the movie.\nThose who downloaded 3.8 gb file of Uri: The Surgical Strike, a video popped up on the screens asking the viewers to go to the theatres to watch the movie.\nIn the video, Yami Gautam says, \"Jab hamari army unki territory me ghuskar aatankvaadio ko maar sakti hai, to kya hum aapke torrent me nahi ghus sakte?\". Vicky adds, \"Picture dekhiye garv se. Theatre me jaakar. Then Yami says, Chori chhipe, illegal download karke nahi.\"\nThat was indeed the most creative way to curb piracy so far. But seemingly, this couldn’t change the fate of the film in terms of piracy. TamilRockers.com have managed to leak the film, despite the attempt of the makers of a surgical strike on piracy.\nDon't Miss 233 SHARES 870 SHARES 8.5 K SHARES 12.5 K SHARES 5.5 K SHARES\nMeanwhile, the movie is doing a great amount of business. Beating the record of Raazi, Stree and Badhaai Ho, the movie has earned Rs 70 crore in just one week. Have you watched the movie yet? How’s the Josh?", "title": "The Surgical Strike On Torrent, Setback For Film Producers Who Tried A Surgical Strike On Piracy", "date_publish": "19/01/2019, 11:38:16", "description": "Not new to the business, TamilRockers.com is infamous for leaking movies online since a very long time. From South Indian films to Bollywood movies, almost all films fall prey to piracy by the website. The recent one to have joined the bandwagon is Vicky Kaushal starrer Uri: The Surgical Strike. Aware of the same and in an attempt to curb piracy, the makers of Vicky Kaushal starrer Uri: Surgical", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/despite-attempting-a-surgical-strike-on-piracy-uri-gets-leaked-online-by-tamilrockers-360678.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_the_surgical_strike_gets_leaked_online_by_tamilrockerscom_1547875543_800x420.jpg"}