{"text": "Devdas Song ‘Dola Re Dola’ Has Been Declared As The Greatest Bollywood Dance Number In A UK Poll\nDevdas Song ‘Dola Re Dola’ Has Been Declared As The Greatest Bollywood Dance Number In A UK Poll\nWhat is the best Bollywood dance number so far? While some would say Chaiyya Chaiyya, others may have different opinion on that. However, according to a UK poll, Dola Re Dola from Sanjay Leela Bhansali’s Devdas has been declared as the greatest Bollywood dance number ever!\nAn Aishwarya Rai and Madhuri Dixit dance face-off from the 2002 box-office hit 'Devdas' has been voted the greatest Bollywood dance number of all time in a new UK poll released on Friday. Dola Re Dola from the Sanjay Leela Bhansali directed film, which was choreographed by Saroj Khan, beat tough competition from dance numbers across the decades to top a new list published by UK-based Eastern Eye' newspaper.\nYoutube\nPyar Kiya Toh Darna Kya' from the 1960 classic Mughal-e-Azam' came in at second place and another of Madhuri Dixit's iconic routines, 'Ek Do Teen''from the 1988 film 'Tezaab', came in third in the '50 Greatest Bollywood Dance Numbers' list, collated based on public votes, cinematic impact, choreography, staging and opinions of dance experts.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"With Bollywood being built on a bedrock of music, dance has become an integral part of Hindi cinema across the decades and given audiences unforgettable moments,\" said Asjad Nazir, 'Eastern Eye' entertainment editor, who collated the top 50. The perfect Bollywood number needs an amazing set, incredible choreography, wonderful dancers, shining stars, beautiful costumes and a larger than life feel. It also needs to be a stand-out moment in the film and 'Dola Re Dola' has all that and more,\" he said.\nHrithik Roshan's Ek Pal Ka Jeena' from the film Kaho Naa Pyaar Hai' was voted fourth and the legendary Vyjayanthimala song Hothon Pe Aisi Baat' from 'Jewel Thief' completed the top five.\nYoutube\nAward-winning Bollywood choreographer, Saroj Khan, and her muse Madhuri Dixit dominated the list that covered all major Bollywood films over the years.\nThe rest of the top 10 was made up of Kamli' from Dhoom 3' (6), Piya Tu Ab To Aaja' from Caravan' (7), Choli Ke Peeche' from Khalnayak' (8), Chhaiya Chhaiya' from Dil Se' (9) and Mehbooba Mehbooba' from Sholay' (10).\n\"The sheer variety in the list shows that Bollywood hasn't just led the world with musicals, but with dance also. There is everything from Indian classical to western contemporary to out of the box ideas like a dance on top of a train. The list also shows how much dance has been used as a form of expression and liberation,\" said Nazir.\nSome of the other well-known dance numbers on the list include Inhi Logon Ne' from Pakeezah' (12), Sheila Ki Jawani' from Tees Maar Khan' (14), O Haseena Zulfon Waali' from Teesri Manzil' (16), Kajra Re' from Bunty Aur Babli' (18), Nimbooda Nimbooda' from Hum Dil De Chuke Sanam' (23) and Munni Badnaam Hui' from Dabangg' (25).\nWith inputs from PTI", "title": "Devdas Song ‘Dola Re Dola’ Has Been Declared As The Greatest Bollywood Dance Number In A UK Poll", "date_publish": "13/11/2018, 12:13:52", "description": "An Aishwarya Rai and Madhuri Dixit dance face-off from the 2002 box-office hit 'Devdas' has been voted the greatest Bollywood dance number of all time in a new UK poll released on Friday. 'Dola Re Dola' from the Sanjay Leela Bhansali directed film, which was choreographed by Saroj Khan, beat tough competition from dance numbers across the decades.", "authors": [], "url": "https://www.indiatimes.com/entertainment/devdas-song-dola-re-dola-has-been-declared-as-the-greatest-bollywood-dance-number-in-a-uk-poll-356551.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/dola_re_dola_1542091718_800x420.jpg"}