{"text": "With Lok Sabha elections just around the corner, everyone is talking and discussing about it – in person as well on social media. Bollywood is also adding spice and melodrama to the upcoming 2019 General elections. With films like PM Narendra Modi and The Tashkent Files lined up for release, several Bollywood celebs have openly declared their support to political parties and its candidates.\nMeanwhile, a lot of other celebs are spreading awareness on social media urging everyone to cast their vote and make it count. Dia Mirza and Esha Deol are also rooting for greater voter turnout in the 2019 Lok Sabha Elections.\nLet’s all come forth and exercise our democratic right to vote 🙏🏻🇮🇳 #JaiHind #VoteIndia pic.twitter.com/DHXEK2JUIJ — Dia Mirza (@deespeak) April 9, 2019\nDia Mirza and Esha Deol are supporting a campaign urging greater voting by people with disabilities in the 2019 Lok Sabha elections. The National Centre for Promotion of Employment for Disabled People (NCPEDP) together with the National Disability Network has launched a public interest campaign called REV-UP - Register, Enable, Vote. Coena Mukherjee, a girl with cerebral palsy, who interns at The Network, Mumbai, has been a part of the development of the campaign.\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 275 SHARES\n“Globally, 1 in 7 people are with disabilities. This makes them the world's largest minority. Their voices must be heard and hence I stand by the Rev-Up campaign. It's time to be inclusive and step-up, and help persons with disabilities to register, enable and vote,” Esha Deol said in a statement.\nReeta Gupta of The Network who guided Coena to develop the campaign, said it brings together disability rights organisations in the country and all corporates who support disability rights.\nArman Ali of NCPEDP said that on a more holistic note, the campaign is also about revving up participation of persons with disabilities in the electoral process as candidates and representatives.\nWith inputs from IANS", "title": "Lok Sabha elections:Dia Mirza & Esha Deol Root For Higher Voter Turnout, Urge Specially-Abled To Cast Their Vote", "date_publish": "10/04/2019, 18:19:39", "description": "Dia Mirza and Esha Deol are also rooting for greater voter turnout in the 2019 Lok Sabha Elections. Dia Mirza and Esha Deol are supporting a campaign urging greater voting by people with disabilities in the 2019 Lok Sabha elections. The National Centre for Promotion of Employment for Disabled People (NCPEDP) together with the National Disability Network has launched a public interest campaign call", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/dia-mirza-esha-deol-root-for-high-voter-turnout-urge-specially-abled-people-to-cast-theirs-too-365209.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/dia_mirza__esha_deol_root_for_higher_voter_turnout_urge_speciallyabled_to_cast_their_vote_1554898374_800x420.png"}