{"text": "Did You Know, Shah Rukh Khan Thought Kuch Kuch Hota Hai’s Script Was Utterly Nonsense At First?\nDid You Know, Shah Rukh Khan Thought Kuch Kuch Hota Hai’s Script Was Utterly Nonsense At First?\nRahul, who strongly believed that “Hum ek baar jeete hai, ek baar marte hai, shaadi bhi ek baar hoti hai ... aur pyar ek baar hi hota hai” did actually fall in love and marry twice in Kuch Kuch Hota Hai. Ironic much?\n20 years after the release of the movie, Karan Johar accepts that Rahul, played by Shah Rukh Khan, in his debut film was a bit of a “fraud” and that Kuch Kuch Hota Hai has some flaws.\nRead More: 20 Years On, ‘Kuch Kuch Kuch Hota Hai’ Still Remains One Of The Glossiest Rom-Coms Of All Time\nBut did you know that when Karan Johar had first approached Shah Rukh Khan for the movie, he thought that the script was “utterly nonsence”?\nWell, who would have imagined the love story of Tina, Rahul and Anjali would become a cult one day?!\ntoiimg.com\nDon't Miss 5 K SHARES 5.7 K SHARES 220 SHARES 12.5 K SHARES\nCelebrating 20 years of Kuch Kuch Hota Hai’s release, Shah Rukh Khan quipped how he still hasn’t understood the script of the movie.\n“I never listen to scripts, I listen to the heartbeats of the people I work with at times millennial chat with me and say things like why you let go of that script that was such a great script. Till date, I never understood a script. And I can say this with confidence that I never understood the script but the script maker or the filmmaker,” he told IANS.\nvia GIPHY\n“Karan came and narrated an utterly nonsense crap story to me; which is certainly not the one that finally you people saw in the film. In his strange way Karan, the man with many words tried to impress me with his crap story. So yes, I really did not understand the story when I signed in. and I am glad that I did not get into the story and just went ahead with the conviction of Karan, otherwise the film would have not been the way it came out,” he added.\nTwitter\nDid you know Salman Khan’s entry on the song Saajan Ji Ghar aaye is what motivated Varun Dhawan to become an actor? Well, that’s what he revealed at the event.\nvia GIPHY\nAlso, Rani Mukerji revealed that Shah Rukh Khan’s elder son Aryan was born right after they shot for the song Koi Mil Gaya. She said she remembered playing with Aryan after shoots and how people complimented SRK for making good-looking babies.\nvia GIPHY\nAlso, Karan Johar used to snatch food off Rani’s plates in order to keep her from gaining weight.\nIndeed, the cast and the crew of Kuch Kuch Hota Hai had a blast shooting for the movie.\nAlso Read: SRK, Kajol & Rani Recreate The Iconic Pose To Celebrate 20 Glorious Years Of Kuch Kuch Hota Hai", "title": "Did You Know, Shah Rukh Khan Thought Kuch Kuch Hota Hai’s Script Was Utterly Nonsense At First?", "date_publish": "17/10/2018, 12:47:55", "description": "did you know that when Karan Johar had first approached Shah Rukh Khan for the movie, he thought that the script was “utterly nonsence”? Well, who would have imagined the love story of Tina, Rahul and Anjali will gain cult status! did you know that when Karan Johar had first approached Shah Rukh Khan for the movie, he thought that the script was “utterly nonsence”? Well, who would have imagined th", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/did-you-know-shah-rukh-khan-thought-kuch-kuch-hota-hai-s-script-was-utterly-nonsense-at-first-354935.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/did_you_know_shah_rukh_khan_thought_kuch_kuch_hota_hais_script_was_utterly_nonsense_at_first_1539760006_800x420.jpg"}