{"text": "Did You Know ‘Captain America’ Star Chris Evans Was A Hardcore Batman Fan While Growing Up?\nDid You Know ‘Captain America’ Star Chris Evans Was A Hardcore Batman Fan While Growing Up?\nIn his movie career so far, Chris Evans have played two Marvel characters – Captain America and Johnny Storm/Human Torch in Fantastic Four. But seemingly, his favourite superhero is none of them. Chris Evans recently revealed that his favourite superhero is Batman.\npinimg.com\n“I wasn't that cool I was more into cartoons like Bugs Bunny and Looney Tunes, things like that. I'll say Batman. I probably shouldn't say that it's DC, I'm gonna get in trouble. But those Michael Keaton movies, those were pretty big, so yeah I'll say Batman,” he said.\nTwitter\nBut of course Captain America is close to his heart. When asked about his favourite scene of the superhero, here’s what he said.\n“I'm partial to that fight scene in the elevator (from 'Captain America: The Winter Solider'). That was the first scene we shot in the second Captain America movie. It was my first time working with the Russos. It was the first time where it felt like Cap was kind of on his own.”\nhearstapps.com\nDon't Miss 1.1 K SHARES 193 SHARES 8.1 K SHARES 12.5 K SHARES\n“The first Cap movie, it felt like everyone was really holding my hand. And the first Avengers movie, I just did my best to not get in the way,” he said.\nmovieweb.com\nChris Evans had done films like Fantastic Four in the past, but it was only after 2011’s Captain America: The First Avenger that he really made his name in the superhero world.\nWith inputs PTI", "title": "Chris Evans:Did You Know ‘Captain America’ Star Chris Evans Was A Batman Fan While Growing Up?", "date_publish": "28/03/2019, 12:09:08", "description": "In his movie career so far, Chris Evans have played two Marvel characters – Captain America and Johnny Storm/Human Torch in Fantastic Four. But seemingly, his favourite superhero is none of them. Chris Evans recently revealed that his favourite superhero is Batman.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/did-you-know-captain-america-star-chris-evans-was-a-hardcore-batman-fan-while-growing-up-364450.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/did_you_know_captain_america_star_chris_evans_was_a_batman_fan_while_growing_up_1553754412_800x420.png"}