{"text": "Did You Know Alia Bhatt Auditioned For Sanjay Leela Bhansali’s ‘Black’ At The Age Of 9 & He Turned Her Down?\nDid You Know Alia Bhatt Auditioned For Sanjay Leela Bhansali’s ‘Black’ At The Age Of 9 & He Turned Her Down?\nThe young girl when quivered her fingers in order to flirt with the first snow of the season, left everyone in awe.\nAyesha Kapur, who played the role of physically challenged girl Michelle McNally, was just 10 years old when she starred in Sanjay Leela Bhansali’s iconic movie Black. The actress became an instant sensation in the world of films.\nTwitter\nBut did you know that Alia Bhatt also went for the audition of the movie when she was just nine years old? Sanjay Leela Bhansali recently told Mumbai Mirror, that she had a sparkle in her eyes when she came for the audition with her mother Soni Razdan. Looking at her, in that moment, SLB knew she would one day become a star, and hence, he refused to audition her for a child’s role.\nYears later, Sanjay Leela Bhansali prediction indeed came true. Rising above the nepotism controversy with her sheer talent, Alia Bhatt has proved her mettle as an actress with some amazing roles in films such as Highway, Raazi and Gully Boy among others. And now, after years, she has finally bagged a role in the ace filmmaker’s movie titled Inshallah, which also stars Salman Khan in the lead role.\nDon't Miss 812 SHARES 336 SHARES 3 K SHARES 247 SHARES 699 SHARES\nFor Alia Bhatt, it is like a dream come true. “I was 9 when I first walked into Sanjay Leela Bhansali's office, all nervous and hoping and praying that I would be in his next film. It's been a long wait,” she had tweeted after making the announcement of the movie.\nI was 9 when I first walked into Sanjay Leela Bhansali's office, all nervous and hoping and praying that I would be in his next film. It's been a long wait.\n— Alia Bhatt (@aliaa08) March 19, 2019\nDream with your eyes wide open they say & I did. Sanjay Sir and Salman Khan are magical together & I can't wait to join them on this beautiful journey called “Inshallah” ❤#Inshallah #SLB @BeingSalmanKhan @bhansali_produc @SKFilmsOfficial @prerna982 — Alia Bhatt (@aliaa08) March 19, 2019\nWhat’s more? Twitter apparently dug out an old picture of Salman Khan with baby Alia Bhatt, after it was announced that the two will be working together in the movie.\nWho would've thought they will work together as a lead pair. 😂 #Inshallah pic.twitter.com/nTw6DlHuTw — Sky! (@being_Akash_) March 19, 2019\nWe’re sure the trio will spread the magic on the silver screen. Don’t you agree?", "title": "Alia Bhatt black:Did You Know Alia Bhatt Went For The Auditions Of Sanjay Leela Bhansali’s ‘Black’ At The Age Of 9?", "date_publish": "20/03/2019, 16:43:40", "description": "Did you know that Alia Bhatt also went for the auditions of the Sanjay Leela Bhansali's Black when she was just nine years old? The young girl when quivered her fingers in order to flirt with the first snow of the season, left everyone in awe. Ayesha Kapur, who played the role of physically challenged girl Michelle McNally, was just 10 years old when starred in Sanjay Leela Bhansali’s iconic movie", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/did-you-know-alia-bhatt-auditioned-for-sanjay-leela-bhansali-s-black-at-the-age-of-9-he-turned-her-down-364039.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_bhatt_went_for_the_auditions_of_sanjay_leela_bhansalis_black_at_the_age_of_9_1553078193_800x420.png"}