{"text": "Did You Know, Irrfan-Tabu Were The First Choice And Not Neena Gupta-Gajraj Rao For Badhaai Ho\nDid You Know, Irrfan-Tabu Were The First Choice And Not Neena Gupta-Gajraj Rao For Badhaai Ho\nThe real stars of Badhaai Ho were Neena Gupta, Gajraj Rao, and Surekha Sikri. While Ayushmann Khurrana and Sanya Malhotra complimented the film well, the real stars still were the trio who lit up the big screen with their impeccable comic timing and dialogue delivery. But do you know that Neena Gupta and Gajraj Rao were not the first choices of director Amit Sharma?\nInstead of Rao and Gupta, the elderly couple that Sharma had visioned were Tabu and Irrfan Khan.\nTwitter\nIn an interview with IANS, Amit Sharma revealed why Tabu rejected the role stating that she \"looked like a woman who can still have a child.\"\nJunglee Pictures\nBut it was Tabu who passed on the role and suggested that Neena Gupta would suit more. Amit Sharma added,\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nAgencies\n\"We had gone to Tabu ji for the role. At that time, we had a different script in mind and we wanted Tabu ma'am and Irrfan Khan sir. When she heard the script, she suggested Neenaji's name for her character. Tabu felt, perhaps rightly, that she looked like a woman who can still have a child.\"\nThere is another trivia about the film that's surprising. Sharma further said that Ayushmann Khurrana (who played the role of the couple's elder son jokingly suggested that he could have played the role of the father as well as the son. He was quoted as saying,\nTwitter\n\"Ayushmann jokingly suggested he should play both the father and son. It was Ayushmann who suggested Gajraj Rao's name. I knew him from the time we worked together for Pradeep Sarkar. When he heard the script for Badhaai Ho, he advised we get a bigger star to play the role since it was a major part. But I insisted on him. He agreed.\"\nBut as the old adage says, all's well that ends well and the film has currently earned over Rs. 61 core and is currently unstoppable at the box-office.", "title": "Did You Know, Irrfan-Tabu Were The First Choice And Not Neena Gupta-Gajraj Rao For Badhaai Ho", "date_publish": "26/10/2018, 13:23:57", "description": "The real stars of Badhaai Ho were Neena Gupta, Gajraj Rao, and Surekha Sikri. While Ayushmann Khurrana and Sanya Malhotra complimented the film well, the real stars still were the trio who lit up the big screen with their impeccable comic timing and dialogue delivery. But do you know that Neena Gupta and Gajraj Rao were not the first choices of director Amit Sharma?", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/did-you-know-irrfan-tabu-were-the-first-choice-and-not-neena-gupta-gajraj-rao-for-badhaai-ho-355494.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/badhaai_ho_1540541584_800x420.jpg"}