{"text": "If you think that that the latest season of Koffee With Karan hasn’t been so interesting, giving you the juiciest gossips and making you burst into laughter with their funny banter, the next set of stars to grace the Koffee couch are rockstars Diljit Dosanjh and Badshah and they sure look promising!\nKnown for their vivacious energy and mind-boggling personalities, Fun-Jabi boys Diljit Dosanjh and Badshah will bring the house down in the next episode.\nScreengrab\nThe channel has given us a glimpse into the fun-loaded episode with two promos and the excitement level of the fans is soaring higher than ever!\nSpilling beans on his childhood secret, Diljit Dosanjh reveals how he used to pray gurudwara that he becomes famous and people know him, but he shouldn’t know many people. “Main kisiko na jaanu, sab mujhe jaane”, he says.\nTwitter\nOn the other hand, when Badshah is asked about the mistake he would never repeat in Bollywood, he says, “doing songs for films like Baar Baar Dekho”. Is he talking about Kaala Chashma? Well, that was a chartbuster track. We’re sure there’s more to this story, which will only be revealed when the episode airs.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nFrom talking about how they deal with female attention to if they have made out in car or “khet”, Diljit Dosanjh and Badshah made quite some revelations.\nAnother promo gives us a glimpse into the game round and it’s again loaded with fun banters. But who’s going to win? Can you take a guess?\nDiljit Dosanjh and Badshah will stir up a storm with their fun banter and we just can't wait!", "title": "Diljit Dosanjh & Badshah Promise A Laughter Riot With Lassi Shots On ‘Koffee With Karan'!", "date_publish": "03/12/2018, 12:32:16", "description": "Known for their vivacious energy and mind-boggling personalities, Fun-Jabi boys Diljit Dosanjh and Badshah will bring the house down in the next episode of Koffee With Karan. Spilling beans on his childhood secret, Diljit Dosanjh reveals how he used to pray gurudwara that he becomes famous and people know him, but he shouldn’t know many people. “Main kisi ko na jaanu, sab mujhe jaane”, he says.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/diljit-dosanjh-badshah-promise-a-laughter-riot-with-lassi-shots-on-koffee-with-karan-357817.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/funjabi_boys_diljit_dosanjh__badshah_promises_a_laughter_riot_as_they_sip_koffee_with_karan_1543820632_800x420.png"}