{"text": "Diljit Dosanjh-Lilly Singh's Video Is The Most Accurate Depiction Of How Two Punjabis Meet!\nDiljit Dosanjh-Lilly Singh's Video Is The Most Accurate Depiction Of How Two Punjabis Meet!\nIt's predominately assumed that in India, Punjabis have the biggest hearts and have the loudest laugh. What happens when two Punjabis meet for the first time? From endless banter about each other's well-being to offering various snacks during the conversation-it stretches for over ten minutes.\nWell, giving an accurate picture of these first meetings, Singer-actor Diljit Dosanjh has collaborated with YouTube sensation Lilly Singh for a comical video, showing what happens when two Punjabis meet each other.\nScreengrab\nLilly, popularly known as Superwoman, on Friday, took to Instagram to share the video with her followers.\nScreengrab\n“When you meet someone from the motherland... This is definitely how Punjabis greet each other, complete with a five-minute long hand holding session and family tree check-in. To be honest, Diljit and I aren’t even acting... someone was just rolling when we met up,” she wrote.\nIn the video, Lilly can be seen formally shaking hands with the foreigners, but when she sees Diljit, she gets carried away and starts talking to him in Punjabi. From asking about each others’ health to relatives, Diljit and Lilly engage in a funny Punjabi conversation. Watch the video right here:\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe reactions:\nThe video clip has generated a lot of love from social media users, including members of the Indian film and television industry. After watching the collaboration, actress Zareen Khan commented: “I love Punjabis.” Actor-anchor Maniesh Paul wrote: “So True.” The Do You Know hitmaker also shared the video, captioning “Toronto Di Lilly Te DosanjhanWala... When Two Punjabis meet.”\nLilly was in India for the YouTube FanFest held here recently. Her video with Ranveer Singh, where they both jammed to 'Apna Time Aayega' went viral on the internet.\n(With agency inputs)", "title": "Diljit Dosanjh-Lilly Singh's Video Is The Most Accurate Depiction Of How Two Punjabis Meet!", "date_publish": "05/04/2019, 17:22:53", "description": "Diljit Dosanjh and YouTuber Lilly Singh bond over Punjabi roots. Watch Bollywood actor Diljit Dosanjh and YouTuber Lilly Singh recently met and bonded over their shared Punjabi roots. The ‘Superwoman’ later shared the video on Instagram. Watch it here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/diljit-dosanjh-lilly-singh-s-video-is-the-most-accurate-depiction-of-how-two-punjabis-meet-364954.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/diljit_1554465336_800x420.jpg"}