{"text": "Dipika Kakar Beats Sreesanth To Win Bigg Boss 12, Says She Was Never Competing Against Him\nDipika Kakar Beats Sreesanth To Win Bigg Boss 12, Says She Was Never Competing Against Him\nAfter a three-month-long battle, Bigg Boss 12 has finally come to an end. The 12th season of the show hosted by Salman Khan has been won by Dipika Kakar, who shot to fame with her role in hit TV serial Sasural Simar Ka. While Dipika took the trophy home, Sreesanth became the first runner-up. On the other hand, Deepak Thakur, the third runner-up quit after taking 20 lakhs of prize money home.\nTwitter\nOverwhelmed by her big win, Dipika Kakar told IANS, “I am on cloud nine. I thank my fans for making me win this show. Without their support, this would not have happened.”\nFurthermore, talking about her camaraderie with Sreesanth, she said, “I never fought against him. I was very confident that Big Boss is about being you and I would be myself and that’s the reason why I have won the show. No doubt, bhai (Sreesanth) was my stronger competition but I never considered him as a foe and never felt that I have to win against him.”\nDipika’s fans are quite happy that she won the show.\n#1\nFinally she #DipikaKakar won m sooooo happy for her she deserves to win the title of @BiggBoss congratulations to her. Votes bekaar nhi gye hmaare😘😘😘😘and after all queen is always a queen pic.twitter.com/VAyEN710Sf — Pratibha (@Pratibh16394724) December 30, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n#2\n#3\n#4\n#5\nCongratulation #DipikaKakar @ms_dipika u totally deserve it.. Dignifies lady history in bigg Voss after #BB4 winner well played .. Haters staw away — Azaz Ahmed (@AhmedAzuuu) December 30, 2018\n#6\n#7\n#8\n#9\nCongralutions #DipikaKakar and @Shoaib_Ibrahim1 ❤I love her so muchhh🌹💕She deserved to win!! 😇 God bless her — Crissy Bieber (@his_girlieber__) December 30, 2018\nWho was your favourite on Bigg Boss 12? Tell us in the comments section below.", "title": "Dipika Kakar Beats Sreesanth To Win Bigg Boss 12, Says She Was Never Competing Against Him", "date_publish": "31/12/2018, 11:54:57", "description": "After a three-month-long battle, Bigg Boss 12 has finally come to an end. The 12th season of the show hosted by Salman Khan has been won by Dipika Kakar, who shot to fame with her role in hit TV serial Sasural Simar Ka. While Dipika took the trophy home, Sreesanth became the first runner-up. On the other hand, Deepak Thakur, the third runner-up had quit after taking 20 lakhs of prize money home.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/dipika-kakar-beats-sreesanth-to-win-bigg-boss-12-says-she-was-never-competing-against-him-359544.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/dipika_kakar_beats_sreesanth_to_win_bigg_boss_12_says_she_was_never_fighting_against_him_1546236354_800x420.png"}