{"text": "Katrina Kaif and Akshay Kumar together are every filmmaker's dream. The duo has starred in several films together and many managed to strike gold at the box-office. The duo starred in 'Namaste London' in 2007 and the film was a massive hit.\nEros Now\nNow that another part of the Namaste Franchise is all set for its release, director Vipul Amrutal Shah explains why he couldn't get them for the film.\neros now\n\"Katrina could not have been an Indian desi girl. We both did speak about it. And she said this role is something that people may not accept her in. I was going to do the film with Akshay but his dates were blocked for two years so he recommended I go to another actor,\" Vipul told PTI.\nDon't Miss 346 SHARES 814 SHARES 699 SHARES 1.2 K SHARES 18.3 K SHARES\nThe director said he then approached Arjun Kapoor who had everything that he needed in an actor to play the part. He added,\n\"I met Arjun and I told him I was going to do this with Akshay but he doesn't have dates. He heard the script and agreed to do it and that's how he came into the picture. I wanted someone desi who can also look modern and who has got a certain honesty in his face. He was the most suited boy for the part. Parineeti was already part of it when I was going to do it with Akshay,\" he added.\nReleased in 2007, Namastey London made Akshay Kumar and Katrina Kaif a hit pair. The filmmaker said he is aware that comparisons will be made with the first film and most of the people will prefer the original over the sequel.\n\"I am sure eight out of ten people will say 'Namastey London' was better, this is bad, because it's human nature, whatever is old is gold. They must've have seen 'Namastey London' so many times, have been listening to its music all these years. And that's because you are already emotionally connected to the first one so you treat this as a lesser cousin of the original one.\"\nVipul, however, said he did not make the sequel to cash in on the franchise but because he saw potential in the story.\n\"People tell us to make sequels of 'Singh is Kinng', 'Holiday' and other films. There is a demand for it. There's no dearth of fresh ideas. Even in sequels, the story is new, just the world is similar.\"\nThe film is all set for its release this Thursday.\n(With PTI inputs)", "title": "Director Vipul Shah Explains Why Akshay-Katrina Couldn't Be A Part Of 'Namaste England'!", "date_publish": "16/10/2018, 12:28:28", "description": "Katrina Kaif and Akshay Kumar together are every filmmaker's dream. The duo has starred in several films together and many managed to strike gold at the box-office. The duo starred in 'Namaste London' in 2007 and the film was a massive hit.Now that another part of the Namaste Franchise is all set for its release, director Vipul Amrutal Shah explains why he couldn't get them for the film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/director-vipul-shah-explains-why-akshay-katrina-couldn-t-be-a-part-of-namaste-england-354873.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/namaste_london_1539673240_800x420.jpg"}