{"text": "Twitter\n“Irrfan and his family are planning to celebrate Diwali at their Nashik farmhouse. It will be a 10-day trip after which he will return to the UK for his ongoing treatment. He is yet to be given a clean chit by his doctors on whether he can start full-fledged work. The doctors are hopeful that he can return to the set by March. But he will have to follow the guidelines that his oncologists give him. The biopic will have to be divided into shorter schedules.\"\nTwitter\n2018 is a year of weddings. From Ranveer Singh and Deepika Padukone's wedding to Nick and PC announcing that they will tie the knot, a lot of stories have found their happy ending this year. Another talked-about couple is Isha Ambani and Anand Piramal.\nDisha Patani is one gorgeous actress; she looks stunning in whatever she wears. But this time her Diwali outfit has not impressed her fans and rather made them upset. Why? Well, Disha’s latest Diwali picture in a bra has left her fans angry.\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nTwitter\nThe Supreme Court verdict allowing women of all age groups entry into the Sabarimala temple managed to create divided opinions among people. Giving her piece of mind on the same is Malayalam film actor Parvathy Thiruvothu, who has come out in support of the Supreme Court verdict.\nIn a complaint filed at the North Avenue Police Station, Sirsa has said that they have received a number of complaints from the Sikh Sangat. In the complaint, Sirsa alleged that in the promo of the movie, actor Shah Rukh Khan has been shown wearing ‘Gatra Kirpan’ (Article of Sikh Faith) in their movie promo which has created an outrage among Sikh community worldwide.", "title": "Disha Patani Trolled Again, Parvarthy Gives Her Views On Sabarimala Row & More From Ent", "date_publish": "06/11/2018, 16:06:55", "description": "“Irrfan and his family are planning to celebrate Diwali at their Nashik farmhouse. It will be a 10-day trip after which he will return to the UK for his ongoing treatment. He is yet to be given a clean chit by his doctors on whether he can start full-fledged work. The doctors are hopeful that he can return to the set by March. But he will have to follow the guidelines that his oncologists give him", "authors": [], "url": "https://www.indiatimes.com/entertainment/disha-patani-trolled-again-parvarthy-gives-her-views-on-sabarimala-row-more-from-ent-356178.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/disha_1541501084_800x420.jpg"}