{"text": "Disha Patani Grooves On 'I Can't Get Enough', PC Living It Up With The Jonas Family & More From Ent.\nDisha Patani Grooves On 'I Can't Get Enough', PC Living It Up With The Jonas Family & More From Ent.\n\"The superheroes in 'Avengers' personify traits like courage, perseverance, bravery, and hope — the same traits countless kids and their families in children's hospitals exhibit every day,\" Robert Iger-the CEO of Disney.\nFrom inspiring people with her workout videos to giving her fans a glimpse of her world, Disha Patani is surely doing social media right. With a fan following of approximately 19 million on Instagram, she is one of the most influential women in India.\nBut for all those who think that Priyanka Chopra's life doesn't exist beyond Nick Jonas and the family, you're mistaken. She's juggling between her professional and personal commitments like a Queen and we have proof. For all those who have been thinking that ambitions have taken a back seat for PC, she might just be seen in one of the upcoming Marvel movies.\n“This might have been the result of the melodrama of Bollywood plots but it was more likely just the fact that shared emotions and the simple language of their expression reaches across and binds people of all definitions. In fact, I can’t emphasize enough, the importance of expression as a binding force for compassion. It is only by expressing our stories that we create the ground for our life experience to be accepted and understood.\"\nTo give you a closer glimpse of the whole scenario, we made a list of nine on-screen couples we are really excited about. Read on and mark your calendars already!\nDon't Miss 862 SHARES 346 SHARES", "title": "Disha Patani Grooves On 'I Can't Get Enough', PC Living It Up With The Jonas Family & More From Ent.", "date_publish": "06/04/2019, 17:05:24", "description": "From inspiring people with her workout videos to giving her fans a glimpse of her world, Disha Patani is surely doing social media right. With a fan following of approximately 19 million on Instagram, she is one of the most influential women in India. From inspiring people with her workout videos to giving her fans a glimpse of her world, Disha Patani is surely doing social media right. With a fan", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/disha-patani-grooves-on-i-can-t-get-enough-pc-living-it-up-with-the-jonas-family-more-from-ent-365003.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/wrap_1554550884_800x420.jpg"}