{"text": "Just before David confirmed, Blackpool Police wrote how the actor was not even under suspicion. They wrote,\n\"Thank you to everyone for your speedy responses. We have investigated this matter thoroughly and have confirmed that David Schwimmer was in America on this date. We're so sorry it has to be this way.\"\n“I felt like he (Sartaj Singh) is getting slapped by everybody. What’s happening? Some second rate thug Bunty is jhaaping him. I got irritated. But it takes time. And if you see the show and I saw it much later... I asked him, ‘Are you sure you want me to do this role because this other guy has such a fun colour?’ and I was told that those things are true but we have seen that before.\n“Woh LESBIAN hai aur usne mera RAPE kia: “ #RakhiSawant ’s SHOCKING claims about #TanushreeDutta pic.twitter.com/qWrUOHPDqn — Bollywood Hungama (@Bollyhungama) October 24, 2018\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nBut this time, Rakhi took it too far. After her explosive videos on social media, Rakhi called the media for a press conference and said the most outrageous things ever. Listen in.\nIn an interview with Larry King, he says the Marvel Studios are looking for someone who could either be an Afro-American or a woman as the successor to his character.\nWondering how this little girl played the role? Named Myra Vishwakarm, she was indeed two years old when she shot for Pihu.", "title": "Disha Patani Gives Fitness Goals, Rakhi Sawant Accuses Tanushree Dutta Of Rape & More From Ent.", "date_publish": "25/10/2018, 17:32:03", "description": "From Rakhi Sawant accusing Tanushree Dutta of raping her multiple times to Disha Patani who continues to give inspiration as she prepares for her upcoming Salman Khan starrer Bharat, here's everything you might have missed today. Take a look. Disha Patani Gives Fitness Goals, Rakhi Sawant Accuses Tanushree Dutta Of Rape & More From Ent.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/disha-patani-gives-fitness-goals-rakhi-sawant-accuses-tanushree-dutta-of-rape-more-from-ent-355462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/rakhi_1540469252_800x420.jpg"}