{"text": "Disha Patani Dances On Selena Gomez' 'I Can't Get Enough' And Fans Are Floored!\nDisha Patani Dances On Selena Gomez' 'I Can't Get Enough' And Fans Are Floored!\nDisha Patani's fan following on social media makes her one of the most popular celebrities! Today, you need not to have five films in your kitty to be relevant as having a strong social media presence is equally good enough. Today, Patani can boast of endorsing some of the most credible brands in the world, proving that she is an influencer and a good one at that.\nWhat makes people follow her?\nWell, it's not just the brand value that she has managed to create in all these years or her relationship with Tiger Shroff, that the paps glorify every now and then. There is much more to Disha Patani.\nFrom inspiring people with her workout videos to giving her fans a glimpse of her world, Disha Patani is surely doing social media right. With a fan following of approximately 19 million on Instagram, she is one of the most influential women in India.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nLike, recently, she shared a video of her working out and dancing on international pop singer Selena Gomez's song 'I Can't Get Enough'. The has garnered over 2,947,747 views, making it one of the most viral and shared videos of the week.\nOn the professional front, Disha will be next seen in Salman Khan and Katrina Kaif-starrer 'Bharat'.", "title": "Disha Patani Dances On Selena Gomez' 'I Can't Get Enough' And Fans Are Floored!", "date_publish": "06/04/2019, 15:26:32", "description": "Disha Patani's fan following on social media makes her one of the most popular celebrities! Today, you need not have five films in your kitty to be relevant as having a strong social media presence is equally good enough. Today, Patani can boast of endorsing some of the most credible brands in the world, proving that she is an influencer and a good one at that.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/disha-patani-dances-on-selena-gomez-i-can-t-get-enough-and-fans-are-floored-364993.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/disha_patani_1554544734_800x420.jpg"}