{"text": "For Mumbaikars, this Holi is going to be a grand one as they are going to witness an experience of a lifetime. For the uninitiated, there is a big holi bash that is going to take place and to make it grander than ever, DJ Snake has already arrived in Mumbai.\nThe young girl when quivered her fingers in order to flirt with the first snow of the season, left everyone in awe. Ayesha Kapur, who played the role of physically challenged girl Michelle McNally, was just 10 years old when she starred in Sanjay Leela Bhansali’s iconic movie Black. The actress became an instant sensation in the world of films.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n'Badhaai Ho', which is based on the story of an elderly couple who are expecting their third child. According to IMDb customer ratings, 'Badhaai Ho' was among the top five Indian movies of 2018. And now, Boney will remake the Hindi film for the South Indian audience.\nWhile Deepika and Alia were seen posing for the paps, Ranveer's hug to Ranbir Kapoor after winning the best actor trophy is winning everyone's hearts! In case you are wondering what we are talking about, have a look at the pictures and videos.", "title": "DJ Snake Arrives In India, SLB Rejected Alia Bhatt For Black And More From Entertainment", "date_publish": "20/03/2019, 18:18:19", "description": "DJ Snake Arrives In India, Anurag Kashyap Extends Support To An Actor And More From EntDJ Snake Arrives In India, Anurag Kashyap Extends Support To An Actor And More From EntDJ Snake Arrives In India, Anurag Kashyap Extends Support To An Actor And More From EntDJ Snake Arrives In India, Anurag Kashyap Extends Support To An Actor And More From Ent", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/dj-snake-arrives-in-india-slb-rejected-alia-bhatt-for-black-and-more-from-entertainment-364052.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/top_bollywood_news_1553084476_800x420.jpg"}