{"text": "Don 3 Is Finally Happening With Shah Rukh Khan And Here Are The Details!\nDon 3 Is Finally Happening With Shah Rukh Khan And Here Are The Details!\nThe news around Don 3 has always been around and finally, we have a confirmation. Latest reports claim that the film is on its way and it has been titled Don: The Final Chapter.\nReports further claim that Shah Rukh Khan will back in it. The film was a remake of the 1978 film of the same name starring Amitabh Bachchan and this has proved to be one of the most popular franchise.\nThe cast of the film is still being finalized but Priyanka Chopra will not be a part of the third part.\nFor the first time ever, producer Farhan Akhtar will be seen playing the role of a cop in the movie. A source was quoted in a report saying,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES\n“Shah Rukh Khan and Excel Entertainment have finally locked on to the script. Don: The Final Chapter will be full of action and trickery. But it all ends! They thought it would be nice to give the franchise a great end, rather than dragging it. And hence, they’ve come up with a great climax that will have everyone stunned.\"\nReports claim that Shah Rukh Khan will begin shooting for the film after wrapping up Rakesh Sharma biopic Saare Jahan Se Achha.", "title": "Don 3 Is Finally Happening With Shah Rukh Khan And Here Are The Details!", "date_publish": "21/01/2019, 18:14:54", "description": "The new around Don 3 has always been around and finally, we have a confirmation. Latest reports claim that the film is on its way and it has been titled Don: The Final Chapter. Reports further claim that Shah Rukh Khan his role. The film was a remake of the 1978 film of the same name starring Amitabh Bachchan and this has proved to be one of the most popular franchise.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/don-3-is-finally-happening-with-shah-rukh-khan-and-here-are-the-details-360799.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shah_rukh_khan_1548075095_800x420.jpg"}