{"text": "Donald Trump Thought Christian Bale Was Actually Bruce Wayne & He Probably Thinks The Same About Santa\nDonald Trump Thought Christian Bale Was Actually Bruce Wayne & He Probably Thinks The Same About Santa\nAt what age did you get to know that superheroes aren’t real -- 5, 8, or maybe 10?\nvia GIPHY\nI mean, at least, now you know that when Gamora, Vision and Loki died in Avengers: Infinity War, Zoe Saldana, Elizabeth Olsen and Tom Hiddleston were still alive. Because they portray these roles in the cinematic world, and that these characters aren’t real?\nvia GIPHY\nWhy stating the obvious, you ask? Because some people think that these characters exist in the real world. No, we are not talking about your niece/nephew or the kid that lives next door in his/her bubble. We are talking about grown-ups. For instance, DONALD TRUMP.\nvia GIPHY\nTalking about The US President Donald Trump, did you know that he recently brought Google under the scrutiny because when people like you and me searched for “idiot” on the search engine, his name would pop up.\nWhy would that happen? Just so unfair, right? Did someone hack Google or what? People had so many questions.\nSo, undoubtedly, Google CEO Sundar Pichai had to be questioned on that to make sure that “it's not some little man sitting behind the curtain figuring out what we're going to show the users.”\nvia GIPHY\nWell, that’s another story for some other time maybe. But what caught our attention recently was that Christian Bale who played the role of Batman, talked about his experience meeting with Donald Trump in 2011.\nhearstapps.com\nDon't Miss 257 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nRead carefully to what he said at the red carpet for the premiere of his upcoming political comedy Vice.\n“We were filming on Batman in Trump Tower and he said, come on up to the office. I think he thought I was Bruce Wayne because I was dressed as Bruce Wayne. So he talked to me like I was Bruce Wayne and I just went along with it, really. It was quite entertaining,” he said.\ncdn.vox-cdn.com\n“I had no idea at the time that he would think about running for president,” Christian Bale was quoted as saying by Variety.\nvia GIPHY\nBut aren’t we all living in a world which goes beyond our expectations? I mean, even we didn’t know a Chai Wala would someday become our Prime Minister. Who would have thought that! In life, expect the unexpected. PS - We are sure he doesn't know about Santa Claus as well!\nWith inputs from PTI", "title": "Christian Bale:Donald Trump Thought Christian Bale Was Actually Bruce Wayne And No, We Are Not Kidding!", "date_publish": "13/12/2018, 14:07:11", "description": "what caught our attention recently was that Christian Bale who played the role of Batman, talked about his experience meeting with Donald Trump. He said that Donald Trump actually thought he was Bruce Wayne. No, we are not kidding. what caught our attention recently was that Christian Bale who played the role of Batman, talked about his experience meeting with Donald Trump.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/donald-trump-thought-christian-bale-was-actually-bruce-wayne-he-probably-thinks-the-same-about-santa-358496.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/donald_trump_thought_christian_bale_was_actually_bruce_wayne_and_no_we_are_not_kidding_1544689406_800x420.jpg"}