{"text": "DP-Ranveer's Wedding Deets Are Out, CID To Go Off Air After 21 Years And More From Ent\nDP-Ranveer's Wedding Deets Are Out, CID To Go Off Air After 21 Years And More From Ent\nA luxurious villa overlooking Lake Como, Italy has already been booked for those dates. Even though it is going to be a very private affair, a TOI report hints that the couple has invited a chosen few for their ceremonies. This list includes Sanjay Leela Bhansali, Shah Rukh Khan, Arjun Kapoor, Rohit Shetty, and Karan Johar.\nDayanand Shetty, who plays the role of Daya in the show went on to confirm this news to TOI. The last episode of the show will air on 27th October 2018. In an interview with TOI, Dayanand Shetty said, \"We were in our 21st year and had we shot for a few more episodes, we would have entered our 22nd year. It is quite an unfortunate thing to happen as we were shooting like always and suddenly we were informed by our producer that the shooting has been called off indefinitely because there were issues with the channel.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nPayal said, “Dibakar did six films after that. He doesn't look like a villain, but that doesn't take away from the fact that he used his sob story of a bad marriage to make a move. I didn't file an FIR against him because I was intimidated. In the wake of #MeToo, I hope things will be different. I don't know if YRF [Yash Raj Films, producer of Sandeep Aur Pinky Faraar] will take a stand. YRF knows about Dibakar.\"\nWishing his on-screen brother 'Amarendra Baahubali', the picture that Rana shared is just about perfect.\nThis is not his first brush with the law. Two years ago, he was arrested and released on bail on charges of sending obscene pictures and lewd messages to a beautician who had offered him a business project proposal.", "title": "DP-Ranveer's Wedding Deets Are Out, CID To Go Off Air After 21 Years And More From Ent", "date_publish": "23/10/2018, 17:49:47", "description": "A luxurious villa overlooking Lake Como, Italy has already been booked for those dates. Even though it is going to be a very private affair, a TOI report hints that the couple has invited a chosen few for their ceremonies. This list includes Sanjay Leela Bhansali, Shah Rukh Khan, Arjun Kapoor, Rohit Shetty, and Karan Johar.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/dp-ranveer-s-wedding-deets-are-out-cid-to-go-off-air-after-21-years-and-more-from-ent-355316.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ranveer_and_deepika_1540297521_800x420.jpg"}