{"text": "Priyanka Chopra and Nick Jonas are getting married in Jodhpur’s Umaid Bhawan on Dec 2, and if you are waiting to catch a glimpse of the Nick Jonas wearing a Sherwani and dancing on Desi songs as he arrives with his Baaraat, there’s a bad news for you.\nViral Bhayani\nWedding are supposed to be private affair, people! So, just like Deepika Padukone and Ranveer Singh, grapevine suggests that Priyanka Chopra and Nick Jonas have also banned mobile phones at their wedding. What’s more? The paps won’t be able to bring you the pictures, because the bride and groom will arrive at their wedding destination in a chopper. So, we doubt if any pictures would leak. However, one can be hopeful, right?\nViral Bhayani\nMeanwhile, after a Puja in Mumbai yesterday, the couple along with family members including Sophie Turner and Joe Jonas flew to Jodhpur. As they arrived at the airport, they posed for the pictures. Take a look!\nViral Bhayani\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 553 SHARES\nWhat’s more? The eldest of the Jonas Brothers, Kevin Jonas has arrived in India too.\nViral Bhayani\nThe Mehendi and Sangeet are scheduled to take place on Nov 29. This will reportedly be followed by a Cocktail party on Nov 30. The couple will celebrate their Haldi ceremony on Dec 1, and the wedding in Hindu and Christian ceremonies will take place on Dec 2 itself, it is said.", "title": "Dulhe Ka Bhai Is In Town! Kevin Jonas Arrives In India To Be A Part Of Nick & PC's Wedding", "date_publish": "29/11/2018, 13:26:48", "description": "The eldest of the Jonas Brothers, Kevin Jonas has arrived in India too. grapevine suggests that Priyanka Chopra and Nick Jonas have also banned mobile phones at their wedding. What’s more? The papz won’t be able to bring you the pictures, because the bride and groom will arrive at their wedding destination on a private plane. So, we doubt if any pictures would leak.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/dulhe-ka-bhai-is-in-town-kevin-jonas-arrives-in-india-to-be-a-part-of-nick-pc-s-wedding-357591.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nicks_eldest_brother_kevin_jonas_arrives_in_india_after_pc__their_families_leave_for_jodhpur_1543476629_800x420.png"}