{"text": "EC Bans Vivek Oberoi's Modi Biopic One Day Before Its Release & The Internet Is Celebrating!\nEC Bans Vivek Oberoi's Modi Biopic One Day Before Its Release & The Internet Is Celebrating!\nBollywood actor Vivek Oberoi was in news recently for starring in the biopic of Prime Minister Narendra Modi. Receiving severe backlash on the subject and the timing of its release (11th April), Vivek Oberoi took on criticism and gave a befitting reply.\nTwitter\nFrom being seen on debates to heavily promoting his upcoming film, speaking about his off and on stint in Bollywood, Vivek Oberoi said, \"I'm still here and unbreakable.\" His film was earlier touted to release on 4th April, however, opposition parties alleged that the movie has an intention of influencing voters in the run-up to the Lok Sabha elections.\nTwitter\nSoon the movie shifted to 11th April but now in a fresh set of events, EC has banned the biopic citing 'disturbs level-playing field' They have mentioned there will be no biopic till the polls end.\nDon't Miss 862 SHARES 638 SHARES 346 SHARES\nHere are some of the fresh reactions on Twitter after the movie got postponed.\nFinally a good decision made by EC.\nVivek Ab roye 😂 ( i was waiting to say this😅).#NoMoreModi #EkHiChowkidarChorHai — Rohma Ansari (@ansari_rohma) April 10, 2019\nFinally it seems EC has awake — Shrenik Chhajer (@shrenikchhajer) April 10, 2019\nNaMo TV bhi band karo — Sasikumar (@Sasikum36004064) April 10, 2019\nThe film-makers should be ashamed of themselves for trying to release this biopic at a time like this. Complete irresponsibility! — Pallavi Deka (@pallavi_deka) April 10, 2019\nचलो मतलब मोदीजी ने मूवी देख ली। 😂😂 — Pulkit Sankhla (@PulKitnaBolega) April 10, 2019\nSupreme Court had earlier given a go-ahead to the movie but EC has put the movie on hold.\nWell, we can't wait to see how this movie will eventually turn out to be.", "title": "EC Bans Vivek Oberoi's Modi Biopic One Day Before Its Release & The Internet Is Celebrating!", "date_publish": "10/04/2019, 15:00:19", "description": "Supreme Court had earlier given a go-ahead to the movie but EC has put a hold to the movie.Supreme Court had earlier given a go-ahead to the movie but EC has put a hold to the movie.Supreme Court had earlier given a go-ahead to the movie but EC has put a hold to the movie.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ec-bans-vivek-oberoi-s-modi-biopic-one-day-before-it-s-release-the-internet-is-celebrating-365190.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vivek_oberoi_1554888481_800x420.jpg"}