{"text": "Shortly after the shooting of Game of Thrones season one had ended, Emilia Clarke who played the breakthrough role of Daenerys Targaryen collapsed at the gym following a severe headache. That was the beginning of her heath struggles which led to two life-threatening brain aneurysms.\nIn an essay written for The New Yorker, Emilia Clarke says she thought she would die. \"In my worst moments, I wanted to pull the plug. I asked the medical staff to let me die,\" she said.\nWhat had happened to her? Doctors diagnosed her with having a subarachnoid haemorrhage (SAH), from which a third of sufferers die immediately or soon after. After the surgery, a condition called aphasia set in, meaning she could not communicate and feared her acting career was over.\nWhen after the first surgery, she was warned about second smaller aneurysm on the other side of her brain, she could see her life ahead, “and it wasn’t worth living,” she said. “I am an actor; I need to remember my lines. Now I couldn’t recall my name.”\ntimedotcom\nDon't Miss 159 SHARES 842 SHARES\nIt was in 2013, while performing for a play in New York, she received brain surgery for a second aneurysm on the other side of her brain. This second surgery was gruesome as her skull was opened up for it. “I looked as though I had been through a war more gruesome than any Daenerys experienced.”\nbiography.com\nShe had recovered post the surgery and had even begun shooting for season 2, but she was feeling very weak, and that is when she thought she would die. “Season 2 would be my worst. I didn’t know what Daenerys was doing. If I am truly being honest, every minute of every day I thought I was going to die.”\npinimg.com\nShe says she is now \"at a hundred per cent\" and has helped develop a charity that supports people recovering from brain injuries and strokes.\nWith inputs from IANS and PTI", "title": "Emilia Clarke Underwent Two Life-Threatening Brain Surgeries After Game Of Thrones Season 1", "date_publish": "22/03/2019, 18:33:30", "description": "Shortly after the shooting of Game of Thrones season one had ended, Emilia Clarke who played the breakthrough role of Daenerys Targaryen collapsed at the gym following a severe headache. That was the beginning of her heath struggles which led to two life-threatening brain aneurysm.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/emilia-clarke-underwent-two-life-threatening-brain-surgeries-after-game-of-thrones-season-1_-364154.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/got_star_emilia_clarke_went_through_two_lifethreatening_brain_surgeries_after_season_1_1553259001_800x420.jpg"}