{"text": "Game of Thrones Star Emilia Clarke plays a vital role in the show. Featuring right from the first season, her character sees plenty of shades through the seven seasons. But Emilia was not only going through transformations in her reel life but in real life as well.\nScreengrab/GoT\nEmilia Clarke aka Khaleesi, recently released unseen photographs taken during her recovery from a life-threatening brain aneurysm in 2011, when she was just 24-years-old. This was also the first when the first season of Game Of Thrones released.\nEarlier this year, the star opened up about how she suffered and survived two brain aneurysms while filming the fantasy drama, the second of which nearly killed her. And this time she shared images from her hospital stay.\nTwitter/Emilia\nDon't Miss 159 SHARES 169 SHARES\nDiscussing the impact it had not just on her physical health but mental well-being, in an interview, she said: \"The first time it was difficult, with the second one I found it much harder to stay optimistic. (I coped with it as a) a day-to-day thing. I definitely went through a period of being... down - putting it mildly.\"\nIn one of the photographs, the actor is lying on a hospital bed holding her phone and in the other, the star is with a medical tube attached to her head.\nTwitter\nThe actress explained that when a part of your brain is starved of blood for more than a minute, it dies, which is what happened to her after her second aneurysm.\nShe said that once she returned to shoot the second season she had no time to \"question her own mortality\" because she was too busy playing a \"bada*s character who walked through fire\".\nInputs from IANS", "title": "Emilia Clarke AKA Khaleesi Shares Unseen Pics From Her Brain Surgeries & They'll Shake You Up", "date_publish": "10/04/2019, 17:12:00", "description": "Game of Thrones Star Emilia Clarke plays a vital role in the show. Featuring right from the first season, her character sees plenty of shades through the seven seasons. But Emilia was not only going through transformation in her reel life but in real life as well.Game of Thrones Star Emilia Clarke plays a vital role in the show.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/emilia-clarke-aka-khaleesi-shares-unseen-pics-from-her-brain-surgeries-they-ll-shake-you-up-365194.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/emilia_clarke_1554889892_800x420.jpg"}