{"text": "Just a few days ago, Emilia Clarke revealed about her battle with brain aneurysms that nearly took her life, says she is “overwhelmed” and “profoundly moved” after fans and followers came forward in her support.\nThe Game of Thrones star on Saturday took to Instagram to express gratitude towards the audience after she shared her secret health scare in an essay for The New Yorker, which she faced soon after the success of the first season of the HBO epic-fantasy drama.\nIn the video, the actor said, “The response to my story has been overwhelming – and deeply and profoundly moving. Thank you so much.”\nreuters\nClarke said she was surprised how many people resonated with her story. “A million million thank you’s to everyone who has read shared and sent love for my story, it’s a beautiful thing to behold and I can’t quite believe how many of you this has affected!” she wrote as the caption.\nThe actor also tagged her charity, SameYou, which is dedicated to increasing access to rehabilitation after brain injury and stroke for young people.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“@sameyouorg is ready to hear your stories, how you recovered and what could have made that recovery experience better. By hearing your stories we can build a case for an improved aftercare experience for all in the future… who wouldn’t want that!” Clarke further said.\nIn The New Yorker essay, which published online last week, the actor said just before she assumed her role as Daenerys Targaryen in 2011, she started feeling a “shooting, stabbing, constricting pain” in her head during a workout with her trainer.\nAfter recovering, Clarke returned to promote GOT, but soon discovered that she had another smaller aneurysm on the other side of her brain that could rupture any time.\nAround the third season of the series, the actor visited the medical facility for regular brain scans and learned that the second aneurysm had doubled in size. She had another surgery, but it did not go as successfully as the first one and ended up spending a month in the hospital.\nreuters\nSeveral weeks after the surgery, Clarke was back to work promoting the series at the San Diego Comic-Con with her castmates. She kept the news of her surgeries a secret until now, even denying a National Enquirer story that ran six weeks after the procedure.\nThe actor has assured that since the second surgery, she is “100 per cent better”.\nInputs From PTI", "title": "Emilia Clarke Is ‘Overwhelmed’ By Fan Support After Opening Up About Aneurysms", "date_publish": "25/03/2019, 15:33:53", "description": "Emilia Clarke, who recently revealed about her battle with brain aneurysms that nearly took her life, says she is “overwhelmed” and “profoundly moved” after fans and followers came forward in her support. The Game of Thrones star on Saturday took to Instagram to express gratitude towards the audience after she shared her secret health scare in an essay for The New Yorker, which she faced soon afte", "authors": [], "url": "https://www.indiatimes.com/entertainment/emilia-clarke-is-overwhelmed-by-fans-support-after-opening-up-about-aneurysms-364263.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/emilia_clarke_1553510711_800x420.jpg"}