{"text": "Emilia Clarke Claims That The Final Season Of Game of Thrones Will Shock The Audience\nEmilia Clarke Claims That The Final Season Of Game of Thrones Will Shock The Audience\nAfter a long wait of two years, fans will finally get to see and experience the eighth chapter of Game Of Thrones.\nAgencies\nThe last installment aired on July 16, 2017 and it is all set to return for its final lap on April 14. With the promos and pictures flooding our social media timelines, it isn't a mystery anymore that the last season will be nothing short of epic.\nHBO\nAs per the details revealed by HBO, the new season will be bigger, with six feature-length episodes and some of most complex battle sequences that will set television records when they air.\nAgencies\nDon't Miss 161 SHARES 842 SHARES\nThe final battle between the humans and the undead took 55 nights of outdoor shooting, a first for the show and perhaps even the history of television. Actor Emilia Clarke has teased there is “a very good reason” why the makers Game of Thrones took their time with the last season of the hit show.\nTwitter\nThe 32-year-old actor, known for playing the iconic role of Daenerys Targaryen in the HBO series, said the eighth and final season will “shock people”.\n“It’s going to be huge, that much everyone needs to know. It took us a long time to film this one for a very good reason. But I think there’s going to be some things... I know there’s going to be some things in this last season that will shock people,” Clarke told E! on the Oscars 2019 red carpet.\nFor all those who missed it, HBO even shared new footage from the upcoming season on Monday. In short video previews all of HBO’s upcoming shows in summer, Game of Thrones also got a few seconds new footage. The video showed Arya Stark’s gleeful expression at seeing a dragon for the first time.\nIf you still haven't watched the video, hit play now.\n(With agency inputs)", "title": "Emilia Clarke Claims That The Final Season Of Game of Thrones Will Shock The Audience", "date_publish": "26/02/2019, 15:36:44", "description": "Actor Emilia Clarke has teased there is “a very good reason” why the makers Game of Thrones took their time with the last season of the hit show. The 32-year-old actor, known for playing the iconic role of Daenerys Targaryen in the HBO series, said the eighth and final season will “shock people”.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/emilia-clarke-claims-that-the-final-season-of-game-of-thrones-will-shock-the-audience-362830.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/game_of_thrones_1551177341_800x420.jpg"}