{"text": "The countdown has already begun. In just four days, Game Of Thrones final season will air and we won’t know if we are prepared to watch our favourite show coming to an end.\nGOT/Screengrab\nNot only it is an emotional moment for the fans but the cast and the crew are also experiencing nostalgia. Recently, talking about the first day of filming Game Of Thrones, Emilia Clarke recounted how she ended up in tears because it involved horses.\nGOT/Screengrab\n“Yeah, I remember my first day on set. Oh my God, I fell off a f**king horse,” she said.\n“Jesus, this is my first job, this is like the first thing I ever did and they stuck me on a horse. In a bamboo field in Belfast, and it's raining. I was falling off the horse and trying to act still, and I remember just ... hanging on for dear life, and I just remember shouting 'please stop filming!' And I'm like 'OK, everything's going to be fine.' Turn around and I’m like, 'oh my God, there's like the whole crew,' and I just cried. That was my first day on Game of Thrones,” she added.\nDon't Miss 159 SHARES 842 SHARES\nyoutube/screengrab\nThe ending will leave the fans divided, the cast and the crew had said. Spilling more beans on the same, actor Kristofer Hivju who plays the role of Tormund Giantsbane, recently said, some people will cry and some people will destroy their TV sets.\n“I think people will be everything: some people will be sad, some people will be happy because maybe their theory went right. Some people will cry and some people will destroy their TV. I think people will react in many different ways,” he added.\nGame of Throne season 8 will premiere on April 14. We just can’t wait.", "title": "Emilia Clarke Recalls First Day Of Filming Game Of Thrones, Says It Began With A Horse Ride!", "date_publish": "10/04/2019, 12:04:02", "description": "The countdown has already begun. In just four days, Game Of Thrones final season will air and we won’t know if we are prepared to watch our favourite show coming to an end. The countdown has already begun. In just four days, Game Of Thrones final season will air and we won’t know if we are prepared to watch our favourite show coming to an end.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/emilia-clarke-recalls-first-day-of-filming-game-of-thrones-says-it-began-with-a-horse-ride-365167.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_1554877595_800x420.jpeg"}