{"text": "Emraan Hashmi shared, \"Today, 5 years after his diagnosis, Ayaan has been declared cancer free. It has been quite a journey. Thank you for all your prayers and wishes. Love and prayers for all the cancer fighters out there, hope and belief go a long way. You can WIN this battle !!! #thekissoflife\"\nBe it pulling off a comic role in Koi Mil Gayaa to playing the role of Akbar in Ashutosh Gowarikar's period drama Jodha Akbar, Hrithik Roshan slipped into the skin of his characters and made each of his characters visionary.\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nWhile there is a lot that happens in the teaser, the major highlight is how the teaser ends as Jon, Sansa and Arya are seen drawing their blades. We can gauge that the siblings prepare themselves for a deadly fight. Without further ado, watch the teaser right here.\nShe said, “We publicize such things and later raise questions, I think we should question everyone involved in the show.”\nA reporter asked her to comment on the inappropriate remarks of “her friend Hardik Pandya” and that's when she lost her cool. Esha responded by saying, “Who is the one who told you (Hardik Pandya) is my friend?”\nTo begin with, he spoke about Uri’s success. Feeling thankful, Vicky said, \"This kind of response was pleasantly surprising for all of us, we were hoping to get a good response but we didn’t think that even Friday evening shows would be full and the numbers will be so good. The claps are the biggest compliment for me from the audience; you get the claps in the theatres only when they feel connected.“", "title": "Emraan Hashmi's Son Is Cancer-Free, Hrithik Completes 19 Years In Bollywood And More From Ent", "date_publish": "14/01/2019, 17:49:14", "description": "After A Battle Of Five Years, Emraan Hashmi's 9-Year-Old Son Finally Declared Cancer Free Emraan Hashmi shared, \"Today, 5 years after his diagnosis, Ayaan has been declared cancer free. It has been quite a journey. Thank you for all your prayers and wishes. Love and prayers for all the cancer fighters out there, hope and belief go a long way. You can WIN this battle !!! #thekissoflife\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/emraan-hashmi-s-son-is-cancer-free-hrithik-completes-19-years-in-bollywood-and-more-from-ent-360406.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/trending_1547468660_800x420.jpg"}