{"text": "Enthu-Cutlet Ranveer Singh Listens To 'Mehendi Laga Ke Rakhna' Before Flying To Italy With Deepika!\nEnthu-Cutlet Ranveer Singh Listens To 'Mehendi Laga Ke Rakhna' Before Flying To Italy With Deepika!\nDeepika Padukone and Ranveer Singh have officially taken another step towards their wedding. The couple flew out of India early this morning along with Ranveer Singh's parents and sister.\nInstagram\nAt the airport, Ranveer Singh was being his most authentic self, like always. From making an enthusiastic entry, waving at his fans and the paps who were waiting to capture the to-be bride and groom.\nRanveer was present with his team and he was also seen carrying his boombox along.\nInstagram\nIn one of the videos from the airport, Ranveer can be seen listening to 'Mehendi Laga Ke Rakhna.' As he steps inside the airport, he greets his family and Deepika and requests his team to lower the volume.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nThis video is proof that Dulha Ranveer is in his groom mode and we can only imagine what lies ahead for all of us and #DeepVeer fans who are waiting with bated breath to get updates on the wedding that is scheduled to take place in Italy on 14th-15th November.", "title": "Enthu-Cutlet Ranveer Singh Listens To 'Mehendi Laga Ke Rakhna' Before Flying To Italy With Deepika!", "date_publish": "10/11/2018, 13:41:17", "description": "At the airport, Ranveer Singh was it most authentic self, like always. From making an enthusiastic entry, waving at his fans and the paps who were waiting to capture the to-be bride and groom. Ranveer was present with his team and he was also seen carrying his boombox along.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/enthu-cutlet-ranveer-singh-listens-to-mehendi-laga-ke-rakhna-before-flying-to-italy-with-deepika-356398.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1541837779_800x420.jpg"}