{"text": "Social Media is a place where the reaction to any action is quicker than any other platform. For celebrities, this medium is both a bane and boon and for Esha Gupta, it has always been extreme.\nActor and Arsenal supporter Esha Gupta has courted another controversy and is being called out on social media for making racist remarks on Nigerian footballer Alexander Iwobi.\nAgencies\nIt was after she shared a snapshot of a Whatsapp conversation on Instagram.\nIn the conversation, Esha’s friend called Iwobi a “gorilla” and said that “evolution stopped for him”. To that, Esha replied: “Haha... I don’t know why they don’t bench him more.”Actor and Arsenal supporter Esha Gupta has been called out on social media for making racist remarks on Nigerian footballer Alexander Iwobi. The social media was abuzz as a snapshot of a Whatsapp conversation that Esha shared on her Instagram stories. The conversation criticised Iwobi for his performance.\nIn the conversation, Esha’s friend called Iwobi a “gorilla” and said that “evolution stopped for him”. To that, Esha replied: “Haha... I don’t know why they don’t bench him more.”\nThis “ignorance” didn't go down too well with people and they hit back, calling her out for being racist despite having claimed she herself has been a victim in the past.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAfter the backlash, Esha took to Twitter to apologize. Twitter, however, wasn’t too happy about her apology.\nGuys m sorry you thought it was racist. Was bad on my part, being a sports lover. Wallah never meant it. Sorry guys forgive the stupidity 🙏🏽 #gooner4life — Esha Gupta (@eshagupta2811) January 27, 2019\nIt was us discussing our frustration during the game.sorry as I din realise it directed towards racism.laughed over the spur of the moment, which was the games result guys.been victim of racism myself before. But this is not something m proud of. It was a fault,sorry guys — Esha Gupta (@eshagupta2811) January 27, 2019\nWell it was my fault. So gotta own up to my shit.. sorry 😐 https://t.co/0TCXxOi1Tp — Esha Gupta (@eshagupta2811) January 27, 2019\nArsenal fans called Esha a racist and thought her apology wasn’t heartfelt. Fans are also asking Arsenal to ‘ban her for life’.\nHere is how social media turned against Esha and requested her to pull up her socks.\nThought? It was racist. — Hunkleberry Finn (@HunkleberryFinn) January 27, 2019\nHow do you feel about an Arsenal brand ambassador making these racist comments about an Arsenal Academy graduate? @Arsenal pic.twitter.com/Dfcpvl58mF — Chris (@LondonGoona) January 27, 2019\nDon’t put #gooner4life after such stupidness we don’t wanna be associated with such dumbassery — name: yega (@YEGASMITH) January 27, 2019\nThis needs to be investigated further. A lot of us Nigerian gooners aren't taking it. @alexiwobi is our boy. We will not stand and watch him been dehumanised and not act.\nTake not @Arsenal. — Committed Gooner™ 🇳🇬 (@pancofm) January 27, 2019\n@Arsenal sort our ambassador out ffs — NoMoreBanterEra (@LordyGonner) January 27, 2019\nAwful thing to say. Utterly disgusting — RICHARD CAPELING (@richcapeling) January 28, 2019\nYour response is embarrassing! You state on one hand you’ve suffered racism yet on the other have no idea that you’ve made a racial slur! Your ignorance and arrogance of this whole situation is beyond words! Please remove gooner from your profile! Your not part of our club/family — Keiron Batchelor (@keiron85) January 27, 2019\n(With agency inputs)", "title": "Esha Gupta Apologises After She Receives Flak For Racist Comments Against A Nigerian Footballer", "date_publish": "28/01/2019, 16:41:40", "description": "Actor and Arsenal supporter Esha Gupta has courted another controversy and is being called out on social media for making racist remarks on Nigerian footballer Alexander Iwobi. It was after she shared a snapshot of a Whatsapp conversation on Instagram.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/esha-gupta-apologises-after-she-receives-flak-for-racist-comments-against-a-nigerian-footballer-361181.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/esha_1548674985_800x420.jpg"}