{"text": "Who would have thought that a cup of 'Koffee' can actually cost someone their careers? For Hardik Pandya and KL Rahul, one episode of Koffee With Karan turned out to be one of their biggest nightmares.\nTheir regressive remarks on women didn't go down well with the audience and the consequences were strict for the two cricketers. Just to jog your memory, there was also a mention of Esha Gupta on the show as KJo was counting Hardik Pandya's 'girlfriends'.\n(Also read: Hardik Pandya Takes Another Hit After His Sexist Comments As He Loses A Sponsor)\nEsha was recently addressing the media at the launch of her new single ‘Get Dirty’ in Mumbai when remarks by a reporter made her angry.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Many times people get more excited and say such things. I think even then a little education should be given on how to talk, especially about women.\"\nEsha appeared really upset with the makers of the show too. She said,\n“We publicize such things and later raise questions, I think we should question everyone involved in the show.”\nA reporter asked her to comment on the inappropriate remarks of “her friend Hardik Pandya” and that's when she lost her cool. Esha responded by saying, “Who is the one who told you (Hardik Pandya) is my friend?”\nThe actress further said, “I do not think anyone should talk bad about any woman, if you think your family is not worried about it, then be it, but it is wrong on Humanity.” That's not all. She added,\nTwitter\nFirstly, women should not compare themselves with men. We are the best in every respect. I don’t want anyone to feel bad, but why don’t you give birth to a child? We suffer from periods five days every month and even then we have to dance, go to an office, and take care of the children. When you can do all this, you become superior.\"\nA lot of people reacted to the whole controversy around the episode. Veteran Indian spin bowler Harbhajan Singh had too lashed out at Pandya and Rahul. He said that the suspended duo has put the reputation of other cricketers at stake too.", "title": "Esha Gupta Slams Hardik Pandya And 'Koffee With Karan' Makers For Regressive Remarks On Women", "date_publish": "14/01/2019, 11:04:17", "description": "Bollywood actress Esha Gupta on Saturday slammed tainted Indian all-rounder Hardik Pandya for his ‘sexist’ remark in a talk show named Koffee With Karan hosted by filmmaker Karan Johar.Esha said that “little education should be given on how to talk.” Esha raised questions on Hardik’s family and also slammed the makers of the show stating that “everyone involved” in the show should be questioned. S", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/esha-gupta-slams-hardik-pandya-and-koffee-with-karan-makers-for-regressive-remarks-on-women-360363.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/esha_gupta_1547445714_800x420.jpg"}