{"text": "Even After Two National Awards And A Padma Shri, Manoj Bajpayee Sees Himself As A Common Man\nEven After Two National Awards And A Padma Shri, Manoj Bajpayee Sees Himself As A Common Man\nA lot of people come to Mumbai with suitcase full of dreams and inspirations but how many outsiders manage to make the cut? Well, the percentage of successful 'outsiders' might just be evidently low but the ones that exist, they are highly inspiring.\nToday, Manoj Bajpayee, boasts of two national awards and one padma shri. The man began his film journey with a blink-and-miss role in 1994's film Droh Kaal'. His initial journey in Bollywood was full of struggle and hardship.\nAgencies\nBut it was his dedication that helped him make a mark in his career. He rose to fame with his role of a gangster in Satya and later featured in hit films like Shool, Zubeidaa and Pinjar. His filmography is diverse and as an actor, he has never stopped taking risks.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nBut even after all this success and laurels, he still considers himself a common man from Bihar who has to keep working hard to survive in a dream city like Mumbai. The actor, who turned 50 on Tuesday, feels that he still has a long way to go.\nAgencies\n\"I am not Padma Shri Manoj Bajpayee. I am Manoj Bajpayee, an outsider who saw dreams and stayed on the fringes of Mumbai and worked day and night to get work. For my contribution to Hindi cinema, I was felicitated with Padma Shri. I am happy to get such an honour but it does not mean I will stick around it only,\" Manoj told IANS in a telephonic interview.\nBajpayee, who has completed twenty five years in the Indian film industry added,\nAgencies\n\"It is important to move on from the laurels of the past. I can't let success go to my head. These awards inspire me to do more hard work each day. There's a lot more to do. I am still exploring.\"\nHe also celebrated his 50th birthday on 23rd April. On hitting the golden jubilee of his life, Manoj said,\n\"I do party every year but it used to be small. This time, it would be a little big. I will invite my colleagues from theatre and film industries.\"\nHe also added that all his struggling days have made him a stronger and a calmer person.\nTwitt\n\"I am a completely different person now. Now I know how to channelise my anger and how to deal with odd and uncomfortable situations. Struggle teaches you a lot of things and I am happy that I witnessed a roller coaster ride. The journey has improved me as a person and made me more mature.\"\nOn the work front, Manoj is now looking forward to the release of his web show The Family Man.\n(With IANS inputs)", "title": "Even After Two National Awards And A Padma Shri, Manoj Bajpayee Sees Himself As A Common Man", "date_publish": "24/04/2019, 12:26:21", "description": "Actor Manoj Bajpayee is the recipient of two National Film Awards and India's fourth highest civilian award, Padma Shri, but he stills considers himself a common man from Bihar who has to keep working hard to survive in a dream city like Mumbai. The actor, who turned 50 on Tuesday, feels that he still has a long way to go.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/even-after-two-national-awards-and-a-padma-shri-manoj-bajpayee-sees-himself-as-a-common-man-365989.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/manoj_bajpayee_1556088608_800x420.jpg"}