{"text": "Even if you are not a Marvel fan, we are sure, you must have heard about the crazy fandom for Avengers: Endgame, the movie which will conclude over 22 marvel films, after 11 years and 21 movies. A lot of actors will retire from their roles. So, basically, it’s a very big deal. And to be honest, it’s a film that should not be missed.\nsquarespace-cdn.com\nThe frenzy has already begun. Avengers: Endgame is hitting the screens on April 26 in India. Joe Russo, the co-director of the movie came to India to promote the film. All details regarding the plot of the movie are being kept under wraps. Meanwhile, Marvel fans are just counting days to experience the one-of-a-kind movie. Even before its release, Avengers: Endgame has already taken the world by storm.\n#1 It has beaten Infinity War to become MCU’s longest movie. Avengers: Endgame is 3 hours 58 seconds long.\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\n#2 With 289 million views in just 24 hours, Avengers: Endgame trailer has set a new record for most number of views in a day.\n#3 The movie has already made a record of most pre-sales tickets purchased within 24 hours. In just six hours, the sale records were broken surpassing the last two Star War films: Star Wars: The Force Awakens and 2017's Star Wars: The Last Jedi, according to Fandango and Atom, which are the two of the top ticketing websites in the United States.\n#4 According to CNBC.com, Avengers: Endgame has sold nearly twice as many advance tickets as Avengers: Infinity War, Aquaman, Star Wars: The Last Jedi and Captain Marvel COMBINED.\n#5 The resale of tickets on eBay are setting new records. Someone just bought Avengers: Endgame ticket for a whopping USD 15000 (Rs. 10,45,150.50).\nAlso Read: And The Frenzy Begins! People Are Selling Avengers: Endgame Tickets On eBay For Rs 6,35,260\nEntertainment Weekly\nThe funny thing is Avengers: Endgame hasn’t even released yet. Wonder how many records it'll shatter once it does!\nAlso Read: Chris Evans Recalls The ‘Emotional’ Last Day On Avengers Endgame Sets, Says ‘I Was Teary-Eyed’", "title": "Even Before Its Release, Marvel’s 'Avengers: Endgame' Has Already Smashed These 5 Records!", "date_publish": "10/04/2019, 17:51:57", "description": "Avengers: Endgame is hitting the screens on April 26 in India. Joe Russo, the co-director of the movie came to India to promote the film. All details regarding the plot of the movie are being kept under wraps. Meanwhile, Marvel fans are just counting days to experience one of a kind movie. Even before its release, Avengers: Endgame has already taken the world by storm.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/even-before-its-release-marvel-s-avengers-endgame-has-already-smashed-these-5-records-365206.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/even_before_its_release_marvels_avengers_endgame_has_smashed_these_5_records_already_1554897932_800x420.jpg"}