{"text": "Anup Jalota, who has been evicted this week from the house, declares that he never had any romantic angle with Jasleen Matharu. He revealed that his purpose to be in the house was to make her popular as she is her student.\nTwitter\nIndiatimes spoke to Anup Jalota and questioned him about his relationship with Jasleen and he has some shocking details to share,\n“I never announced she is my girlfriend, if you see my entry, you will see, I sang Aisi Laagi Lagan and then I went to meet Salman. We had a quick chat and he asked who’s coming with me I said Jasleen, she is my student. But Salman said she is saying something else. The moment she came, she announced that we are lovers and I was shocked, Salman was shocked, the entire family of hers and mine were shocked.\nI don’t know why she said this, once she will come out, you can ask her directly. Now that she said we are lovers, we had no option but go in the house, I didn’t even get time to discuss it with her, I was like Chalo acting karna hai kar lete hai.”\nTwitter\nFurther when we probed him about being upset with Jasleen for not destroying her clothes for him during a task, Anup said, “How did you like my acting? There are so many TV actors, ‘Maine sabki chutti kar di’, The next day I sorted things with her, I am her guru and it was my responsibility to teach her that material things are not important in front of your guru, father or family. It was a lesson for her.”\nDon't Miss 531 SHARES 148 SHARES 3 K SHARES\nTwitter\nAnup even said how he met Jasleen’s father and explained to him that there is no romantic angle of him with his daughter,\n“ I met Jasleen’s father today and asked, 'will you call me for Jasleen’s wedding and let me perform her Kanyadaan', he said 'Hum dono milke uska Kanyadaan karenge'. I am like a father figure to her, I am her guru.”\nTwitter\nWhen we asked about why he couldn't expose Jaleen's lies then and there, Anup said, “It must be some strategy of her. It’s doesn’t look good to talk on the show, so I acted on what she said. Let her come out and then we can find out why she said that we are lovers. I was waiting for the show to get over and now that I am out, I spoke the truth.”\nTwitter\nHis fans on social media are appalled at this revelation and he said, “I never cheated the audience, what Jasleen told, I acted and rest you can ask Jasleen. My purpose was to come in the house and make Jasleen successful, and within 3 weeks she became very popular.”\nTwitter\nWe even asked Anup about Jasleen’s closeness with Shivashish, and further he shocked us by saying,\n“Shivashish is a nice guy, he belongs to a good family, I and Kesar ji will do her Kanyadaan.”\nTwitter\nAnalysing what made Jasleen lie to such an extent and Anup said,“Bigg Boss must have told her they will cast her in a Salman Khan film, if she does this, so let her come and the truth will be out.\nSigh! What is real in a reality show, we will never know.", "title": "Evicted Bigg Boss Contestant Anup Jalota Denies Dating Jasleen, Says He's Like A Father Figure To Her", "date_publish": "30/10/2018, 22:26:59", "description": "Indiatimes spoke to Anup Jalota and questioned him about his lies on his relationship with Jasleen, he lied through his teeth with an interview with us, he said, “ I never announced she is my girlfriend, if you see my entry, you will see I sang Aisi Laagi Lagan and then I went to meet Salman we had a quick chat and he asked who’s coming with me I said Jasleen, she is my student. But Salman said sh", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/evicted-bigg-boss-contestant-anup-jalota-denies-dating-jasleen-says-he-s-like-a-father-figure-to-her-355686.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/jasleen_1540883082_800x420.jpg"}