{"text": "Ex-CBFC Chief Pahlaj Nihalani Becomes Butt Of Jokes As He Moves To HC Against 20 Cuts In His Film\nEx-CBFC Chief Pahlaj Nihalani Becomes Butt Of Jokes As He Moves To HC Against 20 Cuts In His Film\nAs shocking and funny as it may sound, former Censor Chief Pahlaj Nihalani who was known for demanding unreasonable cuts in films is now protesting against the censor board, and apparently, he isn’t ready to back off.\nTwitter\nCensor Board has reportedly ordered multiple cuts in his forthcoming film Rangeela Raja which stars Govinda in a double role, and Pahlaj Nihalani is not ready to back off. He says he will take the matter to court.\nMoreover, he even ranted against the current CBFC Chief Prasoon Joshi.\n“Everybody knows about Prasoon Joshi’s enduring friendship with Aamir Khan. No one is surprised that Thugs Of Hindostan (starring Aamir Khan) was given an all-clear censor certification out of turn, while my film Rangeela Raja which was submitted well in time 60 days ahead of release, has been slapped with multiple cuts which I am not taking. No sir”\nHe says the demands of the censor board are ABSURD. Yes, you read that right.\n“There is no vulgarity no double meaning dialogues. Still, I’ve been asked to delete a massive number of dialogues and scenes. In one sequence my heroine asks my hero what he’d like as guru dakshina. He says Eklavya cut his thumb and gave it to his guru, to which she tells the hero he can cut her lips. There is no kiss. Only a suggestion of a kiss. Still, I’ve been asked to cut out this harmless playful scene. Why? Movies like Anurag Kashyap’s Manmarziyan are filled with kissing and lovemaking scenes and yet passed with a UA,” he was quoted as saying by Bollywood Hungama.\nDon't Miss 117 SHARES\nAnd since then he has become a butt of jokes on Twitter!\n#1\n😂😂😂😂😂😂😂😂😂\nKisine bahut sahi kaha h.... isi janm me karmo ka fal mil jata h.#गुस्सा_आता_है #PahlajNihalani https://t.co/R2HXSaKeeJ — Bhuvanesh Sharma (@bhuvanhere) November 5, 2018\n#2\nKarma's a bitch, or as Pahlaj Nihalani would've 'modified', karma's a bad woman! https://t.co/5TJyojgPLe — kabir (@KabirTrivedi) November 5, 2018\n#3\n#4\nPahlaj Nihalani's reaction after Censor board suggests 20 cuts in Rangeela Raja pic.twitter.com/MiodsNysr1 — Batty (@MrBatty_) November 5, 2018\n#5\nWhen the chickens come home to roost 🤣🤣🤣 #PahlajNihalani https://t.co/CNf8UO9Kll — Nandini Sen (@nandinicsen) November 5, 2018\n#6\n#7\nGive him the idea to change the film name to Rangeela Popat. censor board will pass it 🤣😃 — Baba Rangeela Popot (@Popat_Patra) November 5, 2018\n#8\nAs you sow, so shall you reap! — Mahadev Parameswaran (@empeewarren) November 5, 2018\n#9\nIrony just died a thousand deaths — Rottun (@anshuzewan) November 5, 2018\nWell, somebody rightly said – Karma is a bi**ch!", "title": "Ex-CBFC Chief Pahlaj Nihalani Becomes Butt Of Jokes As He Moves To HC Against 20 Cuts In His Film", "date_publish": "05/11/2018, 18:00:09", "description": "Censor Board has reportedly ordered multiple cuts in his forthcoming film Rangeela Raja which stars Govinda in double role, and Pahlaj Nihalani is not ready to back off. He says he will take the matter to the court. Censor Board has reportedly ordered multiple cuts in his forthcoming film Rangeela Raja which stars Govinda in double role, and Pahlaj Nihalani is not ready to back off. He says he wil", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ex-cbfc-chief-pahlaj-nihalani-becomes-butt-of-jokes-as-he-moves-to-hc-against-20-cuts-in-his-film-356118.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/excbfc_chief_pahlaj_nihalani_becomes_butt_of_jokes_as_he_moves_hc_against_20_cuts_in_his_film_1541419305_800x420.png"}