{"text": "Surgery can wait for Ryan Reynolds, but his fans in China should not. Postponing his arm surgery, Ryan Reynolds flew to China for the promotions of Deadpool 2. The recut version of the film has finally passed the Chinese rigorous censorship standards, and Ryan Reynolds is quite excited about it.\nHe flew to China on Sunday to enthrall all the Deadpool fans, reports variety.com. Last week, Fox suddenly announced that a re-cut, PG-13 Deadpool 2 would hit Chinese theaters starting this Friday - the first time the franchise has passed the country's strict censorship standards.\nReuters\nThe Beijing visit by Reynolds, who is Canadian, comes at a time when Sino-Canadian relations are at a historic low following the arrest in December of Huawei Technologies CFO Meng Wanzhou in Vancouver, with China detaining two Canadians in apparent retaliation.\nA third Canadian was sentenced to death at a sudden retrial of his drug-smuggling case in a move that Canadian Prime Minister Justin Trudeau has called \"arbitrary\" and a cause for \"extreme concern.\" None of that seemed to faze Reynolds.\nDon't Miss 623 SHARES 158 SHARES 2.4 K SHARES 2.2 K SHARES 120 SHARES\n\"It's been a dream of mine for years to bring 'Deadpool' to China and Chinese audiences, so for me this is, uh, heaven on earth,\" he told his Beijing fans on a whirlwind one-day promotional visit.\nYoutube\nHe had injured his left arm shooting the film and was scheduled to undergo surgery in New York on Sunday morning but skipped the appointment.\n\"This was more important. I was not going to miss coming to China,\" he said.\nBut conquering the Middle Kingdom may be an uphill battle even for the revamped, censor-approved \"Deadpool.\" Most Chinese fans of the franchise will have already seen both the first film and its sequel by now through other means online, and much of the films' celebrated humor is so culturally specific to the US that newcomers may easily find themselves lost in translation.\nThe film will be released with a Chinese name that translates to \"Deadpool 2: I Love My Family,\" harking back to a similarly titled classic Chinese TV show from the 1990s that follows the story of a family in Beijing.\nWith inputs from IANS", "title": "Excited For Deadpool 2’s Release In China, Ryan Reynolds Skips Arm Surgery To Promote The Film", "date_publish": "24/01/2019, 11:17:33", "description": "Actor Ryan Reynolds cancelled surgery on his arm to fly to China and charm \"Deadpool\" fans in Beijing ahead of the franchise's unexpected theatrical debut in the country. He flew to China on Sunday to enthrall all the \"Deadpool\" fans, reports variety.com.", "authors": [], "url": "https://www.indiatimes.com/entertainment/excited-for-deadpool-2-s-release-in-china-ryan-reynolds-skips-arm-surgery-to-promote-the-film-360940.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ryan_reynolds_1548245150_800x420.jpg"}