{"text": "Fan Commits Suicide After KGF Star Yash Didn't Come Out Of His House To Click A Selfie With Him\nFan Commits Suicide After KGF Star Yash Didn't Come Out Of His House To Click A Selfie With Him\nIn a shocking turn of events, a fan committed suicide outside the star of a Kannada star Yash. The actor who recently featured in K.G.F: Chapter 1 was on cloud no. 9 as his movie during the second week showed a phenomenal growth and minted close to Rs 200 crore.\nHe turned 33 two days ago and it was special because of his birthday but turned out to be an unfortunate one. The actor who usually steps out to meet and greet fans every year on his birthday did not do so after paying tribute to the late veteran actor Ambreesh. The actor, as per reports, was also not in town.\nHowever, fans don't understand this. One fanatic fan was disappointed when Yash did not step out and set himself on fire right outside his house.\nTwitter\nDon't Miss 812 SHARES\nAccording to a report in News 18, the man was identified as Ravi, who hailed from Dasarahalli. He was outside Yash’s home at Hoskerehalli, but was extremely disappointed when he found out that the actor was not in town. He then doused himself with petrol and set himself on fire.\nTwitter\nYash angrily reacted on this and said, \"I do not want fans like this, this is not fandom or love, this does not bring me happiness. I will not come to see anybody else like this again, it will give the wrong message to fans who think that I will come and meet them (if they take drastic steps like this).\"\nHe visited Ravi at the hospital and was shocked looking at what had happened. We wish strength to the entire family.", "title": "Fan Commits Suicide After KGF Star Yash Is Unable To Step Out And Click A Selfie With Him", "date_publish": "10/01/2019, 19:01:26", "description": "Yash angrily reacted on this and said, \"I do not want fans like this, this is not fandom or love, this does not bring me happiness. I will not come to see anybody else like this again, it will give the wrong message to fans who think that I will come and meet them (if they take drastic steps like this).\"", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/fan-commits-suicide-after-kgf-star-yash-didn-t-come-out-of-his-house-to-click-a-selfie-with-him-360196.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kgf_1547124685_800x420.jpg"}