{"text": "Fans Set A New Example, Slam Trolls For Racist Jibes At Director Atlee Kumar Who Was Hanging Out With Shah Rukh Khan\nFans Set A New Example, Slam Trolls For Racist Jibes At Director Atlee Kumar Who Was Hanging Out With Shah Rukh Khan\nWe are a country composed of people having diverse colour, caste, creeds and customs. India is hailed as the land of many languages and is celebrated as ethnically and culturally diverse nation. Yet, we have not been able to rise above the biases.\nTwitter\nAt an IPL match recently, at MA Chidambaram International Cricket Stadium, Shah Rukh Khan was enjoying the match between Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) along with Tamil filmmaker and screenwriter Atlee Kumar, who is known for his works in movies like Theri and Mersal among others.\nTwitter\nA movie director was sitting next to a Bollywood star enjoying a cricket match – what could possibly go wrong here, right? But some people made racist remarks on Atlee’s skin complexion.\nWho is this? SRK right side, black goat? — சா.சதிஸ்குமார் (@satheshsms89) April 10, 2019\nDon't Miss 281 SHARES 343 SHARES 555 SHARES 1.1 K SHARES\nThe fans of the 32-year-old star lashed out at the obnoxious comments being made and taught the trolls a good lesson.\nOkay yes he is black! Seriously? You are making fun of his skintone? Do u guys even realise that skin tone is the real skin tone of Ancient Indians?! btw u r either watching this match in TV or from paid stands while he is sitting in a VIP area! He achieved that with his talents pic.twitter.com/i8LSqw0Shn — Sarcawesome (@mrmohanmk) April 10, 2019\nMay be the guys who making fun would never be known to even people in the next streets but #Atlee already made his name in Kollywood! Respect people for their talents and characters, not by their looks or gender!\n- A True #Thala fan! #CSKvKKR #CSK #IPL2019 — Sarcawesome (@mrmohanmk) April 10, 2019\nMyself being mostly dark, I feel bad for the trolls that #Atlee has to go through when he makes public appearances. #Priya should be proud that her hubby has reached a height that to sit besides #SRK is no less feat. pic.twitter.com/aDsAIm8OJ2 — 🎞Pravs🎧 (@filmsnut) April 9, 2019\n#atlee He In A Position To Sit Along With #ShahrukhKhan..💪💪so many people troll about his colour. Ur troll becomes to sit along with #Sharukhkhan jiii..💖💖this meeting becomes a big blockbuster😍💪💪 pic.twitter.com/C0QAMQbUmL — Kumaravel (@kumarav30427559) April 10, 2019\nAt the end of the day, #Atlee got married to a beautiful woman. Earning 8 figure salary. Doing movies with the biggest star of this generation in Tamil. You, his RACIAL ABUSERS, are living a low life. — George AB Addict (@VijayIsMyLife) April 9, 2019\nY’all making fun of Atlee’s skin colour well at least he got to sit beside SRK by his own hardwork. What have you achieved other than sitting at your home commenting about his skin colour? #Atlee #CSKvKKR — Yaaro 🤔 (@lostsoulheree) April 9, 2019\nIn the meantime, some of the fans were wondering as to Atlee Kumar and SRK’s hanging out with each other could mean a possible collaboration? Little birdies suggest Atlee Kumar is talks with Shah Rukh Khan for the remake of the latter’s 2017 film Mersal.\npostimg.cc\nAlthough, nothing is official as of yet, people, especially movie journalists from the South are convinced about this alleged collaboration.\n. @iamsrk and @Atlee_dir are certainly doing a Movie together..\nWhether it's #Mersal Hindi remake or fresh script is to be decided.. — Ramesh Bala (@rameshlaus) April 9, 2019\nMersal, which starred Tamil star Vijay in the lead role, is a story about two twin brother avenging their father’s death. The movie had minted Rs 260 crore at the worldwide box-office. After Shah RukhK Khan walked out of Rakesh Sharma biopic, we wonder if he has taken up this role.", "title": "Fans Set A New Example, Slam Trolls For Racist Jibes At Director Atlee Kumar Who Was Hanging Out With Shah Rukh Khan", "date_publish": "11/04/2019, 11:42:33", "description": "At an IPL match recently, at MA Chidambaram International Cricket Stadium, Shah Rukh Khan was enjoying the match between Chennai Super Kings (CSK) and Kolkata Knight Riders (KKR) along with Tamil filmmaker and screenwriter Atlee Kumar, who is known for his works in movies like Theri and Mersal among others.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/fans-set-a-new-example-slam-trolls-for-racist-jibes-at-a-director-who-was-hanging-out-with-srk-365225.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/director_atlee_kumar_faces_racist_comments_as_he_hangs_out_with_shah_rukh_khan_fans_slam_trolls_1554961553_800x420.png"}