{"text": "Fans Can’t Stop Gushing Over Thor & Captain Marvel’s First Meeting In Avengers: Endgame Trailer\nFans Can’t Stop Gushing Over Thor & Captain Marvel’s First Meeting In Avengers: Endgame Trailer\nThe end is near, Marvel fans. The much-awaited full trailer of Avengers: Endgame was finally released yesterday, and boy, it was more dramatic than anyone would have expected it to be.\nvia GIPHY\nThere was a lot that the trailer showed and fans couldn’t stop talking about. Hawkeye’s new haircut has become a topic of discussion already. There were new Avengers white suits. Rocket Raccoon was hanging out with War Machine. And to everyone’s surprise, Captain Marvel finally showed up in the present time.\nvia GIPHY\nCaptain Marvel arrives and meets Thor in the Avengers: Endgame trailer. The two beloved characters were meeting for the first time. And now, fans can’t get over Thor’s first impression of Carol Danvers AKA Captain Marvel.\nvia GIPHY\nAs the Thunder calls for his axe, the weapon flies past Captain Marvel’s head, but she didn’t even flinch. “I like this one,” he tells Black Widow post that. Thor’s reaction is so endearing, isn’t it? Fans cannot stop gushing. They want more of their two favourite superheroes. Take a look.\nvia GIPHY\na friendship between captain marvel and thor: the two strongest avengers #AvengersEndgame pic.twitter.com/HocLqvxl6w — a saw cm (@cptainxmarvel) March 14, 2019\nBrb writing a screenplay that can only be described as: Fifty Shades of Grey but it’s Thor and Carol Danvers — Carrie Wittmer🐻🍊 (@carriesnotscary) March 14, 2019\nDon't Miss 117 SHARES 2.5 K SHARES 1.7 K SHARES\nAnd help I already want a buddy cop movie with Thor and Carol #AvengersEndgame — Preeti Chhibber (@runwithskizzers) March 14, 2019\nthor after knowing carol for two seconds pic.twitter.com/pN5FmHSCzZ — 𝐣𝐮𝐥𝐢𝐚𝐧𝐚 𝐬𝐚𝐰 𝐜𝐦 𝐱𝟐 | 𝟏𝟏𝟔 (@valkyriethot) March 14, 2019\nLook at Thor being all soft with Carol. I CAN'T WAIT FOR THIS FRIENDSHIP! #AvengersEndgame pic.twitter.com/QjzVTrxc2Y — 𝓪𝓁𝒾𝒶𝓈 (@itsjustanx) March 14, 2019\nThor and Carol after meeting for 5 seconds#AvengersEndgamepic.twitter.com/JCXF3XIHiO — Becky || SAW ︽✵︽ (@xBreeTanner) March 14, 2019\nThor making new friends is what I live for pic.twitter.com/9Ls8jWbdPM — melek☀️ (@Lokieed) March 14, 2019\nthor and carol in endgame when they both figure out they have glowing eyespic.twitter.com/NlU0TZTctA — ale | saw captain marvel x3 (@AVNGRSWINTER) March 11, 2019\nTHOR AND CAROL DANVERS. U SEE THAT EXCELLENCE #AvengersEndgame pic.twitter.com/PqWQQ66v93 — hannah (@lillseb) March 14, 2019\nCarol and Thor on their way to defeat Thanos #AvengersEndgame pic.twitter.com/5AExwDOqwK — Raquel Anchel🔻︽✵︽ (@Ranchel_) March 14, 2019\nThor meeting Carol Danvers for the first time... #AvengersEndgame pic.twitter.com/vUcOZUcUjF — Mark Brockett (@Tuff_Overlord) March 14, 2019\nThanos when he see's Carol and Thor pulling up to his farm pic.twitter.com/4mNz3r9AGt — Peter come's back next month (@MJxbeanie) March 8, 2019\nthe only person who ever smiled in the two endgame trailers we got was thor. carol literally breathed and he smiled ohmygod her power pic.twitter.com/D1QoxWblAw — 𝐳𝐨𝐞 𝐬𝐚𝐰 𝐜𝐦 𝟐𝐱 (@neIliescrain) March 14, 2019\ncarol: not impressed\nthor: very impressed pic.twitter.com/AyXrfh1TdN — patricia (@heartfiIiaz) March 14, 2019\nthanos when carol and thor show up in front of him pic.twitter.com/SUd9CpLsao — laq saw cm!!! (@spidervesre) March 14, 2019\nThor and Captain Marvel together would be so powerful, don’t you all agree?", "title": "Fans Can’t Stop Gushing Over Thor & Captain Marvel’s First Meeting In Avengers: Endgame Trailer", "date_publish": "15/03/2019, 12:20:04", "description": "Captain Marvel arrives and meets Thor in the Avengers: Endgame trailer. The two beloved characters were meeting for the first time. And now, fans can’t get over Thor’s first impression of Carol Danvers AKA Captain Marvel. As the Thunder calls for his axe, the weapon flies past Captain Marvel’s head, but she didn’t even flinch. “I like this one,” he tells Black Widow post that. Thor’s reaction is s", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/fans-can-t-stop-gushing-over-thor-captain-marvel-s-first-meeting-in-avengers-endgame-trailer-363754.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/fans_cant_stop_gushing_over_thor__captain_marvels_first_meeting_in_avengers_endgame_trailer_1552631423_800x420.png"}