{"text": "Ever since Irrfan Khan dropped the news of his cancer diagnosis, fans have been worried. Irrfan Khan, who is considered as one of the finest actors we have today has been battling cancer since last year but fans did take a sigh of relief when he returned to India in March to resume his work in Mumbai.\n\"The unexpected makes us grow, which is what the past few days have been about. Learning that I have been diagnosed with neuroendocrine tumor as of now has admittedly been difficult, but the love and strength of those around me and that I found within me has brought me to a place of hope,\" Irrfan earlier said while sharing the news of his tumor.\nIrrfan had earlier requested the paps to not click him and he was seen sporting a mask all through his on and off appearances ever since he returned to India.\nHowever, today, it was a delightful change for all his fans as the actor was spotted without any masks and looked evidently comfortable with the camera and paps.\nHave a look at the pictures.\nViral Bhayani\nViral Bhayani\nDon't Miss 197 SHARES 291 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAs soon as the pictures and videos were shared on social media today, fans have been pouring best wishes for the actor. Read on!\nFor the uninitiated, Irrfan Khan was in London, where he was undergoing medical treatment for neuroendocrine tumor. The actor returned to India in March and he is all set to begin shooting for the sequel of his hit film Hindi Medium.", "title": "Fans Rejoice As Irrfan Khan Gets Clicked Looking Healthier Post His Cancer-Treatment!", "date_publish": "02/04/2019, 15:37:21", "description": "Ever since Irrfan Khan dropped the news of his cancer diagnosis, fans have been worried. Irrfan Khan, who is considered as one of the finest actors we have today has been battling cancer since last year but fans did take a sigh of relief when he returned to India in March to resume his work in Mumbai.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-rejoice-as-irrfan-khan-gets-clicked-looking-healthier-post-his-cancer-treatment-364747.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/irrfan_khan_1554200934_800x420.jpg"}