{"text": "That’s how every picnic starts, right? And now another video in which Ranveer Singh is singing and dancing on Nashe Si Chadh Gayi is doing the rounds. Looks like Ranveer’s infectious energy has taken over the entire team.\nIn one of the videos that is now going viral on social media, fans can be heard singing Desi Girl for her outside the concert venue. “Priyanka, I love you! My desi girl!,” hooted one of them before singing the Desi Girl song.\nFirstly, Varun was asked if he had ever thought or imagined to be the most bankable actor one day and he confidently replied, “I think I did imagine because if I wouldn’t have, it wouldn’t have happened. I have certain expectations from myself and I have to believe in myself if I don’t believe, then how will others do.”\nThis man bought a ticket for Avengers: Endgame for a whopping USD 15000 (Rs. 10,45,150.50). Someone had auctioned the ticket for $2,500 (Rs. 1,73,766) for New Jersey’s AMC theatre. But not wanting to miss the opportunity of watching the film on the first day of its release, this man chose ‘Buy It Now’ option and bought it for $15,000 (10,45,150.50).\nDon't Miss 862 SHARES 346 SHARES\nEnjoying a spectacular sea view with her, we started the conversation with her about her upcoming film Kalank being compared with Sanjay Leela Bhansali’s films and she said, “Every director creates his own world and Abhishek Verman has managed to create his own world, you don’t know the story and you don’t know what the film is about, but you are going by the visuals which are larger than life, even if you see Mughal E Azam, its larger than life, the visuals are big and because it’s a period drama, it starts looking kind of similar, but it’s totally different. The characters are very different, they are very beautiful, nuanced, and deep; it’s very layered, what you see is not what you actually get as there are a lot of layers to it. Every character has deeper conflicts, the way they deal with their conflicts is very different, and the characters make the film very interesting.”", "title": "Fans Abroad Sing 'Desi Girl' To PC, Varun Hopes He Doesn't Experience Failure With Kalank & More From Ent.", "date_publish": "09/04/2019, 18:37:28", "description": "Enjoying a spectacular sea view with her, we started the conversation with her about her upcoming film Kalank being compared with Sanjay Leela Bhansali’s films and she said, “Every director creates his own world and Abhishek Verman has managed to create his own world, you don’t know the story and you don’t know what the film is about, but you are going by the visuals which are larger than life.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-abroad-sing-desi-girl-to-pc-varun-hopes-he-doesn-t-experience-failure-with-kalank-more-from-ent-365151.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bollywood_1554815515_800x420.jpg"}