{"text": "Fans Share Ranveer's Old Apology Video After He Received Flak For His Comments On KWK\nFans Share Ranveer's Old Apology Video After He Received Flak For His Comments On KWK\nThe Internet can forgive you but it hardly ever forgets. After Hardik Pandya landed into controversy for his regressive remarks on Karan Johar's chat show Koffee With Karan, people dug out an old video of Ranveer Singh.\nThe Simmba actor received a lot of criticism for his remarks.\nIn his debut episode on the chat show, Ranveer had described how he was floored by Kareena Kapoor Khan's beauty when she would come to a club for swimming. \"I went from child to boy\", he said in the clip while describing his feelings to see Kareena swim.\nAgencies\nThat's not all. In the video, Ranveer Singh asks Anushka Sharma if she wants to get her 'A** pinched'.\n\"You want your ass pinched? I'm right here\" IS THIS YOUR HERO? Also look at how Kjo is laughing. BOLLYWOOD IS FULL OF SCUMS pic.twitter.com/nZbEWiTlp8 — babu bisleri (@PUNchayatiii) January 10, 2019\nFans have now pushed put an old video where Ranveer Singh confesses his regret around his statements. He admitted that he was arrogant when he made his debut. Singh's fans got divided on the social media platform and while half of them are protecting his image, a few others are lashing out on the actor.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nA comment reads,\n\"Wish people would stop delivering snap judgments on social media! Trial by Twitter provoked by malicious trolls should stop.\"\nWatch the video and decide for yourself.\nStar India\n[Video] Ranveer Singh over the years talking about his first KWK experience and why he regrets some things he’s said!\nYou grow you learn... he has regretted his words several times we think people should let it gopic.twitter.com/4qIOTn8oks — #Simmba 😎💪🏽👮🏽‍♂️🔫 ka Cafe ☕️ (@ranveercafe69) January 11, 2019\n👇🏽 As told by Ranveer Singh to HT in Feb. 2018 pic.twitter.com/X6A86pch4N — #Simmba 😎💪🏽👮🏽‍♂️🔫 ka Cafe ☕️ (@ranveercafe69) January 11, 2019", "title": "Fans Share Ranveer's Old Apology Video After He Received Flak For His Comments On KWK", "date_publish": "15/01/2019, 13:44:45", "description": "The Simmba actor received a lot of criticism for his remarks. In his debut episode on the chat show, Ranveer had described how he was floored by Kareena Kapoor Khan's beauty when she would come to a club for swimming. \"I went from child to boy\", he said in the clip while describing his feelings to see Kareena swim.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-share-ranveer-s-old-apology-video-after-he-received-flak-for-his-comments-on-kwk-360436.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_1547541228_800x420.jpg"}