{"text": "Fans Gather Outside Mannat To Wish SRK, Deepika's Wedding Celebrations Begin And More From Ent\nFans Gather Outside Mannat To Wish SRK, Deepika's Wedding Celebrations Begin And More From Ent\nDeepika's stylist Shaleena Nathani took to Instagram to share pictures from the Nandi puja. Donning a saffron Sabyasachi suit, Deepika looked super-happy as the bride-to-be.\nMidnight celebrations for SRK were low-key but really special. He kickstarted the celebrations in Mumbai with his \"girl gang.\"He shared pictures from the celebration writing, \"Fed cake to wife... Met my family of fans outside Mannat... now playing Mono Deal with my lil girl gang! Having a Happy Birthday. Thank you all for this amazing love,\"\nDon't Miss 10.9 K SHARES\nNo matter how busy SRK is, he follows the ritual of coming to his terrace and waving to his fans, ensuring that they don't go back home disappointed. Being a Shah Rukh Khan fan is not just about loving him or being an ardent fan of his films. For many, SRK is no less than a religion.\nAs per reports, Katrina Kaif will be playing the role of an actress who is an alcoholic. It is also said that this is her toughest role so far. A close source to Mid Day even revealed that Kat extensively read about the lives of Hollywood actresses Lindsay Lohan, Demi Moore and Liza Minnelli who battled alcoholism.\nKrishnan has refuted the allegations. This is the second such instance in which a woman has been named, and first from Tamil Nadu with the campaign surging ahead. Chennai-based theatre artiste Ananya Ramaprasad in a Facebook post said, \"I am a victim of sexual, mental and emotional manipulation, abuse, and most horrifically, gas-lighting, all at the hands of my abuser, Maya S Krishnan.\"", "title": "Fans Gather Outside Mannat To Wish SRK, Deepika's Wedding Celebrations Begin And More From Ent", "date_publish": "02/11/2018, 16:58:10", "description": "Deepika's stylist Shaleena Nathani took to Instagram to share pictures from the Nandi puja. Donning a saffron Sabyasachi suit, Deepika looked super-happy as the bride-to-be. Midnight celebrations for SRK were low-key but really special. He kickstarted the celebrations in Mumbai with his \"girl gang.\"He shared pictures from the celebration writing, \"Fed cake to wife... Met my family of fans outside", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-gather-outside-mannat-to-wish-srk-deepika-s-wedding-celebrations-begin-and-more-from-ent-355948.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/trending_1541158185_800x420.jpg"}