{"text": "Fans Shower Love On Robert Downey Jr On His 54th Birthday, Call Him The Godfather Of Marvel\nFans Shower Love On Robert Downey Jr On His 54th Birthday, Call Him The Godfather Of Marvel\nDid you know that Tom Cruise was almost close to being cast as Tony Stark AKA Iron Man – the character with which it all began? It has been 11 years since Iron Man was released, and in all these years, Marvel Cinematic Universe has grown so rapidly that it is now the biggest franchise of all time. And it’s all because of Iron Man AKA Robert Downey, Jr.\nvia GIPHY\nCan you even imagine any other actor in that role? When the makers of the film were a little skeptical to cast Robert Downey Jr. in the role because of his controversial past, director Jon Favreau unremittingly campaigned for him. And then, as they say, a star was born.\nvia GIPHY\nNot many people know that when he was six, his father fed him marijuana and he pretty much spent his major chunk of life in rehabs thereafter. He is sober since 2003. And his charisma and personality are making people swoon since then.\nHe is witty, sarcastic and humorous. Robert Downey, Jr. is just not a celebrity but a phenomenon. He is hailed as the ultimate Avengers by his fans.\nWhen the rumours were rife that he is quitting Marvel after Avengers: Endgame, fans were disheartened. Isn’t it impossible to picture MCU without him?\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nThe man who has upped the game of Marvel is celebrating his 54th birthday today, and fans are pouring out their love for him. Take a look!\n#1\nHappy birthday non-age man✌🏼\nI love you so much❤️ I hope you eat this cake much more than the last time🙏🏼😂 #RobertDowneyJr | @RobertDowneyJr pic.twitter.com/aku4MkeA4s — Tuğ. (@protestiadau) April 3, 2019\n#2\nhey, it’s my ride or die’s birthday today. happy birthday @RobertDowneyJr, i love you so much my og fave 🖤🖤🖤 pic.twitter.com/cea9Ghn0vG — arin (@tuavenger) April 3, 2019\n#3\nHappy birthday legend #RobertDowneyJr #IronMan\nStay happy always sir\nBe our iron man\nLots of love from india\nI know it's too soon\nBt in India it's 4th April\nAnd it's Ur birthday 😍😍😍😍😍\nThanks sir to entertain us\nThanks sir inspire us\nAnd love you sir so much😘😘 pic.twitter.com/8AQyk13Fj7 — MD.Rizwan (@MDRizwa29549299) April 3, 2019\n#4\nI have always been proud of you and always will be. Thank you for being who you are. The best birthday for you❤ #HappyBirthdayRDJ @RobertDowneyJr pic.twitter.com/5RHy2GBXxu — Endgame Mila 🌹 (@sxarletwxtch) April 4, 2019\n#5\nHAPPY HAPPY BIRTHDAY TO MY DAD @RobertDowneyJr! He is the man who started all of this. I can’t believe he is 54 now! You’re such an amazing person and I hope to meet you someday. Thank you for bringing Tony Stark to life! I wish you all the best! We love ü pic.twitter.com/Cc2DSCcOL2 — jd ⎊ (@leviosstark) April 3, 2019\n#6\nA Very Happy Birthday to The Most Loved Superhero Tony Stark aka Robert Downey Jr ❤️😘\nThe Heart of MCU ❤️#IronMan pic.twitter.com/ZLlbrFfJ7f — HBD Tony Starkᴹᴵ 😈 (@AkkyKaDeewana) April 4, 2019\n#7\nHappy Birthday to the King of the MCU ! The Godfather of Marvel ! The man who became a Icon !\nHappy Birthday Robert Downey Jr !\n🎉🎉💚💚 #HappyBirthdayRDJ #HappyBirthdayRobert pic.twitter.com/Bwdf5vwH2S — Døwney_Depp ⚓👑🐍 (@Downey_7765) April 4, 2019\n#8\nHappy birthday to Robert Downey Jr!\nThe man who started the MCU, the very first superhero in the MCU, the man who has carried the MCU for over 10 years and lifted it to brand new heights.\nRobert, we couldn't have asked for a better iron man. Thank you, and please enjoy this day pic.twitter.com/Oss7rTEWD6 — Marvel || End Game (@lovemymarvel) April 4, 2019\n#9\n✨happiest birthday robert💘 here's us trying to give you all the love we have for you on this special day bc you deserve this and much more ✨@RobertDowneyJr #HappyBirthdayRDJ #HappyBirthdayRobert pic.twitter.com/A7LcHwL8BM — best of rdj (@bestsofrdj) April 4, 2019\n#10\nit’s my dad’s birthday yall. words can’t express how much i adore this man. he’s the best role model anyone can have, and he’s always inspired me to become the best version of myself. i’d be lost without him. thanks for everything robert dobert jobert. i love you @RobertDowneyJr pic.twitter.com/tea1FtRbip — hbd robert dobert jobert | 𝔞𝔫𝔡𝔯𝔢 ⚯͛ (@wizardowney) April 4, 2019\n#11\nHappy Birthday to Chris Evans' biggest fan Mr. @RobertDowneyJr\nMay your birthday be as awesome as you are! 💞 #HappyBirthdayRDJ pic.twitter.com/R77rddJaD4 — emma (@dchrisevans) April 4, 2019\n#12\nHappy Birthday to the best and badass superhero @RobertDowneyJr!! 🤩 pic.twitter.com/Y41mvI6W1f — Mʀ. Mιcнᴀᴇʟ (@IamKriish) April 4, 2019\n#13\nTo the world’s most talented person that. Happy 54th birthday! i love you@RobertDowneyJr #Happy54thBirthdayRDJ pic.twitter.com/wZGOTve8Dz — TEAM DOWNEY/RDJ (@TeamDowney1965) April 4, 2019\n#14\n#15\n\"Listen,smile,agree and then do whatever the fuck you were gonna do anyway\"\n-Robert Downey Jr.\nHappy Birthday Dad 😄🎂🎉 pic.twitter.com/w3KZzJWUoZ — Judelyn Narada (@JudelynNarada) April 4, 2019\n\"Genius, Billionaire, playboy, Philanthropist!\" Happy birthday, Robert Downey, Jr.", "title": "Fans Shower Love On Robert Downey Jr On His 54th Birthday, Call Him The Godfather Of Marvel", "date_publish": "04/04/2019, 16:11:09", "description": "Did you know that Tom Cruise was almost close to be cast as Tony Stark AKA Iron Man – the character with which it all began. It has been 11 years since Iron Man was released, and in all these years, Marvel Cinematic Universe has grown so rapidly that it is now biggest franchise of all time. And it’s all because of Robert Downey, Jr.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/fans-shower-love-on-robert-downey-jr-on-his-54th-birthday-call-him-the-godfather-of-marvel-364874.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/robert_downey_jr_1554372653_800x420.jpg"}