{"text": "1. Winter Has Finally Arrived! Fans Welcome Game Of Thrones Season 8 With Epic Jokes & Memes\nAfter what felt like eternity -- 595 Days to be precise, winter has finally arrived. One billion people tuned into HBO to watch the first episode of Game Of Thrones season 8. All the fans across the globe, including Indians who watched it on Hotstar, forgot their Monday blue and woke up at 6:30 am eager to watch the finale season, and boy, it was one heck of an episode, tbh.\n2. Playing An Old Man For The 1st Time, Salman Khan Stuns Fans With A 70-Year-Old Avatar For 'Bharat'\nBharat is a remake of Korean movie titled Ode To My Father, which is a story about a man separated from his father during war, desperately longs to reunite with him and his missing sister.\n3. From One-Room Shed To Dream House In Mumbai, This Is Pankaj Tripathi’s Inspiring Success Story\nDon't Miss 159 SHARES 812 SHARES\n“Today, my wife Mridula and I own our dream house. But I haven't forgotten my one-room shed with its tin roof in Patna. One night, the rains and wind were so intense that one of the tin sheets blew away and I was left looking at the naked sky,” he told IANS.\n4. Kangana Ranaut’s Sister Rangoli Slams Alia Bhatt And Her Mom Soni Razdan Over Their British Citizenship\nFor the uninitiated, Alia Bhatt doesn’t hold an Indian passport. She is a British citizen and so is her mother Soni Razdan. So, to be able to vote, she will have to give up her British citizenship because according to Indian rules, no person can hold dual passports.\n5. This Baby Dressed Up As Brienne Of Tarth To Welcome Game Of Thrones Season 8 & We Can’t Stop Swooning\nAnd this isn’t all! In another part of the world, right before the premiere of the finale season, in all the excitement, a couple dressed up their little daughter as another character from Game Of Thrones. You have met Brienne of Tarth in GoT, right? Now meet 'Brienne - the cutie!'", "title": "Fans Welcome Game Of Thrones Season 8, Salman Khan’s Salt-And-Pepper Look & More From Ent", "date_publish": "15/04/2019, 18:31:05", "description": "From Salman Khan’s new look for Bharat to Game Of Thrones season 8 premiering and fans going crazy, here is all that rocked the world of entertainment. On the other hand, in another forthcoming film titled Bharat, he will be seen in a never-seen-before greying and bespectacled avatar. Salman Bhai will sport a white moustache and beard. So, basically he is playing an old man in Bharat!", "authors": [], "url": "https://www.indiatimes.com/entertainment/fans-welcome-game-of-thrones-season-8-salman-khan-s-salt-and-pepper-look-more-from-ent-365503.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/fans_welcome_game_of_thrones_season_8_salman_khans_saltandpepper_look__more_from_ent_1555331162_800x420.png"}