{"text": "The wait for Ranveer and Deepika's wedding pictures felt like forever. Everyone was glued to their phone and laptop screens just to gatch a glimpse of the couple. At 8 P.M both Ranveer Singh and Deepika Padukone took to their social media handles to give their fans and loved ones a closer look at their celebrations.\nTheir romance entered a new phase in Italy and the pictures of their wedding were nothing short of dreamy.\nInstagram/Ranveer\nWhat didn't come as a surprise was how netizens reacted to these pictures. While half of them couldn't stop gushing and sulking about their single status, there were a few people who tweaked the pictures only to start a meme-fest.\nIn case you are wondering what we are talking about, here are all the funniest tweets!\nOmg. Made for each other.\nRanveer wearing Tanishq jewellery and Deepika carrying 4 types of Ching's Chutneys.#DeepVeerKiShaadi pic.twitter.com/2IoHnRvM39 — SAGAR (@sagarcasm) November 15, 2018\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nRanveer and Deepika asked the guests at the wedding not to share their wedding pics. Ranveer and Deepika will do that first. They are doing so much to get more likes and retweets than others! — SAGAR (@sagarcasm) November 15, 2018\nIs he apologizing for playing Tune Maari Entriyan at the wedding? #DeepVeer pic.twitter.com/5fTbQ86rCC — Shreemi Verma (@shreemiverma) November 15, 2018\nWhen your favorite is married and you haven't seen a single picture #DeepVeerKiShaadi pic.twitter.com/rk3FXal7Oi — siddhant. (@ignoreandfly) November 14, 2018\nPls stop saying their wedding pics look like a Bhansali movie, those are the ones where Deepika dies in the end. — Ripper (@Ace_Of_Pace) November 15, 2018\nOmg. Made for each other.\nRanveer wearing Tanishq jewellery and Deepika carrying 4 types of Ching's Chutneys.#DeepVeerKiShaadi pic.twitter.com/2IoHnRvM39 — SAGAR (@sagarcasm) November 15, 2018\n(Also read- 12 Endearing Things About Ranveer-Deepika's Fairytale Wedding That Will Make You Swoon!)", "title": "Fans Give A Hilarious Twist To Ranveer-Deepika's Wedding Pictures, Turn Them Into Memes!", "date_publish": "16/11/2018, 15:14:42", "description": "What didn't come as a surprise was how netizens reacted to these pictures. While half of them couldn't stop gushing and sulking about their single status, there were a few people who tweaked the pictures only to start a meme-fest. While half of them couldn't stop gushing and sulking about their single status, there were a few people who tweaked the pictures only to start a meme-fest.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-give-a-hilarious-twist-to-ranveer-deepika-s-wedding-pictures-turn-them-into-memes-356805.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_1542362491_800x420.jpg"}