{"text": "It's that time for the year when the two biggest celebrities of the film industry have taken one of the biggest decision of their lives. Bollywood superstars Ranveer Singh and Deepika Padukone, have now officially tied the knot in konkani style ceremony in the picturesque location of Italy.\nIn a three day event of wedding festivity, #DeepVeer as fans love to call them, got engaged on Day 1 and then got hitched in a day ceremony.\nAnd it's heartbreaking for everyone back in the home country that none of us have gotten our hands on any visuals of the same. From designers, fans and friends, everyone is eager to know how the wedding is rolling, and how Deepika and Ranveer are looking as man and wife.\nDon't Miss 7.9 K SHARES 159 SHARES\nAs per reports, heavy patrolling is done in and around their wedding venue and celebs, family, staff and florists are all required to submit their phones at the entrance to avoid any pictures getting leaked.\nFollowing into the footsteps of Rani Mukerji and Aditya Chopra, Deepika-Ranveer have so far managed to be successful. However, social media is pleading the A-listers to release a few photos. Take a look\nMy heart is feeling too many feelings. I’m pretty sure this is what seeing your daughter marry the love of her life feels like #DeepVeerKiShaadi pic.twitter.com/iYANfm9Okw — Doe #Ladkiwale👑 (@doepikapadukone) November 14, 2018\nNo pictures but it was love personified to see them together today. Couldn’t stop my tears, but these were tears of happiness and so I hope they never do. #DeepVeerKiShaadi #ranveerkishaadi #foreverlove — Nitasha (@Nitasha22) November 12, 2018\nAwww congratulations babies ❤️❤️\nI'm so happy for you two, stay healthy and stay blessed.\nStill waiting for wedding pictures of the biggest wedding in bollywood 💞\nHappy Married Life, make lots and lots of movies.❤️#DeepVeerKiShaadi pic.twitter.com/BpizWXmH6d — Nicki | 26/10/19 mark the day y'all 💞 (@MrsJiyongkwon88) November 14, 2018\nBy not letting a single picture/ video out, they're just killing the excitement!! Let us also be a part of the madness! #DeepveerKiShaadi #DeepikaPadukone #ranveersingh #DeepikaRanveer — SnehalRajani (@Snehal_Rajani) November 14, 2018\nThe anxiety of who Deepika will be wearing tonight is getting unbearable. Please release pictures at the earliest so everyone can be relieved of the pain.#DeepVeerKiShaadi — breen (@breenrana) November 14, 2018\nC'mon you guys, we really do deserve a glimpse of this beautiful ceremony. Share photos, already! Some fans have even got mehendi on their hands with the hashtag DeepVeer and are even cutting congratulatory cakes after hearing confirmed reports of their marriage.", "title": "Fans Plead Ranveer-Deepika To Share Their Wedding Pictures With Endearing & Funny Tweets!", "date_publish": "14/11/2018, 17:05:44", "description": "The duo have reportedly tied the knot in a konkani style ceremony in Italy.The duo have reportedly tied the knot in a konkani style ceremony in Italy.The duo have reportedly tied the knot in a konkani style ceremony in Italy.The duo have reportedly tied the knot in a konkani style ceremony in Italy.The duo have reportedly tied the knot in a konkani style ceremony in Italy.The duo have reportedly t", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/fans-plead-ranveer-deepika-to-share-their-wedding-pictures-with-endearing-funny-tweets-356671.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_1542194228_800x420.jpg"}