{"text": "2018 was magical for Deepika Padukone. After all, she got married to the love of her life Ranveer Singh, and since then she is high on happiness. Also, her film Padmaavat in which she completely nailed the character of Rani Padmavati, was well-received by her fans and critics. What’s more? At Cannes 2018, she made a thunderous entry making several heads turn with her breathtakingly gorgeous look.\nDeepika sure has seen ups and downs in her career – she succumbed to depression too – but she emerged a warrior, fought it all to prove that happy endings aren’t myths. After a failed relationship with Ranbir Kapoor that took a toll on her life, she is now happily married to Ranveer Singh.\nThe diva stole hearts from the day she ventured into the world of films. Remember when she walked out of a car wearing a pink lehenga waving at the crowd in her debut film Om Shaanti Om? She made several people swoon. She is a self-made independent woman, a style-queen too, and a charming personality that gives strength and love to those who walk into her life – like Ranveer Singh – who calls her his “super-power”, “Hummingbird” and the best decision of his life.\nDon't Miss 264 SHARES 322 SHARES 185 SHARES 3.4 K SHARES 234 SHARES\nTwitter\nDeepika Padukone has turned 33 today. Aching to work with her in this year, Ranveer Singh has revealed that sadly the lovebirds won’t be seen in a movie together in 2019. But he is “hoping that filmmakers will approach the two of us with a script that we like and can take it forward,” he told DNA.\nTwitter\nOn her first birthday after marriage, B-town and fans is pouring out wishes for Deepika Padukone with all the love.\nTo the girl who I looked up-to when I was lost, when I felt its the END,you made me realize there is a moment of laughter waiting for you if you're tearing now, I learnt to fight with my depression because of you! Thank you and I love you ❤ a very #HappyBirthdayDeepikaPadukone pic.twitter.com/bx1MT0KNNL — Happy birthday DP❤ (@ItzAnjuHere) January 4, 2019\nHappy Birthday darling @deepikapadukone!! Hope this year brings you all that your heart desires. Have a good one 💖✨ pic.twitter.com/2otNqOZ34k — Madhuri Dixit Nene (@MadhuriDixit) January 5, 2019\nHappy birthday darling @deepikapadukone\nYou adorn every character you play with so much grace.\nMay this year & every year be all yours!!!\nLooking forward to working with you on ‘CHAPAAK‘\nLove and light always.. pic.twitter.com/OPP5uoR9i9 — Shankar Mahadevan (@Shankar_Live) January 5, 2019\nWishing the girl who is extremely beautiful inside and out @deepikapadukone a very happy birthday..you are one of the nicest people I have met in my life..always real..always humble..always human..wish u have a fantastic year ahead❤️🤗 #mymeenamma #happybirthdaydeepikapadukone pic.twitter.com/jWJvwP5WLa — NIKITIN DHEER (@nikitindheer) January 5, 2019\nA very Happy Birthday @deepikapadukone\nWish you the best of health, happiness & peace. 🤗❤️ — Vikrant Massey (@masseysahib) January 5, 2019\nEven if it is for infinite times... I will not get tired sayingI LOVE YOU DEEPIKA PADUKONE #HappyBirthdayDeepikaPadukone pic.twitter.com/EVSK6cTOqC — Sneha (@snehaprasadv) January 4, 2019\nHere's to the one who inspires everyone with her unwavering determination and passion! The one we all love, adore and respect - The Queen of Hearts🌸💕@deepikapadukone #HappyBirthdayDeepikaPadukone pic.twitter.com/O16QwsUg43 — Aayushi🌸 (@aayushi1907) January 4, 2019\nHappy birthday to this talented and utterly beautiful woman, who has never failed to inspire me with her courage and kindness. You are one hell of a woman @deepikapadukone. As I always say, the best is yet to come ♥🍾#HappyBirthdayDeepikaPadukone pic.twitter.com/9QeQaixybA — pri (@_AgarTumSaathHo) January 4, 2019\nActing can be learned from the crash course, but humanity and morality are not going to make learn with anyone, it is inbuilt. You are a true actor not just from your work and performance, but from your ethics. Happy Birthday @deepikapadukone 😍🥰\n#HappyBirthdayDeepikaPadukone pic.twitter.com/hvNv0pLN2d — Er SP Singh (@IamErSPSingh) January 4, 2019\n◾National Level Badminton player\n◾Only actress with 7 movies in the 100+ crore club\n◾Founded an NGO to bring awareness about mental health\n◾ Only woman to enter top 5 in forbes' richest Indian celeb list\n◾Her brand AAY is worth 100cr+#HappyBirthdayDeepikaPadukone pic.twitter.com/TtUet2fR0k — siddhant. (@ignoreandfly) January 4, 2019\nHappy Birthday to the quintessential Diva of bollywood @Deepika https://t.co/7DcxfdpiG2 inspiration I love you from the bottom of my heart.❤who doesn't even know that I exist.Just a small gift from you biggest fan girl ever😊❤#HappyBirthdayDeepikaPadukone #HappyBirthdayQueen pic.twitter.com/uhHjgiXybk — Anwesha💕 (@Insane__wesha) January 4, 2019\nHappy Birthday, Deepika Padukone. Keep rocking in life!", "title": "Fans Make Deepika Padukone's 33rd Birthday Special, Express She Has Always Been An Inspiration", "date_publish": "05/01/2019, 15:10:39", "description": "Deepika Padukone has turned 33 today. Aching to work with her in this year, Ranveer Singh has revealed that sadly the lovebirds won’t be seen in a movie together in 2019. But he is “hoping that filmmakers will approach the two of us with a script that we like and can take it forward,” he told DNA.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/fans-make-deepika-padukone-s-33rd-birthday-special-express-she-has-always-been-an-inspiration-359897.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/after_a_magical_2018_deepika_rings_in_her_33rd_birthday__fans_are_going_all_out_to_wish_her_1546679389_800x420.png"}