{"text": "Fans Sing ‘Desi Girl’ For Priyanka Chopra Outside Jonas Brothers' Concert, Shout ‘I Love You’\nFans Sing ‘Desi Girl’ For Priyanka Chopra Outside Jonas Brothers' Concert, Shout ‘I Love You’\nWhen Priyanka Chopra had danced to Desi Girl, she hadn’t even made her Hollywood debut. Who would have imagined that one day, the diva will make waves in the West, marry American singer Nick Jonas and her fans abroad will be singing this song for her!! That’s exactly what happened at the Jonas Brothers concert venue in Atlanta.\nYouTube\nIn one of the videos that is now going viral on social media, fans can be heard singing Desi Girl for her outside the concert venue. “Priyanka, I love you! My desi girl!,” hooted one of them before singing the Desi Girl song.\nPriyanka was greeting a little girl when this happened. She waved in the direction before moving to the vehicle that was waiting for her. Isn’t she a diva?\nPriyanka Chopra seemingly had a blast at the concert. In one of the other videos, she can be seen doing the Galla Goodiyaan hook step on Jonas Brothers’ new song Sucker. What’s more? She even taught her sister in laws Sophie Turner and Danielle Jonas this step. Take a look!\nDon't Miss 159 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nAnd while we can't get enough of her, PC can’t get enough of her husband Nick Jonas.\nPriyanka, Sophie and Danielle have appeared in the video of Jonas Brothers’ first comeback single Sucker. If you haven’t watched it already, here it is below.", "title": "Fans Sing ‘Desi Girl’ For Priyanka Chopra Outside Jonas Brothers' Concert, Shout ‘I Love You’", "date_publish": "09/04/2019, 11:23:25", "description": "When Priyanka Chopra had danced to desi Girl, she hadn’t even made her Hollywood debut. Who would have imagined that one day, the diva will make waves in the west, marry American singer Nick Jonas and her fans abroad will be singing this song for her? That’s exactly what happened at the Jonas Brothers concert venue in Atlanta.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/fans-sing-desi-girl-for-priyanka-chopra-outside-jonas-brothers-concert-shout-i-love-you-365093.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/fans_sing_desi_girl_for_priyanka_chopra_outside_jonas_brothers_concert_shout_i_love_you_1554789323_800x420.png"}