{"text": "Farah Khan Takes A Stand On Allegations Against Her Brother, Says It's Heartbreaking\nFarah Khan Takes A Stand On Allegations Against Her Brother, Says It's Heartbreaking\nBollywood filmmaker Sajid Khan has been embroiled in the most shocking controversy. The director who was all set to present his upcoming film Housefull 4 has been slapped with some horrific charges.\nTwitter\nSajid has been accused of sexual harassment by not one but three women including a journalist. Actress Saloni Chopra too penned down her incident in her blog, while another actress Rachel White revealed that she was called inside her bedroom to strip.\nInstagram\nAmidst severe allegations against him and Nana Patekar, Akshay Kumar took to Twitter to announce that he won't shoot till legally this is not sorted.\nDon't Miss 193 SHARES 862 SHARES 346 SHARES\nMeanwhile, Sajid Khan himself took down from the direction of Housefull 4 till the time the truth doesn't come out.\nAnd now his sister, famous director and choreographer Farah Khan has also tweeted. Absolutely appalled at the allegations, she wrote,\nThis is a heartbreaking time for my family.We have to work through some very difficult issues. If my brother has behaved in this manner he has a lot to atone for.I don’t in any way endorse this behavior and Stand in solidarity with any woman who has been hurt. — Farah Khan (@TheFarahKhan) October 12, 2018\nThis is definitely a difficult time for the family but we hope justice is served.", "title": "Farah Khan Takes A Stand On Allegations Against Her Brother, Says It's Heartbreaking", "date_publish": "12/10/2018, 18:04:03", "description": "Absolutely appalled at the allegations, she wrote, \"This is heartbreaking time for my family.\" Farah Khan Takes A Stern Stance On Alleged Sexual Charges On Her Brother, Says It's heartbreaking. Bollywood filmmaker Sajid Khan has been embroiled in the most shocking controversy. The director who was all set to present his upcoming film Housefull 4 has been slapped with some horrific charges.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/farah-khan-takes-a-stand-on-allegations-against-her-brother-says-it-s-heartbreaking-354678.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/farah_1539346517_800x420.jpg"}