{"text": "From burning of paddy straws to bursting of firecrackers, everyone is blaming something or the other for the decline in Air Quality Index in the capital. But this is not the first year that Delhites woke up to severe air pollution that aggravated breathing issues for many. The living conditions in the capital of the nation are highly dangerous at the moment.\nAlso Read: Twinkle Khanna Takes A Dig At Building Of Tall Statues & Ignoring Air Quality Index In Her Blog\nAnd just like everyone else, Priyanka Chopra and Farhan Akhtar are also breathing in Delhi’s toxic air as they are both shooting for their upcoming film titled The Sky Is Pink in Delhi.\nAs Delhi continues to grapple with rising air pollution, Farhan and Priyanka are also struggling with it just like the others. Sharing a behind-the-scenes picture from the sets, Farhan Akhtar showed how they are both coping up with the polluted air by wearing masks.\n“Masking our emotions in the Delhi air. @priyankachopra your pose is just #bts #prescenereading #theskyispink,” he wrote in the caption.\nDirected by Shonali Bose, the film also stars 'Dangal' star Zaira Wasim. The movie is based on the life of Aisha Chaudhary, who became a motivational speaker after being diagnosed with an immune deficiency order at the age of 13. It is produced by Siddharth Roy Kapur under his home banner named Roy Kapur Films.\nDon't Miss 7.9 K SHARES 161 SHARES 769 SHARES 182 SHARES\nWith inputs from ANI", "title": "Farhan Akhtar, Priyanka Chopra Battle Delhi’s Polluted Air While Shooting For ‘The Sky Is Pink’", "date_publish": "12/11/2018, 16:53:00", "description": "And just like everyone else, Priyanka Chopra and Farhan Akhtar are also breathing in Delhi’s toxic air as they are both shooting for their upcoming film titled The Sky Is Pink in Delhi. Sharing a behind-the-scene picture from the sets, Farhan Akhtar showed how they are both coping up with the polluted air by wearing masks.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/farhan-akhtar-priyanka-chopra-battle-delhi-s-polluted-air-while-shooting-for-the-sky-is-pink-356513.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/farhan__pc_struggle_to_cope_with_delhis_polluted_air_while_shooting_for_the_sky_is_pink_1542019871_800x420.png"}