{"text": "Farhan Akhtar Insists That Men Need To Change Their Mentality For Women To Feel Safe & We Agree\nFarhan Akhtar Insists That Men Need To Change Their Mentality For Women To Feel Safe & We Agree\nIt’s also a man’s issue, Farhan Akhtar had once said about gender equality and rightly so. The actor has never minced his words when it comes to social issues. He often shares his opinions on social media.\nActor-filmmaker Farhan Akhtar on Sunday -- the International Day for the Elimination of Violence Against Women -- launched a short film She, which takes a look at the various forms of violence perpetrated against women. He says a safer environment for women will be possible when men change their mentality and behaviour. Farhan's MARD (Men Against Rape and Discrimination), filmmaker Feroz Abbas Khan and Population Foundation of India (PFI) jointly released the three-minute short She online.\nBCCL\n\"For women to feel safe in our society, it is important that men change their mentality and behaviour. This short film 'She' gives the other perspective - of how ignorant men are about this violence. It is imperative that men understand the humiliation that women go through. Only then will they truly make an effort to change,\" Farhan said in a statement.\nKhan, the film's creative lead, added: \"Men feel entitled to perpetuate violence against women. They feel it is their right. Director Ranjeeta Kaur exposes that entitlement in 'She'.\"\nDon't Miss 264 SHARES 193 SHARES 182 SHARES 805 SHARES\nPFI Executive Director Poonam Muttreja said: \"Though more women are now finding the courage to speak out and report abuse, a large part of society still normalises such crimes, until it reaches the point of really heinous forms of violence. Men need to recognise that the everyday forms of violence and violation faced by women are no less harmful.\"\nWith inputs from IANS", "title": "Farhan Akhtar Insists That Men Need To Change Their Mentality For Women To Feel Safe & We Agree", "date_publish": "25/11/2018, 18:33:43", "description": "Actor-filmmaker Farhan Akhtar on Sunday -- the International Day for the Elimination of Violence Against Women -- launched a short film \"She\", which takes a look at the various forms of violence perpetrated against women. He says a safer environment for women will be possible when men change their mentality and behaviour.", "authors": [], "url": "https://www.indiatimes.com/entertainment/farhan-akhtar-insists-that-men-need-to-change-their-mentality-for-women-to-feel-safe-we-agree-357360.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/farhan_akhtar_1543147110_800x420.jpg"}