{"text": "Farhan-Shibani Spend The First Sunday Of 2019 Together, Rahman's Birthday And More From Ent\nFarhan-Shibani Spend The First Sunday Of 2019 Together, Rahman's Birthday And More From Ent\nThe bond that began with Rockstar moved to Highway and not many know that there is an interesting story behind him being roped in for the Alia Bhatt starrer. Recently, one biography on AR Rahman was written by the author Krishna Trilok and the book was released.\nFarhan Akhtar and Shibani Dandekar are reportedly dating and even when their pictures have captions like \"Look Who I Bumped Into\" and \"Best Friends\", everyone knows what they have been trying to conceal.\nDon't Miss 10.9 K SHARES\nThe petitioner has requested the court to issue directions to the Centre, Google, Youtube and Central Board of Film Certification (CBFC) to take steps to stop the exhibition, display of trailer of 'The Accidental Prime Minister'.\nApart from Kapil, other comedians who are back for the second season include Kiku Sharda, Chandan Prabhakar, Sumona Chakravarti, and Rochelle Rao. Two new faces on the second season are Krushna Abhishek and Bharti Singh.\n\"Before working on 'Gully Boy', I did some ads with Alia and they were really fun. She has lovely energy about her. But when I worked with her on 'Gully Boy', I realized what a powerhouse of a talent she is.\" Ranveer is supremely fond of Alia Bhatt as he calls her \"immensely talented, expressive, full of emotion, very intelligent\" and that her emotional quotient is \"very high.\"", "title": "Farhan-Shibani Spend The First Sunday Of 2019 Together, Rahman's Birthday And More From Ent", "date_publish": "06/01/2019, 17:16:17", "description": "The bond that began with Rockstar moved to Highway and not many know that there is an interesting story behind him being roped in for the Alia Bhatt starrer. Recently, one biography on AR Rahman was written by the author Krishna Trilok and the book was released.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/farhan-shibani-spend-the-first-sunday-of-2019-together-rahman-s-birthday-and-more-from-ent-359948.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/top_news_india_1546775289_800x420.jpg"}