{"text": "1. Farhan Akhtar, Priyanka Chopra Battle Delhi’s Polluted Air While Shooting For ‘The Sky Is Pink’\n“Masking our emotions in the Delhi air. @priyankachopra your pose is just #bts #prescenereading #theskyispink,” he wrote in the caption.\nHe called Breaking Bad as \"the greatest professional period of my life\" and said he would love to come back.\n3. After The Tanushree Fiasco, Rakhi Sawant Challenges A CWE Wrestler To Bout, Gets Knocked Out\nThe internet caught hold of a clip from the wrestling event which is now going viral for reasons we all know. In the clip, Rakhi Sawant is seen being escorted out of the ring by female police officer and some helpers.\n4. Ranveer Singh & Deepika Padukone’s Wedding Preparations Have Begun At Lake Como & Everyone Looks Excited\nDon't Miss 7.9 K SHARES 161 SHARES 769 SHARES 182 SHARES\nIt’s going to be the wedding of the year! Ranveer Singh and Deepika Padukone, the much in love couple of the B-Town, is all set to tie the knot in Italy on Nov 14-15. It’s going to be a private ceremony of course but details about what’s happening have already started to emerge.\n5. Katrina Kaif & Varun Dhawan Bring The House Down With Their Humour & Wit On Koffee With Karan!\nDid you know Varun Dhawan and Arjun Kapoor started ‘I hate Katrina Club’ because of Salman Khan?", "title": "Farhan Akhtar & Priyanka Chopra Battle Delhi's Polluted Air, Bryan Cranston To Star In Breaking Bad & More From Ent", "date_publish": "12/11/2018, 18:01:39", "description": "From Farhan Akhtar and Priyanka Chopra trying to cope up with Delhi’s polluted air while shooting for The Sky Is Pink to Bryan Cranston AKA Walter White confirming his presence in Breaking Bad movie, here is all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/farhan-akhtar-priyanka-chopra-battle-delhi-s-polluted-air-bryan-cranston-to-star-in-breaking-bad-more-from-ent-356525.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/farhanpc_battle_polluted_air_bryan_cranston_to_star_in_breaking_bad_film__more_from_ent_1542025039_800x420.png"}