{"text": "Farhan Akhtar & Shibani Dandekar’s Pics Will Give You All The Inspiration You Need To Plan A Summer Vacay ASAP!\nFarhan Akhtar & Shibani Dandekar’s Pics Will Give You All The Inspiration You Need To Plan A Summer Vacay ASAP!\nIt has just been a week into April and the summer heat is already burning us up. Indian summers are getting worse with every passing year. So, what do you do when you just can’t take the summer heat? Head for a mini-vacation, maybe!\nTwitter\nThese pictures of Farhan Akhtar and Shibani Dandekar, the new most-talked-about couple in town, is making us want to plan a vacation ASAP.\nTwitter\nBut remember, beaches are not everyone’s cup of tea especially in summers. Lying in the sand, swimming in the surf and lot and lots of ice cream – sounds like a good place, no? But, you can head to the hills too.\nAlso Read: Taking At Least 3 Vacations A Year Is An Important Key To Living A Longer And Healthier Life\nTwitter\nFarhan Akhtar and Shibani Dandekar are seemingly having a ball in Mexico!\nAlso Read: 7 Instagram Travellers Tell Us About Unexplored Vacation Spots In India & No, Kasol Is Not One Of Them\nTwitter\nIf you are also planning to head for a mini-vacation in India, here are the places that are best to visit during April – Dalhousie, Dharamshala, Manali, Khajjiar, Mussoorie, Kasauli, Gangtok, Pachmarhi, Lonavala, Cherrapunji, Coorg, Ooty, Andaman Islands, Masinagudi, Auli, Kodaikanal and Kalimpong.\nTime to call your friends and plan a vacation?\nAlso Read: 11 Beautiful Photos From South India That Will Make You Want To Take A Vacation Right Away", "title": "Farhan Akhtar & Shibani Dandekar’s Pics Will Give You All The Inspiration You Need To Plan A Summer Vacay ASAP!", "date_publish": "08/04/2019, 13:42:53", "description": "It has just been a week into April and already the summer heat already sizzling. Indian summers are getting hotter every passing year. So, what do you do when you just can’t take the summer heat? Head to a mini-vacation maybe? These pictures from Farhan Akhtar and Shibani Dandekar, the new most-talked about couple in town, is making us plan a vacation soon. But remember, beaches in summers are", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/farhan-akhtar-shibani-dandekar-s-pics-will-give-you-all-the-inspiration-you-need-to-plan-a-summer-vacay-asap-365059.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/farhan_akhtar_and_shibani_dandekars_pics_will_make_you_want_to_plan_a_vacation_soon_1554709615_800x420.png"}