{"text": "The #MeToo movement brought forth a lot of names of sexual predators from Bollywood. One of them was Sajid Khan. Not one but several women opened up about sexual misconduct by him.\nActor Farhan Akhtar says he feels a sense of guilt for not being aware of the indecent behaviour of his cousin Sajid Khan, who has been accused of sexual harassment by several women. Sajid was accused of sexual harassment by two women -- actor Saloni Chopra and a journalist, following which he stepped down as the director of Housefull 4. When the allegations had surfaced, Farhan, who has been a vocal supporter of #MeToo movement, was one of the first celebrities to react and had termed them as \"shocking.\"\n\"Everytime something like this has happened in the public domain, I've been very vocal with my opinion. When it came to someone within my family, I felt silence on that front would be very, very hypocritical,\" Farhan said.\n\"So pretty much on the first day when three women came out and spoke, I felt it was important for me to speak out. Sajid, being my brother, I need to now work with him, try to figure out how he can see this thing through and how it is that he can make the women who have been affected by his actions, somehow feel better,\" he added.\nTOI\nDon't Miss 193 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"To start with apologising is a big step. To say 'I am sorry about what I did' is a big step, it can make a person feel a lot better,\" he added.\nFarhan said when he first heard about the accusations against his cousin, he had conflicted emotions.\n\"It was surprise, disappointment and strangely, because when it's a member of your family, you also feel a certain level of guilt. It's happened to all of us in the past when we hear something like this and say 'but how come someone so close to him didn't know.'\n\"The truth is I didn't. If I did know I would've spoken about it way before the story broke. There was this certain guilt about that, how could this be going on and I had no idea. So there were conflicted emotions,\" he said.\nFarhan feels he wishes he had known about Sajid's behaviour and said three women spoke to him privately, accusing the filmmaker of the same.\n\"There were two-three women who got in touch with me privately to say 'listen you should know whatever is being said is true and he has behaved in a similar way with us as well.' These are the people I've known for 12, 15, 20 years and meet them very often but nobody ever mentioned this to me. I asked them why didn't you ever tell me?\nTiwtter\n\"I have been doing something with MARD for the last five years, I wouldn't have been on his side if you had brought it to my attention but somehow they weren't comfortable to speak about it,\" he said.\nBut the actor says it is ultimately a woman's decision when she wants to come out and tell her story and she should be given that environment and space.\n\"If someone has behaved badly with a woman and she hasn't spoken about it for ten, 20 or 30 years, it's her prerogative when she wants to speak. Even if someone tells me privately, like these three women, I cannot take their names. Can I go to the public with that? I can't because she will be answerable then for the rest of her life and may be she first want to be. It's a woman's agency,\" he added.\nAlso present at the panel discussion were politician Milind Deora and comedian Cyrus Broacha.\nWith inputs from PTI", "title": "Farhan Akhtar Feels Guilty For Not Knowing Sajid Khan's Deeds Before #MeToo Details Came Out", "date_publish": "26/11/2018, 14:13:33", "description": "Actor Farhan Akhtar says he feels a sense of guilt for not being aware of the indecent behaviour of his cousin Sajid Khan, who has been accused of sexual harassment by several women. Sajid was accused of sexual harassment by two women -- actor Saloni Chopra and a journalist, following which he stepped down as the director of \"Housefull 4\".", "authors": [], "url": "https://www.indiatimes.com/entertainment/farhan-akhtar-feels-guilty-for-not-knowing-sajid-khan-s-deeds-before-metoo-details-came-out-357396.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/on_metoo_allegations_against_cousin_sajid_khan_farhan_akhtar_feels_guilty_for_not_knowing_about_it_1543225466_800x420.jpg"}