{"text": "Last night's episode is being called as one of the best episodes of Koffee With Karan season 6 so far. Saif Ali Khan and his daughter (with Amrita Aroa) Sara Ali Khan, graced the couch quite royally on Karan Johar’s chat show.\nSara Ali Khan will soon make her debut on the with Sushant Singh starrer Kedarnath and Ranveer Singh starrer Simmba. But before that, she made her debut on Koffee With Karan and we’re sure that by showcasing her intelligent and grounded vibe, she made more fans than ever.\nhotstar\nSaif Ali Khan and Sara Ali Khan bared their heart out on their “quintessential modern beautiful family”, as Karan said on the show.\nFrom revealing about the friendly relationship she shares with her “father’s wife” Kareena Kapoor to talking about the bond she shares with her mother and father, despite their separation, Sara Ali Khan made quite some revelations on the show.\n#1 She revealed that she shares more of a friendly bond with Kareena and that she would sort of have a nervous breakdown if she called Kareena “Choti Maa”.\nTwitter\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\n“My father also never said that this is your second mother… I think Kareena would have a nervous breakdown if I was to call her 'choti maa'”\n#2 She shined with her savage sense of humour as she poked fun at her parent's divorce.\n“I already said Happy Independence Day”, she said revealing the first episode of the show was recorded on Aug 16, 2004, one day after Amrita Singh “threw” Saif “out of the house”.\n#3 Sara is happy that their parents are now happy!\nTwitter\n“I feel that it's very important to respect what other people want. I see my father today and I see my mother today and they are both much happier than I think they would have been together. And therefore everybody around them is happier. And I think what I have now is two very comfortable homes as oppose to one very uncomfortable home. I really think that I win.”\n#4 She remembers how her mother Amrita Arora dressed her up for father Saif’s wedding with Kareena.\nScreengrab\n“My mom dressed me for my father’s wedding. A lot of people would be of the opinion that Kareena was being weird or mom was being weird. It was very comfortable. Everyone was so mature. It was not a big deal.”\n#5 Saif revealed he wrote a note to Amrita Singh before getting married to Kareena.\n“When I was getting married to Kareena, for some reason, I wrote a note to Amrita saying this is a new chapter starting. I wrote we had a history and something on the lines of good wishes for both of us. I sent it to Kareena to take a look. I sent it across. Sara called me and said, ‘I was coming anyway but now, I am coming with a happy heart.’ I think that story sums up the attitude of everyone involved.”\n#6 Saif made things awkward for Sara as he revealed how he checks out Kareena in her gym look.\nDoes he check her out before she goes out? “Of course, coming and going,” he said.\n#7 Saif also revealed paps get Rs 1500 bucks for one photo of Taimur Ali Khan.\n#8 “Got cash, take her”, Saif cracked this joke quite a lot of times on the show.\n#9 Sara insisted that her love life shall not be like her parents.\n“You can’t control people. Hopefully she’ll have the values that we have, and find her own way,” Saif said, to which Sara interrupted, “Not all the values that all of you have had… I think my father and mother were quite wild. I think I’m less wild than them… I think my mother has done some wild stuff.”\nSara Ali Khan and Saif Ali Khan share quite a unique yet happy relationship, don’t you think?", "title": "Father-Daughter Duo Saif & Sara Ali Khan Discuss Their Modern Family Over Steaming Cups Of 'Koffee'", "date_publish": "19/11/2018, 12:51:18", "description": "Saif Ali Khan and Sara Ali Khan bared their heart out on the “quintessential modern beautiful family”, as Karan said on the show. From revealing about the friendly relationship she shares with her “father’s wife” Kareena Kapoor to talking about the bond she shares with her mother and father, despite their separation, Sara Ali Khan made quite some revelations on the show.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/father-daughter-duo-saif-sara-ali-khan-discuss-their-modern-family-over-steaming-cups-of-koffee-356934.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/karan_johar_poses_with_saif_ali_khan_and_sara_ali_khan_on_koffee_with_karan_1542610881_800x420.jpg"}