{"text": "For Kareena Kapoor Khan, reinvention -both in her personal and professional life -is what has driven her survival as a star in showbiz. For her, it's her self-confidence that makes even her everyday fashion look like couture.\nBut for her, it's her sister Karisma who is \"more of a fashion icon\" between the two, without a second thought. Talking to a news agency, she said,\n\"Most of the time you will see me in a jeans and a T-shirt. It's besides the point that I can make jeans and a T-shirt also look like couture. I know I have that... I can... It's just that I don't like dressing up.\"\nTaking us back to the beginning point of her film journey, from Refugee, where we saw her in bare minimum make-up, to Karan Johar's Kabhi Khushi Kabhie Gham -- in which he presented her as the uber stylish Pooja aka Poo -- Kareena has been fearless about trying different looks. She adds,\n\"It's (the fearlessness is) a part of being successful... Actually I was trying to do different kind of stuff at a very early stage. In fact, I'd say I was very experimental when I was 19. Refugee was a very experimental launch. It was not the typical glamorous girl. But again, I think there would have been no fun if there was no fear or excitement. It is good to be a fearless actor, but it is good to have a little bit fear so that your performance level is always high.\"\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nReinvention is something she takes seriously.\nPinterest\n\"If I can't reinvent as a person, I cannot be a better actor. The reason I feel that I have been in this business through decades and still been here is only because of reinvention. They have made me and my thoughts so much better than what what they were, say 10 years ago. Just sometimes not doing so much work, cutting out on travelling, taking a break and not really being a part of the Bollywood herd... A lot of things in my life that I have chosen to do are a part of me reinventing,\" she said.\nKareena opened up about her last successful film Veere Di Wedding, a coming-of-age story on female bonding last year. She expressed that she is extremely glad that subjects and scripts are being reinvented.\nTwitter\n\"Veere... was a revelation. We have always spoken about male friendships, but we had never seen what female bonding is like. So I think in a way it took it forward in terms of content,\" Kareena said.\nAnd now, her upcoming Dharma project too has managed to stir a positive conversation. Talking about the project that will revolve around surrogacy, \"It's a topic which not many people will touch upon, but of course it's in a commercial space. It's a lot more funny. But we have to keep those dynamics in mind. The idea is to keep entertaining your audience, but with more content-based films.\"\nShe will also be a part of Karan Johar's period drama, Takht. \"The entire ambience and setting will be so different. Besides that, I haven't worked with Karan in many years... He has grown as a director from strength to strength and I am a very different actor today. So it will be very interesting.\"\n(With IANS inputs) | Pictures: Viral Bhayani and Instagram", "title": "Fearlessness Is A Part Of Being Successful, Says Kareena Kapoor Khan On Her Upcoming Films", "date_publish": "05/02/2019, 11:25:42", "description": "For Kareena Kapoor Khan, reinvention -both in her personal and professional life -is what has driven her survival as a star in showbiz. For her, it's her self-confidence that makes even her everyday fashion look like couture.But for her, it's her sister Karisma who is \"more of a fashion icon\" between the two, without a second thought.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/fearlessness-is-a-part-of-being-successful-says-kareena-kapoor-khan-on-her-upcoming-films-361593.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kareena_1549348818_800x420.jpg"}