{"text": "The bold and the beautiful, Kangana Ranaut’s journey in Bollywood hasn’t been easy but with every film she is proving that a film doesn’t necessarily need a male lead. She has shattered several stereotypes with her brutally honest opinions and decisions. No matter how many criticisms and failures come her way, Kangana Ranaut remains unfazed.\nOne of her most loved films was Queen. In the movie, she played the lovable character of Rani who goes on her honeymoon alone after her fiancé calls off their wedding. But did you know that Kangana Ranaut started to feel underutilised as an actress after she did this movie?\nIn an interview to Bombay Times, she said, “After Queen (2014), I started to feel absolutely underutilised, and I had already decided that I wanted to direct.”\nFor the uninitiated, Kangana Ranaut directed a short film titled The Touch in 2012. It has been reported that the shooting of Manikarnika: The Queen of Jhansi started with Krish Jagarlamudi as the director. But he left midway due to creative differences reportedly, and then Kangana Ranaut took over.\nStarring Kangana as Rani Laxmi Bai, Manikarnika: Queen Of Jhansi has been released today, on Jan 25.\nAlso Read: 9 Epic Dialogues From Kangana Ranaut’s 'Queen' That Can Make You Laugh Any Time You Watch It\nDon't Miss 126 SHARES 1 K SHARES 336 SHARES 3.1 K SHARES", "title": "Feeling ‘Underutilised’ After Queen, Kangana Ranaut Decided To Don The Director's Hat For Manikarnika", "date_publish": "25/01/2019, 11:41:29", "description": "One of her most loved films was Queen. In the movie, she played the lovable character of Rani who goes on her honeymoon alone after her fiancé calls off their wedding. But did you know that Kangana Ranaut started to feel underutilised as an actress after she did this movie?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/feeling-underutilised-after-queen-kangana-ranaut-decided-to-don-the-director-s-hat-for-manikarnika-361005.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/feeling_underutilised_after_queen_kangana_ranaut_decided_to_direct__act_in_manikarnika_1548395569_800x420.png"}