{"text": "Film Producer Sanjay Raut Calls Balasaheb's Life An Open Book, Says No One Can Ban 'Thackeray'\nFilm Producer Sanjay Raut Calls Balasaheb's Life An Open Book, Says No One Can Ban 'Thackeray'\nBollywood actor Nawazuddin Siddiqui finally came out with the much awaited trailer Thackeray. The short clip shows an insight into Balasaheb's life and people can't wait to see the film and his life.\nHowever, there are reports that CBFC has objected certain scenes in the biopic of Shiv Sena's late leader Shiv Thackeray. It has left the cast and the film producer infuriated.\nScreengrab\nSanjay Raut, senior party leader and film producer said, \"What is right and what is not right, who will decide? This is a biopic, it is a true story. Balasaheb's life was an open book. The censor board will understand. Some things take time to be understood.\"\n\"Fifty years ago, Balasaheb had spoken about Bhoomiputras (sons of the soil) and now the people who opposed it want Bhoomiputra policy in Madhya Pradesh,\" added Raut in an apparent reference to the Congress government encouraging recruitment of local people in Madhya Pradesh.\nThe Sena's Rajya Sabha member further said, \"There is no question of ban, this is Thackeray. Nobody can ban Thackeray.\"\nScreengrab\nDon't Miss 106 SHARES 282 SHARES 862 SHARES\nNawazuddin said he was grateful to the film's makers for casting him.\n\"This was the most challenging role for me. I did get nervous thinking whether I will be able to do this role or not but the director gave me lot of confidence and put me at ease,\" the actor said.\nDirected by Abhijit Panse, the film will release on January 23, Thackeray's birth anniversary.\nInputs from PTI", "title": "Film Producer Sanjay Raut Calls Balasaheb's Life An Open Book, Says No One Can Ban 'Thackeray'", "date_publish": "27/12/2018, 12:36:31", "description": "thackeray, sanjay raut, bollywood, movies, cinema, shocking, open book, nawazuddin siddiquithackeray, sanjay raut, bollywood, movies, cinema, shocking, open book, nawazuddin siddiquithackeray, sanjay raut, bollywood, movies, cinema, shocking, open book, nawazuddin siddiquithackeray, sanjay raut, bollywood, movies, cinema, shocking, open book, nawazuddin siddiquithackeray, sanjay raut, bollywood, m", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/film-producer-sanjay-raut-calls-balasaheb-s-life-an-open-book-says-no-one-can-ban-thackeray-359343.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/thackeray_1545892671_800x420.jpeg"}