{"text": "Over 61 killed and 70 injured after a speeding train ran over people who were gathered to watch the burning of Ravana effigy on the occasion of Hindu festival Dussehra. The tragic incident took place in Joda Fatak area where over 700 people were gathered to be a part of the Dussehra celebrations.\nAgencies\nAll the 70-odd people injured in the train accident are in critical conditions, officials said on Saturday. This tragic incident has again put a very big question mark on the level of security at public places.\nQuestioning the same, several Bollywood celebrities have reacted to this mishap and mourned the lives that were lost in this tragic incident.\nAgencies\nPointing out at the lack of concrete security and safety measures, Farhan Akhtar took to Twitter to raise a valid point. He wrote,\nAgencies\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\n\"Saddened to hear about the loss of life in #Amritsar. Safety in public spaces HAS TO be taken a lot more seriously. Deepest condolences to all families affected by this tragedy.\"\nHere is how the film fraternity reacted to the unfortunate series of events that happened since last evening.\nPained to hear about the Amritsar train tragedy. Deepest condolences to the bereaved families. — Ajay Devgn (@ajaydevgn) October 19, 2018\nShocked & saddened to hear about the Amritsar train tragedy. It seems so unfair for a horrific accident of this magnitude amidst celebrations of Dussehra. Providence has strange ways of throwing challenges at the humankind. — Shatrughan Sinha (@ShatruganSinha) October 19, 2018\nHope wish & pray, God gives enough strength to the bereaved family. My humble request to State & Central Govt to provide immediate assistance. — Shatrughan Sinha (@ShatruganSinha) October 19, 2018\nSo disturbed to see the visuals of #AmritsarTrainincident 😭 have no words to express how sad is the whole incident. Mere negligence could cost so many lives. Wish it was not true. May God give strength to the families who lost their loved ones. Wish this was not true 😭 — sonu sood (@SonuSood) October 19, 2018\nSaddened to hear about the loss of life in #Amritsar. Safety in public spaces HAS TO be taken a lot more seriously. Deepest condolences to all families affected by this tragedy. — Farhan Akhtar (@FarOutAkhtar) October 19, 2018\nAbsolutely shocked at hearing the news of the #trainaccident in #Amritsar. I just cannot fathom how something like this could have happened. My deepest condolences to all the families that have lost their loved ones. Love and prayers 🙏🏼 — Diana Penty (@DianaPenty) October 19, 2018\nTerrible twist of fate. My heart and prayers go out to the victims and families of the #AmritsarTrainAccident . — Ronit Bose Roy (@RonitBoseRoy) October 19, 2018\nAmritsar train accident is so tragic and heartbreaking!!!heart goes out to the ones who lost their near and dear ones!so many lives are lost due to sheer negligence!!!prayers for all the deceased!!!not a good morning to wake up to such devastating news!! #AmritasarTrainTragedy — manoj bajpayee (@BajpayeeManoj) October 20, 2018\nMy heart goes out to all the people of Amritsar..It's disheartening.\nWhen your family goes for a festival and you never get to see them again... The thought also scares me... Hope Waheguru gives all of you the strength to overcome your loss...#Amritsar #trainaccident pic.twitter.com/AlPSeFP1cP — Bharti singh (@bharti_lalli) October 19, 2018\nHorrified and deeply saddened by the tragic train accident in #Amritsar. My heart goes out to the people who lost their friends and family members. May God give them the strength and courage to deal with this horrific tragedy. Sympathies and prayers.🙏 — Anupam Kher (@AnupamPKher) October 19, 2018\nThoughts and prayers for the victims of the tragedy in #Amritsar and for their families.. this is SO tragic!!!! Devastating news on a festive day. 😔😔🙏🏿🙏🏿🙏🏿 #AmritsarTrainAccident Strength to and prayers for all the affected! — Swara Bhasker (@ReallySwara) October 19, 2018", "title": "Film Fraternity Reacts To Tragic Amritsar Train Accident, Demands Better Safety Measures At Public Places!", "date_publish": "20/10/2018, 11:47:57", "description": "All the 70-odd people injured in the train accident are in critical conditions, officials said on Saturday. This tragic incident has again put a very big question mark on the level of security at public places. Questioning the same, several Bollywood celebrities have reacted to this mishap and mourned the lives that were lost in this tragic incident.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/film-fraternity-reacts-to-tragic-amritsar-train-accident-demands-better-safety-measures-at-public-places-355116.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/amritsar_train_accident_1540016519_800x420.jpg"}