{"text": "Filmmaker Onir’s statement might start a new debate in Bollywood where topic will be on gay and LGBT community. The director in his recent interaction with PTI declared that the industry is full of double standards when it comes to showing support for the Gay and LGBT community.\nOnir, who has spearheaded movies with LGBTQ+ narratives, says the industry is full of homophobes.\nTwitter\n\"Industry is full of double standards. A lot of people of influence belong to the community but you don't find that forthright support come in. There are a lot of people who are also homophobic. Politically everyone will say the right things but in action that's missing,\" Onir told PTI.\nThe filmmaker was speaking on the sidelines of the 20th edition of JIO MAMI Mumbai Film Festival with Star, Monday. He was part of a panel discussion 'Pushing the envelope on LGTBQ cinema in India'. The \"My Brother... Nikhil\" director says the reason big stars have shied away from featuring in a film with LGTBQ narrative as a lot of them are \"not comfortable with that idea\".\nTwitter\n\"Today, how many people actually supported the SC verdict? You don't have to be gay to support it. That shows there's a bit of discomfort, fear of being perceived in a certain way and losing out on an audience, which doesn't happen. There's this insecurity in a lot of people. They don't see these films as something that can churn money,\" he says.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nOnir laments that the percentage of such films being made in India is abysmal. \"At the end of the day, it took Fawad Khan to come from Pakistan and do a film here. And it is wonderful but India is the largest film producing country in the world but the percentage of such films is minuscule.\"\nTwitter\nAnother problem, according to the filmmaker, is the lack of acknowledgment for actors who take up parts of homosexual characters.\n\"None of the mainstream festivals acknowledged my films or the actors playing these roles. When an actor is taking such roles and still not getting recognised because he or she is not a big enough star, it discourages risk taking as the industry doesn't celebrate it and more often ignores it,\" he adds.\nTwitter\nOnir says though the Supreme Court has decriminalised Section 377 of the Indian Penal Code that criminalises consensual gay sex, things would not change overnight. \"There's a long way to go. It's not that after 377, everything will become easy. What has happened now is that it has empowered a lot of us and we wish to see things change. It'll take time, but it'll happen,\" he added.\n(With Inputs PTI)", "title": "Filmmaker Onir Calls Out Bollywood For 'Double Standards', Feels It's Full Of Homophobes", "date_publish": "31/10/2018, 15:31:11", "description": "Filmmaker Onir’s statement might start a new date in Bollywood and topic is on Gay and LGBT community. The director in his recent interaction with PTI declared industry is full of double standards when it comes to showing support for the Gay and LGBT community. Onir, who has spearheaded movies with LGBTQ+ narratives, says the industry is full of homophobes.", "authors": [], "url": "https://www.indiatimes.com/entertainment/filmmaker-onir-calls-out-bollywood-for-double-standards-feels-it-s-full-of-homophobes-355802.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/onir_1540980843_800x420.jpg"}