{"text": "Film Fraternity Pours In Wishes For Ranveer-Deepika, Congratulates Them For New Beginnings!\nFilm Fraternity Pours In Wishes For Ranveer-Deepika, Congratulates Them For New Beginnings!\nIt was a wedding that will be remembered for years to come. Not because they are two of the most popular Bollywood stars, but because it will remind us of the fact that love triumphs all.\nAfter a rock steady relationship of six years, Ranveer Singh and Deepika Padukone solemnized their relationship by marrying in Italy's Lake Como.\nWhile the celebrations were spread over three-four days with close family and friends making a cut into the guest list, 14th-15th were the days when the couple started their official journey together by following both Sindhi and Konkani rituals.\nThe entire country was waiting with baited breaths to catch a glimpse of the newlyweds and after grainy back shots, Ranveer-Deepika obliged us by giving us an opportunity to be a part of their celebrations. While privacy remained one of the key highlights of this destination wedding, both Ranveer-Deepika decided on sharing this private moment by posting pictures on their social media.\nThe pictures were out by 8 pm on 15th and within seconds the social media platforms exploded with wishes for the couple.\nInstagram/Ranveer and Deepika\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nApart from trending on these platforms, the film fraternity joined the #DeepVeer fan-club and poured their heartiest wishes for the couple. In case you were thinking about you were the only one waiting for the snaps, you are clearly mistaken. Looks like people like KJo, Smriti Irani and Alia Bhatt were among you people too! Read on!\nLove and happiness forever.....these are such a full of pyaar wala pictures! For those of us who don’t have a life partner it’s a very “haiiiiiiiii” wala feeling! https://t.co/h1dtYel2be — Karan Johar (@karanjohar) November 15, 2018\nSmile and laugh through this union, so beautiful you both look. God bless you both. Stay blessed. Love and a big hug to you both. Congratulations. https://t.co/AjgtKOxW2F — arjun rampal (@rampalarjun) November 15, 2018\nLove a great love story ❤️ So happy to see this beautiful couple ... together forever ❤️😍Congratulations @deepikapadukone and @RanveerOfficial ❤️😘🙏🎉 https://t.co/78G37Xh8gq — Bipasha Basu (@bipsluvurself) November 15, 2018\nWishing you both a world of happiness and a beautiful journey together. May the love & respect you have in each other, grow leaps and bounds. And welcome to the club 😁💜👫@RanveerOfficial @deepikapadukone — Anushka Sharma (@AnushkaSharma) November 15, 2018", "title": "Film Fraternity Pours In Wishes For Ranveer-Deepika, Congratulates Them For New Beginnings!", "date_publish": "16/11/2018, 10:38:49", "description": "Apart from trending on these platforms, the film fraternity joined the #DeepVeer fan-club and poured their heartiest wishes for the couple. In case you were thinking about how you were the only one, you are clearly mistaken. Looks like people like KJo, Smriti Irani and Alia Bhatt were among you people too! Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/film-fraternity-pours-in-wishes-for-ranveer-deepika-congratulates-them-for-their-new-beginnings-356771.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_1542346394_800x420.jpg"}