{"text": "Even if you are not on Twitter, you would know what a motormouth Kamaal R Khan AKA KRK is in the Twittersphere. His offensive, vulgar and controversial statements directly attacking celebrities are the reason for his stardom. Yeah, that’s precisely what the self-proclaimed critic does for a living.\nTwitter\nFinding himself in the midst of a controversy yet again, this time KRK has bee booked by the police for allegedly passing vulgar remarks against LGBTQ community in a video that was uploaded on Sep 7, a day after Supreme Court passed its verdict decriminalising consensual same-sex relations, which was earlier a punishable crime under Section 377 of the Indian Penal Code (IPC).\nTwitter\nIn a video that has been viewed over 2.83 lakh times, KRK has used offensive language against transgenders as well as men and women who identify themselves as homosexuals.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n19-year-old Ujjawal Krishnam, who is a student from Vadodara had reportedly written to the local police requesting them to take a criminal action against KRK on Oct 2.\n“Kamaal Rashid Khan, a self-proclaimed Bollywood critic, in a recent video, can be seen delivering a hate speech against a specific community. Despite this (SC’s) remarkable judgment, this fellow didn’t stop to deliver a speech which can’t be called less than obscene, vulgar, derogatory and offensive,” he wrote in his complaint, according to Indian Express.\nHe was thereafter advised to file a complaint in Mumbai. Following which, an FIR against KRK was filed at Bandra police station on Friday.", "title": "FIR Filed Against Kamaal R Khan For Allegedly Making ‘Vulgar’ Comments Against LGBTQ Community", "date_publish": "09/12/2018, 15:06:32", "description": "Finding himself in the midst of a controversy again, this time Kamaal R Khan AKA KRK has bee booked by the police for alledly passing vulgar remarks against LGBTQ community in a video that was uploaded on Sep 7, a day after Supreme Court passed its verdict decriminalising consensual same-sex relations, which was earlier a punishable crime under Section 377 of the Indian Penal Code (IPC).", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/fir-filed-against-kamaal-r-khan-for-allegedly-making-vulgar-comments-against-lgbtq-community-358232.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/fir_filed_against_kamaal_r_khan_for_allegedly_making_vulgar_comments_against_lgbtq_community_1544347018_800x420.jpg"}