{"text": "We have seen many turbaned sikh characters in movies, but none like the ones that Diljit Dosanjh plays. Hailed as the most stylish Sardar, Diljit Dosanjh is not only an iconic star but also a social media celebrity. And who doesn’t know about his obsession over Kylie Jenner?\nBCCL\nAs Diljit Dosanjh unveiled his Madame Tussauds’ wax figure in Delhi yesterday, he became the first turbaned Sikh celebrity to get this honour. A die-hard fan of Kylie Jenner, Diljit says he wants Kylie Jenner’s statue next to his. When asked which actress’ statue he would like to have next to him, he laughed and said, “Kylie Jenner.”\nFor the uninitiated, Diljit Dosanjh is such a big fan of Kylie Jenner that he often comments on her instagram pictures. So much so, that once during a live chat video of Kim Kardarshian, her cousin, he even asked, “Kylie Kithe Aa”.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIt started with usual greetings.\nAnd then he posed the main question.\nBut Kim wasn’t replying.\nAnd when Kylie posted a picture with her boyfriend, he even wrote this.\nAnd when she announced that she was pregnant, Diljit Dosanjh was heartbroken.\nMain theek theek an.. Theek an Mai.. 🤣👍 https://t.co/VUiThcflFz — DILJIT DOSANJH (@diljitdosanjh) September 23, 2017\nKylie, just once, please respond to Diljit Paaji! PLEASE!", "title": "First Turbaned Sikh At Madame Tussauds, Diljit Dosanjh Wants Kylie Jenner’s Statue Next To His!", "date_publish": "29/03/2019, 14:15:59", "description": "As Diljit Dosanjh unveiled his Madame Tussauds’ wax figure in Delhi yesterday, he became the first turbaned Sikh celebrity to get this honour. A die-hard fan of Kylie Jenner, Diljit says he wants Kylie Jenner’s statue next to his. When asked which actress’ statue he would like to have next to him, he laughed and said, “Kylie Jenner.”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/first-turbaned-sikh-at-madame-tussauds-diljit-dosanjh-wants-kylie-jenner-s-statue-next-to-his-364542.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/first_turbaned_sikh_at_madame_tussauds_diljit_dosanjh_wants_kylie_jenners_statue_next_to_his_1553848306_800x420.png"}