{"text": "Did you know Ghajini was inspired by Christopher Nolan’s Memento?\nEarlier this year when Christopher Nolan had come to India, he said that he heard about the grand success of the Aamir Khan starrer. He told India Today he was honoured and would watch the film soon.\nAamir Khan’s Thugs of Hindostan might have miserably failed at the box office this year, but how can we forget the fact that Aamir Khan is the first member of the 100 crore club (Ghajini), 200 hundred crore film (3 Idiots) and also the 300 crore club (PK) at the domestic box office.\nAnd it all started with Ghajini.\nIt was ten years ago, on Christmas, that this masterpiece, which was a remake of 2005 Tamil psychological thriller film of the same name, had released. For the first time, Aamir Khan who is known to be Mr Perfectionist attempted what’s called a masala entertainer. He worked hard on his physique and the unique hairstyle that he sported went on to become a trend.\nTwitter\nDon't Miss 468 SHARES 1.7 K SHARES 263 SHARES 12.5 K SHARES\nAlong with that, Aamir Khan, who is known for releasing his films on Christmas, is also celebrating the ninth anniversary of 3 Idiot’s release. Aamir Khan starrer film that takes on the insane craze for admission in IIT colleges and getting an engineering degree in India, inspired a lot of people to follow their dreams.\nRemembering how Aamir Khan films have always been a game-changer for Bollywood, fans are overwhelmed.\n#1\nStill remember the Hysteria it created in both Ss n multiplexes. Jo theatre kabhi full nahi hote the waha pe advance booking n black start hua . Such was a Craze for Epic #Ghajini — 🎆Nikhil Kolhe🎆 (@NikhilKolhe4) December 25, 2018\n#2\nMy best ever movie experience in a theatre. Ghajini,what a edge on the seat thrillar blend with everything right from performances, music,thrill,drama,comedy,action,violence. Aamir started the box office phenomenon with this movie. Trend setter #10YearsOfGhajini — Aks_Aamirian (@Akash_TOH) December 25, 2018\n#3\nGhajini became the highest-grossing Indian film of 2008, and the First Indian film to cross the ₹100 crore mark domestically, creating the 100 Crore Club !!\nBudget :₹65 crore\nBox office : ₹232 crore #10_years_of_GHAJINI pic.twitter.com/DPGhubGfCk — Debangsu Mukherjee (@JoyDbg) December 25, 2018\n#4\n10 years of Classic #Ghajini 🙌🏻 jiska craze never seen before tha...\n9 years of Cult Classic #3idiots ❤\nBoth movies broke each n every records rit frm opening day, weekend, week1, liftime n many more.. n most importantly moved millions of hearts @aamir_khan — Shrenik Jain (@urstrulyshrenik) December 25, 2018\n#5\nOh yes ! I've met people who didn't like 3 Idiots at all and Ghajini - like you said, underwhelming. But I feel they were fun films that never bored. Damn, Kalpana's murder still haunts me. It was so terrrifying ! — Nived Nambiar (@Nived_Nambiar91) December 25, 2018\n#6\nIt's been 10 years since 'short term memory loss' patient Sanjay Singhania avenged his girlfriend Kalpana Shetty's brutal murder. #Ghajini\nAnd nine years since terms 'Prerajulisation' & 'Farhannitrate' was coined by Ranchoddas Shymaldas Chanchad a.k.a Baba Rancho. #3Idiots — Nived Nambiar (@Nived_Nambiar91) December 25, 2018\n#7\n#zero footfalls will not even touch half of #Ghajini — ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤㅤ ㅤ ㅤ ㅤ (@AkhilAK_) December 25, 2018\n#8\n#9\nKyun? Hum fans h use itna chahte h to hum demand kar sakte h na.. Ek ghajini jaisi film chahiye wo bhi next year.. Mahabharat to bilkul nahi chahiye.. Abhi mahabharat ka zamana hi nahi h 😑 — Mubina_saiyed (@MubinaSaiyed) December 24, 2018\nAamir Khan’s Thugs Of Hindostan might have failed at the box office, but how can we forget that he changed the face of Indian Cinema with all his films including Lagaan, Taare Zameen Par and Rang De Basanti. Last year, Dangal crossed Rs 1000 crore at the worldwide box office.", "title": "First Films To Enter 100-200 Crore Club, Ghajini & 3 Idiots Clock 10 & 9 Years Respectively", "date_publish": "25/12/2018, 15:03:25", "description": "Aamir Khan’s Thugs of Hindostan might have miserably failed at the box office, but how can we forget the fact Aamir Khan is the first member of the 100 crore club (Ghajini) , 200 hundred crore film (3 Idiots) and also the 300 crore club (PK) at domestic box office.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/first-films-to-enter-100-200-crore-club-ghajini-3-idiots-clocks-10-9-years-respectively-359237.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/first_films_to_enter_100__200_crore_club_ghajini__3_idiots_clocks_10__9_years_of_release_1545729778_800x420.jpg"}