{"text": "Two of Bollywood's most unconventional faces are all set to tell you a story that is different and refreshing. Taapsee Pannu and Bhumi Pednekar, who have always been lauded for incredible performances as actors are playing the world's oldest sharpshooters, Chandro Tomar and her sister-in-law Prakashi Tomar, in Saand Ki Aankh.\nTwitter\nA few weeks ago, Bhumi Pednekar had shared a picture and she captioned it as:\nOld is Gold and this is certainly GOLD! Excited to begin the shooting of this groundbreaking real story of world's oldest sharpshooters!@taapsee @tushar1307 @anuragkashyap72 @RelianceEnt @nidhiparmar pic.twitter.com/HK8Q4ULBrc — bhumi pednekar (@bhumipednekar) February 9, 2019\n\"ground breaking\" story. She added, \"Old is gold and this is certainly gold! Excited to begin the shooting of this ground breaking real story of world's oldest sharpshooters.\"\nWho are Chandro and Prakashi?\nInstagram\nChandro, 87, and Prakashi, 82, are from Uttar Pradesh's Johri village and reportedly took up sharpshooting in their 50s. Chandro, who is fondly called as 'shooter dadi', is among the world's oldest female sharpshooters.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nThe first look of the film was unveiled together on digital media.\nHere it is bullseye “साँड़ की आँख” pic.twitter.com/VIFGaywjQx — Anurag Kashyap (@anuragkashyap72) April 16, 2019\nFor the first time ever, Taapsee Pannu and Bhumi Pednekar will be sharing the screen space and this is just one of the reasons why people are excited for the film.\nTwitter\nIn one of her earlier interviews, Taapsee called 'Saand Ki Aankh' as one of the most difficult films of her career. She had said,\n\"It has been an intense experience. I feel it is one of the most difficult roles of my career. I don't know how I am going to do it so, I am taking each day as it comes and trying to give my best.\"\nDirector Tushar Hiranandani had also spoken highly of both his leading ladies. He said,\n\"Both Bhumi and Taapsee have put their heart and soul into the characters right from the initial prep to the training and their looks. The film is the perfect platform for them to reach their true potential as powerhouse performers.\"\nThe Reliance Entertainment film will mark writer Tushar Hiranandani's debut as director. The film is being jointly-produced by Anurag Kashyap and Nidhi Parmar.", "title": "First Look Of Taapsee Pannu-Bhumi Pednekar As World's Oldest Sharpshooters Chandro Tomar & Prakashi Tomar Is Out!", "date_publish": "16/04/2019, 12:47:50", "description": "Two of Bollywood's most unconventional faces are all set to tell you a story that is different and refreshing. Taapsee Pannu and Bhumi Pednekar, who have always been lauded for incredible performances as actors are playing the world's oldest sharpshooters, Chandro Tomar and her sister-in-law Prakashi Tomar, in Saand Ki Aankh.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/first-look-of-taapsee-pannu-bhumi-pednekar-as-world-s-oldest-sharpshooters-chandro-tomar-prakashi-tomar-is-out-365526.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/saand_ki_aankh_1555403656_800x420.jpg"}