{"text": "Popularity came at a price for Sophie Turner. The actress who shot to fame at the age of 14 for playing the role of Sansa Stark in Game Of Thrones says negative comments about her character in the American fantasy drama show made her consider suicide.\nThe 23-year-old actress revealed that depression got worse after she hit puberty and it intensified further around the age of 17. She was actually giving in to her social media bullies and doubting her acting skills and appearance.\n“I would just believe it. I would say, 'Yeah, I am spotty. I am fat. I am a bad actress.' I would just believe it. I would get (the costume department) to tighten my corset a lot. I just got very, very self-conscious,” she said.\nSimple things like getting dressed would make her burst into tears.\n“I had no motivation to do anything or go out. Even with my best friends, I wouldn't want to see them, I wouldn't want to go out and eat with them. I just would cry and cry and cry over just getting changed and putting on clothes and be like, 'I can't do this. I can't go outside. I have nothing that I want to do.”\nDon't Miss 365 SHARES 159 SHARES\nGetting out of the bed was a task for her.\n“I've suffered from my depression for five or six years now. The biggest challenge for me is getting out of bed and getting out of the house. Learning to love yourself is the biggest challenge.”\nBut things are better off now, and the credit goes to the love of her life. She credits fiancee Joe Jonas for helping her find happiness. Now that she is done with Game Of Thrones, she wants to focus on her mental health, she said.\nWith inputs from ANI", "title": "For Sophie Turner Fame Came At A Big Price, Says Criticism Over Her GoT Role Made Her Suicidal", "date_publish": "17/04/2019, 18:16:43", "description": "Popularity came at a price for Sophie Turner. The actress who shot to fame at the age of 14 for playing the role of Sansa Stark in Game Of Thrones says negative comments about her character in the American fantasy drama show made her consider suicide.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/for-sophie-turner-fame-came-at-a-big-price-says-criticism-over-her-got-role-made-her-suicidal-365654.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sophie_turner_talks_about_game_of_thrones_fame_says_criticism_over_her_role_led_her_to_consider_su_1555504822_800x420.jpg"}