{"text": "For Aamir Khan, The Best Part About Diwali Is Gambling And Many Of You Would Agree!\nFor Aamir Khan, The Best Part About Diwali Is Gambling And Many Of You Would Agree!\nDiwali holds different meaning for different people in India. While for some, it's a festival of love and light, a few others love all the rituals attached to it. From lighting diyas to attending Diwali card-parties to gambling, Diwali is a special festival for reasons more than one.\nFor Bollywood actor Aamir Khan, this year's Diwali is even more special as his film Thug Of Hindostan is all set for a nationwide release. But this isn't the only reason why Aamir is looking forward to Diwali. Aamir's wife and filmmaker Kiran Rao's birthday too falls on the same day. Talking to DNA, Aamir said,\nPinterest\n\"What I enjoy about Deepawali is being with my family. This year, it’s even more special as it’s my wife, Kiran’s birthday. I hope this Diwali will be special, joyous and safe for everyone.\"\nCalling himself a 'reckless' gambler, Aamir talks about his fondness for it. He adds,\n\"What I like most about this festival is the gambling (laughs)! I’m a reckless gambler. I love it but do it (play cards) only once during this time of the year. I like poker and I’m looking forward to playing it.\"\nWell, a lot of you will surely relate to Aamir. Why is Diwali special for you? Tell us in the comments below.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "For Aamir Khan, The Best Part About Diwali Is Gambling And Many Of You Would Agree!", "date_publish": "07/11/2018, 12:00:37", "description": "For Bollywood actor Aamir Khan, this year's Diwali is even more special as his film Thug Of Hindostan is all set for a nationwide release. But this isn't the only reason why Aamir is looking forward to Diwali. Aamir's wife and filmmaker Kiran Rao's birthday too falls on the same day.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/for-aamir-khan-the-best-part-about-diwali-is-gambling-and-many-of-you-would-agree-356210.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/aamir_khan_1541573572_800x420.jpg"}