{"text": "For Shah Rukh Khan, Taking Up Roles That People Think He Can't Pull Off Gives Him The Real Kick\nFor Shah Rukh Khan, Taking Up Roles That People Think He Can't Pull Off Gives Him The Real Kick\nShah Rukh Khan is one actor who never stops experimenting. Be it his roles or the kind of films that his production house makes, he loves taking risks. Off late, his risks might not be providing him fruitful results but he doesn't believe in giving up.\nAgencies\nShah Rukh Khan was present at an event in Mumbai where he shared some details about the kind of roles he plays in films. Talking about the fact that he loves taking up big challenges, Khan said,\nAgencies\n\"Characters are quite different from roles. I feel nice when people make me do what I can't. The most difficult thing is to play your own self on silver screen. When we do creative things, people ask \"did you ever thought you would reach this level of stardom\" and I say, \"never\".\"\nHe might have achieved for many can only dream of but he still believes that he needs to continue giving his best shot. he added,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES\nAgencies\n\"I just wanted to do good work and even today when I get up I believe in it. Whatever I did, I thought it was my best. You should not think, you should only feel as it is a creative work.\"\nGiving a typical SRK style response full of wit and sarcasm, he had a funny take on how he has recently started pulling off kissing scenes on the big screen. He joked an said,\nAgencies\n\"Har insaan ka din badalta hai.\"\nWell, King Khan surely knows how to win hearts with his words!", "title": "For Shah Rukh Khan, Taking Up Roles That People Think He Can't Pull Off Gives Him The Real Kick", "date_publish": "04/02/2019, 12:54:24", "description": "Shah Rukh Khan was present at an event in Mumbai where he shared some details about the kind of roles he plays in films. Talking about the fact that he loves taking up big challenges, Khan said, \"Characters are quite different from roles. I feel nice when people make me do what I can't.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/for-shah-rukh-khan-taking-up-roles-that-people-think-he-can-t-pull-off-gives-him-the-real-kick-361543.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/shah_rukh_khan_1549265974_800x420.jpg"}