{"text": "For All Bird Box Fans, The Sequel Of The Book Is All Set To Release On October 1\nFor All Bird Box Fans, The Sequel Of The Book Is All Set To Release On October 1\nFor all the Bird Box fans, here's a good news! After its successful on-screen adaptation on Netflix, the \"Bird Box\" book franchise is heading for a sequel, titled \"Malorie\", author Josh Malerman has confirmed. The new book, which releases on October 1, derives its name from Sandra Bullock's character, Malorie Hayes in the acclaimed 2018 post-apocalyptic horror.\n\"Bird Box\", based on Malerman's 2014 novel of the same name, followed Hayes; a woman who, along with a pair of children must cross a forest and river blindfolded to avoid supernatural entities which cause people who see them to die by suicide.\nThe writer has revealed that some unanswered questions spurred him to write a follow-up film which will takes place eight years after the original movie.\n\"At the end of the movie, I turned to my girl Allison and said, 'I want to know what happens next!' and she's like, 'Well, you know, you could make that happen', so it really was this warm feeling.\n\"They've left there, (It's) similar in that they're trying to make things work. It's not like it opens with them in paradise,\" Malerman told Esquire magazine.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe writer, who is engaged to artist-and-musician Allison Laakko, added although some fans were keen to know more about Malorie's children, named Boy and Girl, the next installment will still focus primarily on the lead character.\nIn the time between 'Bird Box' coming out and the time since I've been writing Malorie, I've been asked a ton of times: people want to know what happened with Boy and Girl.\n\"But as much as I care about Boy and Girl, this isn't their story. The 'Bird Box' world is Malorie's story and I wanted to know more about her. I wanted to get to know her even better,\" he said.\nInputs From PTI", "title": "For All Bird Box Fans, The Sequel Of The Book Is All Set To Release On October 1", "date_publish": "25/03/2019, 15:20:45", "description": "\"Bird Box\", based on Malerman's 2014 novel of the same name, followed Hayes; a woman who, along with a pair of children must cross a forest and river blindfolded to avoid supernatural entities which cause people who see them to die by suicide. read more here.", "authors": [], "url": "https://www.indiatimes.com/entertainment/for-all-bird-box-fans-the-sequel-of-the-book-is-all-set-to-release-on-october-1_-364262.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bird_box_sequel_release_on_october_1_1553507750_800x420.jpg"}