{"text": "Former Bond Girl Eva Green Insists James Bond Should Always Be Played By A Man, Here’s Why!\nFormer Bond Girl Eva Green Insists James Bond Should Always Be Played By A Man, Here’s Why!\nWould you want to see a woman playing the secret service agent James Bond? Former bond girl Eva Greens is not in favour of flipping the gender of Agent 007. She thinks women should create their own film legacy.\nfanpop.com\nHailed as one of the best Bond girls, Casino Royale actress Eva Green believes if the gender of Agent 007 is flipped, it would be wrong to the history of the character, which has so far always been played by a man.\nReddit\nDaniel Craig is set to leave the franchise after the release of Cary Fukunaga's Bond 25 in April 2020 and there is already a lot of speculation about his replacement with names such as Idris Elba and Richard Madden doing the rounds.\nBut Eva Green thinks roping in a woman would be a bad idea.\n“I'm for women, but I really think James Bond should remain a man. It doesn't make sense for him to be a woman. Women can play different types of characters, be in action movies, and be superheroes, but James Bond should always be a man and not be Jane Bond. There is history with the character that should continue. He should be played by a man,” Green told Vanity Fair on the Dumbo red carpet.\nTwitter\nDon't Miss 3.1 K SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nFurthermore, talking about her character, Eva Green said that she is proud of the fact that Vesper Lynd brought a change in the way Bond girls were perceived.\n“I originally had reservations about being a Bond girl. I didn’t want to be a bimbo. The women are now perceived differently. They are intelligent and sassy and fascinating. I loved playing Vesper. She’s the only one to get to Bond’s heart and has a big impact on his life,” she said.\nBond 25 will be Craig's fifth outing as 007 following Casino Royale, Quantum of Solace, Skyfall and Spectre.\nWith inputs from PTI", "title": "Former Bond Girl Eva Green Insists James Bond Should Always Be Played By A Man, Here’s Why!", "date_publish": "16/03/2019, 14:29:20", "description": "Would you want to see a woman playing the secret agent James Bond? Former bond girl Eva Greens is not in favour of flipping the gender of Agent 007. She thinks women should create their own film legacy. Hailed as one of the best Bond girls, Casino Royale actress Eva Green believes if the gender of Agent 007 is flipped, it would be wrong to the history of the character, which has so far always be", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/former-bond-girl-eva-green-insists-james-bond-should-always-be-played-by-a-man-here-s-why-363809.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/former_bond_girl_eva_green_says_james_bond_should_always_be_played_by_a_man_heres_why_1552722115_800x420.jpg"}