{"text": "Friends is not a show, it is an emotion for most of us. Can you even believe that it has been over 24 years since the show first aired? Seems like a long time, right? We have all grown up watching the show with all the lovable characters. When they laughed, we laughed along with them, and when they cried, we cried too.\nTwitter\nGenerations will come an go, but FRIENDS will never get old. Remember recently, Matt LeBlanc AKA Joey Tribbiani revealed a funny incident when a fan called hin Joey’s dad. “I was walking down the street one day, this was a few years ago. This kid, he must have been 13, 14, he's like, 'Oh my god, you're Joey's dad!'\nvia GIPHY\nAren’t we all waiting for a FRIENDS reunion for so long. We just want to see all the actors together laughing and sharing the same old bond, for one last time, right? But that might not happen EVER!\nrollingstone.com\nDon't Miss 1 K SHARES 3 K SHARES 738 SHARES 699 SHARES\nFriends co creator Marta Kauffman recently revealed why there will never be a FRIENDS reunion in an interview with Rolling Stone magazine. She said,\n“There are several reasons. One, the show is about a time in your life when your friends are your family. It's not that time anymore. All we'd be doing is putting those six actors back together, but the heart of the show would be gone. Two, I don't know what good it does us. The show is doing just fine, people love it. [A reunion] could only disappoint. 'The One Where Everyone's Disappointed.”\nvia GIPHY\nWe know, she has pretty convincing reason, but we are still not convinced. Are we?\nvia GIPHY", "title": "FRIENDS Co-Creator Marta Kauffman Confirms There Will Never Be A Reunion & We Are Heartbroken!", "date_publish": "13/03/2019, 18:33:22", "description": "Aren’t we all waiting for a FRIENDS reunion for so long. We just want to see all the actors together laughing and sharing the same old bond, for one last time, right? But that might not happen EVER! Friends co creator Marta Kauffman has recently revealed why there will never be a FRIENDS reunion. “There are several reasons. One, the show is about a time in your life when your friends are your fami", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/friends-co-creator-marta-kauffman-confirms-there-will-never-be-a-reunion-we-are-heartbroken-363670.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shattering_our_hopes_friends_cocreator_marta_kauffman_confirms_there_will_never_be_a_reunion_1552481676_800x420.jpg"}