{"text": "From Singing Happy Birthday On Iron Man’s 11th Anniversary To Hosting Lunch For Marvel Women, Robert D Jr. Is Killing It\nFrom Singing Happy Birthday On Iron Man’s 11th Anniversary To Hosting Lunch For Marvel Women, Robert D Jr. Is Killing It\nIt was May 1, 2008, the day Iron man was introduced to the world and it was one crazy cinematic experience. Ever since then, the audience became fans of the superhero films and this journey continued till 11 years.\nTwitter\nThis year, the last series of the film Avengers: End Game released and the fans celebrated it nothing less than festival. Now the video of Avengers cast including Robert Downey Jr. singing Happy Birthday for Iron Man on the 11th anniversary is going viral and for all right reasons.\nThe entire cast is happily celebrating the being of Iron Man and it couldn’t get better than this. Robert Downey Jr shared the video of them on the 11th anniversary of Iron Man and it’s worth watching.\nAlso read: Josh Brolin AKA Thanos Wants To Snap Up Avengers:Endgame Box Office Collection, Says He Should Get Half Of It!\nDon't Miss 4.3 K SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES\nAlso recently, Tony Stark of Avengers hosted lunch for the Marvel women and it looked fun. Clearly, Mr. Stark is killing it and how. Don’t miss the picture of Mr. Downey Jr .with the Marvel ladies.\nAvengers: End Game is one of the highest grosser film all over the world. It won't be an exaggeration to say that no other film has received this kind of love in so long. They will be remembered till eternity. And thank you for everything, Iron Man.", "title": "From Singing Happy Birthday On Iron Man’s 11th Anniversary To Hosting Lunch For Marvel Women, Robert D Jr. Is Killing It", "date_publish": "03/05/2019, 16:16:54", "description": "This year the last series of the film Avengers End Game released and the fans celebrated nothing less than festival. And now the video of Avengers cast including Robert Downey Jr singing Happy Birthday for Iron Man on the 11th anniversary is going viral and for all right reason The entire cast is happily celebrating the being of Iron Man and it couldn’t get better than this. Robert Downey Jr shar", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/from-singing-happy-birthday-on-iron-man-s-11th-anniversary-to-hosting-lunch-for-marvel-women-robert-d-jr-is-killing-it-366562.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/robert_downey_jr_1556880850_800x420.jpg"}