{"text": "From Dancing With Drag Queens To Getting Drunk, Adele-Jennifer Lawrence Party Their Heart Out At A Gay Bar!\nFrom Dancing With Drag Queens To Getting Drunk, Adele-Jennifer Lawrence Party Their Heart Out At A Gay Bar!\nA perfect girls night out includes copious amount of alcohol, great music and loads of fun and Adele and Jennifer Lawrence did exactly that! For Bar patrons in New York’s Greenwich Village, Friday was a little different from other evenings.\nThey just began partying when Adele and Jennifer Lawrence showed up.\nAccording to news reports Grammy-winning singer Adele and her Oscar-winning actor pal hit the gay bar Pieces on Friday night, to the delight of the crowd. They drank and danced and schmoozed, hugging shirtless men and taking selfies while the crowd applauded.\nThey danced to Kylie Minogue and played a drinking game. Adele participated in a game show hosted by a drag queen and introduced herself as a married, stay-at-home mom. More videos from the party show Jennifer sitting in Adele’s lap and getting lesson in drag make up. She can be heard talking about getting the ‘Chinese brows’.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAnother video shows Jennifer bringing a passed out Adele back on her feet when someone screams behind them, “Jennifer, This isn’t Hunger Games”.\nAdele has long been a favourite in the LGBTQ community. She told Time magazine in 2015 that she couldn’t wait to find out who her young son’s “girlfriend or his boyfriend is going to be. ... Whatever my kid wants to do or be I will always support him no matter what.”\n(With inputs from AP)", "title": "From Dancing With Drag Queens To Getting Drunk, Adele-Jennifer Lawrence Party Their Heart Out At A Gay Bar!", "date_publish": "24/03/2019, 17:15:01", "description": "According to news reports Grammy-winning singer Adele and her Oscar-winning actor pal hit the gay bar Pieces on Friday night, to the delight of the crowd. They drank and danced and schmoozed, hugging shirtless men and taking selfies while the crowd applauded.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-dancing-with-drag-queens-to-getting-drunk-adele-jennifer-lawrence-party-their-heart-out-at-a-gay-bar-364231.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/adele_and_jennifer_lawrence_1553428205_800x420.jpg"}