{"text": "From Captain Marvel To Avengers, It Survived, Taapsee On Badla Completing 50 Days In Theatres!\nFrom Captain Marvel To Avengers, It Survived, Taapsee On Badla Completing 50 Days In Theatres!\nJust a few weeks ago, Megastar Amitabh Bachchan expressed that he was upset that not enough has been said on the \"silent success\" of his latest film \"Badla\", directed by Sujoy Ghosh and produced by Shah Rukh Khan.\n\"About time someone started talking about this silent success! Because neither the producer, nor the distributor, nor the line producer, or any else in the industry, in general, has even spent a nano second to compliment the success of this film 'Badla'. Thank you,\" Big B tweeted.\nShah Rukh, known for his quick wit, responded: \"Sir hum toh wait kar rahein hain ki aap party kab de rahein hain hum sabko (Sir, we are waiting for you to throw a party for all of us! We are waiting outside Jalsa every night!\"\nWell, the social media banter continued and just like that, the film has managed to complete a successful run of 50 days at the box-office. Starring Amitabh Bachchan and Taapsee Pannu in the lead roles, the film has been the surprise package of the year in terms of monetary success! While it started slow, it's pleasantly surprising how the positive word of mouth worked for the film.\nDon't Miss 343 SHARES 263 SHARES 449 SHARES 612 SHARES 12.5 K SHARES\nToday, Taapsee Pannu finally reacted to the news of her film completing a successful run of 50 days. Taapsee wrote:\nFrom Captain Marvel to Avengers.....\nWe survived ! #50DaysOfBadla — taapsee pannu (@taapsee) April 26, 2019\nBadla had released on March 8, clashing with the superhero film Captain Marvel, starring Brie Larson and now even when Avengers Endgame has released, the film is standing rock-solid in several cinema halls across the country.\nDirector Sujoy Ghosh also took to social media to praise Avengers: Endgame, calling it real cinema and he also expressed the joy of realising that his film has completed 50 days at the box-office. He wrote,\n\"And it was so cool to see Badla still running... You have no idea how much the team is grateful to all of YOU who made this possible. SAR JHUKAKE THANK YOU.\"\nThe film also stara Amrita Singh, Tony Luke, Manav Kaul and Tanveer Ghani in supporting roles.\n(With agency inputs)", "title": "From Captain Marvel To Avengers, It Survived, Taapsee On Badla Completing 50 Days In Theatres!", "date_publish": "27/04/2019, 17:55:53", "description": "Badla had released on March 8, clashing with the superhero film Captain Marvel, starring Brie Larson in the eponymous role and now, even when Avengers Endgame has released, the film is standing rock-solid in several cinema halls across the country. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-captain-marvel-to-avengers-it-survived-taapsee-on-badla-completing-50-days-in-theatres-366208.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/badla_1556368271_800x420.jpg"}