{"text": "Six months after the bridge was declared ‘fit to use’ after structural audit, Mumbai’s CST foot overbridge near the bustling Chhatrapati Shivaji Maharaj Terminus (CMST) railway station collapsed taking the lives of at least six people and injuring more than 30 people.\nIn past two years, this is the fourth such incident taking place in Mumbai. While everyone is still shocked and the blame game in the political scenario has begun, Bollywood stars condoled the loss of lives.\n#1\nSaddened how little life of its own people matter to the establishment. We pay tax for this...for someone to term negligence a natural calamity. 5 people dead. Sad. Mad. #MumbaiBridgeCollapse 💔 — TheRichaChadha (@RichaChadha) March 15, 2019\n#2\nT 3118 - In grief and in silent prayer .. !! Mumbai city — Amitabh Bachchan (@SrBachchan) March 14, 2019\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n#3\nPerturbed to hear about the #MumbaiBridgeCollapse. So disturbing to see images and videos of the scene. Prayers for the victims and their families🙏 — Vivek Anand Oberoi (@vivekoberoi) March 14, 2019\n#4\nDistressed at the news of the fall of part of the overbridge at CST. Praying for the injured.\nCommuter safety needs attention and hoping that authorities act to prevent such incidents. — Sachin Tendulkar (@sachin_rt) March 14, 2019\n#5\nDeeply anguished by the loss of lives due to the foot overbridge accident in Mumbai. My thoughts are with the bereaved families. Wishing that the injured recover at the earliest. The Maharashtra Government is providing all possible assistance to those affected. — Narendra Modi (@narendramodi) March 14, 2019\n#6\nWhat a horrible tragedy.. so sad to know that many have lost lives. My deepest condolences to the families who lost their loved ones & prayers for the injured. This #MumbaiBridgeCollapse should have been avoided. This negligence is unpardonable. — Riteish Deshmukh (@Riteishd) March 14, 2019\n#7\nPerturbed to hear about the #MumbaiBridgeCollapse. So disturbing to see images and videos of the scene. Prayers for the victims and their families🙏 — Vivek Anand Oberoi (@vivekoberoi) March 14, 2019\n#8\nTragedy- this time in the heart of Mumbai! The foot overbridge at the CST suddenly collapsed killing 5 people & injuring at least 36. I pray for those who have lost their lives & for those now in hospital for treatment🙏 — Hema Malini (@dreamgirlhema) March 14, 2019\n#9\nDeeply saddened to know about the bridge collapse in Mumbai. My thoughts and prayers are with the bereaved families. May God give them strength to deal with this loss.🙏 — Anupam Kher (@AnupamPKher) March 14, 2019\nThe incident took place at 7:20 pm when a big slab of the FOB came crashing down yesterday. Teams from NDRF, Mumbai Police, Fire Brigade and other rescue agencies reached the spot and immediately evacuated those buried under the rubble and shifted them to hospitals.\nAn FIR has been registered against officials concerned of the Central Railway and the Brihanmumbai Municipal Corporation (BMC) under section 304A (Causing death by negligence) of the Indian Penal Code at the Azaad Maidan Police Station.\nSoon after, the Maharashtra government announced ex-gratia of Rs 5 lakh each for the families of those who were killed in the tragic incident.\nAlso Read: Mumbai Footover Bridge Collapse Yet Again Shows Apathy Of Authorities As It Is The 4th Mishap In 4 Years", "title": "From Amitabh Bachchan To Sachin Tendulkar, Celebs Condole Loss Of Lives In Mumbai Bridge Collapse", "date_publish": "15/03/2019, 16:02:52", "description": "Six months after the bridge was declared ‘fit to use’ after structural audit, Mumbai’s CST foot overbridge near the bustling Chhatrapati Shivaji Maharaj Terminus (CMST) railway station collapsed taking the lives of at least six people and injuring more than 30 people. In past two years, this is the fourth such incident taking place in Mumbai. While everyone is still shocked and the blame game in", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-amitabh-bachchan-to-sachin-tendulkar-celebs-condole-loss-of-lives-in-mumbai-bridge-collapse-363779.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/from_amitabh_bachchan_to_sachin_tendulkar_celebs_condole_loss_of_lives_in_mumbai_bridge_collapse_1552645213_800x420.png"}