{"text": "Now that I have food poisoning, I lie back on the couch and tell her, ‘Look, I now have a legitimate excuse to stop attending more functions and I have also lost a few pounds. This is truly killing two birds with one stone.’\nMy sister draws in a long breath of Delhi’s polluted air and retorts, ‘Every week you give me an update of how much weight you have lost and gained! It’s not the rupee against the dollar that anyone has such deep interest in your .5 shifting numbers. And by the way, it seems you can’t use that dog and killing birds phrase anymore. PETA is up in arms about humans using insensitive language towards animals.’\nBCCL\nI say, ‘Stop being mean about my weight! Listen, this animal thing is ridiculous. I completely get the fact that eating them is cruel but isn’t it stupid to throw out all idioms?’\nMy sister sighs, ‘Well, they have suggested alternatives. Instead of saying ‘bring home the bacon’, one should say ‘bring home the bagels’, and as for ‘killing two birds’, they suggest, ‘feeding two birds with one scone.’\nDon't Miss 132 SHARES 594 SHARES 9.8 K SHARES 12.5 K SHARES\nI reply, ‘First of all, if we feed birds scones, they will probably get food poisoning like me. And there is a limit to political correctness. No one will get what we are actually saying.’\nLater that day, Mummyji summons me to her chambers to inquire about my health. She offers me a samosa with some masala tea but I hastily decline, ‘Mummyji, my stomach is still not all right and more importantly, by almost throwing up what felt like my gall bladder and parts of my left lung, I have lost two kilos and I want to keep it off. I can’t say that the scale and I are friends again but we are definitely on talking terms now.’\nMummyji is not mollified, ‘You girls think too much about these things. In our time, a little fat was considered good.’\nI have a sip of my tea and say, ‘No one calls people fat anymore Mummyji, unless they want to insult them! Did you hear about how Sharad Yadav had to apologise for calling Vasundhara Raje “moti”? I guess just the fact that you are a woman means that people have no qualms about judging you on your physical appearance.’\nI recently attended a show where a caller asked me for advice. She said that she was single, overweight, and her parents were finding it difficult to find a boy for her.\nBCCL\nMy heart went out to her. Navigating school as the fattest girl in my class for many years, I do know a little about how the world looks at a plus-size girl, and how it changes the way you look at yourself. Even today where I am vaguely comfortable with my bits and bobs, the tendency to watch the scale, no matter what I tell myself, hasn’t disappeared.\nBut I am not a fairy godmother who can transform the young caller’s life or body, and even if I had a magic wand on the stage instead of a mike, I would rather change the world into one where we are valued just the way we are, for all the things we do.\nThe question still remains why women are body shamed, especially in a field like politics where physical form has absolutely no role to play. I remember a laughing Renuka Chowdhury once making a self-deprecatory joke about her weight (By the way, most chubby girls, including me, joke about our weight as part of our defence mechanism). But Venkaiah Naidu told her, ‘My simple suggestion is, reduce your weight and make efforts to increase the weight of the party’. Then during a cabinet shuffle, Smriti Irani was shifted to the textile ministry. While none of the other ministers, all men to be noted, were lampooned, the size of her blouse became a butt of jokes on Twitter.\nWhen I tell Mummyji this, she is immediately annoyed, partly because she has always had a soft spot for Smriti from her Kyunki Saas Bhi days, ‘As if these male politicians are fit! Most of them are round like atta balls. Someone should take a belan and hammer them into thin rotis if they say anything about a lady’s weight! There is also a way of saying things, Beta. See in our friends’ circle if anyone puts on weight, we just say, “You are looking thoda healthy side behenji”. It is not like we are children anymore na that you call each other bad names.’\nI immediately conjure up a picture of a 70-something Yadav hanging from a jungle gym calling the 65-year-old Raje, “Moti” while she swings her school bag and knocks him on the head, just like I once did to a boy who called me the same thing.\nBCCL\nOf course, Vasundhara Raje now has bigger problems than being called fat after the Congress pulled off poll victories in three states, including hers. This made the underdog Pappu grin from all our TV screens like the cat who swallowed the canary or perhaps even a few cows in this case.\nThe question on everyone’s mind though is what will happen in 2019, but for that I guess, we will all just have to weight and watch.\nErr… I am sure in the course of this column, I may have offended some animals and so I would like to weasel out of any controversies with this disclaimer, ‘Dear PETA, birds, cats, canaries and cows, please don’t throw me to the wolves, as I am just horsing around.’\nYou can read the entire blog here.\nOriginally published in The Times of India", "title": "From Fat-Shaming To Women’s Weight Stigma, Twinkle Khanna Blogs About ‘Weighty Matters’", "date_publish": "16/12/2018, 12:32:09", "description": "Now that I have food poisoning, I lie back on the couch and tell her, ‘Look, I now have a legitimate excuse to stop attending more functions and I have also lost a few pounds. This is truly killing two birds with one stone.’ My sister draws in a long breath of Delhi’s polluted air and retorts, ‘Every week you give me an update of how much weight you have lost and gained!", "authors": ["Twinkle Khanna"], "url": "https://www.indiatimes.com/entertainment/from-fat-shaming-to-women-s-weight-stigma-twinkle-khanna-blogs-about-weighty-matters-358695.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/twinkle_khanna_1544943634_800x420.jpg"}