{"text": "This year has been been quite an eventful one for the world of entertainment. The year started with Sonam Kapoor and Anand Ahuja's wedding and had ended with a bigger bang in December.\nThe most awaited wedding of Isha Ambani and Anand Piramal finally took place last night in Mumbai. From the sangeet that was held in Udaipur with Beyonce as their guest, Isha Ambani's wedding will go down in the history of royal weddings.\nThe couple got married in Mukesh Ambani's plush house Antilla. To bless the couple, the who's who of tinsel town turned up. From newly weds DeepVeer, Nickyanka to the Bachchans, Rajinikanth, celebrities graced the occasion with their glamourous presence.\nDon't Miss 161 SHARES 862 SHARES 346 SHARES\nHere's taking a look at the sizzling evening that turned out to be a finest one.\n1. Newly weds Priyanka Chopra and Nick Jonas\nTwitter\n2. Sonam poses with daddy Anil Kapoor in a hot pink Anamika Khanna outfit\nViral Bhayani\n3. Ranveer Singh and Deepika Padukone radiating in red and white\nTwitter\n4. Manish Malhotra had designed outfits for Ambani's sangeet ceremony in Udaipur\nVral Bhayani\n5. The Bachchans making their way into the wedding\nViral Bhayani\n6. ShaMira were also present at the big fat Indian wedding\n7. The Kapoor sisters wore Manish Malhotra for Isha Ambani's wedding\n8. After attending the glamourous sangeet, Hillary Clinton marked her presence at the wedding as well\n9. Alia Bhatt dazzled in a black and white outfit\n10. Putting on his desi swag, KJo looks hot in his white number.\n11. Abhishek Bachchan poses with wifey Aishwarya and tiny tot Aaradhya at home before heading to the big wedding\n12. Aamir Khan and Kiran Rao also took out time to meet the new couple\n13. Kiara Advani makes a sizzling appearance at the wedding.\n14. Rajinkanth comes to the wedding wearing a white kurta pajama\nCelebrities took their fashion quotient a notch higher and we are not surprised. After all, it was Mukesh Ambani's daughter's wedding and it had to be perfect.", "title": "From DeepVeer, Nickyanka, Thalaivar To Bachchans, Bollywood Celebs Grace Isha Ambani's Wedding", "date_publish": "13/12/2018, 13:12:08", "description": "bachchans, ambani, ranveer, deepika, isha, priyanka chopra, bollywoodbachchans, ambani, ranveer, deepika, isha, priyanka chopra, bollywoodbachchans, ambani, ranveer, deepika, isha, priyanka chopra, bollywoodbachchans, ambani, ranveer, deepika, isha, priyanka chopra, bollywoodbachchans, ambani, ranveer, deepika, isha, priyanka chopra, bollywoodbachchans, ambani, ranveer, deepika, isha, priyanka cho", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/from-deepveer-nickyanka-thalaivar-to-bachchans-bollywood-celebs-grace-isha-ambani-s-wedding-358482.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ambani_1544682115_800x420.jpg"}