{"text": "There are a lot of good films that are made around the world. But sadly, we Indians only watch/are obsessed with Hollywood and Bollywood. Just like how Baahubali erupted from regional cinema and gained popularity across the globe, Korean pop culture and films are also gaining momentum gradually.\nIf you have never watched films in languages other than Hindi and English, Korean films are a good place to start with. Here are some of the films that are refreshingly different from what you have been watching for so long.\n#1 Oldboy (2003)\nOldboy is one of those films that turned global interest towards Korean cinema. Hailed as a Korean cult masterpiece, Oldboy is an action-thriller story about a man who after being kidnapped and imprisoned for 15 years is released only to find his captor in five days. It’s the second film in The Vengeance Trilogy that consists of Sympathy for Mr. Vengeance (2002), Oldboy (2003), and Lady Vengeance (2005).\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n#2 The Man From Nowhere (2010)\nThe Man From Nowhere is a story about a pawnshop owner with a violent and mysterious past. When a young girl he befriends is kidnapped by a vivacious drug and organ trafficking racket, he rushes to save her but is caught up in it. It was the highest grossing movie of 2010.\nFun Fact: John Abraham's Rocky Handsome was a remake of this movie.\n#3 A Tale Of Two Sisters\nIf you are a fan of horror films, this is one film that you shall simply not miss. This is a psychological horror film that will keep you scared and in suspense until the very end. It’s a story of a family who is haunted by the tragedies of deaths within the family. The Uninvited (2009) was remake of this Korean movie.\n#4 The Wailing (2016)\nThis critically and commercially successful movie is about a little village where after the arrival of a man, a mysterious sickness has started to spread. A policeman is forced to solve the mystery who is drawn into a war between reason and folkfare.\n#5 The Beauty Inside (2015)\nEver imagined how it would like to wake up in a different body every day? It can be quite stressful, right? And even more stressful when you have figure out a way to reconnect with your girlfriend every day! The Beauty Inside is a romantic saga about a furniture designer who wakes up in a different bodies every day. The story seems quite complicated, right? But it’s heartwarming at the same time.\n#6 Thirst (2009)\nIf you love horror films and movies based on vampires, Thirst is the film that you should be watching next. What happens when a priest is infected with vampirism? He is forced to abandon his ascetic ways. This one is far from the vampire movies you have watched til date.\n#7 Oasis (2002)\nOasis is a sensitive romantic saga about a convicted man of a hit-and-run case who befriends a girl with cerebral palsy and falls in love with her. Keep tissues handy if you plan to watch this one.\n#8 Train To Busan (2016)\nFor zombie lovers, this is a film that broke audience record with 10 million people watching the movie during its theatrical run. When a train is about to deport, a lady boards it. She has a nursing bite wound on her leg, and soon she becomes a zombie. The struggle to survive on the train from Seoul to Busan will be spine chilling.\n#9 Mother (2009)\nIt’s a story about a mother whose specially-abled son is wrongly accused of a murder. The mother takes it upon herself to find the killer who is responsible for the brutal murder of a young woman. This murder mystery will keep you hooked.\n#10 Forgotten (2017)\nForgotten is a story of a man who gets caught up investigating his brother’s kidnapping. His brother returns seemingly a different man with no memory of past 19 days. As he tries to solve the mystery of his brother’s kidnapping, he learns new things that make him question about his own life.\n#11 Tunnel (2016)\nEnjoyed watching Rajkummar Rao’s Trapped? Now watch Tunnel, which is a story of a car salesman, who is on his way to his home when he gets trapped in a tunnel. How he survives inside with the advice of the rescue team will keep you on the edge of the seat.\n#12 Pieta (2012)\nWith highly sexual content and Christian symbolism, Pieta can be a little unsettling movie. The story revolves around a loan shark who is forced to reconsider his violent lifestyle after the arrival of a woman who claims to be his mother.\n#13 A Man Who Was Superman (2008)\nThis is a story of a snobbish producer who is making a documentary on the extraordinary behaviour of her neighbour who thinks of himself a superman. Is this man really Superman? If not, what are his reasons for helping out everyone at the expense of himself?\n#14 Castaway On The Moon (2009)\nIt’s a romantic adventure tale of a man who after his failed attempt to commit suicide is heartbroken and is forced to live in wilderness, and an agoraphobic woman addicted to Cyworld (South Korean social network service).\n#15 A Moment To Remember (2009)\nThe movie will leave you in tears. It’s a story of a fashion designer who falls in love with a construction worker. The epic story takes a turn when the man finds out that the girl he loves has early onset Alzheimer’s. It’s a love story that shows how love truly conquers all.\nNow that weekend is here, call your friends/bae over, and maybe run a marathon!", "title": "From Mind-Numbing Thrillers To Refreshing Rom-Coms, 15 Korean Movies You Need To Watch ASAP!", "date_publish": "30/03/2019, 12:43:30", "description": "There are a lot of good films that are made around the world. But sadly, we Indians only watch/are obsessed with Hollywood and Bollywood. Just like how Baahubali erupted from regional cinema and gained popularity across the globe, Korean pop culture and films are also gaining visibility gradually. If you have never watched films in languages other than Hindi and English, Korean films are good to", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-mind-numbing-thrillers-to-refreshing-rom-coms-15-korean-movies-you-need-to-watch-asap-364335.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/here_are_must_watch_best_korean_movies_of_all_time_1553600674_800x420.png"}