{"text": "From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood\nFrom Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood\n“How’s the Josh? High Sir!” – These lines instantly fill you up with all the patriotic vibe. From Prime Minister Narendra Modi to little kids, all those who have watched Vicky Kaushal starrer Uri: The Surgical Strike are going bonkers over this dialogue from the movie.\nIndeed, Vicky Kaushal pulled off the role Major Vihaan Singh Sherghil so well that people were reminded of Sunny Deol from Border. The only difference was – Vicky showed less intensity yet made a powerful impact with his impeccable acting skills. So much so, that Anupam Kher lauded his performance in the movie and welcomed him to the “actor’s world”. Interestingly, Anupam Kher’s The Accidental Prime Minister released on the same date as Uri: The Surgical Strike, and the latter made more noise than the former.\nDear @vickykaushal09 ! Welcome to the ‘actors’ world. You are FANTASTIC in #UriTheSurgicalStrike. Real, gutsy and a performer. Remember!! You are your own competition. The more difficult you make your jo, the more you will explore it. Love and best wishes always.🙏😍 pic.twitter.com/grlvt3QxSn — Anupam Kher (@AnupamPKher) January 21, 2019\nHe is perhaps one of the few actors who can blend in playing a second lead or a supporting role (like he did in Sanju) and also stand out playing a solo lead, as he did in Uri: The Surgical Strike.\nTwitter\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe era of super-stardom is probably hitting rock bottom. Gone are those days when people would eagerly wait for a Shah Rukh Khan or a Salman Khan movie. The audiences now want something different – something thought proving, real and relatable. And Vicky Kaushal is catering to that superbly.\nJust like how actors like Nawazuddin Siddiqui, Rajkummar Rao and Irrfan Khan among others have made their own league in the industry, Vicky Kaushal has also shown his range of acting in different films earning critical as well as commercial success.\nNot many people know that he is a star-kid too. He is the son of a well-known stunt director Shyam Kaushal. But that didn’t give him a sure shot ticket to stardom. Unlike other star kids, Vicky Kaushal hadn’t stepped on to the sets of films until he started assisting Anurag Kashyap on Gangs Of Wasseypur.\nTwitter\nDid you know, he is an engineer by degree? But he always knew what he wanted to become – an actor. He gave an interview for a job as a telecommunication engineer, just for the “thrill of it” – just to experience the “nervousness”. He even got selected but tore off the offer letter so he could follow his dreams.\nbollyy.com\nHe was always aware about his humble household. He knew there was a time when his father had to “hunt for their next meal”, but he didn’t turn back, he worked hard to achieve his dreams.\nmasala.com\nFrom films like Masaan and Bombay Velvet to Sanju, Raazi and Uri, he has earned himself a place in the hearts of the audiences. He has had a rich and rewarding journey so far, and it proves he is here for a long haul.\n#1 With his first film, Vicky made his presence felt in the industry. In an ensemble cast, he aced his role of Deepak, a boy-next-door, in Masaan and won all the critical acclaim that he rightfully deserves. He even won the best debut award in many award functions.\n#2 In Raman Raghav 2.0, he showed audiences another shade of his versatility. He transformed himself into the role of a corrupt and drug-addict cop. His performance was at par with that of Nawazuddin Siddiqui.\n#3 And yet again, in his next film, he experimented with his role. When OTT platforms like Netflix weren’t that big, he starred in Netflix India’s original film titled Netflix special, Love Per Square Feet, a rom-com, in which he won the audiences over with his smooth-sailing performance.\n#4 With his portrayal of Pakistani army officer Iqbal in Alia Bhatt starrer Raazi, Vicky made audiences fall for his character even more this time. Adding the human angle to the spy thriller, he made his performance shine bright.\n#5 And then came Lust Stories, another Netflix film, which he calls his “quirkiest film”, he garnered glowing reviews for his cute antics in the movie.\n#6 With his sheer talent, he emerged out as the best performer in the film that starred Ranbir Kapoor in the lead role. While the audiences were waiting to see Ranbir Kapoor ace the role of Sanjay Dutt in the biopic, not many people even knew that Vicky Kaushal was a part of the movie playing the role of Sanju’s best friend Kamli. This film was the game-changers for Vicky Kaushal. So much so, that more than Ranbir, people were talking about him after the movie released. Some even said that he outshone Ranbir.\n#7 But Vicky has a lot in store for his audiences. In Manmarziyaan, he gave a mohawk-haired, wacky lover Vicky Sandhu who lives life to the fullest. For the unversed, he also lent his voice for the song F For Fyaar in the movie. Indeed, he is multi-faceted.\n#8 Vicky Kaushal shot up the Josh of a commoner with a stellar portrayal of Major Vihaan Singh Sherghil in Uri: The Surgical Strike, attribute to the 19 martyred soldiers in 2016 attack. With his powerful goose bump-inducing performance, he turned out to be a star-performer yet again.\n#9 Is there something that Vicky Kaushal can’t do? In his next, a multi-starrer historical drama, titled Takht, he will play the role of Aurangzeb, and we’re already looking forward to it.\nVicky Kaushal is on his way to becoming the next big star of Bollywood or has he become one already, what do you think?", "title": "From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood", "date_publish": "22/01/2019, 14:03:19", "description": "From films like Masaan and Bombay Velvet to Sanju, Raazi and Uri, Vicky Kaushal has earned himself a place in the hearts of the audiences. He has had a rich and rewarding journey so far, and it proves he is here for a long haul. Not many people know that he is a star-kid too. He is the son of a well-known stunt director Shyam Kaushal. But that didn’t give him a sure shot ticket to stardom. Unlike", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-supporting-roles-to-a-solo-lead-in-uri-vicky-kaushal-is-on-his-way-to-becoming-the-next-big-star-of-bollywood-360835.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/vicky_kaushal_is_on_his_way_to_becoming_the_next_superstar_of_bollywood_1548149237_800x420.jpg"}