{"text": "From Virushka To Nickyanka, Here's How Bollywood Couples Rang In New Year\nFrom Virushka To Nickyanka, Here's How Bollywood Couples Rang In New Year\nNew years is a time of new beginnings, untying old knots and looking forward to what lies ahead. For people in love, this marks the beginning of another year together. In 2018, a lot of Bollywood couples went public and expressed their love.\nThere were also a few of them who kept their relationships under wraps and then went all public about their affair. In case you are wondering what these couples are up to, let's take a look at how the new year celebrations went for the couple.\n1. Anushka Sharma and Virat Kohli have taken a break to be together in Australia.\n2. Alia Bhatt is in New York to be with her rumored boyfriend Ranbir Kapoor. The couple celebrated the new year eve with the Kapoor family.\n3. After keeping their relationship under wraps for over a year, Arjun Kapoor and Malaika Arora are comfortable with paps clicking them together. The rumored couple is often spotted at Bandra cafes, exiting their date. The couple spent their new year's eve together with Sanjay Kapoor's family.\n4. Priyanka Chopra and Nick Jonas are enjoying their skii life and Swiss holidays!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "From Virushka To Nickyanka, Here's How Bollywood Couples Rang In New Year", "date_publish": "01/01/2019, 11:02:50", "description": "There were also a few of them who kept their relationships under wraps and then went all public about their affair. In case you are wondering what these couples are up to, let's take a look at how the new year celebrations went for the couple. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-virushka-to-nickyanka-here-s-how-bollywood-couples-rang-in-new-year-359610.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/new_year_1546321069_800x420.jpg"}