{"text": "From Crushing On Each Other To Now Romancing In Imtiaz Ali's Next. What's Really Up, Sara-Kartik?\nFrom Crushing On Each Other To Now Romancing In Imtiaz Ali's Next. What's Really Up, Sara-Kartik?\nOn National Television and India's most popular chat show Koffee With Karan, Sara Ali Khan confessed that she has a huge crush on Kartik Aaryan. KJo being KJo proved to be a cupid here and he kept the same questions to Karthik Aaryan where he shyly admitted that he's making more money to take her out on a date.\nStar India\nCut to: An award show, where Kartik and Sara were seen hugging and talking to each other. In just a few months, things escalated to an extent that Kartik and Sara are now shooting for Imtiaz Ali's next rom-com.\nThe duo were also recently spotted on a motorbike exploring the lanes of Delhi for their upcoming shoot.\nTwitter\nAnd now last evening, Sara Ali Khan confirmed that her next film is a rom-com with Kartik and it will be helmed by Imtiaz Ali.\nConsidering what has been happening since last three months, it's not surprising to see that Imtiaz Ali saw his potential couple in Sara and Kartik. The picture that was shared by Sara received a positive response on social media and the fans can't wait to see their sizzling chemistry on the silver screen.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES", "title": "From Crushing On Each Other To Now Romancing In Imtiaz Ali's Next. What's Really Up, Sara-Kartik?", "date_publish": "21/03/2019, 09:29:59", "description": "On National Television and India's most popular chat show Koffee With Karan, Sara Ali Khan confessed that she has a huge crush on Kartik Aaryan. KJo being KJo proved to be a cupid here and he kept on dodging love and admiration messages from one person to another here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-crushing-on-each-other-to-now-romancing-in-imtiaz-ali-s-next-what-s-really-up-sara-kartik-364062.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kartik_and_sara_1553142824_800x420.jpg"}