{"text": "Ranveer Singh and Deepika Padukone kept their relationship away from media spotlight but the world already knew what they were trying to hide. The relationship made headlines, their PDA was winning the internet and even without their official nod, they became #DeepVeer for everyone.\nAgencies\nRanveer and Deepika tied the knot in Italy in November and the world watched. It was a wedding you only dream about. Only a few people close to them had flown down to Italy with them and it was a wedding that will be remembered for years!\nAgencies\nWhile we know what all is happening in their professional life post-wedding, there is a lot that happened in the last six years of their relationship.\nFrom co-actors, they graduated to becoming each other's better-half and a lot conspired between these two!\nAgencies\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nGiving all of us some dope on their courtship period, Padukone spoke to Jitesh Pillai for Filmfare's Famously Filmfare. In a first, Deepika didn't hesitate while divulging some inner deets between him and husband Ranveer. We have a few excerpts on what all Deepika spoke about on her wedding with her long-term boyfriend Ranveer Singh, why they chose Lake Como and other 'special' incidents.\n1. The initial dating days: When Deepika spoke about the special moment between Ranveer and her.\n2. On waking up to each other and why it's special for her:\n3. When she was asked the relevance of 'Ek Chutki Sindoor' in her real life:\n4. When she was asked why she and Ranveer chose Lake Como as their wedding destination:\n5. Deepika Padukone on why they opted for both Sindhi and South Indian wedding traditions.\n6. On what tips Ranveer's Mom gave Deepika.\n7. When Deepika was asked her moment of realization that Ranveer was the 'special' one for her:", "title": "From 1st Date To Ek Chutki Sindoor Moment, Deepika Makes Swoon-Worthy Confessions About Ranveer", "date_publish": "18/12/2018, 17:59:42", "description": "Ranveer Singh and Deepika Padukone kept their relationship away from media spotlight and glare but the world already knew what they were trying to hide. The relationship made headlines, their PDA was winning the internet and even without their official nod, they became everyone's #DeepVeer.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-1st-date-to-ek-chutki-sindoor-moment-deepika-makes-swoon-worthy-confessions-about-ranveer-358834.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepveer_1545135981_800x420.jpg"}