{"text": "From Spotting Celebs Taking An Auto To Clicking Them At Dates, Indian Paparazzi Knows It All!\nFrom Spotting Celebs Taking An Auto To Clicking Them At Dates, Indian Paparazzi Knows It All!\nYou must be living under a rock if you are unaware that Tiger Shroff and Disha Patani go to Bastian in Mumbai for a date every Sunday!\nLike, almost each one of us know that Taimur goes for horse-riding every weekend. Everyone is aware of the basic routine of these celebrities and two people who are actually responsible for it- Viral Bhayani and Manav Manglani.\nThey revolutionized and began the whole pap culture on social media and this also bridged the gap between celebrities and the fans. But do they know where to draw the line?\nWell, just a day ago, pictures and videos of Sara Ali Khan ditching her car for an auto-ride went viral on the internet. In the videos, it's clear that Sara was both surprised and shocked to see that paps manage to figure out where she was!\nDon't Miss 707 SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES\nFor instance, recently Malaika Arora and boyfriend Arjun Kapoor were spotted by the Indian paps exiting a hospital in Mumbai. In no time, speculations of them getting a pre-marital check up started doing rounds.\nWhile it's often said that the PR managers give paps cues about the stars they are handling, it's more than scary and clear intrusion to their privacy that they are clicked without their permission. What is your take? Tell us in the comments below.", "title": "From Spotting Celebs Taking An Auto To Clicking Them At Dates, Indian Paparazzi Knows It All!", "date_publish": "27/04/2019, 16:25:19", "description": "You must be living under a rock if you are unaware that Tiger Shroff and Disha Patani go to Bastian in Mumbai for a date every sunday! Like, almost each one of us know that Taimur goes for horse-riding every weekend. Everyone is aware of the basic routine of these celebrities and two people who are actually responsible for it- Viral Bhayani and Manav Manglani.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-spotting-celebs-taking-an-auto-to-clicking-them-at-dates-indian-paps-knows-it-all-366201.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/viral_bhayani_1556362972_800x420.jpg"}