{"text": "From Anil Ambani, Priyanka Chopra To Madhuri Dixit, Influential People Step Out To Cast Their Vote\nFrom Anil Ambani, Priyanka Chopra To Madhuri Dixit, Influential People Step Out To Cast Their Vote\nThe fourth phase of Lok Sabha elections began on Monday. For 72 Lok Sabha seats, people across 9 states will be voting today. And these include the Bollywood stars as well, who went out to push for a change and vote, because it counts.\nMumbai, the city of dreams and also the city of billionaires, is home to Bollywood stars as well as seven of the India’s 19 richest people including Mukesh Ambani and Uday Kotak. From celebs like Anil Ambani to Priyanka Chopra, Madhuri Dixit, Aamir Khan and Sanajay Dutt, a lot of celebs were seen at polling booths to cast their vote.\n#1\nMumbai: Anil Ambani casts his vote at voting centre number 216 at GD Somani School in Cuffe Parade. #LokSabhaElections2019 pic.twitter.com/II9VZJvjmV — ANI (@ANI) April 29, 2019\n#2\n#Mumbai: Reserve Bank of India (RBI) Governor Shaktikanta Das casts his vote at polling booth number 40 & 41 at Peddar Road. #LokSabhaElections2019 pic.twitter.com/i2TFjtuJxP — ANI (@ANI) April 29, 2019\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 275 SHARES 2.5 K SHARES\n#4\n#5\n#Mumbai: Veteran actor Rekha casts her vote at polling booth number 283 in Bandra. #LokSabhaElections2019 pic.twitter.com/z14VraA06W — ANI (@ANI) April 29, 2019\n#6\n#7\n#Mumbai : BJP sitting MP Paresh Rawal & his wife Swaroop Sampat cast their vote at polling booth number 250-256 at Jamna Bai School in Vile Parle. pic.twitter.com/V4iXvzhD9D — ANI (@ANI) April 29, 2019\n#8\n#Mumbai: Actors Bhagyashree and Sonali Bendre after casting their votes at a polling booth in Vile Parle. #LokSabhaElections2019 pic.twitter.com/cJFwpTtgKA — ANI (@ANI) April 29, 2019\n#9\n#Mumbai: Actor Aamir Khan and his wife Kiran Rao after casting their votes at polling booth in St. Anne's High School in Bandra. #LokSabhaElections2019 pic.twitter.com/jRYwkW8LzX — ANI (@ANI) April 29, 2019\n#10\n#Mumbai: Actor Madhuri Dixit casts her vote at a polling booth in Juhu. #LokSabhaElections2019 pic.twitter.com/6OraiSkWVZ — ANI (@ANI) April 29, 2019\n#11\n#Mumbai: BJP MP candidate from UP's Gorakhpur, Ravi Kishan casts his vote at a polling booth in Goregaon. pic.twitter.com/s9mH0pHLey — ANI (@ANI) April 29, 2019\nWhile these celebs have cast their votes, there are others including Alia Bhatt, Soni Razdan, Akshay Kumar, Jacqueline Fernandez, Deepika Padukone and Katrina Kaif among others who wouldn’t be able to vote in these elections. These celebs do not hold Indian citizenship, and hence, can’t vote.\nVoting is underway for the 17 Lok Sabha constituencies in Maharashtra.", "title": "From Anil Ambani, Priyanka Chopra To Madhuri Dixit, Influential People Step Out To Cast Their Vote", "date_publish": "29/04/2019, 11:40:43", "description": "Mumbai, the city of dreams and also the city of billionaires, is home to Bollywood stars as well as seven of the India’s 19 richest people including Mukesh Ambani and Uday Kotak. From celebs like Anil Ambani to Priyanka Chopra, Madhuri Dixit, Aamir Khan and Sanajay Dutt, a lot of celebs were seen at polling booths to cast their vote. The fourth phase of Lok Sabha elections began on Monday. For 72", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-anil-ambani-priyanka-chopra-to-madhuri-dixit-influential-people-step-out-to-cast-their-vote-366250.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/mumbai_elections_2019_bollywood_celebs_cast_their_vote_in_the_lok_sabha_elections_1556517399_800x420.png"}