{"text": "From Piggyback Ride To Partying With Her Girls, PC's Bachelorette In Amsterdam Looks Fabulous!\nFrom Piggyback Ride To Partying With Her Girls, PC's Bachelorette In Amsterdam Looks Fabulous!\nThe festive season is here, and adding to the glory are celebrities including Deepika Padukone, Ranveer Singh, Priyanka Chopra and Nick Jonas who have more and more reasons to party, rejoice and have fun.\nAfter Deepika Padukone and Ranveer Singh wedding on Nov 14 and 15, our Desi Girl Priyanka Chopra is also planning to get married soon. Her Bachelorette party is not just restricted to one day. She's had several rounds with her girlfriends and we're sure there are still more to come.\nWell, her mother-in-law warned her to “be good” but the girls will for sure have all the fun, and why shouldn’t they?!\nPriyanka Chopra invited her future sister-in-law and Games Of Thrones stars Sophie Turner and bonded quite well in Amsterdam. This video of PC giving Sophie Turner a piggyback ride is a proof!\nDon't Miss 365 SHARES 161 SHARES 12.5 K SHARES 186 SHARES\nWhat’s more? Priyanka Chopra dressed up like a diva in white and with that radiant infectious smile, she is sure giving us #BrideGoals.\nAnd they had a ball!\nPriyanka Chopra is making sure that she has fun with her girl gang, and so joining her among Sophie Turner, Srishti Behl Arya, Tamanna Dutt, Natasha Pal, Chanchal D’Souza and Dana Supnick, is PC’s cousin sister Parineeti Chopra. She’ll soon be in Amsterdam.", "title": "From Piggyback Ride To Partying With Her Girls, PC's Bachelorette In Amsterdam Looks Fabulous!", "date_publish": "05/11/2018, 12:35:22", "description": "Priyanka Chopra's Bachelorette party is on and she is apparently on cloud nine. Priyanka Chopra is making sure that she has fun with her girl gang, and so joining her among Sophie Turner, Srishti Behl Arya, Tamanna Dutt, Natasha Pal, Chanchal D’Souza and Dana Supnick, is PC’s cousin sister Parineeti Chopra. She’ll soon be in Amsterdam.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-piggyback-ride-to-partying-with-her-girls-pc-s-bachelorette-in-amsterdam-looks-fabulous-356063.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/from_giving_sophie_turner_piggyback_ride_to_wearing_a_ball_gown_priyanka_chopras_extended_bachelor_1541399603_800x420.png"}