{"text": "From Hinting About Having Kids To Chilling With AR Rahman, Here’s What Priyanka Chopra Is Up To\nFrom Hinting About Having Kids To Chilling With AR Rahman, Here’s What Priyanka Chopra Is Up To\nOur Desi girl Priyanka Chopra is making waves in the west, especially after she got engaged to the love of her life Nick Jonas. Not only can’t her Indian fans stop gushing about seeing her happy but even the foreign media is quite obsessed with their love story.\nEveryone’s asking the same question – when are Priyanka Chopra and Nick Jonas getting married? However, we feel that the day is quite near when PC and Nick will be seen tying the knot. Talking about Meghan Markle’s pregnancy, PC’s says she needs to catch up.\n“I just have a few of my friends who are having babies right now and I'm like, 'God I need to catch up,” she was quoted as saying by E! News.\nWhat’s more? The diva is having quite a ball in the west. In a span of about just two months, she has travelled from India to London and now she in the US.\nDon't Miss 527 SHARES 106 SHARES 161 SHARES\nShe was in the Las Vagas where she was attending a music festival. There, she was seen bonding with AR Rahman.\nShe introduced Pitbull at the festival. In case you’re forgetting, Pitbull and PC have worked together on Exotic.\nShe looked sexier than ever in this outfit.\nMeanwhile, Priyanka Chopra is also shooting for The Sky Is Pink alongside Zaira Wasim and Farhan Akhtar. For one of the shooting schedules, she was in London recently.\nLounging on a sofa in the most stylish way possible, Priyanka Chopra posted a picture on Instagram and Nick couldn’t stop himself from commenting heart-eyes emoticons and a flame one too on it.\nPriyanka Chopra and Nick Jonas make one hot couple, don’t they?", "title": "From Hinting About Having Kids To Chilling With AR Rahman, Here’s What Priyanka Chopra Is Up To", "date_publish": "21/10/2018, 12:18:17", "description": "Our Desi girl Priyanka Chopra is making waves in the west, especially after she got engaged to the love of her life Nick Jonas. Not only can’t her Indian fans stop gushing about seeing her happy but even the foreign media is quite obsessed with their love story.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-hinting-about-having-kids-to-chilling-with-ar-rahman-here-s-what-priyanka-chopra-is-up-to-355149.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/from_hinting_about_having_kids_to_chilling_with_ar_rahman_heres_what_priyanka_chopra_is_up_to_1540103422_800x420.png"}