{"text": "Mehendi Laga Ke Rakhna, Doli Saja Ke Rakhna! That is the song Ranveer Singh was listening to before he flew from India to his wedding destination Italy along with the love of his life Deepika Padukone. And quite evidently, he couldn’t wait to tie the knot to the love of his life!\nBeaming with happiness and joy, the couple smiled, waved and thanked the fans who congratulated them saying “Shaadi Mubarak”. And now it’s almost time to solemnise their six-year-old relationship. They are getting married on the same day when their first movie Ram-Leela had released in 2013 – the same movie on whose sets the couple fell in love with each other.\nThe wedding celebrations have begun! Singer Harshdeep Kaur and her troup will lend their magical voice to DeepVeer's wedding festivities. Striking a pose outside the Lake Como, she posted a picture all set for a \"beautiful day.\"\nWhat a beautiful day 🌻 pic.twitter.com/fiRQIpCKyg — Harshdeep Kaur (@HarshdeepKaur) November 13, 2018\nThe couple has also exchanged rings. If reports are to be believed, Ranveer-Deepika have officially got engaged in a Konkani style ceremony. It is after the Pooja and exchanging of rings that the fun and dancing began.\nLike a typical desi and filmy Sangeet and Mehendi ceremony, songs like Mehndi Ni Mehndi, Dholak, Kala Shah Kala, Mehendi hai rachney wali were played at Deepika Padukone and Ranveer Singh’s Sangeet ceremony too.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nAccording to India Today, Ranveer Singh entered singing ‘Tune Maari Entriyaan’ and danced with every one thereafter.\nytimg.com\nIn just another day, they’ll be man and wife. Lots and lots of love to you, Deepika Padukone and Ranveer Singh! May you both be blessed with joy and happiness forever!", "title": "From Ring Ceremony To Sangeet, Here’s How Deepika Padukone & Ranveer Singh Celebrated Day 1 Of Wedding Festivities In Italy", "date_publish": "13/11/2018, 20:27:23", "description": "Like a typical desi and filmy Sangeet and Mehendi ceremony, songs like Mehndi Ni Mehndi, Dholak, Kala Shah Kala, Mehendi hai rachney wali were played at Deepika Padukone and Ranveer Singh’s Sangeet ceremony too. According to India Today, Ranveer Singh entered singing ‘Tune maari entriyaan’ and danced with everyone thereafter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-ring-ceremony-to-sangeet-here-s-how-deepika-padukone-ranveer-singh-celebrated-day-1-of-wedding-festivities-in-italy-356609.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/from_sangeet_to_engagement_heres_how_deepika_padukone__ranveer_singh_basked_in_joy_of_wedding_fes_1542128757_800x420.png"}