{"text": "From Adorable Wishes To Cutting Fancy Cakes, Alia Bhatt's Birthday Party Was All Things Love!\nFrom Adorable Wishes To Cutting Fancy Cakes, Alia Bhatt's Birthday Party Was All Things Love!\nAlia Bhatt has turned 26 today and she is celebrating her day with her loved ones which includes her beau Ranbir Kapoor. Last night Bhatt’s close friends and family hosted a small surprise birthday party for her at her residence. Take a look at the inside pictures and videos from the celebration right here.\nTwitter\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 1.7 K SHARES\nAlia’s mom and dad posted adorable pictures from last night's party with lovely captions.\nAlia always acknowledges that Karan Johar made her life by giving her Student Of The Year. And this time too he didn’t disappoint her; he gave her the gift which she will love the most. The director released a new picture of Alia and dedicated it as her birthday gift. How cool is that?\nIt won’t be wrong to say, Alia is right now in the happiest phase of her life, she is thoroughly enjoying both her professional and personal life. All her films right from Raazi to Gully Boy were a massive hit and now she is all set for Kalank, Brahmastra and SS Rajamouli’s film. If we talk about her personal life, she spoke about it on Koffee With Karan season 6 and made it very clear that she is dating the heartthrob of bollywood.\nTwitter\nApart from her friends and family, B-town members too shared their lovely wishes for Alia, right from Rani Mukerji, Varun Dhawan to Katrina Kaif, wished the gorgeous actress on her birthday.\nInstagram\nHappy Birthday, Alia! Hope you continue to entertain us with your amazing performances with every passing year.", "title": "From Adorable Wishes To Cutting Fancy Cakes, Alia Bhatt's Birthday Party Was All Things Love!", "date_publish": "15/03/2019, 14:13:11", "description": "Alia is right now at the happiest phase of her life, she is thoroughly enjoying both her professional and personal life. All her films right from Raazi to Gully Boy is a massive hit and now she is all set for Kalank, Brahmastra and SS Rajamouli’s film. While talking about her personal life, she spoke about it on Koffee With Karan season 6 and made it very clear that she is dating the heartthrob o", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/from-adorable-wishes-to-cutting-fancy-cakes-alia-bhatt-s-birthday-party-was-all-things-love-363772.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/alia_1552640795_800x420.jpg"}