{"text": "From Calling Tanushree A Man To Accusing Her Of Rape, Rakhi Sawant Has Completely Lost The Plot\nFrom Calling Tanushree A Man To Accusing Her Of Rape, Rakhi Sawant Has Completely Lost The Plot\nBollywood actress Rakhi Sawant is known for being a motormouth. For the past couple of years, she was silent before she discovered Instagram and then all hell broke loose. People who follow her on social media know the hilarious and provoking videos she puts on. Take a quick look.\nBollywood celebrities like Ranveer Singh, Taapsee, Masaba Gupta and Fatima Sana Shaikh follow her and are entertained by her videos. This time around, Rakhi resurfaced back into news after Tanushree Dutta put sexual harassment allegations on Nana Patekar.\nThe incident that happened during a movie set (Horn Ok Pleassss) during the shooting of an item song shook the entire nation after Tanushree claimed that Nana Patekar harassed her in 2009.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAfter the much chaotic episode, Rakhi was roped in for the song. After Tanushree came into light again last month with her claims on Nana Patekar, Rakhi too didn't skip a moment to grab the little limelight.She has become active on her Instagram like never before.\nIn one of the videos, Rakhi says she would file a defamation case against Tanushree. Here's why.\nBut this time, Rakhi took it too far. After her explosive videos on social media, Rakhi called the media for a press conference and said the most outrageous things ever. Listen in.\n“Woh LESBIAN hai aur usne mera RAPE kia: “ #RakhiSawant ’s SHOCKING claims about #TanushreeDutta pic.twitter.com/qWrUOHPDqn — Bollywood Hungama (@Bollyhungama) October 24, 2018\nShe has accused Tanushree of raping her and called the movement \"she to she\". Rakhi even said that Tanushree has got a short hair cut because of she's a man. Needless to say, her comments have generated a lot of reactions and Twitterati is in ''úghhh'' of her.\nKaunsi mata aa gyi hai iske upar 🤦 — Aarohi Tripathy 🇮🇳 (@aarohi_vns) October 24, 2018\n😂😂😂.... she pulled the last straw in the #metoo movement... — Chinmay Vartak (@chi_vart) October 24, 2018\nWas feeling stressed depressed from last few days....this video has rejuvenated me again.....dukhi logon ki saathi Rakhi ji huamari....😂😜 — Saurabh sharma (@15saurabhSharma) October 24, 2018\nLol..She is the real comedian artist of the country.Why Rohit Shetty is not giving her break ? ..btw her paloo on head while explaining her rape is adding masala on the scene 🤦🤦🤦 — Shivali Bhat (@BhatShivali) October 24, 2018\nKoi iski shaadi Kamaal R khan se karwa do pliss 😭😭😭 — Perfect Errorist (@TheNitishaDixit) October 24, 2018\nThere ain't no on like Rakhi, after all.", "title": "From Calling Tanushree A Man To Accusing Her Of Rape, Rakhi Sawant Has Completely Lost The Plot", "date_publish": "25/10/2018, 12:13:49", "description": "Bollywood actress Rakhi Sawant is known for being a motormouth. For the past couple of years, she was silent before she discovered Instagram and then all hell broke loose. People who follow her on social media know the hilarious and provoking videos she puts on. Take a quick look. Bollywood celebrities like Ranveer Singh, Taapsee, Masaba Gupta and Fatima Sana Shaikh follow her and are entertained", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/from-calling-tanushree-a-man-to-accusing-her-of-rape-rakhi-sawant-has-completely-lost-the-plot-355409.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/rakhi_1540449211_800x420.jpg"}