{"text": "From Tupac To Eminem, Here's Every Rapper That Inspired Ranveer Singh To Prepare For Gully Boy\nFrom Tupac To Eminem, Here's Every Rapper That Inspired Ranveer Singh To Prepare For Gully Boy\nRanveer Singh's rapper avatar in Gully Boy has got all of us excited. After roles like Khilji and Simmba, the actor is again in a completely different territory, experimenting with films yet again!\nDuring a recent interview, the actor confessed his affinity towards the genre since his childhood and his love for Eminem's music.\nIn a statement to IANS, Ranveer said,\n\"Hip-hop is something that's very alive inside me and always has been ever since I was a kid. I have a natural affinity and inclination towards it and I was thrilled to be in Zoya's film because I had always wanted to do such a film.\"\nTalking about Gully Boy, he added,\n\"I think I was in Class 3 or 4 when I first got into hip-hop. I loved listening to Snoop Dogg, Tupac Shakur, The Notorious B.I.G, while growing up and I have been into that kind of music ever since. I used to watch a lot of MTV and that's where I first experienced it. There is a cousin of mine who migrated to the US and whenever he used to come down for summer holidays, he used to bring this music and we used to sit and hear it all the time.\"\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nHe said that Rap legends Tupac and Eminem have inspired Ranveer, shaping up the 'hip-hop artiste' in him. He added,\nAgencies\n\"I think Tupac's All Eyez on Me was the first album that I had mugged up. And when Eminem made his debut... he completely blew my mind. I followed his music very closely and he became one of my most favourite artistes of all time.\"\nKnown for his eclectic sense of fashion, some of Ranveer's earlier looks were also inspired by the rappers. \"I used to go through phases where I used to dress like rappers - wear baggy jeans, oversized jerseys.\"\n(With agency inputs)", "title": "Here's Everything That Inspired Ranveer Singh To Prepare For Gully Boy", "date_publish": "23/01/2019, 17:25:16", "description": "Ranveer Singh said,\"Hip-hop is something that's very alive inside me and always has been ever since I was a kid. I have a natural affinity and inclination towards it and I was thrilled to be in Zoya's film because I had always wanted to do such a film.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-tupac-to-eminem-here-s-every-rapper-that-inspired-ranveer-singh-to-prepare-for-gully-boy-360934.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_1548244174_800x420.jpg"}