{"text": "2018 has been a roller coaster ride for Bollywood. Who would have imagined that #MeToo will finally strike the industry and a lot of big names including Sanskari man Alok Nath, Sajid Khan and Nana Patekar will be accused of sexually harassing their co-stars and other aspiring actors?\nEven the fact that big banner films starring the A-listers of Bollywood would fail miserably at the box office was unpredictable. 2018 proved that Salman Khan can’t fool his fans anymore and Mr. Perfectionist Aamir Khan can also fail to impress his audiences despite leaving no-stone-unturned. In fact, things aren't looking bright for King Khan. SRK's Zero has hit the silver screens recently and hasn't received a good response.\nOn the other side, with the rise of streaming platforms such as Amazon Prime and Netflix, Indian audiences witnessed great content that otherwise they only expected from foreign markets, especially Hollywood. The fact that Sacred Games made waves all over the world and Mirzapur enticed the audiences quite much, content turned out to be the king in 2018. After all, films like Andhadhun and Badhai Ho won more praises than Thugs Of Hindostan.\nHere are some of the performances that left us all stunned.\n1. Gajraj Rao and Surekha Sikri in Badhaai Ho\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nGajraj Rao has already won a trophy for his performance as Jeetender Kaushik in Badhaai Ho. The man is blessed with a face that looks naturally confused and perplexed as if he is hiding a secret or a bad news. With his distinct expressions, he tickled our funny bones. Badhaai Ho was a game changer for Gajraj Rao.\nPlaying the role of a nagging grandma, Surekha Sikri proved that age is just a number. At 70, she nailed the role by sending us all in a laughter riot with each of her dialogues.\n2. Jaideep Ahlawat in Raazi\nApart from Vicky Kaushal and Alia Bhatt, who are already winning praises for their roles, Jaideep Ahlawat, who has otherwise been playing villainous roles in movies like Gangs of Wasseypur – Part I, Commando: A One Man Army and Raees, stood out with his performance as RAW Agent.\n3. Kubbra Sait (Kuckoo), Jatin Sarna (Bunty), Jitendra Joshi (Katekar) and Neeraj Kabi (DCP Parulkar) In Sacred Games\nWith Netflix India launching its original series on the platform, audiences all over the world got a taste of Indian local gangster drama. Apart from Nawazuddin Siddiqui (Ganesh Gaitonde) and Saif Ali Khan (Inspector Sartaj Singh), a lot of other actors got their ticket to stardom. Kubbra Sait who played Kuckoo did her job so well that people actually asked her if she was a transgender. Jatin Sarna AKA Bunty also gave a brilliant performance. And Katekar played by Jitendra Joshi actually left fans teary-eyed.\n4. Abhishek Banerjee in Stree\nWe are not denying that Pankaj Tripathi, Rajkummar Rao or Aparshakti Khurana did a great job with their respective roles. But the one that was a surprise package was Abhishek Banerjee. The man left us all giggling throughout the movie with his crazy and funny antics.\n5. Mrunal Thakur in Love Sonia\nOne of the most underrated movies of 2018, Love Sonia was made on a topic that mirrored reality – human trafficking. With a star-studded cast that included Richa Chaddda, Rajkummar Rao, Manoj Bajpayee, Anupam Kher, Adil Hussain, Freida Pinto among others, the movie based on real incidents won praises even abroad. Mrunal Thakur, who played the titular role of 17-year-old who enters the big bad world of prostitution to search for her sister made several heads turn.\n6. Vicky Kaushal In Sanju\nThe hype around Sanjay Dutt’s biopic began when Ranbir Kapoor’s look as the star was leaked. Sanjay Dutt has seen many ups and downs in his tumultuous life, and that indeed made audiences excited. But it is only after watching the movie, Vicky Kaushal’s performance as his best friend Kamli that became the talk of the town. He portrayed the role so well that people wanted to know who this character in real life was. And since then, there has been no looking back for Vicky Kaushal.\nAlso Read: Meet Sanjay Dutt's Best Friend, Paresh Ghelani AKA 'Kamli', Played By Vicky Kaushal In ‘Sanju’\n7. Radhika Madan in Pataakha\nRadhika Madan who has earlier acted on small screen in shows including Meri Aashiqui Tum Se Hi (playing the role of Ishani) won the hearts of the audiences so much that she already has been tagged as the most promising newcomer at Star Screen Awards. She totally excelled in this quirky drama.\n8. Rajkummar Rao in Omerta\nRajkummar Rao has given many brilliant performances this year – including the one in Stree where he experimented by being a part of horror comedy, a genre that is relatively new to the Indian audiences – but his performance in Omerta (a movie based on British terrorist of Pakistani descent Omar Saeed Sheikh responsible for a number of mass massacres and murder of Wall Street Journal reporter Daniel Pearl) was par excellence.\n9. Kiara Advani in Lust Stories\nPlaying the role of a simple girl who is stuck in an unsatisfactory relationship, Kiara Advani struck the right chords with the audiences and left them in awe of her performance. Also, breaking stereotypes, she performed a masturbation scene that sure grabbed a lot of eyeballs but at the same time won her applause from fans as well as critics.\n10. Ishaan Khatter in Beyond The Clouds\nIshaan Khatter might have made his Bollywood debut with Dhadak, but not many people know that he forayed into the world of films with Iranian filmmaker Majid Majidi’s Beyond The Clouds. His first performance was indeed better than the second one.\n11. Vineet Kumar Singh in Mukkabaaz\nAfter playing several unnoticed roles, Vineet Kumar gained much-deserved recognition with films like Gangs of Wasseypur, Ugly, Daas Dev and Bombay Talkies. Finally, this year he made his debut as a lead actor in an Anurag Kashyap film titled Mukkabaaz, and he was welcomed with open arms and applause.\nWhile all these actors surprised us all with their impeccable performances, there were others including Ayushmann Khurrana (Badhaai Ho and Andhadhun), Ranbir Kapoor (Sanju), Nawazuddin Siddiqui (Manto and Sacred Games), Rani Mukerjee (Hichki) and Alia Bhatt (Raazi) that deserve applause. It won’t be fair to not mention them.\nIf any other actor’s performance left you in awe, tell us about it in the comments section below.", "title": "From Gajraj Rao To Kubbra Sait, 11 Path-Breaking Performances Of 2018 That Are Applause-Worthy", "date_publish": "23/12/2018, 17:38:26", "description": "2018 has been a roller coaster ride for Bollywood. Who would have imagined that #MeToo will finally struck the industry and a lot of big names including Sanskari man Alok Nath, Sajid Khan and Nana Patekar will be accused of sexually harassing their co-stars and other aspiring actors. From Gajraj Rao To Kubbra Sait, 11 Path-Breaking Performances Of 2018 That Deserve Applauses", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-gajraj-rao-to-kubbra-sait-11-path-breaking-performances-of-2018-that-are-applause-worthy-358837.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/from_gajraj_rao_to_kubbra_sait_11_pathbreaking_performances_of_2018_that_deserve_applauses_1545127403_800x420.jpg"}