{"text": "From Shah Rukh To Aamir, Celebs Make A Glitzy Appearance At Akash Ambani-Shloka Mehta’s Wedding\nFrom Shah Rukh To Aamir, Celebs Make A Glitzy Appearance At Akash Ambani-Shloka Mehta’s Wedding\nAfter Isha Ambani and Anand Piramal’s wedding which took place last year, it is time for Mukesh Ambani and Nita Ambani’s son Akash Ambani to tie the knot with his fiancée Shloka Mehta.\nAlso read: Photos From Akash Ambani & Shloka Mehta's Fairytale Wedding Are Finally In & They're Beautiful\nThe wedding celebrations had begun last month itself when the Amabanis along with their 300 guests flew to Switzerland for a pre-wedding bash. It was a star-studded affair.\nFor the wedding, the celebrations have already begun. Bollywood stars have started arriving at the venue. From Shah Rukh Khan and Aamir Khan to Ranbir Kapoor and Karan Johar, these pictures will give you a glimpse of how everyone made a glitzy appearance at the venue. Take a look!\n#1\nViral Bhayani\n#2\n#3\nViral Bhayani\nDon't Miss 468 SHARES 343 SHARES 247 SHARES 555 SHARES 699 SHARES\n#4\nViral Bhayani\n#5\nViral Bhayani\n#6\nViral Bhayani\n#7\n#8\n#9\nAkash Ambani and Shloka Mehta will soon tie the knot at Jio World Centre in Bandra Kurla Complex.\nAlso Read: Photos From Akash Ambani & Shloka Mehta's Fairytale Wedding Are Finally In & They're Beautiful", "title": "From Shah Rukh To Aamir, Celebs Make A Glitzy Appearance At Akash Ambani-Shloka Mehta’s Wedding", "date_publish": "09/03/2019, 18:34:22", "description": "After Isha Ambani and Anand Piramal’s wedding which took place last year, it is time for Mukesh Ambani and Nita Ambani’s son Akash Ambani to tie the knot with his fiancée Shloka Mehta. The wedding celebrations had begun last month itself when the Amabanis along with their 300 guests flew to Switzerland for a pre-wedding bash. It was a star-studded affair.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-shah-rukh-to-aamir-celebs-make-a-glitzy-appearance-at-akash-ambani-shloka-mehta-s-wedding-363446.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/from_srk_to_ranbir_kapoor_celebs_make_glitzy_appearance_at_akash_ambanishloka_mehtas_wedding_1552135747_800x420.png"}