{"text": "Sai Tamhankar is one of the most gorgeous actresses in Marathi film Industry. She is not only a huge name in regional cinema but also a popular face in Bollywood. She left the audiences stunned with her bold character in Hunterrr (2015). Indiatimes had a candid conversation with the actress where she spoke about the industry's pros and cons.\nShe Is Flamboyant And Carefree\nWe asked Sai if she ever gets affected by the judgments or trolling due to her bold choices in cinema, to which she said, “ I have been flamboyant and carefree since a child, so I think that reflects in my projects, it is in my personality. I also feel people who are self-made, who have started their journey from scratch are fearless because they have nothing to lose.”\nTwitter\nSai Expected To Be Judged After Doing Hunterrr\nSai left everyone stunned with her bold character in Hunterrr, she gained fame instantly with this film in Bollywood, we asked her if she wasn’t worried about being judged, she said, “ I expected that I will be judged, so why should I waste my time overthinking something that is going to happen, I don’t let my decision get hampered by thinking what others will think. Second best part about Hunterrr’s character is that there is such kind of women, they are very much part of this society, you hate them, love them but you can’t ignore them. When I got Hunterrr, I immediately thought who would portray that character because that is ethically wrong what she does, and that is why I did it immediately because these are the complexities you get to live onscreen and that’s the beauty of acting.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nShe Is More Than Just A Bold Actress\nSai is extremely optimistic in life, she says she is more than just a bold actress, “On daily basis I am called this bold or hot actress, but I don’t mind getting tagged because I am more than that and I know it and I try to convey that through cinema. I think slowly people too have understood that there is something more in me than just being bold and beautiful. I just want to prove to the audience that Sai is more than just bold and beautiful.”\nTwitter\nWas Asked To Sleep With Producer And Director For A Film\nWe quizzed Sai if sexual harassment exists in Marathi Industry too, to which she said, “ Here everyone is like a family. I haven’t experienced any sexual abuse in the industry, but yes I had got a call many years ago which said, “ Ok there is this project and you have to sleep with the producer and the director, generally it’s the producer, director, and hero, but since it’s only you in the film, so it’s just the producer and director”. I took a dramatic pause after listening to all this and then I told him, ‘ Why don’t you send your mother?’. He went speechless, I think I answered him in a way that he understood he is messing with a wrong person. This was for some film, he didn’t specify the language of the film, but this was his condition.”\nShe further added, “When he asked me such a question it clearly meant that people are ready to do such things to get work and it is very sad.”\nInstagram\nLearnings From 2018\n\"I think one thing I learned for sure is that trolling and judging has become a huge part of our lives and these petty things shouldn’t be given huge importance, but we are so influenced by social media platforms that we can probably stay without food but not without posting a snap on Instagram. It has gone that bad; I just want to tell people to detox a little bit, live life to the fullest. We have just one life then why should we let all these unnecessary judgments affect you.”\nTwitter\nAdvice To Self\nSai is one optimistic person and this is the advice she would like to give her 18-year-old self, “Don’t lose your innocence, there will be 100 distractions that will tell you to be calculative, but stick to yourself, be confident, we are here to take charge of our life and not otherwise”.\nSai is surely an inspiration for all her fans and followers.", "title": "Sai Tamhankar Reveals She Was Asked To Sleep With A Producer And Director To Get A Film", "date_publish": "25/12/2018, 12:35:02", "description": "Sai Tamhankar is one of the most gorgeous actresses in Marathi Industry. She is not only a huge name in regional cinema but also a popular face in Bollywood. She left the audiences stunned with her bold character in Hunterr (2015). Indiatimes had a candid conversation with the actress where she made a shocking revelation.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/from-casting-couch-to-handling-trolls-sai-tamhankar-recounts-everything-she-learned-this-year-359172.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sai_1545638137_800x420.jpg"}