{"text": "From Posing With SRK To Calling Him A 'Legend', DJ Snake Fanboying Over King Khan Is All Of Us!\nFrom Posing With SRK To Calling Him A 'Legend', DJ Snake Fanboying Over King Khan Is All Of Us!\nHave you all been grooving to Taki Taki and Magenta Riddim at the clubs? If not, then you must have tripped over songs like Let Me Love You and Lean On. The man behind these songs – French DJ and record producer DJ Snake is in Mumbai for an event, and guess who he met – the King of Bollywood, Shah Rukh Khan.\nedmchicago.com\nWhen Shah Rukh Khan spreads his arms, we are all left swooning, right? His charismatic personality can charm almost everyone, including DJ Snake, who got clicked with him in the Indian pose of Namaste. As he shared the picture online, he captioned it as “Legend”.\nWhen the two stars posed together, fans lost their calm!\nAfter seeing this picture, fans couldn’t control their excitement. Take a look. Also, aren’t you loving what DJ snake is wearing?\nFuckin legendary picture 🇮🇳🇫🇷 — G (@jain11gaurav) March 22, 2019\nDon't Miss 1 K SHARES 343 SHARES 5.7 K SHARES 555 SHARES\nFrench legend with Indian legend\nKing Khan — TEAM DJ SNAKE (@DjSnakeIndia11) March 22, 2019\n2 legend in single fream 😍♥ — GANPAT🚩🚩 (@Maliganpat6) March 22, 2019\nOMG 😳😳😳😳😳😳\nReally I m watching you two together 😳😳😳 — Chowkidar Sushma Shaw (@SushmaShaw8) March 22, 2019\n@mayer_doi\nOsm picture...Global Icon International Greatest Actor Baadshah of Bollywood Creativity Romance Legend Of Acting Of Indian Cienma Industry King SRK with brilliant DJ Snake 🌟🌟🌟🌟🌟 — Mayer Doi@ferdbouk (@mayer_doi) March 22, 2019\nWhat’s more? Dilbar fame Nora Fatehi also met with the international sensation. And now rumours are rife that these two might be collaborating soon.\nHappy happy holi everyone!!! It was an epic one! ❤️🥰🇮🇳 pic.twitter.com/wihXwLqcSC — Nora Fatehi (@Norafatehi) March 21, 2019\nIt’s going to be fun to see Nora shaking a leg on DJ Snakes’ tunes, don’t you agree?", "title": "From Posing With SRK To Calling Him A 'Legend', DJ Snake Fanboying Over King Khan Is All Of Us!", "date_publish": "23/03/2019, 11:39:36", "description": "Have you all been grooving to Taki Taki and Magenta at the clubs? You, for sure, must be tripping over songs like Let Me Love You and Lean On? The man behind these songs – French DJ and record producer DJ Snake is in Mumbai for an event, and guess who he met – the King of Bollywood, Shah Rukh Khan!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-posing-with-srk-to-calling-him-a-legend-dj-snake-fanboying-over-king-khan-is-all-of-us-364162.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/dj_snake_calls_shah_rukh_khan_a_legend_as_they_pose_together__fans_cant_control_their_excitement_1553318331_800x420.png"}