{"text": "From Eating At A Dhaba To Doing 'Shramdaan' On Maharashtra Day, Aamir Khan Is Winning Hearts!\nFrom Eating At A Dhaba To Doing 'Shramdaan' On Maharashtra Day, Aamir Khan Is Winning Hearts!\nOn Maharashtra Day and May day on Wednesday, Bollywood actor-producer Aamir Khan indulged in a voluntary contribution of labour in the state's Koregaon Taluka of Satara district, along with his wife Kiran Rao.\nYou must be living under a rock if you are unaware of the fact that the actor has been extensively towards improving the water situation in Maharashtra through his NGO Paani Foundation.\nToday, he took to social media on Wednesday to share photos of him and his wife Kiran Rao. Apart from enjoying a quick little break.\nKhan took to his social media accounts to share pictures of him and Kiran eating ‘bhel puri’ off a newspaper and drinking sugarcane juice at a local ‘dhaba’ in Zhawadarjun, a village in Maharashtra.\nThe couple also posed with the staff of the dhaba as everyone flashed smiles for the pictures. Both Aamir and Kiran were accompanied by Jalamitras who came forward to help Aamir and his non-profitable organisation, Paani Foundation.\nDon't Miss 6.3 K SHARES 241 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nAfter receiving a warm welcome, Aamir Khan headed to a certain location and started digging the ground for 'shramdaan'. He got support from villagers who also got inspired and joined him in the activity, according to a statement on his behalf.\nOn the professional front, 54-year-old actor Aamir Khan will be seen in Lal Singh Chaddha, the official Hindi remake of Tom Hanks’ 1994 blockbuster Forest Gump. The film will be directed by Advait Chandan, who had previously worked on Secret Superstar.", "title": "From Eating At A Dhaba To Doing 'Shramdaan' On Maharashtra Day, Aamir Khan Is Winning Hearts!", "date_publish": "01/05/2019, 18:12:14", "description": "On Maharashtra Day and May day on Wednesday, Bollywood actor-producer Aamir Khan indulged in a voluntary contribution of labour in the state's Koregaon Taluka of Satara district, along with his wife Kiran Rao. You must be living under a rock if you are unaware of the fact that the actor has been extensively towards improving the water situation in Maharashtra through his NGO Paani Foundation.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-eating-at-a-dhaba-to-doing-shramdaan-on-maharashtra-day-aamir-khan-is-winning-hearts-366424.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/aamir_khan_1556708108_800x420.jpg"}