{"text": "From Skirts To Street-Style, Ranveer Singh Couldn't Care Any Less About The Fashion Police!\nFrom Skirts To Street-Style, Ranveer Singh Couldn't Care Any Less About The Fashion Police!\nGully Gully mein shor hai… Ranveer Singh super humare dil ka chor hai!\nYes it's a bit cliched but we can't help but say that! After all, Ranveer Singh is one actor who is not ashamed to sport his eccentric-fashion sense like a boss. Each time he makes a public appearance, he makes several heads turn with fashion game. Like it or not, you just cannot ignore Ranveer Singh, can you?\nRanveer Singh has taken his fashion game a notch higher especially during the promotions of his forthcoming film Gully Boy. Just like how the film gives us a crazy and energetic vibe, Ranveer Singh is also trying to reflect the same through his outfits. He even called himself “faalooda” mocking his own fashion choice.\nRanveer Singh is a dream come true for every designer. After all, he can pull off any attire with utmost confidence and panache. If you have any doubt, these pictures below are a proof that Ranveer Singh “jaisa koi hai-ich nahi hai!”\n#1 Gully Boy meets Simbba the tiger!\n#2 As Ranveer Singh said, here's his Faalooda outfit.\n#3 With this one, he has taken fashion game a notch higher!\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n#4 Mr. Super Cool!\n#5 We simply love that pose!\n#6 He took his fashion game to the Berlin Film Festival as well!\n#7 Meet Cheeteshwar Ranveer Singh!\n#8 He was literally shining bright like a diamond at the music launch of Gully Boy!\n#9 He will bring back the bucket hat trend back!\n#10 Funky outfits are Ranveer Singh's BFFs\nRanveer Singh ‘Jaisa Koi Hai-Ich Nahi Hai’! Hai Kya?\nGully Boy is slated to release on Feb 14.", "title": "From Skirts To Street-Style, Ranveer Singh Couldn't Care Any Less About The Fashion Police!", "date_publish": "09/02/2019, 12:03:35", "description": "Ranveer Singh has taken his fashion game a notch higher especially during the promotions of his forthcoming film Gully Boy. Just like how the film gives us a crazy and energetic vibe, Ranveer Singh is also trying to reflect the same through his outfits. He even called himself “faalooda” mocking his own fashion choice. Ranveer Singh is dreams come true for every designer. After all, he can pull of", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-skirts-to-street-style-ranveer-singh-couldn-t-care-any-less-about-the-fashion-police-361827.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/these_xyz_pics_from_gully_boy_promotions_prove_that_ranveer_singh_jaisa_koi_hardich_nahi_hai_1549691727_800x420.png"}