{"text": "From Wedding Date To Nick’s Name, These Pics Show Everything That Was Embroidered On PC’s Gown!\nFrom Wedding Date To Nick’s Name, These Pics Show Everything That Was Embroidered On PC’s Gown!\nIt was love at first sight. The first time Nick Jonas met with Priyanka Chopra, he went down on one knee. Their whirlwind romance grabbed a lot of eyeballs, made people gush and left several swooning over the love story of our desi girl with American singer.\n“Will you make me the happiest man in the world and marry me?” – that’s what Nick Jonas said when he proposed to the love of his life Priyanka Chopra. The diva was silent for 45-seconds. She was indeed left speechless. “I’m going to put this ring on your finger now unless you have any objections,” he then said.\nThat sounds like a fairytale, doesn’t it? And why not? Our desi girl deserves all the love. She is happily married to Nick Jonas and is living the best time of her life.\nNick Jonas in an interview to etonline.com recently said that she is a partner for life. “It was kind of an instant thing. I knew once we locked in together that I had a partner for life and a teammate, someone I could walk through the good times and the bad times with, and that was the key.”\nTwitter\nThe lovebirds tied the knot in Jodhpur’s Umaid Bhawan. It was a hush-hush affair, but still, people got to see glimpses from the wedding. But we haven’t seen it all.\nSome unseen pictures are doing the rounds on social media. Take a look!\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nThis one video, which took us by surprise, shows what all was embroidered on Priyanka Chopra’s gown that had 75-feet long veil. From their wedding date to Nick Jonas’ name, here’s everything that was embroidered on the gown.\nIsn’t love the sweetest thing?", "title": "From Wedding Date To Nick’s Name, These Pics Show Everything That Was Embroidered On PC’s Gown!", "date_publish": "04/01/2019, 17:51:55", "description": "The lovebirds tied the knot in Jodhpur’s Umaid Bhawan. It was a hush-hush affair, but still people got to see glimpses from the wedding. But we haven’t seen it all. Some unseen pictures are doing the rounds on social media. Take a look! This one video, which took us by surprise, shows what all was embroidered on Priyanka Chopra’s gown that had 75-feet long veil. From their wedding date to Nick J", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-wedding-date-to-nick-s-name-these-pics-show-everything-that-was-embroidered-on-pc-s-gown-359861.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/from_wedding_date_to_nicks_name_these_unseen_pics_show_what_all_was_embroidered_on_pcs_gown_1546602871_800x420.png"}