{"text": "Californians are going through a really hard time. For the uninitiated, thousands of the people living in Southern California lost their homes to the blaze that broke out on Thursday. The Woolsey Fire, has already burned 91,572 acres of land, claimed many lives and left several stranded as an estimated 370 homes as of Monday morning, have been burnt to ashes, according to the California Department of Forestry and Fire Protection.\nAFP\nAs for Northern California, the Camp Fire near Oroville has torched 111,000 acres, killed 42 people and destroyed 6,453 homes as of Sunday evening, reported Cal Fire. The first responders are battling blazes on both ends of the state popularly called as the Town Of Paradise.\nAt this very moment, three fires - The Woolsey Fire, The Camp Fire and The Hills Fire are blazing across the US state of California. The reason? Dry underbrush, combined with winds and hot temperatures became the perfect breeding ground for fires to ignite. While the exact cause is still unknown, the seasonal Santa Ana winds have been spreading the flames rapidly.\nDon't Miss 173 SHARES 2.3 K SHARES 222 SHARES 12.5 K SHARES 5.5 K SHARES\nAFP\nNow, not only the public but the wildfire has forced celebrities to flee from the flames that have destroyed many homes and forced an evacuation of Malibu.\nHere’s a quick dekho of every celeb/filming set that has been affected by the tragedy:\n1. Gerard Butler\ninstagram\nUpon returning to his Malibu home on Sunday, November 11, Gerard Butler was devastated to find his property completely destroyed. He took to his social media accounts to post a picture of his burnt home. He wrote,\n\"Returned to my house in Malibu after evacuating. Heartbreaking time across California. Inspired as ever by the courage, spirit and sacrifice of firefighters. Thank you @LAFD. If you can, support these brave men and women at SupportLAFD.org .”\n1/2 Driving around Point Dume on Saturday. My heart aches for all those who lost their homes and their lives in California. I was one of the lucky ones, my home was only partially destroyed. A lot of people lost everything and will have to rebuild from scratch. (tweet continued) pic.twitter.com/cS4UTlRR00 — Gerard Butler (@GerardButler) November 12, 2018\n2. Miley Cyrus\nOn Monday, songstress Miley Cyrus tweeted that her $2.5 Million Malibu mansion has been charred by the fire. It was the very same house that she had purchased with her fiance Liam Hemsworth in 2016. However, she also expressed gratitude that her animals and the Love Of Her Life (Liam) made it out safely and that’s the only thing that matters after all.\nCompletely devestated by the fires affecting my community. I am one of the lucky ones. My animals and LOVE OF MY LIFE made it out safely & that’s all that matters right now. My house no longer stands but the memories shared with family & friends stand strong. I am grateful for — Miley Ray Cyrus (@MileyCyrus) November 12, 2018\nall I have left. Sending so much love and gratitude to the firefighters and LA country Sheriff’s department! If you are interested in getting involved see next tweet....\nDonate $ , Time , Supplies\nI love you more than ever , Miley — Miley Ray Cyrus (@MileyCyrus) November 12, 2018\n3. Caitlyn Jenner\nJenner took to Instagram to announce that she, her friend Sophia Hutchins and her dogs have been safely evacuated by the fire department from her Malibu home.\n4. Khloe Kardashian\ninstagram\nKhloe and her baby girl True had to evacuate their home a couple of days back. She has been staying with her brother Rob Kardashian since then. She went on to share scary images of the fire on her social media accounts.\n5. Kim Kardashian\nKim and her family had to evacuate her Hidden Hills home. They had an hour to pack up their things. To update her fans about her safety, she took to Instagram to post a picture of herself and Khloe’s daughter True and captioned it as, “We are all safe and that’s all that matters”.\nI heard the flames have hit our property at our home in Hidden Hills but now are more contained and have stopped at the moment. It doesn’t seems like it is getting worse right now, I just pray the winds are in our favor. God is good. I’m just praying everyone is safe 🙏🏼 — Kim Kardashian West (@KimKardashian) November 9, 2018\n6. Lady Gaga\nThe A Star Is Born actress and singer Lady Gaga left her Malibu Mansion on Friday morning and posted an emotional tweet expressing her solidarity with everyone who is affected by the fire. She wrote,\n\"I am thinking so deeply for everyone who is suffering today from these abominable fires & grieving the loss of their homes or loved ones. I’m sitting here with many of you wondering if my home will burst into flames. All we can do is pray together & for each other. God Bless You.\"\nI am thinking so deeply for everyone who is suffering today from these abominable fires & grieving the loss of their homes or loved ones. I’m sitting here with many of you wondering if my home will burst into flames. All we can do is pray together & for each other. God Bless You. — Lady Gaga (@ladygaga) November 10, 2018\ninstagram\nGaga then visited the Red Cross shelter on Sunday to meet the stranded people. She also tweeted to President Donald Trump, saying “You continue to make it clear you care for no one other than yourself.” She also urged Trump to “show some compassion for the people of California.”\n.@realDonaldTrump I knew this before, but you continue to make it clear you care for no one other than yourself. Mr. President show some compassion for the people of California and set an example of kindness for this country. #BeKind #Kindness #CaliforniaFire — Lady Gaga (@ladygaga) November 12, 2018\n7. Orlando Bloom\nOrlando posted a scary image of his street which looks like it has been gulped by the flames. He wrote,\"this is my street as of two hours ago praying for the safety of all my malibu fam, grateful to our brave firefighters please stay safe 🙏🏼\"\n8. Robin Thicke\nAccording to his representative, Robin Thicke’s Malibu home got burned down entirely.\nRobin Thicke/Instagram\nThe 41-year-old Blurred Lines singer took to Instagram to express his gratitude to the volunteers and the firefighters. He also announced that his girlfriend and his two kids are “safe and surrounded by friends and family”.\n9. The Bachelor Mansion\nThe mansion where the reality TV series The Bachelor is generally shot has been partially burned down according to several reports. Fortunately, the current cast and crew members weren’t in the mansion as they have been filming abroad for the current season.\n10. Westworld Set\nSad for fans of @WestworldHBO and shows like Dr Quinn Medicine Woman, the Paramount Ranch western town movie set has burned to the ground in the Woolsey Fire @CBSLA #westworld #Woolseyfire pic.twitter.com/DhZWaGbr6g — John Schreiber (@johnschreiber) November 9, 2018\nAccording to a TMZ report, the sets of popular HBO series WestWorld has been completely burned down by the fire. All the buildings on the set have been charred to bits.\n11. Jessica Simpson\nJessica and her family were evacuated on Friday. She posted a picture from the scene with the caption, \"Praying for everyone in California affected by these terrible fires. We have been evacuated for almost 48hrs now and need the angels to keep surrounding our home. Thank you to the brave firefighters who have protected our home so far. 🙏🏻”\n12. Charlie Sheen\nThe Two and A Half Men star is far away from the fires. However, he posted an SOS on his social media handles because his parents were untraceable after they got evacuated by the wildfires.\ni cannot\nget ahold of\nmy parents,\nMartin and Janet Sheen.\nthey\nare in the\ngroup, at the\nstaging ground\nnear Zuma Beach.\nif\nanyone\nhas eyes on\nthem,\nplease let me\nknow that they\nare safe and sound\nin the middle of\nthis horrific scenario.\nthank you\nin advance.\nxox\n©️ — Charlie Sheen (@charliesheen) November 10, 2018\nThankfully, his father Martin Sheen told a TV channel on Friday that he and his wife were safe, but their Malibu home had probably been destroyed and the couple probably would be sleeping in their car that night.\n13. Liam Payne\nThe former One Direction member and singer Liam Payne’s home is said to be in danger of catching fire. He tweeted about the same:\n“My heart goes out to everyone caught in the fires please stay safe and don’t take unnecessary risks. I think I’m about to lose my house and its memories. Even worse, tragically people have died.”\nMy heart goes out to everyone caught in the fires please stay safe and don’t take unnecessary risks. I think I’m about to lose my house and its memories 😔even worse tragically people have died thoughts and prayers with everyone it’s been a tough day let’s hope it gets better 🙏🏼 — Liam (@LiamPayne) November 10, 2018\n14. Alyssa Milano\nThe Who’s The Boss? and Insatiable actress, Milano had to evacuate her home along with her children. She updated her fans about her whereabouts and also informed that her horses have also been rescued to safety.\nI just had to evacuate my home from the fires. I took my kids, dogs, computer and my Doc Marten boots.\n(Husband is in NY. Horses are being evacuated by my trainer.) — Alyssa Milano (@Alyssa_Milano) November 9, 2018\nHorses are finally safe. My children are safe. My home is in jeopardy but... everything with a heartbeat is safe. Thank you all for your concern.\nTo those who insisted on still being hurtful because our political affiliation is different, you are what is wrong with the country. — Alyssa Milano (@Alyssa_Milano) November 9, 2018\nSandra Bullocks Generous Donation For The Non-Human(animals) Victims Of The Wildfires\ntoofab\nWhile many celebs are reaching out to help the displaced people, actress Sandra Bullock made a $100,000 donation to The Humane Society of Ventura County, which is in charge of helping the animals affected by the wildfires in Southern California.\n\"Our efforts for rescuing and caring for evacuated animals from the Hill and Woolsey fires had caught her attention and her team reached out to the shelter to show their support,\" the organisation wrote on Facebook. \"Sandra Bullock and her family have reached out to other nonprofit organisations both during this incident and in the past. However, this time she wanted to contribute to those on the frontline rescuing animals in peril and hope others will choose to do the same.\"\n\"The HSVC pledges to care for these animals for as long as is needed or until their owners feel comfortable in safely reuniting their families,\" the organisation wrote.", "title": "From Westworld Set To Celeb Homes, Here's Everything That Was Destroyed In California Wildfires", "date_publish": "13/11/2018, 17:32:38", "description": "Californians are going through a really hard time. For the uninitiated, thousands of the people living in Southern California lost their homes to the blaze that broke out on Thursday. The Woolsey Fire, has already burned 91, 572 acres of land, claimed many lives and left several stranded as an estimated 370 homes as of Monday morning, have been burnt to ashes, according to the California Departmen", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/from-westworld-set-to-celeb-homes-here-s-everything-that-was-destroyed-in-california-wildfires-356588.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/wildfires_1542105477_800x420.jpg"}