{"text": "Ranveer said, \"I think I was in Class 3 or 4 when I first got into hip-hop. I loved listening to Snoop Dogg, Tupac Shakur, The Notorious B.I.G, while growing up and I have been into that kind of music ever since. I used to watch a lot of MTV and that's where I first experienced it. There is a cousin of mine who migrated to the US and whenever he used to come down for summer holidays, he used to bring this music and we used to sit and hear it all the time.\"\nTiger said, \"Hrithik sir is coming in top form. I have seen him train day and night, I have seen him work hard on a set and I have seen his work ethic so, I think, if he is not the same as he was in Kaho Na Pyaar Hai, he must be even better and younger looking now.\"\nDon't Miss\nWhile Rohman and Sush looked perfect, it was daughter Alisah who stole the limelight with her cute and adorable antics while practicing her flower girl walk. Have a look.\nFor the uninitiated, the lovebirds have been dating for two years. They are finally taking the wedding plunge today in Lucknow. Sanya Sagar is a writer, director and editor. She has apparently known Prateik Babbar for eight years.\nSetting another record, Black Panther has done something no other superhero movie has ever done. The film has become the first superhero film to get best picture nomination at Oscars 2019. Black Panther has been nominated alongside BlacKkKlansman, Bohemian Rhapsody, A Star Is Born, Roma, The Favourite, Green Book, and Vice at the 91st Academy Awards nominations.", "title": "Men Were On Top Internet Trends And More From Ent", "date_publish": "23/01/2019, 18:10:07", "description": "Ranveer said, \"I think I was in Class 3 or 4 when I first got into hip-hop. I loved listening to Snoop Dogg, Tupac Shakur, The Notorious B.I.G, while growing up and I have been into that kind of music ever since. I used to watch a lot of MTV and that's where I first experienced it. There is a cousin of mine who migrated to the US and whenever he used to come down for summer holidays, he used to br", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-hrithik-tiger-to-ranveer-singh-men-were-on-top-internet-trends-today-and-more-from-ent-360943.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/top_bollywood_news_1548246079_800x420.jpg"}