{"text": "It's a beautiful coincidence that a film about love has bought Ranbir Kapoor and Alia Bhatt together. The couple has been dating for over one year and it was during the first schedule of Brahmastra that sparks happened.\nInstagram\nJust a few days ago, Brahmastra director (who also happens to be Alia-Ranbir's very close friend) took to Instagram to share a throwback picture of the couple at a VFX studio and wrote,\nInstagram\n\"Ranbir and Alia needed to work as one unit and that relationship was more important than their individual characters because at its heart, our movie is a love story. There has been a lot of love since then...\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nLove blossomed between Ranbir and Alia on the sets of their film and everything is going rock-steady in their paradise claim reports. The couple also celebrated Alia's birthday together and now, if reports are to be believed, Ranbir has planned a special gift for his ladylove.\nTwitter\nA source close to the couple has spoken to media websites and claimed that Ranbir is planning to take Alia and fly off to Aspen Mountain Ski Resort in Colorado for a romantic holiday.\nRanbir wanted to plan it ASAP because Alia is already busy with the promotions of Kalank and right before she again gets busy with professional commitments, it was Ranbir's idea to give her a short break.\n(Also read: Alia Bhatt Gives A Classy Reply To Kangana Ranaut For Mocking Her Boyfriend Ranbir Kapoor!)\nTwitter\nThe rumours of their engagement have been doing the rounds since a long time and considering how things are proceeding, we won't be surprised if one day we see their engagement picture on our timeline!\n(Also read: Ranbir Kapoor And Alia Bhatt To Get Engaged After The Release Of Their Film 'Brahmastra')", "title": "From Engagement Reports To A Quick Couple Holiday: What Really Lies Ahead For Ranbir-Alia", "date_publish": "17/03/2019, 11:18:37", "description": "Love blossomed between Ranbir and Alia on the sets of their film and everything is going rock-steady in their paradise claim reports. The couple also celebrated Alia's birthday together and now, if reports are to be believed, Ranbir has planned a special gift for his ladylove.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-engagement-reports-to-a-quick-couple-holiday-what-really-lies-ahead-for-ranbir-alia-363842.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranbir_kapoor_and_alia_bhatt_1552801938_800x420.jpg"}