{"text": "Remember the popular 'kauwa biryani' scene from movie Run? Pankaj Tripathi made a blink-and-miss appearance with Vijay Raaz in that scene.\nYouTube Screengrab\nPankaj Tripathi’s Bollywood journey mirrors a typical masala hindi film. The actor came to Mumbai in search of work in 2004, but only gained recognition in the industry after 2012 with Anurag Kashyap's Gangs of Wasseypur. And since then, there has been no looking back.\nurbanasian.com\nBe it films to web-series such as Mirzapur, Sacred Games and Criminal Justice, Pankaj Tripathi is now a big name in the world of entertainment. But did you know his journey involves jail and hotel kitchen as well.\ncinemaexpress.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHaving grown in a small village, Pankaj Tripathi discovered his love for theatre after 12th standard. He graduated only because he wanted an admission in National School of Drama. During his college days, he was a part of Akhil Bharatiya Vidyarthi Parishad (ABVP) and was even jailed for taking part in a student’s movement. He would work in a hotel kitchen in order to do theatre in the morning.\nTwitter\nSure, he has come a long way. But success hasn’t taken over him. Pankaj Tripathi says he now owns his dream house, but he still hasn’t forgotten about one-room shed which had a tin roof.\nTwitter\n“Today, my wife Mridula and I own our dream house. But I haven't forgotten my one-room shed with its tin roof in Patna. One night, the rains and wind were so intense that one of the tin sheets blew away and I was left looking at the naked sky,” he told IANS.\nThis week, Pankaj Tripathi and his wife have shifted to their dream house. “It was our dream home, a love nest at the seaside. Now I've finally bought our dream house in Madh Island. My wife got very emotional after we shifted into our new home.”\nFor starters, Pankaj had no interest in movies.\n\"I was culturally inclined from the beginning. At 21, I'd cycle for miles to catch a concert by Bismillah Khan. Although I didn't understand the music, I listened with rapt attention. I had no interest in cinema. Theatre was my scene. I joined the National School of Drama in Delhi, did my course and returned to Bihar to pursue theatre.\nTwitter\n\"But I soon realized there was no future, no money in theatre. I decided to move to Mumbai where movie acting was a viable option.\"\nPankaj Tripathi’s successful journey is a proof that if you work hard towards your dream, one day they will come true for sure.", "title": "From One-Room Shed To Dream House In Mumbai, This Is Pankaj Tripathi’s Inspiring Success Story", "date_publish": "15/04/2019, 15:58:50", "description": "Be it films to web-series such as Mirzapur, Sacred Games and Criminal Justice, Pankaj Tripathi is now a big name in the world of entertainment. But did you know his journey involves jail and hotel kitchen as well. Be it films to web-series such as Mirzapur, Sacred Games and Criminal Justice, Pankaj Tripathi is now a big name in the world of entertainment. But did you know his journey involves jail", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/from-one-room-shed-to-dream-house-in-mumbai-this-is-pankaj-tripathi-s-inspiring-success-story-365478.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/pankaj_tripathis_success_story_says_he_owns_his_dream_house_hasnt_forgotten_oneshed_tin_house_1555321503_800x420.jpg"}