{"text": "From The Three Khans To Newly-Weds DeepVeer, B-Town Had A Gala Time At Isha Ambani's Sangeet\nFrom The Three Khans To Newly-Weds DeepVeer, B-Town Had A Gala Time At Isha Ambani's Sangeet\nWe might have missed all the fun and frolic that was going on in Umaid Bhawan and Italy’s Lake Como during Priyanka Chopra-Nick Jonas and Deepika Padukone-Ranveer Singh’s wedding. But, we sure have glimpses – a lot of snippets – from Isha Ambani and Anand Piramal’s wedding in Udaipur.\nThe entire Bollywood clan was present at the pre-wedding festivities that took place last night. From Shah Rukh Khan, Salman Khan and Aamir Khan to the Bachchans and newly-weds DeepVeer and Nickyanka, the B-town clan pretty much brought the house down with their performances.\nWant to know what happened inside Udaipur’s Udaivilas last night? Here’s the sneak peek!\n#1 Shah Rukh Khan performed with wife Gauri and it all started with a kiss.\n#2 Abhishek Bachchan and Aishwarya Rai stole the thunder as they danced to the popular track from Guru. Love was in the air!\n#3 Salman was seen dancing to Shah Rukh’s Koi Mil Gaya!\nDon't Miss 365 SHARES 161 SHARES 812 SHARES 183 SHARES 1 K SHARES\n#4 SRK and Aamir set the stage on fire with their energetic dance moves.\n#5 King Khan brought the entire Ambani clan on stage for a ‘Shava Shava’ performance.\n#6 Ranveer-Deepika also rocked the dance floor!\n#7 Karan Johar also shook a leg!\n#8 It was a night to remember!\nAlso Read: Shah Rukh Khan Gets Chucked Out Of Forbes Richest Celeb List But His Response Is Winning Hearts", "title": "From The Three Khans To Newly-Weds DeepVeer, B-Town Had A Gala Time At Isha Ambani's Sangeet", "date_publish": "10/12/2018, 11:37:07", "description": "The entire Bollywood clan was present at the pre-wedding festivities of Isha Amabani and Anand Piramal’s wedding in Udaipur that took place last night. From Shah Rukh Khan, Salman Khan and Aamir Khan to the Bachchans and newly-weds DeepVeer and Nickyanka, the B-town clan pretty much brought the house down with their performances.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-the-three-khans-to-newly-weds-deepveer-b-town-had-a-gala-time-at-isha-ambani-s-sangeet-358262.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/from_khan_trio_to_newlyweds_deepveer_entire_btown_rocked_the_dance_floor_at_ambani_bash_1544420911_800x420.png"}