{"text": "From The Exciting Plot To Star Cast, 7 Things You Need To Know About Game Of Thrones Prequel\nFrom The Exciting Plot To Star Cast, 7 Things You Need To Know About Game Of Thrones Prequel\nGame of Thrones fans are experiencing a classic case of mixed emotions at the moment. Most of them are devastated because the show that kept them hooked for almost eight years is now finally coming to an end leaving a void in their hearts. But at the same time, they are also excited to know who will finally sit on the Iron Throne – who will make it to the end and who will meet a terrible fate.\nAlso Read: Game of Thrones Prequel Series Is Coming & It’ll Be Set Thousand Years Before The Events Of GoT\nbleedingcool.com\nBut what happens after that? Well, Game of Thrones prequel will whet your appetite for the brilliant show. Wondering what it is all about and what can you expect? Here’s everything that you need to know about Game Of Thrones prequel:\n#1 What the show will be about?\nculturedvultures.com\nDon't Miss 161 SHARES 896 SHARES\nIt will be set ten thousand years before the event from where the first season of Game of Thrones began – which apparently is the time called Age of Heroes. It will show how the houses of Westeros were founded and by whom. It is said that the Age Of Heroes came to an end after the event called The Long Night.\n#2 The show will tell about the origin of White Walkers.\nsyfy.com\nRemember the first episode of Game of Thrones begins will white walkers. But how did they rise from the dead? Well, that might be answered in Game of Thrones prequel.\n#3 What will be the title of the show?\nTwitter\nGeorge RR Martin has suggested that the show be called The Long Night. Will it be only called The Long Night or Game of Thrones: The Long Night, that remains to be seen.\n#4 Who will be the cast on Game Of Thrones prequel?\nThe Ringer\nThe first actor who has been confirmed for the show is Oscar-nominee Naomi Watts. She has been cast as “a charismatic socialite hiding a dark secret.” Also, Poldark actor Josh Whitehouse will also be a part of the show. His role hasn’t been disclosed as of yet.\n#5 Is George RR Martin writing the show?\ngeekrobats.com\nIt has been reported that George RR Martin is only consulting on Game of Thrones prequel. Jane Goldman, who wrote Kingsmen, is the showrunner.\n#6 How many Game of Thrones prequels can we expect?\nthebritishberliner.files.wordpress.com\nIn his blog, George RR Martin said that there will be “three more GAME OF THRONES prequels, set in different periods and featuring different characters and storylines, remain in active development.”\n#7 It’s not a story you think you know.\ntimeincapp.com\nWell, that’s what the official synopsis of the first Game Of Thrones prequel says. This is “not the story we think we know.”", "title": "From The Exciting Plot To Star Cast, 7 Things You Need To Know About Game Of Thrones Prequel", "date_publish": "01/11/2018, 12:50:26", "description": "Game of Thrones prequel will apparently whet your appetite for the brilliant show. Wondering what it is all about and what can you expect? Here’s everything that you need to know about Game Of Thrones prequel. It will be set be ten thousand years before the event from where the first season of Game of Thrones began – which apparently is the time called Age of Heroes. It will perhaps show the how t", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-the-exciting-plot-to-star-cast-7-things-you-need-to-know-about-game-of-thrones-prequel-355853.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/from_its_title_to_casting_of_naomi_watts_7_things_you_should_about_game_of_thrones_prequel_1541058401_800x420.jpg"}