{"text": "From Holidaying Together To Spending Lazy Sunday Mornings, Shibani-Farhan Are Inseparable\nFrom Holidaying Together To Spending Lazy Sunday Mornings, Shibani-Farhan Are Inseparable\nWhen someone falls in love, the way they smile and glow-it's different.\nWell, that's the magic of love and togetherness and looks like a lot of people in the B-town have been struck by the cupid. While there are couples who have never confessed their relationship status or went all public about their relationship, their social media PDA and appearances together have said it all.\nThe cat is finally out for a lot of Bollywood couples and after Arjun Kapoor and Malaika Arora, all eyes are on the latest entrants of the love-birds club.\nFarhan Akhtar and Shibani Dandekar are reportedly dating and even when their pictures have captions like \"Look Who I Bumped Into\" and \"Best Friends\", everyone knows what they have been trying to conceal.\nWell, our reaction:\nThe 'rumored' couple has been clicked by the paps at a lot of events and date nights and they sort of made their relationship official by posing for the paps hand-in-hand when they attended the DeepVeer reception in Mumbai.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBoth Farhan and Shibani post some of the most adorable pictures from their vacations and date nights and it has love written all over them.\nToday, Farhan shared yet another picture of Shibani looking out of the balcony, with her dog. Captioning the picture as \"Looking out for each other\", the picture summed up their lazy Sunday morning perfectly.\nA few days before, there was a report that claimed how the couple is also interested in taking their relationship to the next level by tying the knot.\nA source close to the couple spoke to DNA and said,\n\"They are extremely serious about each other and Farhan's kids have also warmed up to Shibani, so this looks like the most obvious step for the two.\"\nShibani has been quizzed on her ambiguous relationship a lot of times but she has always maintained a dignified silence. She was quoted in a news report saying,\n\"I don't need to make an announcement about who I'm dating. It's up to me to decide when and what I want to share about my personal life, and it is up to the audience to decide how they look at it. How much information I want to put out in the public domain is my prerogative.\"\nShibani and Farhan's relationship came to spotlight when she accompanied him for his Canada tour in 2018. Since then, they have been very comfortable with social media PDA and making public appearances together.", "title": "From Holidaying Together To Spending Lazy Sunday Mornings, Shibani-Farhan Are Inseparable", "date_publish": "06/01/2019, 14:12:56", "description": "Farhan Akhtar and Shibani Dandekar are reportedly dating and even when they try to confuse their fans by captions like \"Look Who I Bumped Into\" and \"Best Friends\", everyone knows about their alleged love affair. The 'rumored' couple has been clicked by the paps at a lot of events and date nights and they sort of made their relationship official by posing for the paps hand-in-hand.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/from-holidaying-together-to-spending-lazy-sunday-mornings-shibani-farhan-are-inseparable-359936.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shibani_and_farhan_1546764396_800x420.jpg"}