{"text": "From Deepika's Bridal Couture To The Food Menu, Here Are Deets On DeepVeer's Konkani Wedding\nFrom Deepika's Bridal Couture To The Food Menu, Here Are Deets On DeepVeer's Konkani Wedding\nIt was a wedding you only hear and read about in fairy tales and books.\nA couple madly in love. Close friends and family. And, one of the world's most exotic locations-Italy.\nSLB Films\nFor Deepika and Ranveer, their six years of relationship took a beautiful turn as they solemnized their relationship by tying the knot at Lake Como in Italy.\nThe couple took special measures to protect their privacy and that's the reason we couldn't catch a glimpse of the couple. However, thanks to a few people who actually managed to get us some clips and pictures from Ranveer Singh and Deepika Padukone's traditional Konkani Brahmin ceremony that lasted 4 hours.\n(Also read: The Moment All Of Us Have Been Waiting For! Here Are The First Pictures From DeepVeer's Wedding)\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nIn case you are wondering about the deets, we have got you covered.\nIf we talk about Deepika's wedding couture, she donned a white and gold Sabyasachi outfit and sticking to the dress code, the ladkiwaale (Deepika’s side) were dressed in traditional South Indian attires. The men wore kurta and mundu, the traditional outfit for men.\nAll the guests were treated with warmth and food menu consisted of served authentic Konkani Mangalorean cuisine like Pooran Poli, Rassam and the likes on a banana leaf.\n(Also read: Dulha Ranveer Singh Will Arrive With ‘Band Baaja Baaraat’ On A Seaplane At Wedding Number 2!)", "title": "From Deepika's Bridal Couture To The Food Menu, Here Are Deets On DeepVeer's Konkani Wedding", "date_publish": "15/11/2018, 12:44:26", "description": "The couple took special measures to protect their privacy and that's the reason we couldn't catch a glimpse of the couple. However, thanks to a few people who actually managed to get us some clips and pictures from Ranveer Singh and Deepika Padukone's traditional Konkani Brahmin ceremony that lasted 4 hours.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/from-deepika-s-bridal-couture-to-the-food-menu-here-are-deets-on-deepveer-s-konkani-wedding-356705.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542263729_800x420.jpg"}