{"text": "From Doing Couple Yoga To Playing Guitar, Sushmita Sen & Rohman Shawl Paint The Town Red With Their Love-Filled Posts\nFrom Doing Couple Yoga To Playing Guitar, Sushmita Sen & Rohman Shawl Paint The Town Red With Their Love-Filled Posts\nFormer Miss Universe, mother of two and power-woman with utter confidence who is living her life on her own terms, Sushmita Sen is an icon for millions of women across the world.\nWhen she adopted her first child at the age of just 24, she hinted to the world that she doesn’t believe in following norms. Unlike, other Bollywood celebrities, she has never kept her relationships under wraps. This time as well, breaking stereotypes, she announced to the world that she is dating her “jaan” and model Rohaman Shawl.\nInstagram\nWith all the PDA and mushy posts, she is giving us all a glimpse into her love life too. We know couple goals is an overused term but looking at their love-filled posts, you’ll sure agree how Sushmita Sen and Rohman Shawl are setting the relationship goals right.\n#1 Giving Rohman Shawal love lessons, Sushmita Sen taught him how to say “I love you”\nDon't Miss 343 SHARES 594 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n#2 Couples who work out together, stay together!\n#3 When she is learning to play guitar from love of her life “nothing else matters”\n#4 Couple yoga is all the motivation you need today!\n#5 Aren’t they just adorable?\nSushmita Sen and Rohman Shawl, keep rocking!", "title": "From Doing Couple Yoga To Playing Guitar, Sushmita Sen & Rohman Shawl Paint The Town Red With Their Love-Filled Posts", "date_publish": "17/01/2019, 14:16:08", "description": "With all the PDA and mushy posts, she is giving us all a glimpse into her love life too. We know couple goals is an overused term but looking at their love-filled posts, you’ll sure agree how Sushmita Sen and Rohaman Shawl are setting the relationship goals right. With all the PDA and mushy posts, she is giving us all a glimpse into her love life too. We know couple goals is an overused term but l", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-doing-couple-yoga-to-playing-guitar-sushmita-sen-rohman-shawl-paint-the-town-red-with-their-love-filled-posts-360575.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sushmita_sen_and_rohaman_shawl_paint_the_town_red_with_their_lovefilled_posts_1547714830_800x420.png"}