{"text": "From Brutally Trolling Her To Now Demanding Her Presence, Virat Kohli Fans Don’t Hate Anushka Sharma Anymore\nFrom Brutally Trolling Her To Now Demanding Her Presence, Virat Kohli Fans Don’t Hate Anushka Sharma Anymore\nMore girls swoon over Virat Kohli than the number of boys that drool over Anushka Sharma, but together they make a power couple that gives relationship goals to many people.\nFondly called Virushka, when Virat Kohli and Anushka Sharma had tied the knot, a lot of hearts were broken, but at the same time, all of us were ecstatic to see them head over heels in love with each other.\nInstagram\nBut do you remember the time when Virat Kohli couldn’t perform well on the cricket field and haters put the blame on Anushka Sharma for just being present on the field? We all play the blame game and point fingers at others when things go wrong, and so did the social media trolls at one point of time.\nAlso Read: Anushka Sharma Is In Awe Of Virat Kohli’s Record-Breaking Performance, Can’t Stop Gushing ‘What A Man’ He Is\nDon't Miss 527 SHARES 365 SHARES 812 SHARES 3.4 K SHARES\nBut seemingly, things are changing and how! Now, people just cannot get enough of the lovely couple that Anushka Sharma and Virat Kohli make. So much so, that they want to see them together more often.\nAlso Read: Virat Kohli & Anushka Sharma Show They Are BFFs Before Lovers & People Can't Stop Swooning Over The Couple!\nTwitter\nSo, recently when Virat Kohli was batting at the Brabourne stadium, fans were craving for the presence of the power couple. They chanted Anushka’s name when Virat was playing on the field. Virat Kohli approved of the gesture and gave a thumbs up!\nSo, when Anushka makes a public appearance, fans often chant Virat Kohli’s name. Don’t believe us? The video below is a proof!\n“Jee haan haan.. Sabko unse (@imVkohli) prem hai, Mujhe bhi hai... Sabko unki yaad aa rahi hai, mujhe bhi aa rahi hai...” @AnushkaSharma 💖 #Virushka pic.twitter.com/9RQnOgzarn — 🌚 (@jugheadjasoos) September 2, 2018\nMay the love of fans for Virat Kohli and Anushka Sharma keep growing, and may they stay happy together forever!\nAlso Read: This Pic Of Anushka Sharma Staring Angrily At Husband Virat Kohli Has Become A Subject Of Hilarious Jokes!", "title": "From Brutally Trolling Her To Now Demanding Her Presence, Virat Kohli Fans Don’t Hate Anushka Sharma Anymore", "date_publish": "31/10/2018, 11:55:41", "description": "But do you remember the time when Virat Kohli wouldn’t perform as good on the cricket field, haters would blame Anushka Sharma for just her presence? But seemingly, things are changing and how! Now, people just cannot get enough of the lovely couple that Anushka Sharma and Virat Kohli make. So much so, that they want to see them both together more often.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/from-brutally-trolling-her-to-now-demanding-her-presence-virat-kohli-fans-don-t-hate-anushka-sharma-anymore-355761.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/people_chant_anushka_sharmas_name_at_virat_kohlis_recent_match_1540965536_800x420.png"}