{"text": "From The Met Gala To Shaadi Ka Mandap, Here's A Timeline Of PC & Nick Jonas' Whirlwind Romance\nFrom The Met Gala To Shaadi Ka Mandap, Here's A Timeline Of PC & Nick Jonas' Whirlwind Romance\nAfter the extravagant wedding of Deepika Padukone and Ranveer Singh, there's another mega wedding ready to take our breath away. Global phenomena Priyanka Chopra who has made our country proud and has taken the world cinema by storm is ready to tie the knot.\nAt a time, when Priyanka is successful and she could choose to continue work, the actress is breaking stereotypes. Priyanka is getting married to Nick Jonas at the peak of her career in the West and we couldn't be happier. Always rooting for equality, freedom and the right to be, Priyanka's wedding would definitely go down in the history.\nAs per reports, International media is also flying down to India to cover the most regal wedding. Here's taking a look at her love story with musician Nick Jonas which is the most lightening one ever.\n1. The two might have definitely met before but Priyanka and Nick Jonas made a very public appearance at MET Gala in 2017 and since then there has been no looking back. They arrived in the same vehicle, walked the red carpet and even wore the same designer, Ralph Lauren. They even had a common agent back then.\nDon't Miss 365 SHARES 161 SHARES 862 SHARES\n2. After that, Priyanka and Nick were spotted for dinner dates in New York wearing colour coordinated outfits mostly. As per reports, Nick loves pampering the love of his life.\nPriyanka/Popsugar\n3. Looks like Jonas knew that Priyanka is the one. After hanging out with her, Nick invited Priyanka to his cousin's engagement. The duo even stayed back to attend the private family brunch.\nFacebook\n4. Soon enough, their love started spilling on social media as well. Infact, during his brief stay in India, Nick made an Instagram story of PC enjoying the Mumbai rains and caption said, \"Her\" with a love struck emoji. This confirmed the couple's love for each other.\nInstagram/Nick Jonas\n5. This was the first time Priyanka was seen hanging out with her boyfriend. Prior to this, she had dated Shahid Kapoor and Harman Baweja but never went in record or was never clicked by the paps but this felt different, Not only to her but all of us as well\nTwitter/Priyanka Chopra 121\n6. And then the magical moment took place. After proposing Priyanka in London with a stunning Tiffany ring, the couple had a private roka ceremony back in Mumbai. The Jonas' family too opted for traditional wear and totally went desi for our desi girl.\n7. Post that, the duo went for Aakash Ambani's mehendi ceremony in Italy and were also seen in Goa spending time together and soaking up some love.\nTwitter\n8. After their roka ceremony, the two have been vocal about their feelings. Whether it's on social media, during Nick's gig or constantly holding hands, Priyanka and Nick are giving us love goals\n9. Priyanka soon went onto celebrate her bachelorette with close friends and family, hinting she's marrying Nick soon. Among her cousins, we spotted Sophie Turner, GOT's Sansa Stark too, as she happens to be Joe Jonas' wife and Priyanka's sister in law\n10. The couple is all set to tie the knot on December 2 in two ceremonies - Christian and Hindu. Umaid Bhawan has been booked from 28th to December 2, 2018. Yesterday, Priyanka Chopra held a small pooja at her home in Mumbai\nTwitter\n11. Not many know that Priyanka is older than Nick by 10 years but nothing seems to stop the couple who are cruising in love.\n12. Like they say, a good start means half done. We can't wait to see Priyanka walk down the aisle to marry the man of her life. We can't wait to call her Mrs Priyanka. We can't wait to see her conquer love and work.", "title": "Priyanka Chopra And Nick Jonas! A Timeline Of Their Lightening Yet Classic Romance", "date_publish": "30/11/2018, 11:18:25", "description": "After the extravagant wedding of Deepika Padukone and Ranveer Singh, there's another mega wedding ready to take our breath away. Global phenomena Priyanka Chopra who has made our country proud and taken the world cinema by storm is ready to tie the knot. At a time, when Priyanka is successful and she could choose to continue work, the actress is breaking stereotypes. Priyanka is getting married", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/from-the-met-gala-to-shaadi-ka-mandap-here-s-a-timeline-of-pc-nick-jonas-whirlwind-romance-357573.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_1543470902_800x420.jpg"}