{"text": "American actor and comedian Aziz Ansari is all set to perform in India this May. This tour will be a part of his international stand-up tour titled Road to Nowhere. For all who are unaware of Aziz, he is of Indian descent and he got immensely popular for doing shows like Netflix series Master of None and the sitcom Parks & Recreation.\nRoad to Nowhere will be Aziz’s first tour ever since sexual assault allegations against the comedian were out in January 2018.\nTwitter\nHowever, he responded to all the claims stating that he was surprised and concerned. Later on, he spoke about the allegations in a show in February and he clarified that he had to take time off to actually process the situation and reply privately.\nHe had said, \"It made me think about a lot, and I hope I’ve become a better person.\" The Road to Nowhere tour began in Boston in February and will end in July.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhen and where will he be performing in India?\nInstagram\nHe will be doing two shows each in Mumbai and Delhi between 24 and 26 May. In Mumbai, Aziz will be performing at the NCPA Tata Theatre on 24 and 25 May. In New Delhi, Aziz will do two shows on 26 May at the Jawaharlal Nehru Indoor Stadium.\nWhere to get the tickets?\nBook your tickets on Book My Show and the price ranges from Rs 1200 to Rs 5000. Are you excited?", "title": "Funnyman Is Here! Comedian Aziz Ansari Is All Set To Perform In India In May And We Have All The Dope!", "date_publish": "27/04/2019, 11:38:06", "description": "American actor and comedian Aziz Ansari is all set to perform in India this May. This tour will be a part of his international stand-up tour titled Road to Nowhere. For all who are unaware of Aziz, he is of Indian descent and he got immensely popular for doing shows like Netflix series Master of None and the sitcom Parks & Recreation.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/funnyman-is-here-comedian-aziz-ansari-is-all-set-to-perform-in-india-in-may-and-we-have-all-the-dope-366176.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/aziz_ansari_1556345532_800x420.jpg"}