{"text": "Alia Bhatt once mentioned that she enjoys memes on her films, in fact she feels memes on the films means it’s a super hit. Wel, she could be right as her last release Gully Boy has some rib-tickling memes and the film turned out to be one of the biggest hits of the year. We hope this continues with Kalank too.\nCan you even imagine any other actor in that role? When the makers of the film were a little skeptical to cast Robert Downey Jr. in the role because of his controversial past, director Jon Favreau unremittingly campaigned for him. And then, as they say, a star was born.\nWell, it seems like all that was a build up to THIS! For, what we have now, in the form of a whacked out 21min-ish documentary, is this episode where Will Smith travels to Haridwar, meets Ranveer Singh and ends up doing a cameo in Student Of The Year 2.\nFrom becoming a criminal mastermind, goofy prankster and then returning to its darker roots, Joker might have had no superpowers over the years but his sadistic sense of humour always manages to shake you up. One of the most iconic characters in popular culture, the Joker has been listed among the greatest comic book villains and fictional characters ever created.\nMayoori Kango was one of the actresses who gained popularity in the industry but after her short sting got lost into oblivion. It was in 2000 that she had bid adieu to the big screen. Wondering what she is up to? Well, Mayoori has made herself a name in digital advertising world and recently joined Google India as its industry head – agency business.\nDon't Miss 862 SHARES", "title": "Funny Memes On Alia-Varun's Kalank, A Look At The Evolution Of Joker & More From Entertainment", "date_publish": "04/04/2019, 19:04:59", "description": "Funny Memes On Alia-Varun's Kalank, A Look At The Evolution Of Joker & More From Ent.Funny Memes On Alia-Varun's Kalank, A Look At The Evolution Of Joker & More From Ent.Funny Memes On Alia-Varun's Kalank, A Look At The Evolution Of Joker & More From Ent.Funny Memes On Alia-Varun's Kalank, A Look At The Evolution Of Joker & More From Ent.Funny Memes On Alia-Varun's Kalank, A Look At The Evolution", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/funny-memes-on-alia-varun-s-kalank-a-look-at-the-evolution-of-joker-more-from-entertainment-364894.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bollywood_1554381307_800x420.jpg"}