{"text": "Bollywood actor Gajraj Rao took almost 25 years to make the kind of impact he managed with Badhaai Ho. Starting out with Bandit Queen at 1994, writing for news channels, enjoying theater, kick-starting his production house to now becoming the face of a hit Bollywood film, Gajraj Rao emerged as the new face of Bollywood father. A father, millennials could connect to, a father, who was badass, a father who gave new life to his ageing character in a never before avatar.\nWhile he gives credit to his director and co-stars, we think Gajraj Rao totally nailed it with his power packed performance. Speaking exclusively to Indiatimes, Bollywood star Gajraj Rao spoke about his life before and after Badhaai Ho.\nI grew up in a Railway colony so I could relate to characters like Kaushik\n\"My father was in Railways and I spent my childhood in a Railway colony, so I have seen characters like Kaushik in a TT. The overwhelming part was that after many years, I got to rehearse for a role. Usually I was doing 5-6 scenes in a film but for Badhaai Ho, Kaushik is an integral part of the script. So it took me 15-20 days. I used to rehearse in a room for the pitching, accent, words. The writers too helped me get the UP slang and tone.\"\nI knew something delicious was cooking with Badhaai Ho\nDon't Miss 862 SHARES 346 SHARES\n\"I had never thought that the response would be so amazing. We knew something delicious was cooking but iska khushbu aisa failega, we never anticipated. I was happy throughout the process. The shooting and the interaction with the director and co-stars was thoroughly enjoyable but didn't know the response would be so good.\"\nDid you know, Gajraj Rao started out as a journalist\n\"From the very beginning, when I was doing theater, i was in various fields. From garment exporter to freelance journalist, I used to take on different work. In fact, I even interviewed Yash Chopra for NavBharat Times for their features page. I was very clear that I never wanted to be a struggling actor, who has to stand in queues for long hours. It's very tough so I used to simultaneously do other work for run my family.\"\n\"Thankfully, I have interest in literature and I write fiction ad non fiction. After journalism, I worked for a lot of TV shows as a dialogue writer. Then I joined Pradeep Sarkar in Delhi and now I direct ad films in a production house. So yes, I have been in the industry for very long. I have my own production house now that's why you don't get to see me so often on the silver screen. I am slightly choosy with my roles but after Badhaai Ho, I am working in a feature script.\"\nWeb shows are his first love but Bollywood gives him fame\n\"The amazing part in my acting graph has been the web shows. Around 3-4 years ago, I collaborated with TVF and it introduced me to a new generation of content makers. There was a saturation point in Indian media but luckily I saw them working very close to the section and how the youth perceives it, so I was happy to collaborate with them.\"\n\"Web shows and movies are two different things. When Badhaai Ho happened, it changed the way people looked at me. This kind of popularity and adulation is not possible if I only do Web. On the other hand, to reach the younger audience who don't watch Indian cinema, web shows are the answer. So movies and shows can't be compared as both are separate segments.\"\nAfter Badhaai Ho, Lootcase and Tripling are coming up\nYoutube/Screenggrab\n\"I have worked in loot case which stars Kunal Kemmu, Rasika Duggal and it's a black comedy. And on TVF, I have featured in a fun episode of Tippling so I can't wait to see how that turns out.\"\nGajraj feels lucky working with the current two firebrands - Vicky Kaushal and Ayushmann Khuranna\nBadhaai Ho/Poster\n\"They are different actors. Ayushmann has different sensibilities and Vicky has an ability to get to the root of his character and make it finer. I can't choose between them. It was a wonderful experience working with both of them in Badhaai Ho and Love Pe Square Foot.\"\nI took 25 years to make a mark because there was no Youtube in the 90s\nYoutube/screengrab\n\"I didn't have you-tube or web or Anand Tiwari. I didn't have Vicky Kaushal, Rajkummar Rao, Alia Bhatt who are such fantastic actors. Imagine a Piku without Deepika Padukone or Raazi without Alia Bhatt. This is an amazing time for actors of any age. I tell people who are struggling that if you are not getting the right opportunity with the right production house, then create a sketch or video of 10 minutes and upload online. I know so many people who are making a debut after being noticed online.\"", "title": "Gajraj Rao Of 'Badhaai Ho' Fame: Took 25 Years To Make A Mark In Bollywood Because There Was No Social Media", "date_publish": "11/02/2019, 13:36:27", "description": "Did you know, he was a freelance journalist in Delhi before he ventured into BollywoodDid you know, he was a freelance journalist in Delhi before he ventured into BollywoodDid you know, he was a freelance journalist in Delhi before he ventured into Bollywood", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/gajraj-rao-of-badhaai-ho-fame-took-25-years-to-make-a-mark-in-bollywood-because-there-was-no-youtube-361746.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/gajraj_1549883727_800x420.jpg"}