{"text": "Gal Gadot Shares New Pics, Writes A Heartfelt Post As She Wraps Up Wonder Woman 1984’s Shoot\nGal Gadot Shares New Pics, Writes A Heartfelt Post As She Wraps Up Wonder Woman 1984’s Shoot\nIt was always a man dressed up in a cape – a superhero – who would help the people in need by beating the bad guys and winning several hearts. Never a woman!\nWhy are all superheroes male? Breaking stereotypes Wonder Woman, a movie based on a female superhero, directed by a woman Patty Jenkins, was released last year and everyone including the kids fell in love with the character.\nAlso Read: 7 Reasons Why Bollywood Needs Kickass Superwoman Films Like Wonder Woman\nSuddenly, she became an icon.\n“On Monday, a boy who was obsessed with Iron Man told me he had asked his parents for a new Wonder Woman lunchbox,\" an elementary school teacher had said.\nAnd not only for little girls but also for the young boys.\nRead More: Gal Gadot Supports 5-YO Boy Who Broke Gender Stereotype By Taking Wonder Woman Backpack To School\nDon't Miss 247 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nThe movie was applauded worldwide. So much so, that soon a sequel was announced.\nGal Gadot, who will be reprising the role of Wonder Woman in the sequel titled 1984, has recently wrapped up the shoot of the movie. Sharing pictures of the same, Gal Gadot wrote a heartfelt note. She wrote why the movie will always be special to her and why shooting for it is no less than an emotional roller coaster ride.\nGal Gadot says she can’t wait to share the film with fans in 2020, and same goes for the fans. We’re sure, just like the original, Wonder Woman 1984 will break several box office records too. Good luck, Patty Jenkins and Gal Gadot.", "title": "Gal Gadot Shares New Pics, Writes A Heartfelt Post As She Wraps Up Wonder Woman 1984’s Shoot", "date_publish": "24/12/2018, 15:55:15", "description": "Gal Gadot, who will be reprising the role of Wonder Woman in the sequel titled 1984, has recently wrapped up the shoot of the movie. Sharing pictures as she wrapped up the shoot of the movie, Gal Gadot wrote a heartfelt note. She wrote why the movie will always be special to her and why shooting for it is no less than an emotional roller coaster ride.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/gal-gadot-shares-new-pics-writes-a-heartfelt-post-as-she-wraps-up-wonder-woman-1984-s-shoot-359184.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/gal_gadot_writes_a_heartfelt_post_as_she_wraps_up_wonder_woman_1984s_shoot__shares_new_pics_1545645116_800x420.png"}