{"text": "Jon Snow, Sansa Stark and Arya Stark walk through Winterfell's labyrinthine crypt passing through the statues of their deceased ancestors while quotes from previous season can be heard in whispers in the background. They finally meet their own statues and an icy wind blows, clearly hinting that WINTER HAS FINALLY ARRIVED.\nAfter a long wait, the first teaser of Game of Thrones titled Crypts of Winterfell was finally unveiled about a week ago, and the excitement level of the fans is at its peak since then.\nThe teaser soon became fodder for the fans who have been analysing what will happen in Game of Thrones season 8. Here’s what the latest Game of Thrones theories suggests. Take a look!\n#1 Bran is the Night King.\nWhile three of the four Stark kids alive can be seen in the Game of Thrones season 8 teaser, but Bran is clearly missing. The mind-boggling theory that Bran is the Night King, fans think, is true. According to this theory, Bran who is a warg and can travel back in time goes into the moment when Children of the Forest are creating the Night King, but he gets stuck there – inside the body of Night King. Is that why we didn’t see him in the teaser? That’s what people have been speculating.\nDon't Miss 596 SHARES 284 SHARES 257 SHARES 12.5 K SHARES 5.5 K SHARES\nOKAY SO. I have been slowly allowing the Bran = Night King theory seep into my brain as time passes. And this trailer...\nThere's one living Stark who's not apparently \"invited\" into the Winterfell Crypt. But then, it seems that maybe he shows up, but he brings cold with him. https://t.co/pWY8naQUsL — diet_glitter (@thelastglitter) January 14, 2019\n“We see a feather fall to the ground after jon walks by and then it becomes eerily apparent that it is only jon, sansa, and arya present: bran isn't there. then, another presence (in the form of the cold) begins to seep in, making itself known, as if someone else has shown up that knows about the starks crypt. ice then consumes the feather, which could give an indication to who is coming: a feather, being consumed by ice. bran? (now, i don't know if this is a raven's feather, since it doesn't really look like one but bear with me) this feather could represent bran becoming the night king, OR bran being \"stuck\" in the night king after warging into him,” says Reddit user mistyrell.\n#2 Sansa and Arya will die during the war with White Walkers.\nIn the teaser, the three Stark kids see their own statues. If you notice closely, Jon Snow’s statue looks older than his current self, while Sansa and Arya’s statues are youthful. Does this suggest what age these characters will die in the show?\n“It’s alluding to Sansa and Arya dying during the war with the White Walkers (hence why their statues depict them as their current age - but good god I hope not). Jon’s statue shows him much older though, possibly signifying that he survives the war and lives to an old age,” says a Reddit user.\n#3 Jon Snow will survive until the very end.\nSince only Jon Snow’s statue looks older than his current age, fans speculate that he will survive until the very end. Will he sit on the Iron Throne? Only time will tell.\n#4 Sansa will sit on the Iron throne.\npinimg.com\nAccording to a Reddit user named Charcoalgreen13, Sansa Stark will end up sitting on the Iron throne, as she is the one who stands in the middle in the teaser. This Twitter user believes, positing in everything in the realm of Game of Thrones.\n“When they all meet at the end of the crypt, Jon is surrounded by Arya and Sansa… But when they move to be in front of their own Statue, Sansa is in the middle. The placement for the king/queen/head of the pack is to be centre. When the frost comes in, Arya and Jon draw their swords and stand in a pose that is not just for self defense, but protective of Sansa,” he said.\n#5 The teaser is just teasing you!\nIn the end, to ruin all the fun for you, remember the footage seen in the teaser barely makes it to the final cut. Remember the teaser of season 6 that showed a wall of masks in the hall of the Faceless men? Those characters never died – not all of them. So, do you think, this footage will appear in Game of Thrones season 8? Also, if you have any other mind-blowing theories, tell us about them in the comments section below!\nGame of Thrones season 8 will premiere on April 14 – Mark the date!", "title": "Game Of Thrones S8 Teaser Has Given Way To Some Interesting Theories & They’ll Blow Your Mind", "date_publish": "23/01/2019, 11:59:59", "description": "Jon Snow, Sansa Stark and Arya Stark walk through Winterfell's labyrinthine crypt passing through the statues of their deceased ancestors while quotes from previous season can be heard in whispers in the background. They finally meet their own statues and an icy wind blows, clearly hinting that the WINTER HAS FINALLY ARRIVED. Here’s what the latest Game of Thrones theories suggest. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/game-of-thrones-s8-teaser-has-given-way-to-some-interesting-theories-they-ll-blow-your-mind-360876.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/game_of_thrones_season_8_teaser_has_given_rise_to_some_interesting_theories__theyll_simply_blow_yo_1548161781_800x420.png"}