{"text": "Unlike other characters in Game of Thrones, Daenerys Targaryen is a lot of things, like -- “Daenerys Stormborn of House Targaryen, First of Her Name, the Unburnt, Queen of the Andals and the First Men, Khaleesi of the Great Grass Sea, Breaker of Chains, and Mother of Dragons.”\nIf Daenerys Targaryen was your colleague, you would hate her. She would make you work under her – that’s what she did with Jon Snow too – and take all the credit in the end. We all have such colleagues, don’t we?\nvia GIPHY\nAlso Read: 9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale!\nWe’re sure, you are not surprised at the fact that a lot of people dislike Daenerys Targaryen. She is one the most powerful women characters on the show, but if you ask people around yourself as to who are they rooting for to sit on the Iron Throne, nobody would take her name. It’s a tough call between Jon Snow and Tyrion Lannister, according to my friends.\nvia GIPHY\nSo, if you are also one of those who wonder why people don’t want Daenerys Targaryen to take the Iron Throne, it is because people hate the character quite a lot. On this Reddit thread, people revealed as to why they hate her so much.\n#1 She is naïve!\n“She's no where near my least favorite character on the show but I do find myself rolling my eyes at a lot of what she says and does. She's just very naive and entitled and while she fundamentally has good intentions for the people she intends to rule, she has no idea whatsoever on how to get them to actually want her to rule them. She also just sucks at ruling and the only reason she's accomplished anything is because she has dragons, not because she's particularly smart, cunning, or any of the traits the other successful characters of the show have,” wrote a user OddishJihad.\nvia GIPHY\n#2 She is pretentious and arrogant.\n“She sits on Dragonstone and when Jon Snow arrives, she immediately asks him to bend the knee. The Starks were the insulted party, after all. She is the one that should have apologized to them in the name of her House,” writes Mindless_Art.\nvia GIPHY\n#3 She is not the Aragorn - prototype like Jon.\n“She is a complex character that made a lot of mistakes and she is trying to learn. She is not the Aragorn - prototype like Jon. That's why she is hated,” writes OnlyOneFeeder.\nDon't Miss 161 SHARES 3.1 K SHARES\nvia GIPHY\n#4 Her outlook is childish.\n“She has a very childish outlook on the world. She destroys entire cities and kills hundreds if not thousands because of a simple idea of “slavery bad”. In the books this is actually addressed, and Daenarys learns that you can’t go around “””liberating””” slaves after Astapor is thrown into ruin and extreme poverty,” writers user H1v3-m1nd.\nvia GIPHY\n#5 She is not really powerful.\n“One of the things that bothers me the most is the fake wind in her fake looking too perfect wig while she, or Emilia Clarke, is just having a blank face and the music starts to be so dramatic. She's portrayed as so \"powerful\", but she never really does anything apart from saying \"Dracarys\". It's mostly the way as they present her,” writes Mariviere.\nvia GIPHY\n#6 She is only popular because of her dragons.\n“The only reason she is where she is at this point is because of the dragons. They are the reason she didn’t die outside of Qarth, didn’t die inside the Warlocks Tower, was able to free the Unsullied, survives the Fighter’s Pit in Mereen, finally conquers the Slavers and also the reason why Queen’s Army agrees to a truce. They are the reason she is able to save Jon and Jorah’s crew. And she doesn’t hesitate to use them to make people bow before her or strike fear in them, writes Betta45.\nvia GIPHY\n#7 She is rude and doesn’t understand business.\n“She’s rude to the 13 and doesn’t understand business, and she’s * surprised pikachu * that no one will help her without getting something in return,” wrote a fan. “Also, willfully ignorant. Every time someone tries to teach her about the land she claims, she shuts them down,” writes acrylicvigilante_.\nAny more reasons why you hate/love her? Tell us in the comments section below. Meanwhile, don’t forget that Game of Thrones season 8 will premiere on April 14.\nAlso Read: The Winter Will Last Really Long! Runtime Of Game Of Thrones Season 8 Episodes Has Been Leaked", "title": "Daenerys Targaryen:Game Of Thrones Fans Share Why They Hate Daenerys Targaryen And They Have Plenty Of Reasons", "date_publish": "26/01/2019, 15:01:56", "description": "A lot of people dislike Daenerys Targaryen. She is of course, the most powerful woman characters on the show, but if you ask people around yourself as to who are they rooting for to sit on the Iron Throne, nobody would take her name. It’s a tough call between Jon Snow and Tyrion Lannister, according to my friends.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/game-of-thrones-fans-share-why-they-hate-daenerys-targaryen-some-of-the-opinions-are-quite-brutal-361080.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/game_of_thrones_fans_share_why_they_hate_daenerys_targaryen_and_they_have_plenty_of_reasons_1548493695_800x420.jpg"}