{"text": "You might find Bollywood songs a bit too cheesy for your taste but can you stop yourselves from grooving when they play? Apparently, Sophie Turner and Maisie Williams enjoy dancing to the desi tunes as well.\nTwitter\nAhead of Game Of Thrones season 8, when Sophie Turner and Maisie Williams appeared on American television show Access for an interview, they also attempted Priyanka Chopra’s dance moves that Sophie learnt at the wedding in Jodhpur’s Umaid Bhawan in Dec 2018.\nOf course, Sophie was asked about the grand wedding that made headlines all over the world. “Is there going to be a big dance number to compete with Priyanka and Nick (at your wedding)?” Sophie was asked. To which, she replied by demonstrating the only move she remembered. Maisie William joined in soon.\nDon't Miss 365 SHARES 159 SHARES\n“No dance numbers. The thing is, Priyanka’s family are in the entertainment industry and they can dance and sing, and Joe’s family obviously can and my family are not. My brother’s a doctor, my other brother’s a lawyer,” she said shaking her head at the possibility of them dancing at the wedding.\nBut you were so good, Sophie Turner! Meanwhile, watch Sophie Turner dancing to Kareena Kapoor’s Tareefan below.\nAlso Read: Keeping Up With The Tradition, Priyanka Chopra Threw Cake At Audience During Steve Aoki’s Concert", "title": "Game Of Thrones Stars Sophie Turner & Maisie Williams Imitate Priyanka Chopra’s Dance Steps & They’re Really Good!", "date_publish": "04/04/2019, 17:37:23", "description": "Ahead of Game Of Thrones season 8, when Sophie Turner and Maisie Williams appeared on American television show Access for an interview, they also attempted Priyanka Chopra’s dance moves that Sophie learnt at the wedding in Jodhpur’s Umaid Bhawan in Dec 2018.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/game-of-thrones-stars-sophie-turner-maisie-williams-imitate-pc-s-dance-steps-they-re-really-good-364888.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_sophie_turner__maisie_williams_imitate_priyanka_chopras_dance_steps__theyre_so_1554377326_800x420.png"}