{"text": "1. Who’ll Sit On The Iron Throne? Game Of Thrones Season 8 Posters Suggest It Can Be Night King Too\nGame of Thrones season 8, the finale season is just 45 days away from its premiere. To surprise the fans and whet their appetite, HBO has released new posters to tease fans and let them know that winter is coming. There 20 posters that the channel has unveiled.\n2. Wing Commander Abhinandan Is Finally Back Home & Everyone Including Bollywood Stars Are Elated!\nAs he walked back home, everyone including Bollywood celebrities welcomed his homecoming.\n3. Shekhar Kapur Recalls Horror Of India-Pak Partition, Says His Mother ‘Played Dead’ To Save Him\nShekhar Kapoor revealed he was born in Lahore, Pakistan. He wrote that while they were migrating to India, her mother in the train played dead to hide him and his sister under the body.\nDon't Miss 161 SHARES 842 SHARES\n4. Taapsee Pannu Supports Pak Actor Ali Zafar, Says There's Nothing Wrong In Supporting Your Own Country\n“It’s his country. [If he doesn’t support his PM], he will be trolled otherwise. We are trolled here when we don’t celebrate our victories. It is stupid to expect him to do anything else. It’s not like he is not able to work because he is banned in India. He is working there and will. He needs to celebrate his country’s achievements and so do we and we are doing that. Obviously, he will support his country. What’s wrong in that?”\n5. Nawazuddin Siddiqui Supports Khans, Says One Flop Film Doesn’t Mean Their Era Is Over\nCommenting on the same, Nawazuddin Siddiqui recently told Times Now, “Ek picture flop ho gayi toh thodi na Khan ka zamaana chala gaya... Aisa nahi hota (Just because one film flopped, does it mean that the era of the Khans is over? It doesn’t happen like that).”", "title": "Game Of Thrones Posters Released, Celebs Welcome Wing Commander Abhinandan & More From Ent", "date_publish": "01/03/2019, 18:22:52", "description": "Indian Air Force pilot Abhinandan Varthaman will finally be released today by Pakistan. When the news was announced yesterday, all Indians took a breath of relief. The tensions between India and Pakistan are apparently worsening, and everyone is worried.", "authors": [], "url": "https://www.indiatimes.com/entertainment/game-of-thrones-new-posters-released-celebs-welcome-wing-commander-abhinandan-more-from-ent-363012.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/game_of_thrones_posters_released_celebs_welcome_wing_commander_abhinandan__more_from_ent_1551443642_800x420.png"}