{"text": "Winter is coming, and apparently, it’s not going away anytime soon.\nGame of Thrones, our favourite American fantasy drama show that kept us hooked for almost a decade is finally coming to an end with its last season, and that’s indeed an earth shattering news. Just imagine when the final episode of Game of Thrones season 8 will air, someone will sit on the Iron throne. Despite the fact that you may or may not be satisfied with the ending of the show, it will leave a void in your heart for sure. But, remember, it’s not the end of the world of Westeros. HBO has a lot more in store for you.\nThere will definitely be Game of Thrones spin-offs. Yes, not one but there are five prequel series in the pipeline already, according to reports. But George RR Martin says it’s possible that more series could come down the line.\nRead More: From The Exciting Plot To Star Cast, 7 Things You Need To Know About Game Of Thrones Prequel\ntimeincapp.com\nThe official synopsis of first Game of Thrones prequel says that it’s not the story you think you know. What is it about? “From the horrifying secrets of Westeros’s history to the true origin of the White Walkers, the mysteries of the East to the Starks of legend, only one thing is for sure: It’s not the story we think we know.”\nthebritishberliner.files.wordpress.com\nThis bit of information has given rise to the excited Game of Thrones fans who have their own theories on what will the show be about. Take a look!\nDon't Miss 161 SHARES 842 SHARES\n#1 It could be about Essos!\nwallpaperup.com\nWondering what’s Essos? You sure know about Westeros – the continent located in the far west of the known world of Game of Thrones. It’s not the only continent in the world of Game of Thrones. There’s Essos as well – located in the East of the known world. Essos is the home of the Free Cities and it served as the backdrop to many of the Game Of Thrones's Daenerys Targaryen-centric storylines. Fans suspect that one of the prequels could be about Essos.\nAlso, HBO’s synopsis reads, “Taking place thousands of years before the events of Game of Thrones, the series chronicles the world's descent from the golden Age of Heroes into its darkest hour.”\n#2 Origin of White Walkers\nbleedingcool.com\nRemember the first ever episode of Game of Thrones from season one begins with white walkers. But how did they rise from the dead? Did the Children of The Forest had something to do with that? One of the prequels is suspected to be about this – the origin of White Walkers.\n#3 The Age Of Heroes\nYouTube\nMentioned in the synopsis of Game Of Thrones prequels, The Age Of Heroes could be the possible subject of one of the series. This one, according to theories, will focus on the formation of Stark house. This will focus on Brandon Stark AKA Brandon the Builder, the legendary founder of the house of Stark, who build the Wall and Winterfell with the help of the giants, as people say.\nPerhaps, this will also tell stories of how other houses were formed. There’ll be lot of politics, we’re sure.\nFun fact: Well, some theories also suggest that Bran Stark is actually Bran the builder. It’s getting insane, right? He is also the Night King, some say.\n#4 Empire of Ash\nwatchersonthewall.com\nFor all those who like dragons, this one is for you all. If the theories are to be believed, this one will be set in Valyria, a ruined city in Essos, which was destroyed because of “social, economic, and political crises” a century before Aegon's Landing by an event called the Doom of Valyria. This one will include the story of dragons and House Targaryen, a family of dragon lords during that time.\n#5 The King Beyond the Wall\nTwitter\nThis Game of Thrones prequel will be about the leader who manages to unite all the wildlings under his command to pose a threat to the seven kingdoms south of the wall. This one might show the Starks in the bad light, because it will be from the perspective of the King beyond the wall.\nAlso, if you’re expecting Jon Snow (Kit Harington) or Tyrion Lannister (Peter Dinklage) to be a part of the show, you should know that George RR Martin has already revealed that the prequels won’t have any of the characters from the current season. It will focus on their ancestors. So, there will not be an Iron Throne or King’s landing. Well, that’s a bummer, but we are sure it will surpass our expectation levels.\nGame of Thrones prequels are likely to be released in 2020.", "title": "Game Of Thrones Isn’t Ending Post Season 8, There’ll Be Prequels & These Theories Will Keep You Hooked!", "date_publish": "09/02/2019, 12:38:30", "description": "Game of Thrones prequels are in the works. There will definitely be Game of Thrones spin-offs. Yes, not one but there are five prequel series in the pipeline already, according to reports. But George RR Martin says it’s possible that more series could come down the line.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/game-of-thrones-isn-t-ending-post-season-8-there-ll-be-prequels-these-theories-will-keep-you-hooked-361220.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/these_game_of_thrones_prequel_theories_will_get_you_pumped_after_season_8_ends_1548749802_800x420.jpg"}