{"text": "In a series of heartbreaking tweets, Game of Thrones star Esmé Bianco opened up on how she survived domestic abuse. 36-year-old actress who plays the role of prostitute Ros in Game Of Thrones recently admitted that because of her past, she still suffers from recurring night terrors and symptoms of post-traumatic stress disorder. In a picture that she shared online, her back is covered in marks and she joined the trending hashtag I Am Not Ok.\nShe wrote, ‘Despite the many years that have passed since this happened my night terrors and PTSD symptoms continue to get worse. I am a domestic violence survivor and #IAmNotOk.’\nFor the initiated, #IAmNotOk movement is where people from all around the globe are sharing their stories of being abuse survivors. Esmé recalled the fear she felt when celebrating her birthday with an abusing boyfriend.\n‘This photo was taken on my birthday many years ago. The night before I had been locked in the bedroom alone and had not slept,’ the actress wrote. Read her heart-wrenching story here.\nThis is my back. The injuries you see are real. The whipping that I got here was filmed in the name of “art”. Despite the many years that have passed since this happened my night terrors and PTSD symptoms continue to get worse. I am a domestic violence survivor and #IAmNotOk pic.twitter.com/nbHhdwtKbw — Esmé Bianco (@esmebianco) March 11, 2019\nDon't Miss 161 SHARES 842 SHARES\n1/2 This photo was taken on my birthday many years ago. The night before I had been locked in the bedroom alone and had not slept. I was surviving on very little food and was physically and mentally exhausted - I often wasn’t allowed to sleep (cont) pic.twitter.com/0fdvJw9yXi — Esmé Bianco (@esmebianco) March 11, 2019\n2/2 In this photo my boyfriend is giving me my birthday present. Despite the plastered on smile I can see the emptiness and fear in my eyes. We went for dinner later and he spent the whole evening berating me because he didn’t want to go out. I was not ok then and #IAmNotOk now — Esmé Bianco (@esmebianco) March 11, 2019\n#iamnotOK because I still struggle with PTSD which has had a serious impact on my life and intimate relationships. — #EvanRachelWould (@evanrachelwood) March 11, 2019\nI used to have to hide in a cupboard to call my family and friends #IAmNotOk — Esmé Bianco (@esmebianco) March 11, 2019\nMy abuser used masterful manipulation and gaslighting over many years so that I thought I was the one who was crazy, and that everything was my fault. That’s one of the hardest things to comes to terms with. I still struggle with shame and #IAmNotOk — Esmé Bianco (@esmebianco) March 11, 2019", "title": "Game Of Thrones:'Game Of Thrones' Actor Esmé Bianco Reveals Her Heartbreaking Story Of Domestic Abuse!", "date_publish": "13/03/2019, 15:43:48", "description": "In series of heartbreaking tweets, Game of Thrones star Esmé Bianco opened up on how she survived domestic abuse. 3 year old actress who plays the role of prostitute Ros in Game Of Thrones recently admitted that because of her past, she still suffers from worsening night terrors and symptoms of post-traumatic stress disorder.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/game-of-thrones-star-esme-bianco-shares-her-story-of-domestic-abuse-it-ll-send-shivers-down-your-spine-363638.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/game_of_thrones_1552472242_800x420.jpg"}