{"text": "1. Slamming ‘Feminist Of Convenience’ Kangana Ranaut, Gauahar Khan Says #MeToo Is For Real Women\nNow, ex-Bigg Boss contestant and actress Gauahar Khan has also slammed Kangana Ranaut in a post on Twitter. Calling her “Feminist Of Convenience”, she said that #MeToo movement is meant for real women.\n2. In The Light Of #MeToo Movement, Saif Ali Khan Hints At Changes In Core Team Of ‘Sacred Games 2’\n“We have been talking constantly. They don't like me talking about the show anyways. I like working with them, they are brilliant. They want to keep it a secret. But I want to give you a clue. There was a terrible scandal concerning Kevin Spacey and he had a show 'House of Cards', the show is going on but Spacey is not there. Let that be a clue,” Saif told PTI.\n3. As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware\nSajid Khan was directing his forthcoming film Houseful 4, when all hell broke loose for him. After Rachel White, Saloni Chopra and journalist Karishma Upadhyay, more women have accused the filmmaker of sexual harassment. Joining the bandwagon and sharing their win stories are Bipasha Basu, Aisha actress Amrita Puri and ex-Bigg boss contestant Mandana Karimi.\nDon't Miss 365 SHARES 862 SHARES 126 SHARES\nAyushamann Khurrana's wife Tahira Kashyap who was recently diagnosed with cancer, has also come forth to share her story. Saying that relatives are the real creeps, she revealed how after 20 years she found solace when she told her husband and parent about it.\n5. As #MeToo Gains Momentum, Usha Uthup & Sussanne Khan Warn People Against Fake Allegations\n“I honestly don't want to comment on this issue much but I definitely feel that there is lot of pretence, false allegations and sort of crazy behaviour. They are using the platform badly and it's not a good thing. If they use platform correctly then, it's supposed to be good thing. They shouldn't make allegation on an individual without any legal evidence,” she told IANS.", "title": "Gauahar Khan Slams Kangana Ranaut, Saif Ali Khan Hints At Changes In Sacred Games 2 & More From Ent", "date_publish": "14/10/2018, 17:34:16", "description": "From Gauahar Khan slamming Kangana Ranaut to Saif Ali Khan hinting that the core team of Netflix’s Sacred Games season 2 might change following the controversies surrounding the #MeToo movement in Bollywood, here is all that rocked the world of Bollywood and entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/gauahar-khan-slams-kangana-ranaut-saif-ali-khan-hints-at-changes-in-sacred-games-2-more-from-ent-354774.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/gauahar_khan_slams_kangana_ranaut_saif_ali_khan_hints_at_changes_in_sacred_games_2__more_from_ent_1539517241_800x420.png"}