{"text": "Genelia's Wishes For Best Friend And Husband Riteish On Their 7th Anniversary Is All About Love!\nGenelia's Wishes For Best Friend And Husband Riteish On Their 7th Anniversary Is All About Love!\nIn 2002, Riteish Deshmukh and Genelia D'Souza met to collaborate for a film and never in their wildest dreams thought that they are going to begin a beautiful chapter of their life.\nFrom co-stars to best-friends to now, a married couple and parents to two wonderful kids, their life is full of cliches' yet they are a couple everyone loves to love.\nIt's been 17 years of their friendship and today, they complete seven years of being happily married to each other.\nInstagram\nOften tagged as Bollywood's 'most adorable' couple, Riteish and Genelia have time and again given us ample amount of reasons why they are perfect together.\nTwitter\nGenelia was 16 when she met Riteish, who was 24 and both were trying to establish a firm foot in Bollywood. However, cupid stuck and after a nine-year long courtship, the couple finally tied the knot on February 3, 2012.\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nToday, on their seventh anniversary, Genelia wrote a love-note for husband Riteish.\nInstagram\nFrom penning down her innermost feelings full of gratitude to wishing a sweet forever, this note is a heartwarming proof of the fact that their relationship is rock-solid and something that will definitely stand the test of time and remain forever.\nShe wrote:\n\"Every girl has a certain perception of how they would want their life partner to be... I Honestly Didn’t..\nI had this most amazing partner who was my bestest friend, who was the shoulder, I always found when I needed to cry and who made me believe that no matter how tough life is, with us being partners we would take it on,in any form, in any way... That’s the man I eventually married and he never ever stopped being the reason for my smile...\nInstagram\nSo I’m glad I never ever had a perception because the reality of living and breathing this wonderful man is all I ever needed to know.. I Love you @riteishd ..Here’s to many more laughs together, to the zillion times we will wipe each other’s tears and pick each other up when either/or feels weak or simply to life together forever and ever... Happy Anniversary..\"\nRead her original post here:", "title": "Genelia's Wishes For Best Friend And Husband Riteish On Their 7th Anniversary Is All About Love!", "date_publish": "03/02/2019, 12:03:43", "description": "In 2002, Riteish Deshmukh and Genelia D'Souza met to collaborate for a film and never in their wildest dreams they thought that they are going to begin a beautiful chapter of their life. From co-stars to best-friends to now, a married couple and parents to two wonderful kids, their life is full of cliches' yet they are a couple everyone loves to love.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/genelia-s-wishes-for-best-friend-and-husband-riteish-on-their-7th-anniversary-is-all-about-love-361495.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/riteish_and_genelia_1549176602_800x420.jpg"}