{"text": "We know there are so many families, so many houses and so many relationships in Game Of Thrones. I mean, in the game of ice and fire, there are seven kingdoms, a war between five kings and a queen which has dragons as her sons. There are incestuous relationships too. And according to George RR Martin's original plan, there could have been more!\nhubstatic.com\nDid you know that George RR Martin originally wanted Arya Stark to fall in love with Jon Snow? Not only that, he also wanted to show Tyrion Lannister eventually falling in love with Arya Stark. Yes, the man behind the books that inspired the show wanted a love triangle between Jon Snow, Arya Stark and Tyrion Lannister.\nTwitter\nSo, if that would have happened, Jon Snow would have been tangled up in two incestuous relationships. Can you even imagine?\nTwitter\nDon't Miss 159 SHARES 842 SHARES\nWhen George RR Martin was plotting the outline of the original book franchise (A Song of Ice and Fire), he described how Arya Stark realised she had feelings for Jon Snow (who was then her half-brother but later revealed to be her cousin.)\newtnet.com\nAccording to excerpts reported by Insider in 2017, the outline read, “Wounded by Lannister riders, they will seek refuge at the Wall, but the men of the Night's Watch give up their families when they take the black, and Jon and Benjen will not be able to help, to Jon's anguish. It will lead to a bitter estrangement between Jon and Bran. Arya will be more forgiving... until she realises, with terror, that she has fallen in love with Jon, who is not only her half-brother but a man of the Night's Watch, sworn to celibacy.Their passion will continue to torment Jon and Arya throughout the trilogy, until the secret of Jon's true parentage is finally revealed in the last book.\"\nTwitter\nAnd boy, that isn’t all. Martin wanted Tyrion Lannister to fall in love with Arya Stark. And that would have led to a rivalry between Tyrion and Jon!\nhbo.com\n“Exiled, Tyrion will change sides, making common cause with the surviving Starks to bring his brother down, and falling helplessly in love with Arya Stark while he's at it. His passion is, alas, un-reciprocated, but no less intense for that, and it will lead to a deadly rivalry between Tyrion and Jon Snow.”\nWell, that would have been huge. After reading this, I can’t see this picture with the same emotions I had before.\nTwitter\nWould that be interesting? What do you think? Tell us about it in the comments section below.", "title": "George RR Martin Originally Wanted A Love Triangle Between Jon Snow, Arya Stark & Tyrion Lannister", "date_publish": "21/04/2019, 13:05:47", "description": "Did you know that George RR Martin originally wanted Arya Stark to fall in love with Jon Snow? Not only that, he also wanted to show Tyrion Lannister eventually falling in love with Arya Stark. Yes, the man behind the books that inspired the show wanted a love triangle between Jon Snow, Arya Stark and Tyrion Lannister.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/george-rr-martin-originally-wanted-a-love-triangle-between-jon-snow-arya-stark-tyrion-lannister-365838.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/george_rr_martin_wanted_a_love_triangle_between_jon_snow_arya_stark_and_tyrion_lannister_1555830260_800x420.png"}