{"text": "Love transcends all boundaries and that's true for all the fans who immensely love and respect Bollywood superstar Shah Rukh Khan. And Khan himself believes that believes humor and entertainment are one of the most powerful tools to strengthen human bonds across various cultures, races, nationalities, and religions.\nThe 53-year-old actor, who was honored with a doctorate in Philanthropy by The University of Law, London, on Friday, believes the reason for his popularity across the globe is the fact that what he expresses on screen is a universal emotion which everybody relates with.\nAgencies\n“One of the greatest learning for me has been to appreciate the sheer simplicity of humor and entertainment as a powerful tool for strengthening human bonds across all races, cultures, nationalities, and religions. I remember meeting fans in Germany one freezing winter evening. None of them spoke a word of Hindi, they told me that they didn’t even watch my films with subtitles yet they understood everything,” he said.\nHe received the merit during a graduation ceremony for more than 350 students, held at the Barbican in London. In his acceptance speech, Shah Rukh added,\nAgencies\n“This might have been the result of the melodrama of Bollywood plots but it was more likely just the fact that shared emotions and the simple language of their expression reaches across and binds people of all definitions. In fact, I can’t emphasize enough, the importance of expression as a binding force for compassion. It is only by expressing our stories that we create the ground for our life experience to be accepted and understood.\"\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 612 SHARES\nTalking about growing together and sharing art, Khan said,\nAgencies\nShah Rukh, who lends his support to the welfare of the people through his non- profit organization, Meer Foundation, said hoarding one’s success makes them insecure. He concludes,\n“Hoarding everything, especially the fruits of success, only leads to a narrowing of perspective, insecurity and the fear of losing power. Giving makes us alive with the possibility of others growing with us, sharing in our work and enriching our lives with their own uniquely beautiful perspectives.”\n(With agency inputs)", "title": "German Fans Watch Shah Rukh Khan Films Without Subtitles, Proving Love Transcends All Barriers!", "date_publish": "06/04/2019, 12:04:56", "description": "Shah Rukh Khan says German fans watch his films without subtitles, understand everything Shah Rukh Khan was honoured with a doctorate in Philanthropy by The University of Law, London, on Friday. He spoke about movies as mediums of communication in his speech.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/german-fans-watch-shah-rukh-khan-s-films-without-subtitles-proving-love-transcends-all-barriers-364978.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_1554534083_800x420.jpg"}