{"text": "When Conjuring had released in 2013, it was winning all the praises for its realistic portrayal of the demon haunting a family, but did you know it was not just a wild imagination of director James Wan. The movie was based on a real-life story.\nConjuring portrayed what Ed and Lorraine Warren, the real life ghost-hunters/paranormal investigators, experienced. Their story is scarier than the movie.\nTwitter\nAt the age of 92, Lorraine Warren, whose role was portrayed by actress Vera Farmiga in Conjuring, is dead. \"She died peacefully in her sleep at home,\" Warren's son-in-law Tony Spera said on Facebook, reports variety.com.\nthedailybeast.com\nIt was in 1952, that Lorraine Warren and her husband Ed founded New England Society for Psychic Research – a ghost hunting group in New England. Two of their most popular cases got cinematic adaptation via Conjuring franchise. Ed had died in 2006.\nTwitter\nDon't Miss 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nConjuring was based on the Perron Family who moved into farmhouse in Harrisville, Rhode Island. The couple and their five daughters soon started to notice strange things happening in the house and that’s when they sought Ed and Lorraine’s help.\nTwitter\nFirst the family started to notice small things like the broom would go missing, hearing strange sounds, daughters would sometimes witness spirits in the house. They knew the spirits were present but they weren’t harmful. They were angry, for sure, was one thing that they knew.\npatheos.com\nUpon studying, Carolyn discovered that the many of the people had died in the same house under strange circumstances. The spirit that was shown in the movie, Bathsheba, was apparently the worst of all.\nwheresthejump.com\nActress Vera Farmiga, who portrayed Lorraine’s role in Conjuring, Conjuring 2, The Nun and The Annabelle Comes Home said she is blessed to have known her.\n...compassion, and took a shield of faith. Righteousness was her breastplate, and she has touched my life so. Love you Lorraine. You're waltzing with Ed now. — Vera Farmiga (@VeraFarmiga) April 19, 2019\nLorraine Warren and her husband Ed have also written many books based on their cases.", "title": "Ghost-Hunter Lorraine Warren Passes Away, Here’s Her Real-Life Story That Inspired ‘Conjuring’!", "date_publish": "21/04/2019, 15:47:14", "description": "At the age of 92, Lorraine Warren, whose role was portrayed by actress Vera Farmiga in Conjuring, is dead. It was in 1952, that Lorraine Warren and her husband Ed founded New England Society for Psychic Research – a ghost hunting group in New England. Two of their most popular cases got cinematic adaptation via Conjuring franchise. Ed had died in 2006.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/ghost-hunter-lorraine-warren-passes-away-here-s-her-real-life-story-that-inspired-conjuring-365844.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ghosthunter_lorraine_warren_whose_reallife_story_inspired_conjuring_is_no_more_1555838803_800x420.png"}