{"text": "Given A Choice, Vivek Oberoi Would Like To Ask Salman Khan If He ‘Believes In Forgiveness’\nGiven A Choice, Vivek Oberoi Would Like To Ask Salman Khan If He ‘Believes In Forgiveness’\nVivek Oberoi and Salman Khan’s fallout is one of the most popular ones in the entertainment industry. After all, The love triangle that Bollywood often showcases in films, turned into real life.\nSalman Khan had drunk called Vivek Oberoi 41 times, he said in a press conference. It changed his fate in the industry, because post this incident, Vivek Oberoi’s career almost fell flat. What was the reason? Salman Khan’s ex-girlfriend Aishwarya Rai was apparently dating Vivek Oberoi. According to Vivek, Salman was drunk when he called him.\nHe even apologised to Salman Khan on the stage of an award show. But they could never bury the hatchet, it seems.\nVivek Oberoi was recently asked about Salman Khan. He was asked if the Dabangg star was given a truth serum, what would he ask him.\nTo this he replied, “Do you truly believe in forgiveness?”\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES\nWill Vivek Oberoi and Salman Khan ever be able to sort out their differences? Only time will tell.", "title": "Given A Choice, Vivek Oberoi Would Like To Ask Salman Khan If He ‘Believes In Forgiveness’", "date_publish": "15/04/2019, 18:37:27", "description": "Vivek Oberoi was recently asked about Salman Khan. He was asked he the Dabangg star was given a truth serum, what would he ask him. To this he replied, “Do you truly believe in forgiveness?” Will Vivek Oberoi and Salman Khan ever be able to sort out their differences?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/given-a-choice-vivek-oberoi-would-like-to-ask-salman-khan-if-he-believes-in-forgiveness-365510.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vivek_oberoi_has_one_question_for_salman_khan_do_you_believe_in_forgiveness_1555333016_800x420.png"}