{"text": "Giving BFF Goals A Whole New Definition, Sushmita Sen & PC Send Love To Each Other On Instagram\nGiving BFF Goals A Whole New Definition, Sushmita Sen & PC Send Love To Each Other On Instagram\nSushmita Sen and Priyanka Chopra are two glamorous divas that have made the entire nation proud. Winning the titles of Miss Universe (1994) and Miss World (2000), they have inspired millions of women, not only in India, but across the globe. But did you know they are BFFs too?\nRemember about two years ago, when the divas met, they made many hearts melt with their camaraderie? These heart-warming pictures will jog your memory.\n#1 These smiles say it all!\n#2 This one is a proof that they are BFFs, right?\nTwitter\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES\n#3 Who said two actresses can’t be friends?\nAnd their bond continues to grow stronger with each passing day. Priyanka Chopra is now married to the love of her life Nick Jonas, and Sushmita Sen is happy in love with her boyfriend Rohman Shawl. Sushmita uploaded a family picture recently and Priyanka Chopra showered all the love upon her. Take a look!\nSushmita Sen and Priyanka Chopra are BFF goals!", "title": "Giving BFF Goals A Whole New Definition, Sushmita Sen & PC Send Love To Each Other On Instagram", "date_publish": "07/02/2019, 14:09:27", "description": "And their bond continues to grow stronger each passing day. Priyanka Chopra is now married to the love of her life Nick Jonas, and Sushmita Sen is happy in love with her boyfriend Rohaman Shawl. Sush uploaded a family picture recently, the Priyanka Chopra showered all the love upon her. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/giving-bff-goals-a-whole-new-definition-sushmita-sen-pc-send-love-to-each-other-on-instagram-361740.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sushmita_sen_and_priyanka_chopra_show_love_to_each_other_on_instagram__its_an_epic_bff_moment_1549526347_800x420.png"}