{"text": "Ever since the paparazzi culture has hit India, the photographer have been capturing their favourite stars in full swing. From airport looks, restaurant after pictures, event snaps, where celebrities go, the media follows.\nSo much so, that some celebrities have admitted to calling the paps when they are reaching a particular place.\ntwitter\nOne such little star who enjoys waving and smiling at the photographers is Taimur, Son of Saif Ali Khan and Kareena Kapoor, the little one became an instagram obsession, the minute his first few photos from the hospital went viral.\nAnd unlike other celebrity kids, Bebo and Saif let their child behave like any other kids. He doesn't have his face hidden and is usually mounted on Saif's shoulder.\nInstagram\nDon't Miss 862 SHARES 346 SHARES\nThe kid is the most popular one on social media and everyone wants a piece of him and want their kids to look like him. Madhur Bhandarkar also feels the same. In fact, they were recent reports that the director has got a movie name registered in the name of 'Taimur'.\nTwitter\nWhile Taimur fans got excited to see a movie on him, the 'Heroine' director has rubbished all rumours saying, “No... it is nothing like that. My production house keeps registering titles, so there are many such titles like Awards or Bollywood Vibes, so that doesn’t mean that we are making a film right now.”\nThe national award winning filmmaker will be making a film on Ghalib instead. Looks like, Madhur has saved the name to use it in future when Taimur will face the harsh and ugly side of Bollywood. What do you think?", "title": "Taimur:Good News, The Taimur Film Is A No Starter. Turns Out Madhur Bhandarkar's Production House Keeps Randomly Registering Titles", "date_publish": "18/04/2019, 12:24:31", "description": "The national award winning filmmaker will be making a film on Ghalib instead. Looks like, Madhur has saved the name to use it in future when Taimur will face the harsh and ugly side of Bollywood. What do you think?The national award winning filmmaker will be making a film on Ghalib instead.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/good-news-the-taimur-film-is-a-no-starter-turns-out-madhur-bhandarkar-s-production-house-keeps-randomly-registering-titles-365669.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/taimur_1555567648_800x420.jpg"}