{"text": "‘Yo! What up, Biat**?’\nIf you haven’t heard of Bryan Cranston AKA Walter White AKA Heisenberg from Breaking Bad, you’re missing out on a lot in life.\nvia GIPHY\nBreaking Bad aired in 2008 and it changed the television landscape forever. When I watched it in 2015, I was so obsessed that I would ask everyone I’d meet –- ‘Have you watched Breaking Bad?’.\nI was so hooked to this show that I watched the entire five seasons in just one week. From stomach-churning episodes to the finale of sorts, I couldn’t stop raving about how amazing, spectacular and intriguing it was! #TeamWalterWhiteForLife\nwallpapermaiden.com\nIf you are tripping over Game of Thrones and you think that the American fantasy drama series is the best show so far, let us enlighten you on the fact that Breaking Bad is officially the greatest TV Show in the world. Breaking Bad holds a Guinness World Records as the highest-rated TV series ever.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\ni3.wp.com/wallup.net\nWhat’s more? Breaking Bad’s Walter White is even more loved than Tyrion Lannister from Game of Thrones. Walter White is the greatest TV character of all times, according to research conducted by Empire Magazine.\nwallpapermaiden.com\nWho would have thought a middle-aged high school chemistry teacher Walter White also known by his clandestine alias Heisenberg, played by Bryan Cranston, would become the greatest TV show character of all times!\nHe was a mediocre man who wanted to achieve big in life, but was somehow stuck between the right and the wrong. That’s basically most of us, right?\nimgur.com\nWhen you are already sympathetic towards him, he is diagnosed with lung cancer. He is at a stage when he is already finding it tough to manage the finances, and he is diagnosed with a disease that takes more money that he has ever had for his treatment. What will Walter White do?\nimgur.com\nTo secure the future of his family, he wants to earn quick money. The chemistry teacher cooks meth along with his student Jesse Pinkman. They make top quality meth that has so much demand that Heisenberg (his alter ego) faces a tough time keeping up with the demand. He is the true Drug Lord.\nhdwallpaper.nu\nHe ends up getting entangled in the world of drug underworld. His family, unaware of his drug business, is unable to deal with him. His wife wants a divorce when the DEA is looking for him. He is called the methamphetamine kingpin. He has killed all those who have come in his way.\nAll Walter White wants at the moment is to earn more money playing more illegal card games.\ndesktopbackground.org\nWith so many layers, Walter White is the greatest character of all times. In the entire show, didn’t you all crave to see him smiling, for once? While for a lot of people he was the greatest anti-hero in the world of television, for us, he defined a perfect man! Here’s why!\n#1 If it wasn’t for his family, he wouldn’t have ever ‘broken bad’!\nvia GIPHY\nIf Walter White wasn’t diagnosed with cancer, do you think he would have ever stepped in the world of drugs? He wouldn’t have ever “broken bad”. He was a family man. Whatever he did was for his family. Even in such circumstances, he risked everything so that he could leave behind money for his family; so that they could live their lives without any problems. He didn’t choose meth life, meth life chose him.\n#2 The man is fearless!\nvia GIPHY\nHe was willing to cook meth even when he knew that would mean going to jail at the end of the day.\n#3 He was Mr. Perfectionist!\nvia GIPHY\nWhatever he did, he did it best – even if that means cooking up meth. Do you even think that after all the hiccups in his journey to become the Drug Lord, anyone else – like Jesse Pinkman – would have been saved? Jesse would have landed in jail in just days if Walter White wasn’t with him.\nHe was doing it all for money, but to him quality mattered the most. He had all the knowledge of science; he knew how to weaponize science in the meth trade. He never settled for making a mediocre quality of meth. He wanted to make the best stuff. Blue sky, blue meth! If it was not because of his knowledge, do you even think, he would have survived in the underworld?\n#4 The man had guts!\nvia GIPHY\nAfter all, he had already conquered the fear of death. He knew he was dying. He dealt with some of the rotten elements of the drug world. From addicts to psycho killers and deadly partnership with Tuco, he had done it all. The man definitely had some guts.\n#5 He was honest in very many ways.\nvia GIPHY\nWe know what you’re thinking. He lied to his wife Skyler. He kept his drug business a secret. But like they say, if you’re lying for someone’s benefit, you’re not actually lying, right? He never lied. Not even to Hank. He clearly gave all the hints. After all, Hank never asked him directly if he was Heisenberg, maybe he would have told there and then. Don’t you also feel Hank should have figured it out seasons ago? He was just hiding facts, not lying, right?\n#6 He is sexy and he knows it.\nvia GIPHY\nFrom a dorky science teacher to a rugged Drug Lord, Walter White was pretty damn attractive, don’t you agree? His eyes – the way he looked – left us all swooning.\n#7 He is emotional too!\nvia GIPHY\nRemember, he saved the copy of Walt Whitman’s Leaves Of Grass that Gale Boetticher had given him? He murdered him, sure, but he kept that book hidden in the bathroom where he could read it. Don’t you think he wanted to hold on to the memories of his partner?\n#8 He was kind, generous and magnanimous!\nvia GIPHY\nThe student-teacher meth-makers Walter White and Jesse Pinkman Wasn’t Walter White and Jesse Pinkman’s bromance was the best one, right? Walter White did care for Jesse Pinkman, and you know not he wasn’t selfish. They were often at odds, but they relied on one another, stood by each other through everything – deaths of their loved ones, addiction, cancer, and what not. They cared for each other even if they showed it in less-than-perfect ways. Walter White even killed many drug dealers just to save his life.\nAlso Read: 7 Reel-Life Bromances From Popular Shows That Can Put Your Real-Life Friendships To Shame!\nvia GIPHY\nWalter White is one of a kind hero or villain – depends on how you see him. Good for evil or evil for good, we leave it on you to decide.\nAlso Read: Bryan Cranston AKA Heisenberg To Return In Breaking Bad Movie & Here’s All That We Know So Far", "title": "Good Side Of Walter White: Here's Why Heisenberg Wasn’t A Villain But The Hero Of Breaking Bad!", "date_publish": "07/03/2019, 12:31:40", "description": "Who would have thought a middle-aged high school chemistry teacher Walter White also known by his clandestine alias Heisenberg, played by Bryan Cranston, would become the greatest TV show character of all times! He was a mediocre man who wants to achieve big in life, but is somewhere stuck between the right and the wrong. That’s basically most of us, right?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/good-side-of-walter-white-here-s-why-heisenberg-wasn-t-a-villain-but-the-hero-of-breaking-bad-363205.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/good_side_of_walter_white_heres_why_we_think_he_wasnt_a_villain_but_the_hero_of_breaking_bad_1551782929_800x420.jpg"}