{"text": "A proud 90s kid through and through, i still remember vividly when the wave of Gossip Girl hit my town inciting profound discussions among teenagers in its wake. Back in 2007, when I was almost a decade younger, the ‘cool’ bug bit me twice. Once, it was in the form of Sex and The City, the second was Gossip Girl.\nHBO\nWhile the former got me hooked till date, the latter not so much. At first, i was riding high on fashion and enjoying the life and times of the Upper East Side. However, as more seasons came out i felt a huge disconnect for reasons more than one. For starters, the incestuous friendships/relationships became more and more disturbing with every episode. Secondly, the way how everything and anything was publicized through the medium of Gossip Girl made me realize that privacy is definitely a luxury for mankind and in this very show it was exploited to the maximum.\nnarcity\nNow, if we talk about the characters, there wasn’t even one character that didn’t have his or her own quirks. At first, Dan Humphrey and his sister Jenny seemed like good kids but it’s safe to say that the goodness didn’t last really long. Initially, Penn Badgley aka Dan, was somehow the least favourite character of all. I mean come on, he didn’t hold the candle in front of Chuck Bass, Blair Waldorf or Serena Van Woodsen, did he?\nDon't Miss 2.7 K SHARES\nHowever, he emerged as the most popular character after the finale, thanks to the shocking twist which revealed that he was the Gossip Girl who wrecked havoc in the lives of the upper east siders. Before you cry foul about the whole spoiler drama, let me remind you that it has been almost seven years since the show ended. If you haven’t seen the show till now then chances are that you never will.\nGlamour UK\nWhat we really need to concentrate here is that Badgley, who was the picture perfect example of an ideal son/brother/friend/man and played the part convincingly was after all the sly intrusive guy who was so desperate to be a part of the creme de la creme that he pulled the strings like a master and made puppets out of everyone else.\n7 Years on, Penn Badgley who had been laying low suddenly became a part of our lives once again and this time with an all black character Joe Goldberg. There’s no chance that one can contest that Goldberg’s character in Netflix series You had shades of gray. Badgley himself agrees with this statement. What's more he has been very vocal about the fact that Joe Goldberg is a psychopath and a person with this kind of behavioral pattern shouldn't be encouraged. He has even admitted that his character has managed to scare men more than women. In an interview with New York Times, he said,\nnetflix\n“In my experience, it tends to be men who are more horrified by Joe. I’ll go out on a limb and wonder if that is because it’s less of a novel idea to women. He’s like a nightmare that you’ve repeatedly had, whereas men are like, ‘This isn’t real!’ Women are like, ‘Of course it isn’t real, but it’s extremely representative of something.’”\nHe further said,\n“I wonder if, as a viewer, no matter how much you’ve enjoyed the frothiness of the show, you can’t get away with liking Joe without taking responsibility for being a part of Beck’s death. There are so many stories in the media about what we currently call 'toxic masculinity' and I feel like that still doesn’t get to the depth of the phenomenon. It’s just really interesting that this show of all shows is so popular right now.”\nnetflix\nThe million dollar question that arises in the head of every person that has seen both his shows Gossip Girl and You is - Aren’t these two characters eerily similar?\nAfter resisting the comparisons for the longest time, Badgley had to finally give in that even though it was completely unintentional, Joe Goldberg does seem like an extension of Lonely Boy Dan Humphrey from GG. In one of his interviews he said,\n“Any part of me that was resisting the Dan Humphrey comparison has stopped because I’ve come to recognize how much of this(YOU) is a surreal progression of Dan Humphrey.”\ntwitter\nYou has been watched by over 40 million people and has definitely taken Badgley’s acting career to new heights. Another good news for the fans is that the show has been renewed for Season 2 recently. The bottom line, however, is that Penn Badgley might have seen a lot of ups and downs in his career but one thing is for sure - the man is a phenomenal actor. To play the part of a psycho stalker with so much conviction and finesse is no child’s play. To celebrate the actor more, (because he really should be celebrated) Here are some of the unknown facts about the actor that you must know:\n1. He began his career as a voiceover artist in video games! It was his voice on two of the Mario games, namely - Mario Golf 64 and Mario Tennis. Interestingly, our beloved stalker claims to have never played the games himself!\npinterest\n2. His name is inspired from tennis balls! No, we are not kidding. There’s a cute story behind this. When Badgley’s mom was expecting him, his father used to bounce Penn tennis balls to relieve stress. During her first pregnancy scan, his mother went on to comment that her baby was the size of a tennis ball. The Badgleys were so taken by the name Penn that they decided to name their kid just that!\nwalmart\n3. He is a frontman of a band called MOTHXR. First formed just for the passion of music, this band has performed all over the world\natwood magazine\n4. He did date his Gossip Girl co-star Blake Lively aka Serene Van Woodsen for almost three years. According to Elle, the duo secretly dated for almost three years while filming Gossip Girl. In fact, no one on set knew the two had broken up in real life until the season two finale of the series.\ntwitter\n5. As per his own admission, Badgley has written a song for every girl that he has dated.\n6. He was reluctant to play Joe Goldberg initially. \"I didn't want to do it — it was too much. I was conflicted with the nature of the role,\" Badgley had told Entertainment Weekly last year.\nnetflix\nHowever, the makers thought that he would be great for the role because they wanted the viewers to understand Joe’s humanity.\n\"To be honest, in the beginning of the process, I had no interest in humanizing [Joe]. Like, please, spare us. But then I realized the only thing you can do as an actor is bring a character to life, and all that that means,\" he added.\n7. He turned down Gossip Girl twice. \"I was frustrated and I was broke and I was depressed, and I was like, 'I cannot do that again. I can't,'\" he told Vulture. He accepted the role in Gossip Girl just when he had no other option but to accept a job as a waiter.\nnetflix\nWell, good for us that he took up both these monumental roles and we are nothing but pumped to see Joe Goldberg blow our minds with his psychotic actions and maniacal nature in You season 2.", "title": "Gossip Girl To Stalker Joe, Penn Badgley Is A Force To Reckon With & It's Time We Accept That!", "date_publish": "05/02/2019, 13:18:00", "description": "Based in Britain in the early 18th century, England is at war with the French. Queen Anne, a fraile ruler sits on her throne along with her confidante Lady Sarah who is her advisor and her lover too. Yes, you read that right! She tends to the Queen’s ill health and her temperamental behaviour to help her govern the country. With a new servant Abigail played by Emma Stone, entering the scenario , L", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/gossip-girl-to-stalker-joe-penn-badgley-is-a-force-to-reckon-with-it-s-time-we-accept-that-361236.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/gossip_girl_1549351105_800x420.jpg"}