{"text": "Jon Snow knows nothing, not even the fact that the woman he is in love with is actually his aunt. In the last season, Jon and Daenerys Targaryen can be seen making love. The two are apparently unaware that they are aunt and nephew. Fans have been predicting that this might even lead to pregnancy, but in Game Of Thrones, we shall expect the unexpected.\nbustle.com\nJon Snow was unlucky when he was in love for the first time. The wildling girl called Ygritte--played by Rose Leslie, his wife in real life--died in the show. Now he has fallen in love with Daenerys. But then, in the finale episode of season 7, it is confirmed that Jon Snow is son of Rhaegar and Lyanna, and that his birth name is actually Aegon Targaryen.\nWhen Jon Snow and Daenerys get to know that they are related to each other by blood, it will definitely affect their future in big way. According to Kit Harington, the world will come crashing down on him when this happens.\n“The end of the world might be coming soon, but at least he’s in love with somebody and knows who he is — and then comes a sledgehammer,” he was quoted as saying by Entertainment Weekly.\nOn the other hand, some fans think that Jon Snow will kill Daenerys Targaryen. Will Jon Snow sit on the Iron Throne then? Only time will tell. Meanwhile, Game Of Thrones season 8 is all set to premiere on April 14. Save the date!", "title": "GoT's Kit Harington Says Jon Snow's World May Come Crashing Down But At Least He's In Love", "date_publish": "09/03/2019, 15:48:59", "description": "Jon Snow knows nothing, not even the fact that the woman he is in love with is actually his aunt. In the last season, Jon and Daenerys Targaryen can be seen making love. The two are apparently unaware of that they are aunt and nephew. Fans have been predicting that this might even lead to pregnancy, but in Game Of Thrones, we shall expect the unexpected.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/got-s-kit-harington-says-jon-snow-s-world-may-come-crashing-down-but-at-least-he-s-in-love-363430.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kit_harington_confesses_jon_snow_is_in_love_says_his_world_will_come_crashing_down_on_him_1552123791_800x420.jpg"}