{"text": "The nation is grieving and is angry. From Bollywood celebs like Madhur Bhandarkar and Uri Director Aditya Dhar urging their contemporaries to cut all ties with Pakistan and ban their artistes in the country, to celebrities like Aishwarya Rai Bachchan among others paying their tributes to the families of those who lost their loved ones by lighting candles, everyone is remembering the martyrs in their prayers.\nmagicofbollywood.com\nCondemning the terror attack on a Central Reserve Police Force (CRPF), actor Manoj Bajpayee recently told IANS that the country should have faith in them (government) and support them in such trying circumstances.\n“Words will fall short to express our anger for this kind of heinous act. My prayers are the families of soldiers who have lost their dear ones in the tragedy and it's their irreparable loss,” he was quoted as saying by IANS at Cine And TV Artistes' Association (CINTAA) and 48 Hour Film Project's first edition of 'Act Fest 2019', which he attended along with Sara Ali Khan, Ronit Roy and Divya Dutta.\nIndiawest.com\n“I feel scared and hurt... I get angry whenever I hear of such evil acts... I am feeling really sad to hear about what has happened in Jammu and Kashmir,” said Sara Ali Khan.\nTwitter\nDon't Miss 837 SHARES 862 SHARES 346 SHARES\nMore than 2,500 CRPF personnel were travelling in the convoy of 78 vehicles when they were ambushed on the Srinagar-Jammu highway. The Pakistan-based JeM terror group has claimed responsibility for the attack that took place about 20 km from Srinagar.", "title": "Government Is Capable Enough To Tackle Situation, Says Manoj Bajpayee On Pulwama Terror Attack", "date_publish": "16/02/2019, 11:34:35", "description": "Condemning the Pulwama Terror Attack on a Central Reserve Police Force (CRPF) by Jaish-e-Mohammed (JeM), actor Manoj Bajpayee recently told IANS that the country should have faith in them (government) and support them in such trying circumstances. The nation is grieving and is angry.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/government-is-capable-enough-to-tackle-situation-says-manoj-bajpayee-on-pulwama-terror-attack-362247.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/government_is_capable_enough_to_tackle_situation_says_manoj_bajpayee_on_pulwama_terror_attack_1550296705_800x420.jpg"}