{"text": "One of the key highlights from last evening at the Grammy's was former first lady Michelle Obama's surprise appearance at the Grammy Awards.\nShe was welcomed onstage by host Alicia Keys and joined Lady Gaga, Jada Pinkett Smith and Jennifer Lopez for an empowering opening address to the crowd, wrote The Hollywood Reporter.\nAgencies\nSpeaking at the event, she said, \"From the Motown records I wore out on the Southside to the 'Who Run the World' songs that fueled me through this last decade, music has always helped me tell my story.\"\nShe further added, \"Music helps us share ourselves, our dignity and sorrows, our hopes, our joys. Music shows us that all of it matters.\"\nGaga too spoke on the power of music, saying, “They said I was weird, but music led me to all of you and to my little monsters, who I love so much,” while Lopez quipped in, “Back in the Bronx, music gave me a reason to dance.\"\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nPinkett Smith added, \"Every voice we hear deserves to be honoured and respected.\"\nHost Keys ended the segment by saying, \"Who run the world?\" which was met with applause from the audience and the start of the show.\nDuring the Grammy awards, Michelle Obama also posted about female friendship on Twitter, writing, “A big part of friendship is showing up for your girls—that’s why I was thrilled to be there for the one and only @aliciakeys at the #GRAMMYs. She is one of the most genuine and thoughtful people I know—there’s no one better to help us all celebrate the unifying power of music!”\nA big part of friendship is showing up for your girls—that’s why I was thrilled to be there for the one and only @aliciakeys at the #GRAMMYs. She is one of the most genuine and thoughtful people I know—there’s no one better to help us all celebrate the unifying power of music! pic.twitter.com/8cMhTmsClA — Michelle Obama (@MichelleObama) February 11, 2019\nNotably, the move to include a female host along with four women who joined her onstage during the monologues comes a year after Recording Academy president Neil Portnow was heavily criticised over his comments that female musicians should \"step up\" to improve gender representation at the Grammys.\nAmerican singer Ariana Grande, who skipped the 2019 Grammy, won her first-ever award for best pop vocal album for ‘Sweetener’.\nThe announcement was made in the pre-telecast ceremony where a majority of the awards are given. Grande beat a tough lot of competition including Camila Cabello, Kelly Clarkson, Shawn Mendes, Pink and Taylor Swift, confirmed The Hollywood Reporter.\nAgencies\nGrande took to Twitter on Sunday (local time) to thank the Recording Academy for the award.\n\"I know I’m not there tonight (trust, I tried and still truly wished it had worked out tbh) and I know I said I try not to put too much weight into these things. This is wild and beautiful. Thank you so much,” she wrote.\nDrake won a Grammy in best rap song category for ‘God’s Plan’. However, his speech was cut short by the producers of the show.\nAgencies\nThere was already tension between the rapper and the Recording Academy. Drake and fellow top nominees Kendrick Lamar and Childish Gambino all refused to perform at the 2019 Grammy Awards, which made the show’s producer Ken Ehrlich admit that the Grammys “continue to have a problem in the hip-hop world,\" reported The Hollywood Reporter.\nHowever, it was Lady Gaga, who stole the show. Lady Gaga took home three Grammy this year. Gaga won best pop solo performance for ‘Joanne (Where Do You Think You're Goin'?)’, best song written for visual media for ‘Shallow’ and best pop duo/group performance for ‘Shallow’ (shared with Bradley Cooper), revealed The Hollywood Reporter.\nAgencies\nThis news comes just hours after the singer won a BAFTA Award for original music at the British Academy of Film and Television Arts Awards in London. This win made her the person to win a BAFTA and a Grammy in the same day, reported Variety.\nAgencies\nHere are some of the key awards.\nA list of winners at the 61st annual Grammy Awards held at Staples Center in Los Angeles.\n1. Record Of The Year\nTHIS IS AMERICA\nChildish Gambino\nDonald Glover & Ludwig Goransson, producers; Derek “MixedByAli” Ali, Riley Mackin & Shaan Singh, engineers/mixers; Mike Bozzi, mastering engineer\n2. Album Of The Year\nGOLDEN HOUR\nKacey Musgraves\nIan Fitchuk, Kacey Musgraves & Daniel Tashian, producers; Craig Alvin & Shawn Everett, engineers/mixers; Ian Fitchuk, Kacey Musgraves & Daniel Tashian, songwriters; Greg Calbi & Steve Fallone, mastering engineers\n3. Song Of The Year\nTHIS IS AMERICA\nDonald Glover, Ludwig Goransson & Jeffery Lamar Williams, songwriters (Childish Gambino)\n4. Best New Artist\nDUA LIPA\nBest Pop Solo Performance\nJOANNE (WHERE DO YOU THINK YOU’RE GOIN’?)\nLady Gaga\n5. Best Pop Duo/Group Performance\nSHALLOW\nLady Gaga & Bradley Cooper\n6. Best Traditional Pop Vocal Album\nMY WAY\nWillie Nelson\n7. Best Pop Vocal Album\nSWEETENER\nAriana Grande\n8. Best Dance Recording\nELECTRICITY\nSilk City & Dua Lipa Featuring Diplo & Mark Ronson\n9. Best Dance/Electronic Album\nWOMAN WORLDWIDE\nJustice\n10. Best Contemporary Instrumental Album\nSTEVE GADD BAND\nSteve Gadd Band\n11. Best Rock Performance\nWHEN BAD DOES GOOD\nChris Cornell\n12. Best Metal Performance\nELECTRIC MESSIAH, High On Fire\n13. Best Rock Song\nMASSEDUCTION\nJack Antonoff & Annie Clark, songwriters (St. Vincent)\n14. Best Rock Album\nFROM THE FIRES\nGreta Van Fleet\n15. Best Alternative Music Album\nCOLORS\nBeck\n16. Best R&B Performance\nBEST PART\nH.E.R. Featuring Daniel Caesar\n17. Best Traditional R&B Performance\nBET AIN’T WORTH THE HAND\nLeon Bridges and HOW DEEP IS YOUR LOVE, PJ Morton Featuring Yebba\n18. Best R&B Song\nBOO’D UP\nLarrance Dopson, Joelle James, Ella Mai & Dijon McFarlane, songwriters (Ella Mai)\n19. Best Urban Contemporary Album\nEVERYTHING IS LOVE\nThe Carters\n20. Best R&B Album\nH.E.R.\nH.E.R.\n21. Best Rap Performance\nKING’S DEAD\nKendrick Lamar, Jay Rock, Future & James Blake and BUBBLIN, Anderson Paak\n22. Best Rap/Sung Performance\nTHIS IS AMERICA\nChildish Gambino\n23. Best Rap Song\nGOD’S PLAN\nAubrey Graham, Daveon Jackson, Brock Korsan, Ron LaTour, Matthew Samuels & Noah Shebib, songwriters (Drake)\n24. Best Rap Album\nINVASION OF PRIVACY\nCardi B\n25. Best Country Solo Performance\nBUTTERFLIES\nKacey Musgraves\n26. Best Country Duo/Group Performance\nTEQUILA\nDan + Shay\n27. Best Country Song\nSPACE COWBOY\nLuke Laird, Shane McAnally & Kacey Musgraves, songwriters (Kacey Musgraves)\n28. Best Country Album\nGOLDEN HOUR\nKacey Musgraves\n29. Best New Age Album\nOPIUM MOON, Opium Moon\n30. Best Improvised Jazz Solo\nDON’T FENCE ME IN, John Daversa, soloist\nTrack from: American Dreamers: Voices Of Hope, Music Of Freedom (John Daversa Big Band Featuring DACA Artists)\n(With ANI inputs)", "title": "Grammy 2019 Top Winners + Key Highlights: Here's Everything That Went Down Last Evening!", "date_publish": "11/02/2019, 10:57:30", "description": "One of the key highlights from last evening at the Grammy's was former first lady Michelle Obama's surprise appearance at the Grammy Awards. She was welcomed onstage by host Alicia Keys and joined Lady Gaga, Jada Pinkett Smith and Jennifer Lopez for an empowering opening address to the crowd, wrote The Hollywood Reporter.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/grammy-2019-top-winners-key-highlights-here-s-everything-that-went-down-last-evening-361926.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/grammy_2019_1549862952_800x420.jpg"}