{"text": "We all remember Ross Geller’s pet Marcel the monkey, who would climb up to his shoulders in our favourite TV show FRIENDS? He adopted Marcel during the first season to keep him company after his divorce. But do you know they weren’t really the best of friends in real life?\nTwitter\nActor Matt LeBlanc, who played the role of Joey Tribbiani in the show, is \"Friends\" with co-stars Jennifer Aniston, Matthew Perry, Courteney Cox, David Schwimmer and Lisa Kudrow, but there's one star of the show that holds a place in the actor's heart: Marcel the Monkey.\nmedia3.s-nbcnews.com\n“I liked the monkey. I like animals. The monkey was really cool,” he said, adding that not everyone was a fan of the monkey whose real name is Katie.\nTwitter\nDon't Miss 2.9 K SHARES 1 K SHARES 738 SHARES 699 SHARES\n“Schwimmer not so much. He's the one that had to work with it the most, so he was like, 'Again with the monkey?,” he added.\nvia GIPHY\nLeBlanc recalled that once when they were shooting on the sound stage and the monkey climbed up the lights to the ceiling and disappeared into the blackness. \"It took half an hour,\" he remembered. \"They're waving mealworms.\" No matter the mayhem, the actor didn't mind the capuchin.\nWith inputs from IANS", "title": "Guess What David Schwimmer Wasn't Fond Of Marcel The Monkey IRL & Matt LeBlanc Can Vouch For It", "date_publish": "15/03/2019, 17:34:16", "description": "We all remember Ross Geller’s pet Marcel the monkey, who would climb up to his shoulders in our favourite TV show FRIENDS? He adopted Marcel during the first season to keep him company after his divorce. But do you know they weren’t really the best of friends in real life?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/guess-what-david-schwimmer-wasn-t-fond-of-marcel-the-monkey-irl-matt-leblanc-can-vouch-for-it-363787.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/sorry_friends_fans_ross_wasnt_fond_of_marcel_the_monkey_says_matt_leblanc_aka_joey_1552650527_800x420.png"}