{"text": "Many come to Mumbai with suitcase full of dreams but what lies ahead for them totally depends on their destiny, luck and hard-work. What lies ahead for them is a reality that only they know.\nIn a heartbreaking story, it has come to spotlight that actor Savi Sidhu, who has worked in films like Gulaal, Patiala House and Bevakoofiyan is not being able to make ends meet.\nIn a rather shocking Revelation, Film Companion recently shared a 5-minute long video on YouTube, where the actor shares how after not being able to crack more films and roles in Bollywood,he had to give up on his Bollywood dreams to take up a job as a security guard.\nToday, he does 12 hours shift as a security guard in a housing society.\nIn the video, he starts talking about his initial days. He said,\nTwitter\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\n“Anurag Kashyap mile struggle karte karte toh mujhe Paanch mei liya, unki jo pehli film thi release nahi hui. Uske baad unhone mujhe Black Friday mei liya, one of the main characters that is Commissioner Samra ka role kiya maine then unke sath maine Gulaal bhi kari. Maine Yash Raj, Subhash ji ke sath, Nikhil Advani ke sath Patiala House kari”\nTalking about his 'Acting Ka Keeda', he further adds,\n“Since my brother got a job in Air India, it became easier for me to come to Mumbai. Fir jaise struggle hoti hai... maine shuri kari producers ko milna”\nSpeaking about why things didn’t work out for him in Bollywood he said,\n“Kaam ki kabhi problem nahi hui. Mujhe hi chhodna pada ki mai nahi kar pa raha hoon. You know... it was like kya mere liye wait kar raha hai... yaha jaise logo ko kaam milta nahi aur mere pas itna kaam hai ki mai kaam nahi kar pa raha. Meri health problems badh rahi hain. Meri financial problems bhi badh gayi, health problems bhi badh gayi toh kaam khatam ho gaya.”\nHe then shared details of the toughest phase of his life. He wrote,\n“Sabse tough phase wo tha when I lost my wife”. He added that he lost everyone close to him to death, including his parents and inlaws.\nSidhu further added that he misses watching films in halls because he has no money to afford tickets.\n“Mere pas bus ke paise nahi hain apne director producers ko milne ke aise halat hain. Ja ke film dekhna toh mere liye dream hai abhi. Bohot filme miss kar raha hoon... dekhne ka mann karta hai par meri financial position aisi hai\"\nBut hope hasn't died for him. he concludes by saying: “They are waiting for me, mai aa raha hoon”.\nAs they say: Remember, hope is a good thing, maybe the best of things, and no good thing ever dies. We hope his dreams see the light of the day soon!", "title": "'Gulaal' Actor Savi Sadhu, Who Has Worked With Akshay Kumar-Anurag Kashyap, Takes Up Job As A Security Guard", "date_publish": "19/03/2019, 12:20:02", "description": "In a rather shocking Revelation, Film Companion recently shared a 5-minute long video on YouTube, where the actor shares how after not being able to crack more films and roles in Bollywood,he had to give up on his Bollywood dreams to take up a job as a security guard.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/gulaal-actor-savi-sadhu-who-has-worked-with-akshay-kumar-anurag-kashyap-takes-up-job-as-a-security-guard-363934.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/anurag_kashyap_actor_1552984054_800x420.jpg"}