{"text": "Gully Boy Ranveer Has Found A Way To Combat Traffic, Raps 'Apna Time Aayega' While Being Stuck\nGully Boy Ranveer Has Found A Way To Combat Traffic, Raps 'Apna Time Aayega' While Being Stuck\nThe lyrics of Ranveer Singh's Gully Boy song could be 'Apna Time Aayega' but in real life, his time has indeed come. With the success of Padmaavat and Simmba, Ranveer Singh has proved that he is one of the most bankable stars of today.\nThe trailer of Gully Boy was unveiled a few days ago and it indeed managed to live up to the hype. So was the trailer worth the wait? Well, indeed!\nExcel Entertainment\nAnd now, it's been just two days since the first rap 'Apne Time Aayega' was released and it's on loop for most of his fans' playlist.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe scenario is pretty much the same for Ranveer himself who posted a video of singing along his own rap while being stuck in traffic.\nDirected by Zoya Akhtar and produced by Excel Entertainment, Gully Boy is all set for its release on 14th February 2019.\n(Also read: 9 Reasons Why We Are Eagerly Waiting For The Release Of Ranveer Singh - Alia Bhatt's Gully Boy)", "title": "Gully Boy Ranveer Has Found A Way To Combat Traffic, Raps 'Apna Time Aayega' While Being Stuck", "date_publish": "16/01/2019, 11:29:40", "description": "The lyrics of Ranveer Singh's Gully Boy song could be 'Apna Time Aayega' but in real life, his time has indeed come. With the success of Padmaavat and Simmba, Ranveer Singh has proved that he is one of the most bankable stars of today. The trailer of Gully Boy was unveiled a few days ago and it indeed managed to live up to the hype. So was the trailer worth the wait? Well, indeed!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/gully-boy-ranveer-has-found-a-way-to-combat-traffic-raps-apna-time-aayega-while-being-stuck-360482.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_1547618712_800x420.jpg"}