{"text": "The hype around Gully Boy is matching up to the excitement of people who have watched the film and are all praises. The team was present at the Berlin International Film Festival for the premiere and people can't stop showering praises at the team for putting up such a brilliant show.\nA special screening of the film was hosted by Zoya Akhtar and the team and celebrities who have watched it can't stop praising Ranveer and Alia. Atul Kasbekar has tagged the film as one of the top 10 films he has ever seen. In his tweet, he wrote,\n\"#GullyBoy is a cinematic masterpiece#ZoyaAkhtar is in my book the best director in the country right now. The film is a technical and emotional triumph. Have no words to describe the brilliance of @RanveerOfficial n @aliaa08. This is 1 of the 10 best Hindi films that I’ve seen.\"\nIn case you are still skeptical, whether to watch the film or not, we have got you covered.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nPraising Ranveer and Alia's spectacular performances, celebrities have given a big thumbs up.\n#Gullyboy is the perfect example of a great Hindi film: It is inevitably a universal blockbuster and will do excellent business in single screens, multiplexes, India and the overseas market.. @RanveerOfficial @aliaa08 @ZoyaAkhtarOff @FarOutAkhtar @ritesh_sid — Ramesh Taurani (@RameshTaurani) February 12, 2019\nI remember when rap broke out of New York & made it to the Caribbean, my Brooklynn born bros would breakdance on cardboard boxes in Dominican Republic, America had no clue how impactful this platform was going to be for the underdog worldwide. Beautiful🎼 https://t.co/TRjC9ag9X4 — Michelle Rodriguez (@MRodOfficial) February 11, 2019\nGULLY BOY !!! GULLY BOY !!! GULLY BOY !! What a masterpiece !! @ZoyaAkhtarOff it can be ONLY YOU ONLY YOU ONLY YOU !! @RanveerOfficial it can be ONLY YOU ONLY YOU ONLY YOU !!! Bllllllllownnnnnn away !! pic.twitter.com/a8NkAtNKbj — Shankar Mahadevan (@Shankar_Live) February 11, 2019\nGULLY BOY !!! GULLY BOY !!! GULLY BOY !! What a masterpiece !! @ZoyaAkhtarOff it can be ONLY YOU ONLY YOU ONLY YOU !! @RanveerOfficial it can be ONLY YOU ONLY YOU ONLY YOU !!! Bllllllllownnnnnn away !! pic.twitter.com/a8NkAtNKbj — Shankar Mahadevan (@Shankar_Live) February 11, 2019\nFew more words on #GullyBoy. @RanveerOfficial finest work yet. Contained yet free, nuanced yet explosive. @aliaa08 A brilliant, achingly true performance, your heart breaks. The rest of the cast were perfectly pitched. Take a bow @jayoza : brilliant camerawork in a complex film. — Rahul Bose (@RahulBose1) February 12, 2019", "title": "Gully Boy Is Earning Praises! Celebrities Go Gaga Over Alia And Ranveer's 'Finest' Performance", "date_publish": "12/02/2019, 16:52:26", "description": "The hype around Gully Boy is matching up to the excitement of people who have watched the film and are all praises. The team was present at the Berlin International Film Festival for the primer and people can't stop showering praises at the team for putting up such a brilliant show.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/gully-boy-is-earning-praises-celebrities-go-gaga-over-alia-and-ranveer-s-finest-performance-362034.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/alia_and_ranveer_1549971724_800x420.jpg"}