{"text": "All eyes right now are on Alia Bhatt and Ranveer Singh's upcoming film Gully Boy. The movie is one of the most awaited releases of the year and we are not surprised. Helmed by Zoya Akhtar, the film is loosely based on the real lives of Divine and Naezy, the underground rappers from Mumbai.\nZoya Akhtar spoke to IANS and divulged into some interesting details around the film. Zoya revealed how the film was written keeping Ranveer and Alia in mind.\nShe was quoted as saying,\nInstagram\n\"I am sure a lot of people want to pair Alia and Ranveer. We wrote the part with Alia in mind and Ranveer in mind.\" Zoya, who brings together Ranveer and Alia for the first time on the big screen, added: \"So there was no question and we loved that they both said 'yes'.\"\nTalking about the buzz around the film, Akhtar added,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I like the genre of music, I like the idea of coming-of-age on a sense and it's an underdog story. It's the story about a boy... so everything attracted me to it, every single thing. And it's a story about my city and Mumbai is a very special place.\"\nShe also mentioned the love that she has for her city, Mumbai. She adds,\n\"It's one place where I honestly believe that anything can happen. Like you can go this way and be up there and you can go that way and fall down. You can literally feel the heat around the corner and this place is magic. If you sit here and all of it put together, it's just very exciting, I just couldn't resist.\"\nWhen she asked what film her film stand out from other films, she added,\n\"This one is different because it's maybe because of your circumstances may be completely different and your experience in life in terms of the way you navigate it and negotiate it may be completely different. But if you can empathize with a character and if you can emotionally resonate with that character and understand their emotional journey, I think you are home. If you can recognize that in people, I think you can contribute to their story.\"\nThe film also stars Kalki Koechlin and is all set to release on February 14.", "title": "Gully Boy Was Written Keeping Alia Bhatt & Ranveer Singh In Mind, Says Director Zoya Akhtar", "date_publish": "09/01/2019, 14:04:41", "description": "All eyes right now are on Alia Bhatt and Ranveer Singh's upcoming film Gully Boy. The movie is one of the most awaited releases of the year and we are not surprised. Helmed by Zoya Akhtar, the film is loosely based on the real lives of Divine and Naezy, the underground rappers from Mumbai.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/gully-boy-was-written-keeping-alia-bhatt-ranveer-singh-in-mind-says-director-zoya-akhtar-360090.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/zoya_akhtar_1547024734_800x420.jpg"}