{"text": "Gully Boy is a film that lived up to the hype that it created and is doing well at the box-office. Apart from Ranveer and Alia, the whole ensemble cast of the film is earning praises. But there are people behind the screen, who deserve as much credit as the actors.\nApart from Zoya Akhtar's direction and her co-writer Reema Kagti's inputs, the dialogues by Vijay Maurya definitely deserves an applause. In an exclusive conversation with ZoomTV.com, Vijay Maurya opened up about the appreciation he is receiving for the film, he said,\n“I haven't stopped replying to people since the last three days. People are loving it! Like there are repeat audiences, they are going to watch the film, getting emotional and inspired, crying and going again. It's becoming something else, it's a fever!”\nHe added that the real rappers were brought on-board and they offered details that helped him in penning the dialogues. He said,\n“Credit to the superb cast and the rap artists who were with us - Altaf, Kaam Bhari, Rahul and Emiway. They helped us a lot. We got them on board and made them read the script.”\nHe further adds,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“So they are 18, 19-year-olds and I am an old-school Bombay man. So when they were laughing and liking the script, we got confident. Some places they said let's not use this.. like chal watak le or chintuk le nikal le, so they were like kamti ho is the new lingo.”\nMaurya, who also played Murad's uncle, Ateeq added that a lot of improvisations happened with the inputs from the actors on the sets. He said,\n“We improvised most of the stuff on the paper itself. But Ranveer is a Bombay boy. He was totally into it. You can see it from his energy and the way he portrays the character. He was just there, he gave a lot of lines. He gave that \"Abhi koi aur batayega main koun hai?\" and things like that. He was deeply involved in the film.”\nHe added that there were a lot of things that got modified on the sets and were difficult to put in on paper and pen. He said,\n“I wasn't there on the sets all the time, I was there when I was required. They improvised some words and some lines here and there and when I finally watched the film, they had taken it to another level. When you put things on the paper, from humour and emotions - everything looks fine. The brains like Ranveer and Alia - when they go through the script and characters, it's a different thing altogether.”\nTalking about Zoya Akhtar's brief for the dialogues and her characters, Maurya added that the brief was “clear and specific about her characters”. He was asked to pen down differing lingos and styles when it comes to different relationships – whether it's the romantic exchanges between Murad and Safeena or their respective conversations with their families or just Murad talking to his 'gully' friends of his rapper friends, he reveals. He added,\n“Mere boyfriend se gulu gulu karegi toh dhoptungi na usko- Being a Mumbaikar, I am surrounded by Maharashtrians and Gujaratis. Ye sab joda hua hai yaha waha se. Like 'dhoptungi' is a Marathi word meaning I will hit you and 'gullu gullu baatein' meaning sweet talk is a common phrase, a very Mumbai thing to say. So, I just mixed it. Some words from here and there, you mix match things and it should sound good.”", "title": "Gully Boy's Dialogue Writer Explains How Alia-Ranveer Brought Murad-Safeena To Life In The Film", "date_publish": "18/02/2019, 11:32:10", "description": "Gully Boy is a film that lived up to the hype that it created and is doing well at the box-office. Apart from Ranveer and Alia, the whole ensemble cast of the film is earning praises. But there are people behind the screen, who deserve as much credit as the actors.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/gully-boy-s-dialogue-writer-explains-how-alia-ranveer-brought-murad-safeena-to-life-in-the-film-362330.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1550472546_800x420.jpg"}