{"text": "'Gully Boy' Siddhant Chaturvedi AKA MC Sher To Get His Own Spin-Off, Will Be Directed By Zoya Akhtar\n'Gully Boy' Siddhant Chaturvedi AKA MC Sher To Get His Own Spin-Off, Will Be Directed By Zoya Akhtar\nEver since Gully Boy has released, Siddhant Chaturvedi has won our hearts. The man became a national crush with everyone obsessing over him. But soon he revealed that he is dating someone whose name he doesn’t want to reveal, and broke several women’s hearts.\nIn a film that starred Ranveer Singh and Alia Bhatt, Siddhant Chaturvedi stole all the limelight. So, just like us, if you have also been waiting to see him on the big screen again, the good news is that his much-loved character, MC Sher, is getting a standalone movie.\nZoya Akhtar, who directed him in Gully Boy, is reportedly planning for a spin-off focussed on MC Sher.\n“The film is entirely based on Siddhant’s character and traces MC Sher’s journey to becoming a hero. This will also give the makers a chance to delve deeper into hiphop culture and you can expect many engaging rap battles,” a source was quoted as saying by Mumbai Mirror.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMC Sher was not only a relatable character but also a true friend that everyone needs in life. It would be interesting to see his story on the big screen now! But did you know he struggled for six years before making it big in the industry?\nRead More: After Struggling For 6 Yrs, Siddhant Chaturvedi AKA MC Sher Finally Tastes Success & How! Here’s His Story\nMeanwhile, have you watched this video of Siddhant Chaturvedi dancing to Dilbar?\nDid you see how he tied his shirt to the waist and prepped to showcase his moves? The fans cheered even louder then. He was spectacular, trying to match the steps with Masaba Gupta.", "title": "Gully Boy’s Siddhant Chaturvedi AKA MC Sher To Reportedly Get His Own Spin-Off, Will Be Directed By Zoya Akhtar", "date_publish": "22/04/2019, 18:21:49", "description": "Ever since Gully Boy has released, Siddhant Chaturvedi has won our hearts. The man became a national crush with everyone obsessing over him. But soon he revealed he revealed that he is dating someone whose name he doesn’t want to reveal, and broke several women’s hearts. In a film that starred Ranveer Singh and Alia Bhatt, Siddhant Chaturvedi stole all the limelight. So, just like us, if you hav", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/gully-boy-siddhant-chaturvedi-aka-mc-sher-to-get-his-own-spin-off-will-be-directed-by-zoya-akhtar-365904.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/gully_boys_mc_sher_is_reportedly_getting_a_spinoff_zoya_akhtar_to_direct_siddhant_chaturvedi_1555935407_800x420.png"}