{"text": "What is a wedding without Guru Randhawa’s song? BORING, right? If you are a Punjabi pop fan, you sure must have heard of the popular singer. If not, you would have of course listened to songs including Suit Suit from Hindi Medium, Ban Ja Tu Meri Rani and Lahore. The mesmerizing voice behind these songs is of Guru Randhawa.\nTwitter\nFrom singing foot-tapping Punjabi songs to making his way in Bollywood, Guru Randhawa is a big star now. For the uninitiated, he is the only Indian to have made it to the Billboard Top 25 songs on YouTube. His song Lahore had secured the 21st spot in the list, in January this year.\nAnd now he is all set to win hearts abroad. So, after Priyanka Chopra’s Exotic, Guru Randhawa is collaborating with American Rapper Pitbull for his song Slowly Slowly and fans are hailing ‘Let it rain over me’.\nMy first international collaboration with Mr.Worldwide sir @pitbull will be out in 2019.@itsBhushanKumar sir and our team @TSeries are proud to do this great collaboration and we thank @pitbull sir and his whole team for making this happen.\n🙏🙏😊😊\nGod is kind ❤️ pic.twitter.com/Zej7ovyhW7 — Guru Randhawa (@GuruOfficial) November 23, 2018\nDon't Miss 186 SHARES 262 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nMy first international collaboration with Mr.Worldwide sir @pitbull will be out in 2019.@itsBhushanKumar sir and our team @TSeries are proud to do this great collaboration and we thank @pitbull sir and his whole team for making this happen.\n🙏🙏😊😊\nGod is kind ❤️ pic.twitter.com/Zej7ovyhW7 — Guru Randhawa (@GuruOfficial) November 23, 2018\nT-Series’ chairman Bhushan Kumar is bringing the two stars together. Meanwhile, T-Series is all set to become the biggest channel on YouTube soon. It has over 71 million subscribers.\n“I am quite excited to collaborate with Pitbull and the song has turned out good. Pitbull’s contribution on the song adds a magical spin that gives it yet another International twist. It’s a huge step ahead in going global. This year has been phenomenal with Bhushan Ji’s support and T-Series becoming the most viewed channel in the world, I think this collaboration will set Indian music on the global map,” Guru Randhawa said in a statement.\nAnd fans are going gaga over this piece of news.\nPitbull & Guru paji u both gonna kill it i know...good luck brothers 💥👌🏽👑🕺🏻👊🏽🙏🏼 pic.twitter.com/ynvdimkPrK — Bobo (@Bobostylenorway) November 23, 2018\nWooooooo ..✨💫🌟cheers n braaavoooooo @GuruOfficial the man always working..So proud of you n ur team..💜🤗🤘💜@pitbull welcome to Bollywood pit. @pitbull cheers to u all n lots of love n luck to u all.@itsBhushanKumar @GuruOfficial 💞🌟💫✨🌟💯 — Ssamara Sshahbuddin (@nasha6666) November 23, 2018\nOh!! My gudness🤩😍❤🔥\nWht a news u did give!!❤\nFor u only @TSeries hs achieved dis goal❤🔥🔥🔥\nU r da real pride of India🤘✌\nUr dream of collaborating with Bruno Mars will als0 come true😇\nThe day is not so far ❤ — Guruian Tiasha❤ (@Tiasha87512018) November 23, 2018\nWhoa congratulations and good luck can’t wait for this lit collab ❤️😍🔥 — Heena Bohemian (@sheenaroy70) November 23, 2018\nWuhooooo ! Super stroke 🏒 — मीनू दत्ता (@Dattaminu) November 24, 2018\nAre you excited, too?", "title": "Guru Randhawa Goes International With Mr Worldwide, Collaborates With Pitbull For A New Single", "date_publish": "25/11/2018, 12:32:19", "description": "Guru Randhawa is collaborating with American Rapper Slowly Slowly and fans are hailing ‘Let it rain over me’. T-Series’ chairman Bhushan Kumar is bringing the two stars together. Sharing a picture with the American rapper, Guru Randhawa wrote on Twitter he is quite excited to collaborate with Pitbull.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/guru-randhawa-goes-international-with-mr-worldwide-collaborates-with-pitbull-for-a-new-single-357333.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/punjabi_singer_guru_randhawa_collaborates_with_pitbull_folr_slowly_slowly_by_t_series_1543127751_800x420.png"}