{"text": "Guru Randhawa Serenaded A Girl With 'Ban Ja Tu Rani' But She Rejected Him After He Sang It To Her\nGuru Randhawa Serenaded A Girl With 'Ban Ja Tu Rani' But She Rejected Him After He Sang It To Her\nCalled the Punjabi hit-machine, Guru Randhawa is the latest Punjabi pop sensation. From Suit Suit Karda, Lahore and Ban Ja Tu Meri Rani, he has given several party anthems to Bollywood too.\nFrom clubs to weddings, it’s almost difficult to control the urge of dancing on his foot-tapping songs, isn’t it?\nFor the uninitiated, Guru Randhawa is collaborating with American rapper Pitbull for a song titled Slowly Slowly.\nMy first international collaboration with Mr.Worldwide sir @pitbull will be out in 2019.@itsBhushanKumar sir and our team @TSeries are proud to do this great collaboration and we thank @pitbull sir and his whole team for making this happen.\n🙏🙏😊😊\nGod is kind ❤️ pic.twitter.com/Zej7ovyhW7 — Guru Randhawa (@GuruOfficial) November 23, 2018\nAnd also, if you didn’t know, Guru Randhawa is the only Indian to have made it to the Billboard Top 25 songs on YouTube. His song Lahore had secured the 21st spot in the list, in January this year.\nBut did you know that Guru Randhawa wrote Ban Ja Tu Meri Rani for a girl he liked? He was quite excited about it and sang the song to her. However, she rejected him. He was left heartbroken, he revealed on The Kapil Sharma Show, according to this report.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe story didn’t end there. There’s a twist. Years after, when his song became superhit, the girl came back into his life. She confessed her love for him, but this time Guru Randhawa rejected her proposal. Sounds like a Bollywood film, right?\nMeanwhile, after the grand success of Lahore, Guru Randhawa is now planning to take a tour to Pakistan. “No, I haven't been to Lahore, but we get calls from Pakistan for a music tour. In fact, I sat with my team and we are planning to go to Pakistan... I do not know about Lahore, but we might just go to Karachi, Islamabad and Rawalpindi. Let's see,” he was quoted as saying by IANS.\nAlso Read: Guru Randhawa Goes International With Mr Worldwide, Collaborates With Pitbull For A New Single", "title": "Guru Randhawa Serenaded A Girl With 'Ban Ja Tu Rani' But She Rejected Him After He Sang It To Her", "date_publish": "19/01/2019, 17:56:13", "description": "But did you know that Guru Randhawa wrote Ban Ja Tu Meri Rani for a girl he liked. He was quite excited about it and sang the song to her. However, she rejected him. He was left heart-broken. The story didn’t end there. There’s a twist. Years after, when his song became superhit, the girl came back into his life. She confessed her love for him, but this time Guru Randhawa rejected her proposal. So", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/guru-randhawa-serenaded-a-girl-with-ban-ja-tu-rani-but-she-rejected-him-after-he-sang-it-to-her-360712.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/guru_randhawa_wrote_ban_ja_tu_meri_rani_for_a_girl_who_rejected_him_after_he_sang_it_to_her_1547898639_800x420.png"}