{"text": "Gwyneth Paltrow Bids Adieu To Pepper Potts In Avengers Endgame, Says She’s Old To Be In A Suit\nGwyneth Paltrow Bids Adieu To Pepper Potts In Avengers Endgame, Says She’s Old To Be In A Suit\nWhile fans were speculating if Chris Evans AKA Captain America and Robert Downey Jr aka Iron Man are quitting Marvel Cinematic Universe post Avengers: Endgame, another shocker has come their way. Gwyneth Paltrow who plays the role of Pepper Potts has revealed that Avengers 4 will be her last outing in the iconic role.\nwegotthiscovered.com\n“I mean, I’m a bit old to be in a suit and all that at this point,” she told Variety as she announced the news.\ngarancedore.com\n“I feel very lucky that I did it, because I actually got talked into it...It was such a wonderful experience making the first ‘Iron Man’ and then to watch how important it has become to the fans,” she added.\nTwitter\nHowever, you might see her doing cameos in future films, as she didn’t rule out the possibility of the same.\nDon't Miss 264 SHARES 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES\n“I feel honoured to be a part of something that people are so passionate about. Of course, if they said, ‘Can you come back for a day?,’ I will always be there if they need me,” she said.\nTwitter\nIt was in October 2018 that Chris Evans had hinted that Avengers: Endgame will be his last film as Captain America. The speculations started after this tweet.\nOfficially wrapped on Avengers 4. It was an emotional day to say the least. Playing this role over the last 8 years has been an honor. To everyone in front of the camera, behind the camera, and in the audience, thank you for the memories! Eternally grateful. — Chris Evans (@ChrisEvans) October 4, 2018\nHowever, later Russo Brothers debunked the rumours. “I think it was more emotional for him than us. Only because he’s not done yet. And I don’t want explain what that means but the audience will soon understand what I’m talking about,” Joseph Russo had told The Associated Press.\nRumours also suggest that Gwyneth Paltrow AKA Pepper Potts might be seen in Spider-Man: Far From Home.", "title": "Gwyneth Paltrow Bids Adieu To Pepper Potts In Avengers Endgame, Says She’s Old To Be In A Suit", "date_publish": "20/02/2019, 17:32:46", "description": "Gwyneth Paltrow who plays the role of Pepper Potts has revealed that Avengers 4 will be her last outing in the iconic role. “I mean, I’m a bit old to be in a suit and all that at this point,” she told Variety as she announced the news. However, you might see her doing cameos in future films, as she didn’t rule out the possibility of the same.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/gwyneth-paltrow-bids-adieu-to-pepper-potts-in-avengers-endgame-says-she-s-old-to-be-in-a-suit-362502.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/gwyneth_paltrow_to_say_bye_to_pepper_potts_post_avengers_endgame_as_shes_old_to_be_in_a_suit_1550663402_800x420.png"}