{"text": "Hailed As The Founder Of #MeToo In India, Tanushree Says The Movement Is Far Bigger Than Her\nHailed As The Founder Of #MeToo In India, Tanushree Says The Movement Is Far Bigger Than Her\nIt all began with Tanushree Dutta in India. The #MeToo movement which took the US by storm stirred up in India too, after Tanushree Dutta spilled beans on the incident that took place with her back in 2008. She levied sexual harassment allegations against Nana Patekar, and from there, it was the beginning of a revolution – a lot of other names were named and shamed by many more women thereafter.\nActress Tanushree Dutta is rightly regarded as the founding-mother of the \"MeToo Movement\" in India. When she spoke on her experience of being harassed 10 years ago, she opened up the floodgates for numerous other women from every walk of life to come forward with their stories.\nBut now, Tanushree is done. She is all set to return to the US, and refuses to take credit for starting the \"MeToo Movement\" in India.\nBCCL\n\"The media is just making a heroine out of an ordinary person's organic journey. I was not the doer but just a conduit and a vessel through which some change or awareness had to come about in society,\" she said.\nDon't Miss 837 SHARES 3.6 K SHARES\nNot that she is distancing herself completely from the movement. \"In a way, I needed retribution too from the incident that pushed me back several years in my professional life.\"\nBut now it's time for her to return to routine life in the US.\nBCCL\n\"I live there now. I was anyways supposed to go back eventually. This became a very long holiday by default and I'll be back again. But I'm going to miss it though, my family and everything else here,\" Tanushree said.\nShe is sure the \"MeToo Movement\" will go on in India regardless of her presence.\n\"Nothing should be dependent on me because when things are dependent on the initiative by a single individual, they get bound and don't flourish freely in its own time,\" the actress said.\nWith inputs from IANS", "title": "Hailed As The Founder Of #MeToo In India, Tanushree Says The Movement Is Far Bigger Than Her", "date_publish": "02/01/2019, 11:54:59", "description": "Actress Tanushree Dutta is rightly regarded as the founding-mother of the \"MeToo Movement\" in India. When she spoke on her experience of being harassed 10 years ago, she opened up the floodgates for numerous other women from every walk of life to come forward with their stories. But now, Tanushree is done.", "authors": [], "url": "https://www.indiatimes.com/entertainment/hailed-as-the-founder-of-metoo-in-india-tanushree-says-the-movement-is-far-bigger-than-her-359664.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hailed_as_foundingmother_of_metoo_in_india_tanushree_dutta_says_the_movement_is_far_bigger_than_h_1546409972_800x420.jpg"}