{"text": "James Bond star Daniel Craig says his level of fame has forced him to master binge drinking.\n\"I've got this window of opportunity in pubs of about 30 minutes,\" the 50-year-old said, reports the Daily Star.\n\"After that things start happening and it's not relaxing any more. I've got really good at drinking 18 pints in half an hour. I like to have a drink, and I love pubs and I love finding new pubs and places to socialise. But that has a limit on it now.\"\nreuters\nHe said smartphones are to blame for ruining his nights out because he is constantly mobbed by fans asking him to pose for selfies, reports mirror.co.uk.\nHe said he has no problem with signing autographs all day long or for posing for the odd picture, but that being photographed all night long in a bar \"p****s\" him off.\nreuters\nThe star said that people in the movie business all talk about the good old days when they could go to a bar and get so drunk they'd fall over without worrying that someone was going to get pictures and videos of them.\nDon't Miss 3.1 K SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nCraig said he \"can't live a normal life\" thanks to the fact that \"everyone's got a camera\".\nInputs From IANS", "title": "James Bond Star Daniel Craig Blames Smartphones For Ruining His Night Outs", "date_publish": "06/11/2018, 14:38:11", "description": "James Bond star Daniel Craig says his level of fame has forced him to master binge drinking. \"I've got this window of opportunity in pubs of about 30 minutes,\" the 50-year-old said, reports the Daily Star. \"After that things start happening and it's not relaxing any more. I've got really good at drinking 18 pints in half an hour. I like to have a drink, and I love pubs and I love finding new pubs", "authors": [], "url": "https://www.indiatimes.com/entertainment/hames-bond-star-daniel-craig-blames-smartphones-for-ruining-his-night-outs-356161.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/daniel_craig_blames_smartphones_for_ruining_his_night_outs_1541495756_800x420.jpg"}