{"text": "He's one of the finest artists of Bollywood. He's one of those few supporting actors that most of you know by name and face, otherwise we usually know we have seen a particular actor but fail to recall their name. And he's certainly not one of them.\nWhether it's reel or real life, Annu Kapoor has manged to make a mark in the showbiz industry. But it has a been a really long journey, almost 30 years. He started his journey with the famous Antakshari show on television.\nWe are sure you remember how Annu Kapoor said Deewane, Parvaane and Mastaane, every time he announced the teams in Antakshari. Soon, Annu Kapoor graduated into the world of films and we couldn't be more thankful.\nHere's taking a look at 9 of his performances that makes Annu Kapoor one of the finest actors of Bollywood. Check it out:\nDon't Miss 264 SHARES 837 SHARES\n1. Mr. India\nYoutube/screengrab\nHe played the role of a nervous newspaper Editor and Sridevi's boss in the film. Featuring Anil Kapoor and Sridevi, Mr. India went onto become one of the classic movies in Indian cinema. Annu Kapoor is hilarious in the film especially during the time when he witnessed the invisible Mr. India in his office. Take a look.\nA tiny role but he does full justice to his part. His reaction to when Mr. India calls him, 'Hello, Gaitonde' is the funniest one.\n2. Vicky Donor\nVicky Donor/youtube screengrab\nAnnu Kapoor played the role of a fertility expert who ran a clinic and a sperm bank in Delhi. His character Dr. Baldev Chaddha was a vital one after Ayushmann Khuranna's role. In the film, Chaddha meets Vicky to convince him for sperm donation and what follows is a dramatic comedy.\nAfter his impactful role in Vicky Donor, Annu Kapoor permanently sealed his place in Bollywood. The movie went on to become a mega hit. Reviews or box office collection, the movie was declared positive and funny. Annu Kapoor's role was appreciated so much that he received a Filmfare award as well as a National Film Award for Best Supporting Actor for Vicky Donor.\n3. Jolly LLB 2\nJolly LLB2/youtube screengrab\nA courtroom drama, Annu Kapoor played the role of a lawyer alongside Akshay Kumar in Jolly LLB 2. Despite having an A-lister as his co-star, Annu Kapoor stood out. There are moments when you strongly feel for Annu Kapoor despite his ruthless and powerful behaviour in the film. The movie in a lot of ways took a dig at the Indian legal system and the last scene of the film makes Annu Kapoor a star. A must watch film as it shows an ugly truth about the country with the help of some of the finest performers.\n4. 7 Khoon Maaf\nyoutube/Screengrab\nHe essayed the role of Priyanka Chopra's 5th husband as Inspector Keemat Lal. The actor got hooked up to the beauty of Susanna (PC) and knew she was married earlier and her four husbands were killed. Despite so many actors like Naseeruddin and irrfan Khan, Annu Kapoor's role is strong and significant in the dark and edgy film.\n5. Chaalbaaz\nTwitter\nHe played the role of a house servant at Anju's (Sridevi) home but it's not just any random role. Playing a pivotal part in the film, Daddu aka Annu Kapoor helped Sridevi sustain in his house where she is constantly harassed by relatives played by Anupam Kher and Rohini Hattangadi. Fun fact: Annu Kapoor played a role double his age in the film. The film is not only remembered for its storyline but also because of the cast. From Shakti Kapoor, Rajinikanth, Sunny Deol, Anupam Kher, Sridevy and Annu Kapoor, this was one of the first mega starrer films.\n6. Raincoat\nTwitter\nOne of the most underrated films, starring Ajay Devgn, Aishwarya Rai and Annu Kapoor, the movie was around two people who're in love but pretending to have moved on. Both lie about each other's dire financial situations. The movie's title Raincoat comes to play when Neeru wears it to go out and fetch some food for Ajay and herself. That's when the landlord played by Annu Kapoor speaks about the real situation of the household, and prompts Mannu to give his borrowed money as rent for the house.\n7. Aitraaz\nyoutube/screengrab\nNot only the performances but the story's concept is progressive on a lot of levels. Aitraaz addressed the story of a man accused of sexual harassment by his female boss. It was a bold subject as it revolved around sexual harassment of a man. Receiving several accolades, Aitraaz was hit back in 2004.\nAnnu Kapoor played the role of barrister Ram Chauthrani who took up Raj's (Akshay Kumar) case and tried to help him win the battle against Priyanka Chopra( Sonia) before Kareena steps in.\n8. The Shaukeens\nyoutube/screengrab\nAn otherwise terrible film, Annu Kapoor is the only saving grace. Revolving around 3 old men who want to have a little fun, the movie got Anupam Kher, Annu Kapoor and Piyush Mishra together for the first time.\nUnlike the other two who are married, Annu Kapoor played Kamaldheer Sharma who is unmarried, rich and unapologetic. While most actors shy away from saying the 'S' word, Annu Kapoor pleasantly surprised the audience from featuring in a cool film like Shaukeens.\n9. The Fakir Of Venice\nYoutube/Screengrab\nA little late to the party, but the movie was almost a decade ago. Yes, The Fakir Of Venice was supposed to be Farhan Akhtar's acting debut, however, due to production issues, the movie shifted quite a few times.\nThe Fakir of Venice revolved around the two faces of every human being which primarily come out due to situations, needs, goals and wants and Farhan played the role of a conman along with Annu Kapoor who are out to cheat visitors to a museum in Spain with their ‘Fakir’ act.\nTo conclude this, we all know Annu Kapoor is one of the most under valued and uncelebrated actor of Bollywood. So here's hoping Annu Kapoor gets finer scripts and more lead worthy roles because he's really out there to impress and win his audience each time with every role. Happy Birthday, Annu Kapoor and thank you for being a gem in our industry.", "title": "annu kapoor:Happy Birthday, Annu Kapoor", "date_publish": "20/02/2019, 17:07:05", "description": "Happy Birthday, Annu Kapoor - 9 Films That Prove He's The Uncelebrated Supporting Actor In Bollywood. Happy Birthday, Annu Kapoor - 11 Films That Prove He's The Uncelebrated Supporting Actor In BollywoodHappy Birthday, Annu Kapoor - 11 Films That Prove He's The Uncelebrated Supporting Actor In BollywoodHappy Birthday, Annu Kapoor - 11 Films That Prove He's The Uncelebrated Supporting Actor In Bol", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/happy-birthday-annu-kapoor-9-films-that-prove-he-s-the-most-undervalued-actor-in-bollywood-362462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/annu_kapoor_1550646618_800x420.jpg"}