{"text": "Happily Ever After Begins! Ranveer Singh And Deepika Padukone Tie The Knot In Italy\nHappily Ever After Begins! Ranveer Singh And Deepika Padukone Tie The Knot In Italy\nIt's a match! A match that is going to last forever.\nAfter dating for over six years, Bollywood's most loved couple Deepika Padukone and Ranveer Singh have finally tied the knot in Italy in a traditional Konkani ceremony today at Villa del Balbianello in Lake Como.\nTwitter\nTomorrow, an Anand Karaj ceremony will be held tomorrow and will be attended by their close friends and family.\nBoth Ranveer and Deepika have been really emotional with all the festivities that have been happening. The couple currently is filled with so much love and gratitude that they both have had their emotional moments during ceremonies, claim reports.\nYesterday, during their Mehendi and Sangeet ceremony, Deepika was very emotional, especially after Ranveer went down on his knees and recited a speech for his ladylove.\nA source told Pinkvilla,\n“Ranveer was in his element completely. His happiness was evident and he made sure that it is one of the most unforgettable events of his life. The handsome hunk with his energy was seen grooving to the dhol beats.”\nThe couple will return to India and host a grand reception for their industry friends and family. Their fraternity friends are full of joy and happiness and they poured wishes for the couple.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nSuch a stunning gorgeous and beautiful couple!!!! Nazar utar lo! @deepikapadukone and @RanveerOfficial !! Badhai ho !!! Love you both!!! Here’s to a lifetime of love and joy!❤️❤️❤️❤️❤️ — Karan Johar (@karanjohar) November 14, 2018", "title": "Happily Ever After Begins! Ranveer Singh And Deepika Padukone Tie The Knot In Italy", "date_publish": "14/11/2018, 17:32:21", "description": "Yesterday, during their Mehendi and Sangeet ceremony, Deepika was very emotional, especially after Ranveer went down on his knees and recited a speech for his ladylove. “Ranveer was in his element completely. His happiness was evident and he made sure that it is one of the most unforgettable events of his life. The handsome hunk with his energy was seen grooving to the dhol beats.”", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/happily-ever-after-begins-ranveer-singh-and-deepika-padukone-tie-the-knot-in-italy-356670.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542193087_800x420.jpg"}