{"text": "How much do you know about the celebrity you love the most? Reel-life isn’t always the same as the real-life, right? What better than the Hardik Pandya episode that came into the scanner recently!\nNo matter if you love them or hate them, or love to hate them, celebs can be fake, shallow, and insincere sometimes, basically human.\nScreengrab\nHardik Pandya might not have completed his studies, but his talent brought him to the forefront in the world of cricket. Hailed as the all-rounder, when Hardik Pandya was all set to appear on the show, the audiences were excited. For the first time, they would get to see the real side of the celebrity they loved. But somehow, things didn’t turn around the way people would have expected. They were taken aback because not one but so many misogynistic and sexist remarks were made on the show.\n#hardikpandya on #KoffeeWithKaran is the reason why Parents should educate their children, teach them manners and bring them up as better human beings. — Tommy!! (@tommy_bytes) January 6, 2019\nDon't Miss 259 SHARES 12.5 K SHARES 5.5 K SHARES\nThe consequences – they were both suspended for an indefinite period; they have to explain themselves in seven days; Hardik lost his Gymkhana honorary membership; and most probably, from now on, no celebrity would be allowed to be a part of such non-cricket chat show.\nJust one show, changed everything for both of them. Who would have expected this will lead to such serious repercussions! After all, this isn’t the first time that such things were said on the show.\nTwitter\nIt’s the sixth season that is airing currently, and Koffee With Karan has always been a source of rich gossip. A lot of celebrities in order to win the koffee hamper have gone brutally honest and crass. Like Aishwarya was called plastic by Emraan Hashmi, and that spoiled everything between them.\nThings turned so sour, that even now they don’t talk to each other. In a recent interview, when Aishwarya was asked what’s the worst comment that she has ever heard for herself, she said the one in which she was called plastic. This hatched won’t perhaps be buried ever!\nYouTube\nThe hot couch of many controversies has had too many cringe-worthy moments over the years. But like they say, times are changing, people are more open-minded now, audiences have transformed, great scripts are being welcomed, the conversation about LGBTQ+ has been normalised. We moving towards a better society and, now crass is no longer acceptable. That being said, here are some of the sexist things said in the past over Koffee, on the same show, that earlier didn’t become the eye of the storm. Perhaps, back then, people thought it was cool.\n#1 Ranveer Singh asked Anushka Sharma if she wants to get her “ass pinched” while Karan Johar laughed uncontrollably.\nAnushka was clearly uncomfortable. Her expressions say it all. Sad, that this made to the final cut. Even more sad, that Karan Johar laughed uncontrollably thereafter.\n\"You want your ass pinched? I'm right here\" IS THIS YOUR HERO? Also look at how Kjo is laughing. BOLLYWOOD IS FULL OF SCUMS pic.twitter.com/nZbEWiTlp8 — babu bisleri (@PUNchayatiii) January 10, 2019\n#2 Sanjay Leela Bhansali had a really weird idea about women.\n“Women are supposed to be more interesting than men. They are the ones who lure you, who are attractive, who seduce you”.\nrediff.com\n#3 Ranveer’s best pick-up line is the worst one, and you shouldn’t ever use.\n“Is that your phone in the back pocket, because that a** is calling me” – that’s Ranveer’s best pick up line, and when he had revealed this, we all laughed at it apparently.\nTwitter\n#4 “Rate these actresses according to their sex appeal” – this is perhaps the most asked question on the show.\n#5 Kareena Kapoor said that best profession for Sonakshi Sinha is being “a housewife”.\nHow uplifting that is. A woman trying to empower the other woman! Kareena thinks Sonakshi can’t do anything but be a housewife.\nHotstar\n#6 Nargis Fakhri laughed off her “butt cheek” remark like it was so cool!\nWhile talking about her name, the last name in particular which has often been mistaken for something else, she revealed that her first name too in Spanish sounds like Nalgas, which means butt cheeks. Didn’t we all laugh at this too?\nYouTube\n#6 Karan Johar thinks Mallika can never play a girl-next-door role because according to him she is always saucy and sexy.\n“Can you be a girl next door, Mallika? Can you really?? Even in Pyaar Ke Side Effects, there was kind of saucy, sexy vibe that ran through the film”, he said.\nTwitter\n#8 Sanjay Dutt almost slut-shamed Kangana Ranaut.\n“What would you do if you woke up one morning as Kangana,” asked KJo, to which Sanjay Dutt replied, “wear a Salwar-Kameez”.\nHotstar\n#9 When Priyanka Chopra and Deepika Padukone didn’t want to talk about their former relationships, he tagged them as “Mother Priyanka” and “Mother Deepika”.\njfwonline.com\n#10 Emraan Hashmi flaunted his misogynist views.\n“Has your wife just accepted the situation that you are a part of a lot of erotic films?”, asked KJo, to which, he replied, “We have a deal. I take her shopping and she swipes the card close to seven-digit number.”\nYouTube\n#11 Twinkle Khanna said Akshay Kumar has a few more inches than the Khans.\nWhen asked what is one thing that Akshay has and other Khans don’t, Twinkle Khanna said, “few extra inches”. We all laughed at this back then, remember?\nTwitter\nEveryone has been questioned in the recent Hardik Pandya and KL Rahul episode, but Karan Johar. He has laughed at the sexist comments made on the show so often. Isn’t he answerable too? What do you think?", "title": "Hardik Pandya Wasn’t The Only One! 11 Times Celebs Made Sexist & Misogynistic Remarks On Koffee With Karan", "date_publish": "15/01/2019, 17:44:51", "description": "The hot couch of many controversies has had too many cringeworthy moments over the years. Not only Hardik Pandya or KL Rahul, here are other celebrities who made sexist and misogynistic comments on the show. That being said, here are some of the sexist things said in the past over Koffee, on the same show, that earlier didn’t become the eye of the storm. Perhaps, back then, people thought it was c", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hardik-pandya-wasn-t-the-only-one-11-times-celebs-made-sexist-misogynistic-remarks-on-koffee-with-karan-360469.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/no_hardik_pandya_wasnt_the_only_one_11_other_times_celebs_made_sexist_comments_on_koffee_with_kar_1548050465_800x420.jpg"}