{"text": "Hardik Pandya’s KWK Episode Removed From Hotstar, Ranbir Kapoor Is A Protective Boyfriend And More From Ent.\nHardik Pandya’s KWK Episode Removed From Hotstar, Ranbir Kapoor Is A Protective Boyfriend And More From Ent.\nRanbir was seen extremely protective for girlfriend Alia; he was guarding her and wrapped his arm around her and walked her through the car. Well, chivalry should be his middle name.\nTwitter\nOn the other side, Hotstar, which is the online streaming partner for the show, has taken down the episode of Koffee With Karan featuring KL Rahul and Hardik Pandya. Furthermore, Star World has also removed all the teasers and photos from social media handles.\nThis week, we saw some of the coolest selfies shared by our Bollywood celebrities. While some created a huge sensation on the internet some were trolled by the fans. Here's taking a look at the coolest selfies of our Bollywood stars from this week.\nWhen Rohit Shetty met with Prime Minister Narendra Modi recently – along with other young icons of the Hindi film industry that included Alia Bhatt, Ranveer Singh, Vicky Kaushal, Karan Johar and Ashwiny Iyer Tiwari among others – to discuss how the entertainment industry can contribute to nation building, he was praised by the PM for making films on the police force.\nTwitter\nBollywood actor Hrithik Roshan might not have had a movie release in the last one year but that has not stopped his fans from showering their love on him. The actor who turned 45 yesterday, had a quiet birthday with family and friends.", "title": "Hardik Pandya’s KWK Episode Removed From Hotstar, Ranbir Kapoor Is A Protective Boyfriend And More From Ent.", "date_publish": "11/01/2019, 18:31:20", "description": "When Rohit Shetty met with Prime Minister Narendra Modi recently – along with other young icons of the Hindi film industry that included Alia Bhatt, Ranveer Singh, Vicky Kaushal, Karan Johar and Ashwiny Iyer Tiwari among others – to discuss how the entertainment industry can contribute to nation building, he was praised by the PM for making films on the police force.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/hardik-pandya-s-kwk-episode-removed-from-hotstar-ranbir-kapoor-is-a-protective-boyfriend-and-more-from-ent-360265.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranbir_kapoor_1547212170_800x420.jpg"}