{"text": "Opening up about the failure of his last film Zero, Superstar Shah Rukh Khan says he felt bad when \"Zero\" failed, and he hasn't zeroed in on his next project till now. \"Unfortunately, 'Zero' itself wasn't received too well back home in India. Maybe I made the wrong film, maybe I did not do the right storytelling so I am a little wary how it will be received here and I hope people here will like it,\" Shah Rukh, who has been receiving a lot of love here, said in an interview to China Global Television Network (CGTN\nThe day the news of Varun Dhawan and Katrina Kaif working together was out, fans couldn’t contain their excitement, but fate had different plans. The film landed to Shraddha Kapoor as Katrina couldn’t manage the dates for the film. The film in question is Remo D’souza’s Street Dancer 3D, and we all know Kat’s prowess in dancing and how apt she would have been for this role. But there’s always a next time.\nDon't Miss\nVicky Kaushal is the current heartthrob right now, all thanks to his outstanding performances in Sanju, Raazi and Uri, after giving back to back hits, he has become the most bankable actor. After becoming a star, every move of Mr. Kaushal is being tracked especially his personal life. There were rumours that he was dating Harleen Sethi, but looks like with fame, their relationship went sour and they parted ways. Does this not remind you of Sushant and Ankita Lokhande's tragic love story?\nJust a few days ago, Ekta Kapoor’s Balaji Motion Pictures released a motion poster for Mental Hai Kya, a film starring Kangana Ranaut and Rajkummar Rao. While people are pumped up with excitement to watch Rajkummar Rao and Kangana share the screen-space again after Queen, Mental Health Experts in India are not very happy.\nGully Boy was a film that turned out to be lucky for newbie Siddhant Chaturvedi. In his recent interview, Siddhant said that he wanted to be loved by people and has taken a vow to always handle his own social media. \"I always wanted people to love me. I am happy that's happening now,\" Siddhant said.", "title": "Harleen Sethi Confirms Break Up With Vicky Kaushal, SRK Talks About Zero And More From Ent", "date_publish": "19/04/2019, 18:21:27", "description": "Just a few days ago, Ekta Kapoor’s Balaji Motion Pictures released a motion poster for Mental Hai Kya, a film starring Kangana Ranaut and Rajkummar Rao. While people are pumped up with excitement to watch Rajkummar Rao and Kangana share the screen-space again after Queen, Mental Health Experts in India are not very happy.", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/harleen-sethi-confirms-break-up-with-vicky-kaushal-srk-talks-about-zero-and-more-from-ent-365777.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_news_1555678442_800x420.jpg"}