{"text": "Looks like the #MeToo movement is not coming to an end anytime. The whole movement started after women celebrities came out and spoke against American film producer Harvey Weinstein and how he sexually assaulted them.\nAnd now another woman has spoken about the filmmaker. Yes, a new lawsuit has been filed against American film producer Harvey Weinstein on Friday by an actress who claims that he repeatedly assaulted her.\nThe woman, identified in the suit only as Jane Doe, stated that he forcibly performed oral sex on her, repeatedly masturbated in front of her, and threatened to harm her career if she objected over the course of more than two years, confirmed Variety.\nhellomagazine\nAccording to the suit, Weinstein pushed her to the ground during a meeting in his office in 2013. He then removed her underwear and began to perform oral sex, as she started to sob in protest. He then asked, \"Do you even want to be an actress?\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWeinstein also bragged about allegedly sleeping with Jennifer Lawrence and said that he was trying to help her and that he was the gateway to her dreams, according to the suit. In reference to the suit, Lawrence on Friday issued a statement denying that they had a sexual relationship.\n\"My heart breaks for all the women who were victimised by Harvey Weinstein,\" Lawrence said. \"I have never had anything but a professional relationship with him. This is yet another example of the predatory tactics and lies that he engaged in to lure countless women.\"\nTwitter\nThe plaintiff said that she first met Weinstein at the Sundance Film Festival in 2013. She said she went to his suite, where Weinstein barged in on her while she was using the bathroom and pulled down his pants and masturbated, eventually ejaculating on her skirt.\nMeanwhile, Weinstein' s attorney denied that he engaged in non-consensual sex, and alleged that his accusers are lying about consensual relations.\nInputs from IANS", "title": "Harvey Weinstein Allegedly Bragged About Having Sex With Jennifer Lawrence, Claims New Lawsuit", "date_publish": "15/12/2018, 17:40:56", "description": "A new lawsuit has been filed against American film producer Harvey Weinstein on Friday by an actress who claims that he repeatedly assaulted her. The woman, identified in the suit only as Jane Doe, stated that he forcibly performed oral sex on her, repeatedly masturbated in front of her, and threatened to harm her career if she objected over the course of more than two years.", "authors": [], "url": "https://www.indiatimes.com/entertainment/harvey-weinstein-allegedly-bragged-about-having-sex-with-jennifer-lawrence-claims-new-lawsuit-358677.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/harvey_weinstein_and_jennifer_lawrence_1544876327_800x420.jpg"}