{"text": "First of all, if you haven't watched the trailer yet - Here it is!\nValar Morghulis, my friends. HBO has finally dropped the much-awaited Game of Thrones season 8 trailer and everyone is tripping over it. We know you must have watched it a hundred times already. But did you notice these little details that could be possible spoilers?\nfacebook/gameoflaughs\n#1 Is Arya Stark doomed to die?\nYouTube/GameOfThrones\nArya Stark is the epitome of courage. The girl has never given up; she has never been afraid. Then what is that she is running away from? Isn’t that a contrast between her saying that she wants to see many faces of death. Also, why is she not wearing an armour, when we can clearly see a battle in Winterfell is happening? The Unsullied and Winterfell soldiers seem all prepared. Is she going to die? Or just like she did in the past, she is yet again tricking the enemy into a trap? What do you think?\nDon't Miss 161 SHARES 842 SHARES\n#2 White Walkers might attack the Winterfell!\nYouTube/GameOfThrones\nHave the White Walkers reached Winterfell? Arya Stark is holding a dragonglass blade in her hand. She is not wearing any armour. Is that a white walker she is running away from? She has the tool to kill whatever is chasing her. Or maybe, the dead Starks buried in the crypts have risen again? Is Night King behind all this?\n#3 We will see Jon Snow riding a dragon!\nyoutube/gameofthrones\nThe trailer teases that Jon Snow will ride Rhaegal, and why not! After all, it has been named after his father Rhaegar. Jon has Targaryen blood. He definitely can ride a dragon.\n#4 Gendry will teach people to forge Valyrian steel.\nyoutube/gameofthrones\nThe white walkers are attacking and they all need more Valyrian steel, the only thing that can kill the army of dead. Gendry, in this glimpse, is clearly the one who will teach people how to make weapons with Valyrian steel.\n#5 Is Jamie dead?\nyoutube/gameofthrones\nCersei can be seen sipping wine. She is in misery but she has a smile on her face? Does that mean things are going according to her plan but her brother Jamie Lannister is dead? Are White Walkers coming for the King's Landing after wiping out her enemies in the North?\nAlso, in last season she had refused to sip wine because she was pregnant. Now that she is drinking it, does this mean the unborn child has died? Is that why she is crying?\n#6 The battle might end in the crypts!\nyoutube/gameofthrones\nIn the Game of Thrones season 8 trailer, Varys can be seen with the non-fighting women and children that include baby Sam and Gilly as well. Something significant will for sure happen in the crypts. Not only the trailer but the earlier released teaser also hinted the same. Will the battle in the North end in the crypts?\n#7 Euron Greyjoy and Cersei Lannister will fight Daenerys and Jon!\nyoutube/gameofthrones\nEuron Greyjoy’s ships are shown in the trailer. But the blonde hair doesn’t look like Euron. The soldiers are dressed in gold. They are not Ironborn. Are they travelling from Essos to King’s Landing? Remember in season 7, Cersei had told Jaime that Euron would be doing this? Will the army defeat Daenerys and Jon?\n#8 Beric and Tormund are alive!\nyoutube/gameofthrones\nIf you remember, in Game of Thrones season 7 finale, Beric and Tormund were only trying to escape Night King’s attack on Eastwatch. While many thought they could be dead, the trailer shows they are very much alive and are back in Castle Black.\n#9 Sam will tell Jon Snow the truth about his Targaryen heritage!\nyoutube/gameofthrones\nBran had helped Sam piece together the truth about Jon Snow's birth parents. This glimpse of them both together hints one of them will tell him about his Targaryen heritage. Most likely it will be Sam.\n#10 Jaime Lannister will fight the battle in Winterfell.\nyoutube/gameofthrones\nIn Game of Thrones season 8 trailer, Jaime Lannister can be seen fighting alongside the Winterfell army. The voice over says, “I promised to fight for the living. I intend to keep that promise.”\n#11 The first glimpse of White horse!\nvia GIPHY\nIs that a ghost or a white horse -- what do you think?\nGame of Thrones season 8 will premiere on Arpil 14.", "title": "Have You Seen Game Of Thrones Season 8 Trailer Yet? We Bet You’ve Missed Out These Possible Spoilers", "date_publish": "06/03/2019, 14:18:40", "description": "Game of Thrones season 8 trailer is finally here. We know you must have watched it a hundred times already. But did you notice these little details that mean so much and could be possible spoilers? Is Arya Stark doomed to die? Arya Stark is the epitome of courage. The girl has never given up; she has never been afraid. Then what is that she is running away from? Isn’t that a contrast between her", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/have-you-seen-game-of-thrones-s8-trailer-yet-we-bet-you-ve-missed-out-these-possible-spoilers-363239.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/watched_game_of_thrones_season_8_trailer_we_bet_youve_missed_on_these_details_that_could_be_possib_1551860345_800x420.jpg"}