{"text": "Hazel Keech Takes #10YearChallenge, Admits She Had Depression And Would Starve Herself\nHazel Keech Takes #10YearChallenge, Admits She Had Depression And Would Starve Herself\nIf you still don’t know what #10YearChallenge is, you are probably living under a rock. It has taken the internet by storm. Social media feeds are flooded with people, including celebrities taking this challenge up.\nHowever, Hazel Keech took this challenge to narrate a different story altogether. Through her post, she revealed how she has been battling depression and bulimia (an eating disorder). She calls it a #personalcelebration.\nWhen Hazel Keech was 22-years-old, she “hid all the pain with a smile,” she wrote, adding “I was battling depression, starving myself, had bulimia, dyed my hair dark and kept it long trying to fit in and please everyone around me and joke so no one knew.”\nDon't Miss 2.5 K SHARES 132 SHARES 12.5 K SHARES 5.5 K SHARES\nRead her entire post below:\nHazel Keech shot to fame after her role in Salman Khan starrer Bodyguard. After her stint in Bigg Boss 7, she gained further popularity and became a house-hold name. Now, she is married to cricketer Yuvraj Singh and living happy healthy life.", "title": "Hazel Keech Takes #10YearChallenge, Admits She Had Depression And Would Starve Herself", "date_publish": "17/01/2019, 17:18:49", "description": "Hazel Keech took the #10YearChallenge to narrate a different story altogether. Through her post, she revealed how she has been battling depression and bulimia (an eating disorder). She call it a #personalcelebration. When Hazel Keech was 22-years-old, she would “hid all the pain with a smile,” she wrote, adding “I was battling depression, starving myself, had bulimia, dyed my hair dark and kept it", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hazel-keech-takes-10yearchallenge-admits-she-had-depression-and-would-starve-herself-360596.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hazel_keech_takes_10yearchallenge_to_admit_she_had_depression_and_she_would_starve_herself_1547725817_800x420.png"}