{"text": "HBO and Donald Trump have had a history. HBO has once again asked US President Donald Trump to stay away from using memes inspired by its hit series Game of Thrones for “political purpose”.\nOn Thursday, Trump put out a tweet with a GOT-inspired meme after US Attorney General Bill Barr reiterated that there was no collusion between the president’s 2016 election campaign and Russia. He, however, tweeted well before the report was made public.\nIn the meme that used GOT fonts, Trump is seen with his back to the camera, wearing his trademark black overcoat. Staying true to the essence of the epic fantasy series, the backdrop is a mix of mist or fog.\nafp\n“NO COLLUSION, NO OBSTRUCTION. For the haters and the radical left Democrats -- GAME OVER,” it said.\nIn response to Trump’s tweet, the network released a statement asking him to refrain from such activities.\n“Though we can understand the enthusiasm for Game of Thrones now that the final season has arrived, we still prefer our intellectual property not be used for political purposes,” HBO said, as quoted by The Hollywood Reporter.\nDon't Miss 159 SHARES 842 SHARES\nThis is not the first time HBO objected to Trump and his team drawing inspiration from GOT. Last November, the US President tweeted a photo with a slogan that resembled popular GOT catchphrase “Winter is Coming”.\n“Sanctions are coming - November 5,” was written in text reminiscent of the Game of Thrones title font. The post hinted that Trump administration would be reinstating all US sanctions on Iran which were removed under the 2015 nuclear deal, which did not go down well with HBO even then.\nThe network had appealed to Trump not to “misappropriate” the show’s slogan.\nInputs From PTI", "title": "HBO Warns Donald Trump To Refrain From Using Game Of Thrones Inspired Memes", "date_publish": "20/04/2019, 10:45:13", "description": "HBO has once again asked US President Donald Trump to stay away from using memes inspired by its hit series Game of Thrones for “political purpose”. On Thursday, Trump put out a tweet with a GOT-inspired meme after US Attorney General Bill Barr reiterated that there was no collusion between the president’s 2016 election campaign and Russia. He, however, tweeted well before the report was made pub", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/hbo-warns-donald-trump-to-refrain-from-using-game-of-thrones-inspired-memes-365786.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_1555739670_800x420.jpg"}