{"text": "Falling in love is easy but keeping that love intact is what needs efforts from both the partners. In the case of Ranveer Singh and Deepika Padukone, their mutual admiration and respect for each other became one of the key reasons why they made their relationship work. In an industry that's extremely dynamic and unpredictable, relationships don't last long.\nInstagram\nBut Ranveer Singh and Deepika Padukone sailed through it all and dated for six long years, before tying the knot in Italy in November. It was a wedding that made the internet gush and root for them for weeks.\nInstagram\nAnd now after series of celebrations and reception parties in Bengaluru and Mumbai, the couple is back to their normal life back home, in Mumbai.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nRanveer is busy with the promotions of Simba and Deepika, on the other hand, is prepping for Meghna Gulzar's next, which she is producing and also acting in. Yesterday, GQ unveiled their latest cover with Padukone and the cover story is making hearts flutter yet again.\nFor the first time ever, Mrs. Ranveer Singh gives us a closer look at her equation with husband Ranveer Singh and how love blossomed and stayed for them. She spoke in depth about her husband Ranveer Singh and her wedding.\nFor Padukone, Ranveer is not just her life-partner. He's everything rolled into one. She says,\nAgencies\n“I think you just know when you want to spend the rest of your life with that one person – and he’s everything rolled into one man. He’s my best friend, playmate, companion and confidant. I can be silly in front of him, I can be stupid in front of him, I can be sick in front of him, I can be whatever I want to be.”\nShe added how there are no insecurities or boundaries between each other. As individuals, they put in separate efforts to make it work. She adds,\nAgencies\n“With Ranveer and me, our relationship rests on the fact that we’re extremely liberal with each other, extremely supportive of each other’s professional careers and know each other’s personal needs. I think when we started dating six years ago, professionally, we were both in very different places. My career took off slightly before his, but throughout our relationship, right from 2013 – even when I was shooting for [Goliyon Ki Rasleela] Ram-Leela and Chennai Express – nothing has changed.”\nWhen she was asked to comment on how her life would change after marriage, she had a beautiful insight to share. She added,\nInstagram\n“I’ve been running a home since I was 18, so I don’t think much is going to change in that sense. But of course, we’ll go through all the changes that happen when two people start living together.” She also said that a live-in relationship was not an option for her, “I was clear right from the start that I didn’t want to have a live-in relationship to figure out if I wanted to marry someone or not. Now [I’m expecting] everything that comes with being a newly-wed: sharing space, you know, or the bills, whatever it takes for two people to live a life together.”\nApart from raving about her husband, she also gave us an interesting detail about her Bachelorette party, which became a big party with Ranveer and all their friends crashing it. She adds,\nInstagram\n“The bachelors crashed my bachelorette! Eventually, it became one big party with all our friends. We were in Orlando for a week and the aim was to get on the scariest roller coasters, to feel that rush of adrenaline like you’re flying. We went on the Hollywood Rip Ride Rockit [at Universal Studios], which Ellen DeGeneres posted about a while back. And the VR Avatar rides [at Disney’s Animal Kingdom], for which we had to stand in line for two-and-a-half to three hours, were phenomenal.”\nOn the other hand, Ranveer Singh says that after achieving the 'Boyfriend of the Millennium' tag, he is now aiming to be the best husband for Deepika. At the trailer launch of his upcoming film, he revealed,\nInstagram\n“I have achieved the title of ‘boyfriend of the millennium’. Now I am working towards being the ‘husband of the millennium’.\nWell, be at it, Ranveer! You two are real #CoupleGoals and we hope you stay happy forever!\n(Also read: Secret Is Finally Out! Ranveer Gives Deets About Dating Deepika & How He Knew She Was The 'One')", "title": "He’s My Best Friend And Confidant, Deepika Padukone Gushes Over Husband Ranveer Singh", "date_publish": "04/12/2018, 13:53:02", "description": "Falling in love is easy but keeping that love intact is what needs efforts from both the partners. In the case of Ranveer Singh and Deepika Padukone, their mutual admiration and respect for each other became one of the key reasons why they made their relationship work. In an industry that's extremely dynamic and unpredictable, relationships don't last long.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/he-s-my-best-friend-and-confidant-deepika-padukone-gushes-over-husband-ranveer-singh-357897.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_and_ranveer_1543913146_800x420.jpg"}