{"text": "On Saturday, Kangana Ranaut celebrated her 32nd birthday on Saturday in Mumbai with the media. After cutting the cake, she even interacted with the journalists and spoke about her last film Manikarnika and upcoming biopic on Jayalalithaa biopic titled Thalaivi. For the uninitiated, the Jayalalithaa biopic will be helmed by director Vijay.\nAgencies\nConfirming all the reports, Kangana confessed that she always looked forward to working on regional films. She said,\n\"I always wanted to do regional films. When we go to Tamil Nadu or Andhra Pradesh, they mainly watch only South cinema. There is a lot of disconnect with that part of the country. So, I always wanted to get a good opportunity to do work there. This just came my way. I was planning to make my own biopic. The work was going on but Jayalalithaa’s story is very similar and a far bigger success story than mine. When I heard the narration, I found it so similar (to her own biopic). We will be doing the film mainly in Tamil. It will be released in Hindi as well. I will learn Tamil.”\nKangana already has three National Awards in her kitty and she said that she's expecting another one for Manikarnika. Talking about the same, she said,\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n\"I feel there are certain things which if you will not respect, then it is, in turn, disrespectful for that organisation itself. So, if I or my film 'Manikarnika...' doesn't win at National film awards, then it will question credibility of that award ceremony but if I come across other good work then, I will be objective enough to say it's better than me. I think last year, Tabu ji gave an amazing performance in 'Andhadun'. I am floored by what she has done. I think in coming year, it will be revealed. If there will be a better performance than 'Manikarnika', I will definitely appreciate that but I don't think it will happen.\"\nKangana is currently gearing up for her next release \"Mental Hai Kya\" along with Rajkummar Rao.\n(With agency inputs)", "title": "Her Story Is Very Similar To Mine, Says Kangana Ranaut On Being A Part Of Jayalalithaa’s Biopic", "date_publish": "24/03/2019, 12:25:41", "description": "On Saturday, Kangana Ranaut celebrated her 32nd birthday on Saturday in Mumbai with the media. After cutting the cake, she even interacted with the journalists and spoke about her last film Manikarnika and upcoming biopic on Jayalalithaa biopic titled Thalaivi. For the uninitiated, the Jayalalithaa biopic will be helmed by director Vijay.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/her-story-is-very-similar-to-mine-says-kangana-ranaut-on-being-a-part-of-jayalalithaa-s-biopic-364217.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_1553413655_800x420.jpg"}