{"text": "It wouldn’t be wrong to say that Hera Pheri is simply one of the best comedy films ever made in Bollywood. “Kabeera speaking” – we all have pranked our friends with these two words when they called us, haven’t we? Be it Babu bhaiya, Raju or Ghanshyam – each character left us howling with laughter. It was a class apart comedy movie.\nFrom Baburao’s daily struggle with people dialling his number to talk to Devi Prasad to the ‘Utha Le Dhoti’ scene, Baburao’s comebacks to Sunil Shetty’s flirty skills, the love-hate chemistry of the trio is legendary. “Agar subah subah sandaas jaana hai toh singer banna padega” – remember this scene? This still tickles our funny bones. And this one was simply epic, “Kutriya Saala, dekh ke number dial kar.”\nYouTube\nHera Pheri is the most watched comedy films. No matter how many times you have watched it, if it is streaming on TV on a weekend, you would still be watching it and rolling with laughter. The jokes never get old. In fact, they get funnier with time, right?\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nYouTube\nIt has been 19 years since the first instalment of the movie made its way to the cinema halls. The second one was released in 2006. So, almost after 13 years, Hera Pheri 3 is in the works, reports Mumbai Mirror. The movie will bring back the trio – Akshay Kumar, Sunil Shetty and Paresh Rawal.\nTwitter\nAre you ready for another laughter riot? We are all set.", "title": "Hera Pheri Is Finally Returning With Its Third Installment & We Are Already Jumping With Joy!", "date_publish": "30/01/2019, 15:44:30", "description": "It has been 19 years since the first instalment of the movie made its way to the cinema halls. The second one was released in 2006. So, almost after 13 years, Hera Pheri 3 is in the works, reports Mumbai Mirror. The movie will bring back the trio – Akshay Kumar, Sunil Shetty and Paresh Rawal.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hera-pheri-is-finally-returning-with-its-third-installment-we-are-already-jumping-with-joy-361301.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hera_pheri_3_is_in_the_works__we_just_cant_wait_for_another_class_apart_comedy_movie_1548842513_800x420.jpg"}