{"text": "The first episode of the Sacred Games started with a bang and we knew it is not like any other regular Indian shows. When the first season had aired, it was so intriguing that almost everyone had binged watched it. The popularity of the Netflix India’s original show was so huge that Nawazuddin Siddiqui once said that people would recognise him as Ganesh Gaitonde in Italy.\nFans have been waiting for season 2 now to know why and how the city will be decimated in 25 days. Nawazuddin Siddiqui had earlier teased that season 2 will be the baap of the first one. “Sab Marenge, sirf Trivedi Bachega”. But why and how, everyone is still wondering.\nNow, a report in Bollywood Hungama suggests that Kalki Koechlin, known for her roles in Anurag Kashyap’s Dev D and recently released Amazon Prime's show Made in Heaven, has been roped in for season 2. It is said that she will be playing a pivotal role.\nSome time ago, Netflix had teased that “14 din mein kuch bada hone wala hai”. And it raised the excitement level of the fans.\nCalendar nikaal. Tareekh likh le. 14 din mein kuch bada hone wala hai. — Netflix India (@NetflixIndia) March 19, 2019\nAnd then in their countdown message, they teased, “6 din mein sab kuch dikhayi dene lagega.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWill a trailer be unveiled, or the release date? We are waiting for April 1. And hoping that it isn’t an April Fool’s Day joke.\nThe worst is yet to come. Sacred Games will be back for Season 2. pic.twitter.com/lSBIzQR2b9 — Netflix India (@NetflixIndia) September 21, 2018\nMeanwhile, Pankaj Tripathi who played a small role of the mysterious Guruji in the first season of much-hyped Netflix series Sacred Games, had earlier hinted that he will play a pivotal role in season 2.\n“I don’t know if my character will be a main one in the next season. I got a call last night that I have to meet Varun Grover (the writer), so the team is trying to get our busy schedules matched. We may be in the clear about the role by next week, hopefully.”\nHe added that Guruji was supposed to be kept a secret initially.\n“My character was kind of kept hidden. I shot for the series for just one day after the main shooting was over. They thought ‘Let’s bring this character into the light’. Initially, that was not the plan. Something happened that they didn’t announce this differently and I am not someone who likes tom-tomming. It was a small role in the beginning, so we did not promote it as if it were a main one in the first season,” he had said.", "title": "Here’s An Update On Sacred Games S2! Kalki Koechlin Reportedly Joins The Cast & We're Elated", "date_publish": "30/03/2019, 18:11:25", "description": "Fans have been waiting for Sacred Games season 2. Now, a report in Bollywood Hungama suggests that Kalki Koechlin, known for her roles in Anurag Kashyap’s Dev D and recently released Netflix show Made in Heaven, has been roped in for season 2. It is said that she will be playing a pivotal role.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/here-s-an-update-on-sacred-games-s2-kalki-koechlin-reportedly-joins-the-cast-we-re-elated-364604.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/heres_an_update_on_sacred_games_season_2_kalki_koechlin_has_reportedly_joined_the_cast_1553946344_800x420.png"}