{"text": "Here Are A Few More Pictures From Priyanka Chopra-Nick Jonas' Dreamy Jodhpur Wedding, Because, Why Not?\nHere Are A Few More Pictures From Priyanka Chopra-Nick Jonas' Dreamy Jodhpur Wedding, Because, Why Not?\nTalking about her wedding on Wednesday, Priyanka Chopra revealed the most special moment came when, \"The curtains opened and I saw him at the altar.\"\nWell, in the middle of your ordinary life, you get an extraordinary love story. While many of us sulk about being single and #ForeverAlone, looks like love happens to each one of us and at the most unexpected time.\nWhile Priyanka Chopra continued to make news for her professional achievements, her 'love-affair' with Nick Jonas became the new thing. From their outings to dinner dates to finally them getting hitched in Jodhpur, things bloomed quickly between Jonas and Chopra within a blink of an eyelid.\nWhen love feels right, things fall into their own place and that's exactly what happened for 'NickYanka'. Now, that the fairytale wedding is over, the couple is back to their normal grind.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nPC spoke to NDTV about her wedding and she elaborated the most special moments. She said,\n“The most special moment was when the curtains opened and I saw him at the altar and life was okay at that moment.”\nTalking about life after marriage she said, “Women are always expected to have to shift their focus after love or marriage, but Nick didn’t expect me to do that. I’ve never had a guy who has said to be ambitious and do what you want to do.”\nShe spoke about outfits at both the Hindu and Christian weddings, designed by Sabyasachi and Ralph Lauren. For her, it wasn't just about fashion but this was something very 'personal' for her. She added,\n“I wanted something unique. Both the dresses- red and white - were personalised for me... I wanted the longest veil in the world and I got that. The outfits were personal choices.”\nAfter seeing the pictures from her Christian wedding, Sabyasachi's official Instagram page recently shared some more photos from their Hindu wedding ceremony. Donning a red-lehenga choli, PC looks like a Queen in the pictures. Have a look.\nHave a look at the pictures.", "title": "Here Are A Few More Pictures From Priyanka Chopra-Nick Jonas' Dreamy Jodhpur Wedding, Because, Why Not?", "date_publish": "06/12/2018, 11:22:14", "description": "Talking about her wedding on Wednesday, Priyanka Chopra revealed the most special moment from it: When ‘the curtains opened and I saw him at the altar’. Well, in the middle of your ordinary life, life gives you an extraordinary love story. While many of us sulk about being single and #ForeverAlone, looks like love happens to each one of us and at the most unexpected time.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/here-are-a-few-more-pictures-from-priyanka-chopra-nick-jonas-dreamy-jodhpur-wedding-because-why-not-358030.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pc_and_nick_1544072658_800x420.jpg"}