{"text": "Everyone is aware about the phenomena that Osho is. The spiritual guru Osho aka Acharya Rajneesh has been touted as the most controversial leader of his times. So much so, that streaming giant Netflix made a docu-drama series on him by the name of Wild Wild Country which went onto become a massive hit.\nWhile it did show the fandom, Osho had build in Oregon, USA, it shed light of Ma Anand Sheela, his personal assistant and top figure of the Rajnessh cult, who put the entire community together and propelled Osho into a mega brand.\nAfter the Emmy winning docu series garnered praises, a lot of filmmakers have approached various actors to adapt this into a film. There are rumours of Alia Bhatt playing Ma Anand Sheela for a Bollywood flick.\nPriyanka Chopra too has been roped in to play the part by an international filmmaker. She revealed the details a few weeks ago on Ellen DeGeneres and since then there has excitement.\nDon't Miss 153 SHARES 161 SHARES 862 SHARES 346 SHARES 183 SHARES\nAccording to a report published by Mid-day, American director Barry Levinson and his team have been working on the idea of a feature film for a few years now before they decided to approach Priyanka Chopra and get her on board as an actor as well as a producer.\nAs per further reports, the filming may start by the end of this year as there is a lot of research that needs to be done on her life and times she has spent at the ashram both in India and in Oregon, US.\nAre you excited?", "title": "Here's Everything You Need To Know About Ma Anand Sheela's Biopic Featuring Priyanka Chopra", "date_publish": "07/03/2019, 15:43:38", "description": "Here's Everything We Need To Know About Ma Anand Sheela's Biopic Featuring Priyanka ChopraHere's Everything We Need To Know About Ma Anand Sheela's Biopic Featuring Priyanka ChopraHere's Everything We Need To Know About Ma Anand Sheela's Biopic Featuring Priyanka Chopra", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/here-s-everything-you-need-to-know-about-ma-anand-sheela-s-biopic-featuring-priyanka-chopra-363323.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/priyanka_1551949178_800x420.jpg"}