{"text": "Bollywood actress Fatima Sana Shaikh might just be two films old but she already has a huge fan base on social media. The actress, who was last seen in Thugs Of Hindostan, is one of most popular and friendly actresses of her generation.\nShe was recently in news for signing a film with Anuag Basu opposite Rajkummar Rao and for speaking about her struggling days. During an interview recently with a leading daily, Fatima was asked about her ordeal as a fresher actress and if she faced any misbehavior during her short stint in Bollywood. Fatima had a brilliant answer to that.\n“I think people have misunderstood the #MeToo movement if they restrict it only to the film industry. It's happening in every sector. What happened to me was long time ago. It happened when I was very young. I think people assuming that it's very current and wondering why, I am not talking about it, that's a lot of expectation. Every woman in our country has dealt with it and I'm sure not everyone wants to talk about it publicly,” she said.\nTwitter\nMaking a valid point on how she would like to keep her #MeToo story to herself, Fatima added, \"My personal life is personal. I might talk a lot and be friendly, but there are certain parts you want to keep it private. About the judge part, there are people who will judge for speaking and even judge you for not speaking, will judge you for wearing saree and will judge you for wearing shorts. So judgmental people are there. So, I mean it is something I just said. It is something I want to keep to myself.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES", "title": "Here's Why 'Dangal' Actress Fatima Sana Shaikh Will Not Discuss Her #MeToo Story And It's Fair", "date_publish": "05/04/2019, 16:37:01", "description": "Making a valid point on how she would like to keep her #MeToo story to herself, Fatima said, \"My personal life is personal. I might talk a lot and be friendly, but there are certain parts you want to keep it private.Making a valid point on how she would like to keep her #MeToo story to herself, Fatima said, \"My personal life is personal. I might talk a lot and be friendly", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/here-s-why-dangal-actress-fatima-sana-shaikh-will-not-discuss-her-metoo-story-and-it-s-fair-364951.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/fatima_1554464897_800x420.jpg"}