{"text": "Here's A List Of Martyrs & The Survivors Who Made It Out Alive From 'The Great War' Of Game Of Thrones!\nHere's A List Of Martyrs & The Survivors Who Made It Out Alive From 'The Great War' Of Game Of Thrones!\nDisclaimer: If you haven’t seen the latest episode of Game Of Thrones Season 8 then do not proceed. I repeat: DO NOT PROCEED!\ntwitter\nFor almost 8 seasons and approximately 69 episodes, we had been anticipating the Great War. It finally took place and left everyone awestruck in its wake. To call Episode 3, a fabulous one, would be an understatement. Most of my friends and family are at a loss of words including myself. If this was what made us wait for almost two years, let’s just say it was justified.\nIt took them 55 nights to shoot the one hour and twenty two minutes-long episode. It was kind of obvious that there would be mass destruction and many, many deaths.\nThe night was indeed long and full of terrors but our people (Yes, I say our people because they are a part of us now, aren't they?) fought bravely. While some made it out alive, we did lose some bravehearts in the Battle of Winterfell.\nSo, let’s take a look at all the martyrs and others who couldn’t make it out alive and take pride in the fact that they put up a good show:\n1. Edmund Tollett\nwatchers on the wall\nDon't Miss 159 SHARES 842 SHARES\nCause of death: The first big death of the episode, Dolorous sacrificed his life to save Samwell Tarly. He died after getting stabbed in the back by a walker\n2. Lyanna Mormont\ntwitter\nCause of death: Probably the most depressing and applause-worthy moment at the same time, little Lyanna tackled a giant and killed him before getting crush to death.\n3. Beric Dondarrion\nthrillist\nCause of death: Resurrected for almost 19 times, Berric served his life purpose by saving Arya’s life by getting stabbed multiple times. His big sacrifice helped Arya make her big escape.\n4. Theon Greyjoy\nyoutube\nCause of death: Possibly the only character to have underwent multiple character changes, Theon protected the three-eyed raven aka Bran Stark and locked horns with THE NIGHT KING itself! However, he met his end by getting killed with his own weapon.\n5. Ser Jorah Mormont\nhbo\nCause of death: Till his last breath, Ser Jorah protected his queen Daenerys but succumbed to his stab injuries.\n6. Melisandre\nhbo\nCause of death: Old age; she gave up her life and took off the necklace because according to her own prophecy, she served her purpose!\n7. Most of the Dothrakis\ntwitter\nThey approached the night army with bravado but unfortunately, they got trapped in the stampede and most of them succumbed! *sniffles*\nSURVIVORS\n1. Jon Snow\nhbo\nAfter a confrontation with the Night King, hide and seek play with ice dragon Viserion and battling several wights, Jon made it out alive!\n2. Daenerys Stormborn\nhbo\nShe almost died but it was Ser Jorah who gave up his own life so that his queen could live #TrueAashiq (Okay, my bad)\n3. Tyrion Lannister\nhbo\nThroughout the episode, there was a scare that Tyrion might not see the light of the day but the Hand of the Queen hid for his dear life and survived\n4. Sansa Stark\nhbo\nShe hung out with Tyrion throughout and escaped death by small margins\n5. Arya Stark\ntwitter\nThe man of the match! Literally. After being saved by The Hound and Beric Dondarrion, in a monumental move, Arya saved the day!\n6. Samwell Tarly\nzimbio\nEdd saved Sam from meeting the old gods and the new.\n7. Jaime Lannister and Brienne Of Tarth\nhbo\nWith their backs against the wall and facing a huge load of wights, this duo escaped death at the right time! Phew!\n8. Gendry, Greyworm and Tormond Giantsbane\nAlthough, there is no official confirmation, but looks like this trio made it out alive.\n9. Others including Lord Varys, Gilly, Davos Seaworth and Missandei lived to tell the tale!\nOh and THE NIGHT KING IS DEAD!\nvia GIPHY", "title": "Here's A List Of Martyrs & The Survivors Who Made It Out Alive From 'The Great War' Of Game Of Thrones!", "date_publish": "29/04/2019, 12:40:47", "description": "Disclaimer: If you haven’t seen the latest episode of Game Of Thrones Season 8 then do not proceed. I repeat: DO NO PROCEED! For almost 8 seasons and approximately 69 episodes, we had been anticipating the Great War. It finally took place and left everyone awestruck in its wake. To call Episode 3 a fabulous one would be an understatement. Most of my friends and family are at a loss of words inclu", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/here-s-a-list-of-martyrs-the-survivors-who-made-it-out-alive-from-the-great-war-of-game-of-thrones-366253.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_1556518699_800x420.jpg"}