{"text": "Ambani’s parties are star-studded extravaganzas full of glamour and perhaps the most expensive ones in the country. Now that Isha Ambani is getting married to Anand Piramal, there is no doubt on the fact that it’s going to be a lavish affair.\nThe couple got engaged amid pomp and show of the stars in Italy a few months ago, where gracing the occasion and announcing their love for each other to the world was popular singer John Legend who sang his all-time favourite track ‘All Of Me Loves All Of You’ sweeping the entire country off their feet.\nNow that Isha Ambani and Anand Piramal are gearing up for their wedding, there’s a video doing the rounds giving us a sneak peak into their wedding invite.\nDon't Miss 1 K SHARES 479 SHARES 19.1 K SHARES 12.5 K SHARES 5.5 K SHARES\nThis video below has been doing the rounds from quite some time. But looks like this was just the teaser!\nNow, another video revealing the complete wedding card has surfaced on social media showing this expensive piece, which is sure a treat to the eyes.\nWondering how much does this cost? Well, if reports are to be believed, this is worth Rs. 3 Lakhs. Isha Ambani and Anand Piramal are all set to tie the knot on December 12. And until then, we’re sure there’ll be more royal updates keeping us hooked.\nAlso Read: Blessings From Queen Bey? Isha Ambani's Wedding Will Have A Special Performance By Beyonce!", "title": "Here's The Unboxing Clip Of Isha Ambani-Anand Piramal's Royal Wedding Invite Worth Rs 3 Lakh!", "date_publish": "11/11/2018, 11:30:38", "description": "Ambani’s parties are star-studded grandeurs that are bigger, glamorous and perhaps the most expensive ones in the country. Now that Isha Ambani is getting married to Anand Piramal, we know it’s going to be an extravagant affair. Now, another video revealing the complete wedding card has surfaced on social media showing this expensive piece, which is sure a treat to the eyes.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/here-s-the-unboxing-clip-of-isha-ambani-anand-piramal-s-royal-wedding-invite-worth-rs-3-lakh-356424.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/heres_a_sneak_peak_into_isha_ambanianand_piramals_royal_wedding_invite_worth_rs_3_lakhs_1541914370_800x420.png"}