{"text": "PARTNER\nEvery year brings a new season of IPL, with which comes a whole lot of excitement! We all have harmless bets going on between our friends about who is going to win the season or who will grab the man of the match. Well, interestingly, this year, we normies aren’t the only ones up to betting!\nRecently, we saw Virender Sehwag placing bets on RCB during the opening match against CSK. Remember?\nThat wasn’t all! Irfan Pathan put his money, figuratively, on CSK. And well, guess who won? Sehwag sportingly completed the #TappingChallenge upon losing. Hundreds of fans followed suit and posted their own version of the Tapping Challenge on social media.\nThere's winning in losing. @virendersehwag got his prediction wrong, but sportingly completed the #TappingChallenge. And his fans followed it and sent us some videos. Go check them out, create your own videos and share with us here. #UCCricket #UCBrowser pic.twitter.com/VVutXiEjJZ — UC Browser (@UCBrowser) March 24, 2019\nWell, now you can be a part of this fun too! UC Browser is offering cricket fans a chance to win big by participating in the exciting Play&Win Game on the browser. Users can guess the right answers for every match and win UCoins, which can be exchanged for Paytm Cash. Sehwag and Pathan have been teasing their fans to win big through the game with funny memes, posts, exclusive commentary, short-videos, and GIFs, all the while cheering and supporting their respective teams in the IPL.\nAll eyes are now set on the highly-anticipated match between Chennai Super Kings and Mumbai Indians on 3rd April. Placing his bets on Mumbai Indians, Irfan Pathan gave his fans on UC Browser a sneak peek into the minds and captaincy style of Mahendra Singh Dhoni versus Rohit Sharma and why CSK has always been touted to be the invincible team of IPL.\nSo far, 4 million users have taken part in the Play&Win Game to win huge prizes! Cricket news feed consumption is up 34% on UC Browser versus same IPL period last year. Are you one of them?", "title": "Here’s How Virender Sehwag And Irfan Pathan Are Making IPL More Fun And Juicier!", "date_publish": "03/04/2019, 18:02:24", "description": "Every year brings a new season of IPL, with which come new excitement! We all have harmless bets going on between our friends about who is going to win the season, who will win a particular match, who will Man of the Match, the season, you get the drift. Well, interestingly, this year, we normies aren’t the only ones up to betting!", "authors": [], "url": "https://www.indiatimes.com/entertainment/here-s-how-virender-sehwag-and-irfan-pathan-are-making-ipl-more-fun-and-juicier-364750.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/uc_browser_1554201546_800x420.jpeg"}