{"text": "Long before he won the hearts of the audiences by tickling their funny bones in the iconic role of Circuit in Munna Bhai MBBS, Arshad Warsi was living a life that sounds almost like a script of a movie.\nArshad Warsi was 18 years old when he lost his father to bone cancer. Two years later, he lost his mother as well. He was in his 10th standard when he lost the property owned by his parents to the tenants who occupied it and was exposed to the harsh reality of life.\nHe had to dropout from school and start earning. At the age of 17, he became a door-to-door salesperson who would sell cosmetic products. But soon he started to discover his love for dancing. Not many people know that before venturing into the world of films, Arshad Warsi was a choreographer. Acting wasn’t his first passion.\nTwitter\nAfter learning the art of dancing and winning quite a few competitions and championships, he started his own dance school, where he also met his wife Maria Goretti. His first tryst with Bollywood was the opportunity to choreograph the title track of Anil Kapoor and Sridevi-starrer Roop Ki Rani Choron Ka Raja. He was spotted by Jaya Bachchan and got offered a role in Tere Mere Sapne. And so, his journey as an actor began in the city of dreams.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nIn his career spanning more than two decades, Arshad Warsi has seen many ups and downs, friends turning foes, and the dark and the selfish side of the industry too.\nEven after proving his mettle as an actor, for eight months after Munnabhai, the movie post which Circuit became a household name, he had no work, he had said.\n“Nobody offered me a film. So I was wondering if people liked my work, why I don't have a movie in hand. I asked Raju Hirani did I do a good job? He said, I was excellent. Then how come I did not have a film in hand,” he had told PTI.\nYouTube\nDespite his impeccable acting skills, he was always the second lead. Perhaps, because the industry at that time was still in the era where it was believed that to play the main lead, one needs a perfect physique and a “hero-like face”, which nobody, until today, has been able to define. With actors like Nawazuddin Siddiqui, Rajkummar Rao, Irrfan Khan and Manoj Bajpayee among others, it took a lot before they could finally introduce their own league in the industry now.\nTwitter\nArshad Warsi even took up roles that no one else was taking. Did you know that he wasn’t the first choice for Jolly LLB? The movie was first offered to Shah Rukh Khan. After the superstar denied the role, Subhash Kapoor offered the role to Arshad Warsi, and rest, as they say, was history.\nJolly LLB was one of a kind film ever made in Bollywood. It was a light-hearted satirical take on India’s judicial system that struck a chord with almost everyone who watched it.\nBut what happened after the grand success of Jolly LLB 2? The makers decided to make a sequel of the movie, and this time they wanted to cast big star, not Arshad Warsi, in the lead role.\nAfter the success of Jolly LLB, Arshad Warsi was signed for Jolly LLB 2, only to be replaced by Akshay Kumar soon. The man, of course, expressed his disappointment on the same without fear.\n“I am not doing it… Akshay is doing it. I was supposed to do it, but fox star studios needed a bigger star, so they chose Akshay” – That’s what he told IANS.\nBut he proved he has a big heart, by congratulating the cast of the movie after Jolly LLB 2’s trailer was released.\nFinally saw the trailer of Jolly LLB2. Love the new Jolly. Looking forward to it, all the best to @humasqureshi @akshaykumar & @subkapoor — Arshad Warsi (@ArshadWarsi) December 20, 2016\nHe is a part of the third installment now, but he is not playing the solo lead. Akshay Kumar and Arshad Warsi have both been roped in for Jolly LLB 3. And going by his statement, Arshad Warsi still has a fear he might be kicked out. When asked if he is a part of the movie, he said, “That's what I heard. That's what I've been told.”\nHe even joked that Jolly LLB 2 would have still been a hit had the makers not signed Akshay Kumar. He further said that the movie would have done even better in terms of business had they cast him and Boman Irani in it.\n“I think, let's be honest, if Boman and me were there in Jolly LLB 2, it would've still done a 100 crore. And they would've still made more money because they would not be paying us as much as they paid Akshay (laughs). It was a bad move, actually. So, bad move. Actually, Fox (producers) would've made more money with Boman and me (laughs),” he was quoted as saying by ZoomTV.\nTwitter\n“Unfortunately, in the profession of acting, acting is the least important thing and that's the sad part,” he was quoted as saying by Times Now.\nHe also said that if he would have done his homework on entering Bollywood, he would have had a better career. “During the course of my life, I understood that acting is a very tiny part of the job. It’s the whole other thing that takes your career wherever you want it to go,” he told Indian Express.\nimimg.com\nWhile in the '90s Arshad Warsi played roles in cheesy films including Hero Hindustani, Betaabi and Hogi Pyaar Ki Jeet that were filled up with melodrama – which was then considered quite legitimate – in 2000s, he began with a new phase of his career proving his versatility.\nBe it his roles in films such as Dhamaal or Salaam Namaste or underrated movies such as Kuch Meetha Ho Jaaye and Seher, he has given beautiful performances. He somewhere also blames his career choice owing to his previous managers, but even for his good roles, he hasn’t received all praises that he rightfully deserves.\namazon.com\nBe it playing a drunkard or a gangster or a side-kick or a funnyman, when Bollywood offered him distinct roles, he made them all memorable with his spectacular performances.\nIn Ishqiya, his performance was as good as that of Naseeruddin Shah and he got an equal screen time too. Be it his villainous character of Mahendra Fauji in Zila Ghaziabad or a journalist in Kaabul Express, he has nailed every role that came his way. In Golmaal series, he definitely stood out taking us all on a laughter ride with his crazy yet funny antics.\nBut the question persists – did he ever get his due as an actor?\nTwitter\nIn the Simbba’s version of Aankh Maare, for us and probably many others, Arshad Warsi stole the limelight completely. Watching him dance with perfection was a treat to the eyes indeed. He stole the show from others in his just 15-seconds.\n“I am down to 15 seconds in a song, I hope that also doesn't go away after this,” he said with a tongue-in-cheek quip.\nThank you so much Vir, that's a huge compliment 🙏🏼🙏🏼I am down to 15 seconds in a song, I hope that also doesn't go away after this 😂😂 https://t.co/IVDPOeD4dd — Arshad Warsi (@ArshadWarsi) December 8, 2018\nBollywood might have failed Arshad Warsi, but the audiences simply love him. When rumours were doing the rounds that Ranbir Kapoor will likely replace Arshad Warsi in the role of Circuit in Munna Bhai 3, social media was disappointed.\nCircuit = Arshad Warsi @ArshadWarsi\nNo other person can replace him at any cost! #MunnaBhai is all about Sanjay dutt and Arshad. Please dont get any stupid actor innnnnnn.Cant stand him at all! — Navs... (@a_navs585) July 19, 2018\nLater it turned out, the rumours were all baseless. Arshad Warsi is a part of Munna Bhai 3 along with Sanjay Dutt, he had revealed some time ago.\n“I do know that the script is pretty much ready. I do know from Raju [Rajkumar Hirani] that the film will go on floors this year - either mid or the end of the year. The work on the script is going on. As of now, yes it's Sanju and me. These are the things I've been told,” he was quoted as saying by PTI\nBut it’s high time Bollywood recognises his talent. More than the audiences, it’s time that filmmakers give him his due.", "title": "Here’s How Bollywood Has Failed Arshad Warsi, An Underrated And Underutilised Gem Of Bollywood", "date_publish": "01/02/2019, 18:07:53", "description": "In his career spanning more than two decades, Arshad Warsi has seen many ups and downs, friends turning foes, and the dark and the selfish side of the industry too. Despite his impeccable acting skills, he was always the second lead. Perhaps, because the industry at that time was still in the era when it was believed that to play the main lead, one needs a perfect physique and a “hero-like face”,", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/here-s-how-bollywood-has-failed-arshad-warsi-an-underrated-and-underutilised-gem-of-bollywood-361251.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/heres_how_bollywood_failed_arshad_warsi_an_underrated_and_underutilised_gem_of_bollywood_1548764998_800x420.png"}