{"text": "Here's The Teaser For The Final Season Of Game Of Thrones And It's A Battle Of Fire And Ice\nHere's The Teaser For The Final Season Of Game Of Thrones And It's A Battle Of Fire And Ice\nThe much awaited first teaser of the final season of \"Game of Thrones\" has been unveiled.\nscreengrab\nThe teaser, titled Dragonstone (which is the ancestral seat of House Targaryen), starts by showing ice apparently taking over Westeros. Some theories say that the clash between fire and the ice is when the Dragonstone forms.\nThe 54 second-long clip promises to show a battle between fire and ice. Watch.\nThe internet is in a bit of shocking after watching the teaser. While some are elated, some are upset that the teaser does not show anything.\nGOT teaser gives me anxiety attacks — Näzarah Tefinkjian (@zarah_jan) December 7, 2018\nDon't Miss 161 SHARES 842 SHARES\nMe forming theories from the teaser... pic.twitter.com/9Ccm96O7A8 — Ghostwalker (@Ghostwalker_019) December 6, 2018\n#GameOfThrones teaser:\nTHE WOLF AND THE DRAGON FREEZE AND THE LION IS ON FIRE.\nWHAT THE HELL!???#GoTS8 pic.twitter.com/0Qf4P0Bjt9 — Valeria (@valeriasworld23) December 6, 2018\nIM NOT OVER IT OMFG I CANT WHY DID I JUST SEE THE TEASER IM NOT READY APRIL NEEDS TO COME NOW BUT I DONT WANT GAME OF THRONES TO BE OVER OMFG HELP pic.twitter.com/XYvahwQZbB — lǝʇʇǝɹɓ 🎄 (@kermitsnoodles) December 7, 2018\nJonsa got me freezing and burning like the #GameOfThrones S8 teaser. pic.twitter.com/mDpSBgn65d — Too School For Cool (@MadMakNY) December 7, 2018\ngame of thrones has released its first teaser trailer im-- pic.twitter.com/e2cZOPLGMJ — stormborn (@RNMNVLR) December 6, 2018\nGAME OF THRONES TEASER pic.twitter.com/w5fA7gA6cB — 🎄the first noel / [nouwɛl]🎄 (@Noeliosiss) December 6, 2018\nThe show is returning in April 2019 and clearly the fans just can't wait as this also happens to be the final season.", "title": "Here's The Teaser For The Final Season Of Game Of Thrones And It's A Battle Of Fire And Ice", "date_publish": "07/12/2018, 12:47:50", "description": "Game Of Thrones Season 8 Teaser Is Here And It's All About Fire And Ice Game Of Thrones Season 8 Teaser Is Here And It's All About Fire And Ice Game Of Thrones Season 8 Teaser Is Here And It's All About Fire And Ice Game Of Thrones Season 8 Teaser Is Here And It's All About Fire And Ice Game Of Thrones Season 8 Teaser Is Here And It's All About Fire And Ice Game Of Thrones Season 8 Teaser Is Here", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/here-s-the-teaser-for-the-final-season-of-game-of-thrones-and-it-s-a-battle-of-fire-and-ice-358116.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/got_1544168258_800x420.jpg"}