{"text": "Restoring our faith in ‘happily ever after’, Deepika Padukone and Ranveer Singh are getting married on Nov 14-15 at Lake Como, Italy, and all their fans in the home country are skittering away in excitement.\nliveuttarpradesh.com\nFinally, the much-in-love couple Deepika Padukone and Ranveer Singh will be man and wife for the rest of their lives proving to the world that every story indeed has a happy ending.\nNo pictures but it was love personified to see them together today. Couldn’t stop my tears, but these were tears of happiness and so I hope they never do. #DeepVeerKiShaadi #ranveerkishaadi #foreverlove — Nitasha (@Nitasha22) November 12, 2018\nAll the wedding festivities will take place in Italy. Grapevine is abuzz with rumours that the guests have been told not to carry their mobile phones to the wedding. So, if that happens, fans might not even be able to catch a glimpse of their wedding day.\nAlso Read: From Ranbir Singing Channa Mereya To Ranveer's Lehenga, Deepika Padukone & Ranveer Singh’s Wedding Memes Are On Point!\nDon't Miss 365 SHARES 402 SHARES 161 SHARES 183 SHARES 151 SHARES\nnewsd.in\nSo, when will they officially make a public appearance? If reports are to be believed, after their wedding at Italy's Villa del Balbianello, Deepika Padukone and Ranveer Singh will come back to India on Nov 18, and they will make their first public appearance on Nov 21. Well, that’s when they are reportedly hosting a wedding reception in Bengaluru, which is Deepika’s hometown.\nvogue.in\nWhat’s more? Rumour also has it that the couple is not accepting gifts. \"Ranveer and Deepika are committed to the cause and want to involve their guests in the act of kindness,” a source told Mid-Day.\nSo, just like the royal couple Prince Harry and Meghan Markle, Deepika Padukone and Ranveer Singh have requested to give the cheques to Deepika's charity The Live Love Laugh Foundation.\nAlso Read: DeepVeer Pre-Wedding Rituals Are In Full Swing As Ranveer Singh Shines Bright At His Haldi Ceremony\nTwitter\nDeepika Padukone and Ranveer Singh’s Mumbai reception will take place on Nov 28, it is said.", "title": "Here’s When Ranveer Singh & Deepika Padukone Will Make Their First Public Appearance As A Married Couple", "date_publish": "13/11/2018, 11:43:10", "description": "Restoring our faith in ‘happily ever after’, Deepika Padukone and Ranveer Singh are getting married on Nov 14-15 at Lake Como, Italy, and all their fans back in the home country are skittering away in excitement. Finally, the much-in-love couple Deepika Padukone and Ranveer Singh will be man and wife for the rest of their lives proving to the world that every story indeed has a happy ending.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/here-s-when-ranveer-singh-deepika-padukone-will-make-their-first-public-appearance-as-a-married-couple-356543.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepikaranveer_to_make_first_public_appearance_post_wedding_at_their_bengaluru_reception_1542089721_800x420.png"}