{"text": "Do you also believe that you have at least one doppelganger in the world? Maybe he or she is just walking around minding his/her business while looking like your twin. What if he/she has a better life than you have? That’s sound creepy, right?\nFor celebrities, it is even more interesting. Remember, Anushka Sharma met with her doppelganger Julia Michaels, who is an American singer and songwriter. Their striking similarity had sent fans into a tizzy.\nBut what if we tell you that often celebrities are confused for other stars? With such popular faces, that has happened to a lot of celebrities. For instance, Amitabh Bachchan was once mistaken for Salman Khan.\nAlso Read: Did You Know Amitabh Bachchan Was Once Mistaken For Salman Khan? His Response To It Was Quite Cool!\nDon't Miss 161 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nHere are other celebrities who have been mistaken for other stars, take a look!\n#1 Harry Potter’s Ron Weasley AKA Rupert Grint has quite often been mistaken for Ed Sheeran.\nusmagazine.com\nNot only fans, legendary singer Leo Sayer got confused as well. “It's kinda 50/50 now. It's like if someone stops me, it could go either way. I could be Ed or I could be me. Leo Sayer, he came up to me and he said he loved my music. Of course, thinking I was Ed. I just, yeah, I play along.” Rupert Grint had said.\n#2 Nargis Fakhri was once called Katrina Kaif at the airport\nA man just said hi Katrina can I take a pic. I said thanks but I'm not her. He said oh ok I'll take a pic of u anyway cuz u look like her. 😂 — Nargis (@NargisFakhri) July 1, 2017\n#3 Once a fan asked This Is Us star Justin Hartley about his wife Blake. Of course, the fan thought he was Ryan Reynolds.\n#4 A fan handed Shah Rukh Khan a piece of paper which read \"I’m your biggest fan, Akshay Kumar.\"\nbrecorder.com\nWondering what SRK did? He replied, “Then you must have loved my song, Tu Cheez Badi Hai Mast.” After the fan said, \"Yes\", Shah Rukh signed the autograph as ‘With love from Akshay Kumar\".\n#5 Meryl Streep has been confused for Glenn Close.\n\"On behalf of Glenn Close and me, who are often mistaken for each other, there should be no illusions. I adore her, and I adore her film,\" she had told the New York Times.\n#6 People think Bella Hadid and Jennifer Lawrence look alike!\nthisisinsider.com\n\"Multiple times a day. Probably today it's already happened like five times,\" Bella Hadid had once said that people often confuse her for the Oscar winner.\n#7 People think Zooey Deschanel is Katy Perry!\n\"I probably answer more questions about her than about my own family,\" Zooey Deschanel had told The New York Magazine.\nAlso Read: Good Side Of Walter White: Here's Why Heisenberg Wasn’t A Villain But The Hero Of Breaking Bad!", "title": "Hilarious Cases Of Mistaken Identities: 7 Celebrities Who Were Confused For Other Stars", "date_publish": "09/03/2019, 17:55:14", "description": "But what if we tell you that often celebrities are confused for other stars? With such a popular faces, that has happened to a lot of celebrities. For instance, Amitabh Bachchan – he was once mistaken for Salman Khan. Here are other celebrities who have been mistaken for other stars, take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hilarious-cases-of-mistaken-identities-7-celebrities-who-were-confused-for-other-stars-363439.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/hilarious_cases_of_mistaken_identities_7_celebrities_who_got_mistaken_for_other_stars_1552133462_800x420.jpg"}