{"text": "Update: Hip-Hop Producer 'Sez On The Beats' has updated his statement. It now reads:\n\"Firstly, I wanted to thank everyone for their support, I didn't expect my post to gather this much attention and the fact that you guys are out here listening is an honour, but I had to say what was on my mind.\nI also wanted to make something clear as there appears to be some confusion. The issue lies with the original label who have licensed out my composition on several occasions and have failed failed to pay me my due share every single time. Ankur Tewari and Excel Entertainment have done all they can to help me and I wanted to thank them for trying to get this all resolved.\nHopefully will be able to tell you all some positive news soon.\"\nZoya Akhtar's Gully Boy is one of the most awaited films of 2019 and more so because of the unique subject. In a first, a Bollywood film will focus on the real life of two underground hip hop rappers Divine and Naezy.\nBe it the trailer or the two songs that have been released from its album, the film has managed to create a strong buzz around it.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nExcel Entertainment\nThe second song from the film Mere Gully Mein came out yesterday but has sparked a controversy. The producer of the original song Sajeel Kapoor (Sez On The Beat) took to his social media account to slam the makers of Gully Boy for impending dues and royalties.\nExcel Entertainment\nWhile he is supportive of the film and wants it to too well, he wrote he found it extremely disheartening that payment wasn't cleared but the song was unveiled without his permission. He wrote,\nTwitter\n\"It's a bit weird writing this out since I'm not one to go to social media to reach out and shit but this was something I felt I needed to say. I legit have nothing to do with the new version of Mere Gully Mein that was released today. I wasn’t even aware of the fact that the song was going to be used in the movie until a little while ago and when I got to know about it I thought the original song will be used. I still think that what we did with Mere Gully Mein was what changed the scene and brought that new sound to our country. We're all rooting for the movie to succeed and introduce the Bollywood audience to what we put our heart and soul into, and for the new opportunities that such a big stage brings all of us. But this is also the sad reality of how the industry works in this country, even after contacting the original label several times, I haven't been paid for my work on this track despite having a contract and my publishing split being agreed and assigned. Just felt y'all needed to hear my piece on this.\"\nRead the original post here:", "title": "Hip-Hop Producer 'Sez On The Beats' Slams 'Gully Boy' Makers For Non-Payment Of Dues", "date_publish": "23/01/2019, 17:56:37", "description": "Zoya Akhtar's Gully Boy is one of the most awaited films of 2019 and more so because of the topic. In a first, a Bollywood film will focus on the real life of two underground hip hop rappers Divine and Naezy. Be it the trailer of the two songs that have been released from its album, the film has managed to create a strong buzz around it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/hip-hop-producer-sez-on-the-beats-slams-gully-boy-makers-for-non-payment-of-dues-360913.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/gully_boy_1548231825_800x420.jpg"}