{"text": "Social media is not just a leisure medium but for many, it's an important tool to communicate and share their inspiring journeys. Bollywood actors have time and again used it to pass on some really meaningful messages to their fans.\nAgencies\nLike recently, Bollywood's 'Greek God' AKA Hrithik Roshan took to his Instagram account to share his journey after his ankle injury. The video is an important one because it doesn't just shows his endurance but shows his commitment towards health and fitness.\nApart from sharing the video of his journey of seven months, he also wrote down a long post, where he shared major details of his journey. He wrote,\nDon't Miss 3.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 2.5 K SHARES\nScreengrab\n“1st September 2018. Behind the scenes. Rehabilitating and re conditioning my body has taken almost 10 months now. And I’m still in the process. Torn right ankle ligaments and a sprained left plus a thorasic slip disc. As if one wasn’t enough.\nMy coordination was incredibly messed up. I’d say jump and my body wouldn’t listen. Couldn’t load the feet or my spine. Needless to say i was losing muscle mass and gaining unwanted weight by the day. Couldn’t do any cardio or weights. Only thing I could control so as to not fall off the grid completely was my diet. Not eating the stuff I liked frustrated me further.\nI’ve been sharing a few clips here from that journey. ZmR’s with light weights, band work plus whole lot of other techniques I discovered. The most important being writing down each day’s progress. I’d aim to do 1 more than yesterday. I hope it helps those who are currently in pain or injured.\nMy rehab and conditioning has been frustratingly slow, after 3 months of a lot of effort and very little results, i was plagued with self doubt and a part of me wanted to quit. But there is magic in consistency. Trust it. And keep going. All the best!.\"\nFor all those who are unaware of Hrithik's injury, the actor had hit himself while shooting for Ashutosh Gowariker’s Mohenjo Daro and had injured his ankle and shoulder. He also had to undergo a brain surgery in 2013 for the removal of a clot. In an interview with IANS in 2017, Hrithik had said,\n“The brain surgery had a devastating effect again on my future -- as in what I could do and what I could not, but by then I was so solid in my head. I felt like there was no stop to my career and the possibilities. So when I look back and join all the dots, every single time that my life seemed that it was over or it seemed like I could not keep going, it was only giving me fodder and information so that one day I could build the HRX brand.\"\nHrithik has time and again shared fitness and work-out videos and many fitness experts rate his Instagram account as one of the most inspiring accounts.\nTwitter\nOn the professional front, the actor is all geared up for the release of Super 30, based on the life of the Patna-based scholar Anand Kumar, who trains 30 underprivileged students for IIT-JEE entrance exams and has an enviable success rate.\n(Also read: Hrithik Roshan Opens Up About Stammering, Says He Practices Everyday To Overcome Speech Issue)", "title": "Hrithik Roshan Shares His Rigourous Fitness Journey After An Ankle-Injury And It's Inspiring!", "date_publish": "26/04/2019, 12:22:11", "description": "Like recently, Bollywood's 'Greek God' AKA Hrithik Roshan took to his Instagram account to share his journey after his ankle injury. The video is an important one because it doesn't just shows his endurance but shows his commitment towards health and fitness.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/hrithik-roshan-shares-his-rigourous-fitness-journey-after-an-ankle-injury-and-it-s-inspiring-366127.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/hrithik_roshan_1556261745_800x420.jpg"}