{"text": "“I have become a star not in spite of my weakness, but due to them,” Hrithik Roshan had once said.\nDuring his childhood, Hrithik Roshan was bullied and ridiculed because he stammered. While we assume that star kids often enjoy affluent lives without any hurdles, it is not always true.\nFor Hrithik Roshan expressing himself through words was a nightmare. His dialogue delivery right now might be packed with punches but earlier in his life, he struggled to even communicate because he would stammer a lot.\nTwitter\nHe has bravely addressed the issue in the past as well, and he now doesn’t mind talking about it in order to inspire those who go through the same. He once said that Aamir Khan’s Taare Zameen Par is one movie which is very close to his heart. “This was one film that has just stayed with me,” he had said.\nTwitter\nDon't Miss 3.1 K SHARES 353 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHe wanted to be an actor but he could only fulfill his dreams by overcoming his fears. He underwent speech therapy. He is now a successful movie star, but he says he practices speech every day.\n“I’d practice every day to overcome the speech issue, I still do for an hour at least so that I can control the secondary actions like twitching and all. The unacceptability to stammering was not only bothersome in my childhood but also prevailed till 2012, long after I had become a film star,” he was quoted as saying by Deccan Chronicle.\nHrithik Roshan also admitted that he had to let go of a lot of film offers because he wasn’t confident about carrying off long monologues.\n“I have now accepted myself as a slow speaker, I have to go through the sentences for a fraction of a second in my mind before saying them aloud. For a long period, it was a struggle for me to accept this, but now I am fine with it,” he said.\ndbpost.com\nHrithik Roshan has now been approached by The Indian Stammering Association (TISA) to be their brand ambassador. “Stammering is an underrated challenge because its gravity isn’t discussed much, it is grave because it is related to your confidence as a human being.”\nFrom a troubled childhood to a superstar and now the brand ambassador of The Indian Stammering Association (TISA), Hrithik Roshan has come a long way! Keep inspiring others, Hrithik Roshan!", "title": "Hrithik Roshan Opens Up About Stammering, Says He Practices Everyday To Overcome Speech Issue", "date_publish": "16/03/2019, 17:33:22", "description": "Hrithik Roshan wanted to be an actor but he could only fulfil his dreams by overcoming his fears. He used to stammer as a kid (at the age of six) He underwent speech therapy. He is now a successful movie star, but he says he practices speech every day.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hrithik-roshan-opens-up-about-stammering-says-he-practices-everyday-to-overcome-speech-issue-363832.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/hrithik_roshan_opens_up_about_stammering_says_he_practices_everyday_to_overcome_speech_issues_1552737251_800x420.jpg"}