{"text": "Finally, Gully Boy dekhne ka time aagagya.\nRanveer Singh and Alia Bhatt’s Gully Boy has been the most awaited film of this year.\nTwitter\nThe trailer and songs of the film have blown the audience's mind already and now they cannot contain the excitement to watch the film. Well, not only the audiences but even Bollywood stars cannot stop praising the film.\nRight from Hrithik Roshan to Alia Bhatt’s mom Soni Razdan have said amazing things about the film. To begin with Alia’s mom, she is extremely stunned with her daughter’s performance and is super proud,\nTwitter\n“@aliaa08 You shine through the film like a light. You infused your character with such charm and played her so engagingly and effortlessly! Blown away by your ability to once again be so real and natural. Many girls will be inspired by spunky Safina. Outstanding! @ZoyaAkhtarOff”.\nDon't Miss 185 SHARES 336 SHARES 3.1 K SHARES 544 SHARES 247 SHARES\n@aliaa08 You shine through the film like a light. You infused your character with such charm and played her so engagingly and effortlessly ! Blown away by your ability to once again be so real and natural. Many girls will be inspired by spunky Safina. Outstanding! @ZoyaAkhtarOff — Soni Razdan (@Soni_Razdan) February 14, 2019\nShe not only praised her daughter but even appreciated other actors' performances in the film.\nThe performances of @SiddhantChturvD and @kalkikanmani deserve a very special mention. Siddhant is incredibly believable and looks like he totally belongs to the world and loved Kalki’s portrayal of Sky... what a lovely character ! ❤️❤️❤️ #GullyBoy — Soni Razdan (@Soni_Razdan) February 14, 2019\nAnd finally the last word must go to Zoya Akhtar who has created a film that will smash all kinds of ceilings ... that so effortlessly draws us into another world and yet speaks about everyone’s worlds at the same time... and made a film that belongs to us all. Wow. #GullyBoy ❤️ — Soni Razdan (@Soni_Razdan) February 14, 2019\nHrithik, Karan and many others also shared their excitement and reviews for Gully Boy.\nI am so excited and elated to hear #gullyboy is being loved unanimously by everyone at screenings!!!! Zoya is a STAR!! A gold star filmmaker and word on the street is that the performances are exceptional! Can’t wait to see it @RanveerOfficial @aliaa08 @ritesh_sid @FarOutAkhtar — Karan Johar (@karanjohar) February 13, 2019\nThe film has received outstanding reviews from the critics as well.\n#OneWordReview…#GullyBoy: FANTASTIC.\nRating: ⭐️⭐️⭐️⭐️\nDepicts the struggles of an underdog brilliantly... Zoya Akhtar’s best film to date... Ranveer is phenomenal... Alia is electrifying... Siddhant Chaturvedi is super... Not to be missed! #GullyBoyReview pic.twitter.com/f6phWdsb7Q — taran adarsh (@taran_adarsh) February 14, 2019\nHave you watched the film? Give us your review on Gully Boy in the comment box below.", "title": "Hrithik Roshan, Karan Johar, Soni Razdan Are Mind Blown By Ranveer & Alia’s Gully Boy", "date_publish": "14/02/2019, 17:02:06", "description": "Finally, Gully Boy dekhne ka time aagagya. Ranveer Singh and Alia Bhatt’s Gully Boy has been the most awaited film of this year. The trailer and songs of the film have blown the audience's mind already and now they cannot contain the excitement to watch the film. Well, not only the audiences but even Bollywood stars cannot stop praising the film.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/hrithik-roshan-karan-johar-and-soni-razdan-are-all-praises-for-ranveer-alia-s-gully-boy-362175.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/gully_boy_1550141527_800x420.jpg"}