{"text": "Bollywood actor Hrithik Roshan might not have had a movie release in the last one year but that has not stopped his fans from showering their love on him. The actor who turned 45 yesterday, had a quiet birthday with family and friends.\nAs many know, Hrithik's father was undergoing a surgery for throat cancer. And on his son Hrithik's birthday, his operation went off successful and Rakesh Roshan could be seen being a part of the celebrations.\nInstagram/Pinky Roshan\nFrom what looks like the hospital room, Hrithik and his family arrived to cut his birthday cake with Papa Roshan. Posing for a group picture, the family could be seen having a relaxing time.\nDon't Miss 106 SHARES 264 SHARES\nInstagram/Pinky Roshan\nBut that's not all, back home, Hrithik's fans were gearing up to wish the superstar. The minute he stepped out at his balcony, fans sang the birthday song for him.\nTwitter\nLooking at their love and joy, Hrithik decided to come out of his house and meet and greet the sea of love that was waiting with open arms.\nHis birthday ended with a fancy dinner with ex-wife Sussanne Khan along with their close friends Goldie Bahl and Sonali Bendre.\nTwitter\nThe four posed for the shutterbugs as they left the restaurant on a happy note. Sonali looked adorable in a bald look, once could see her hair coming back. Hrithik Roshan clearly did have a long day. Here's to seeing him more on silver screen this year.", "title": "Hrithik Roshan Celebrates His 45th Birthday With Parents And Ex-Wife Sussanne, Greets Fans Outside Home", "date_publish": "11/01/2019, 12:17:01", "description": "Bollywood actor Hrithik Roshan might not have had a movie release in the last one year but that has not stopped his fans from showering their love on him. The actor who turned 45 yesterday, had a quiet birthday with family and friends.Bollywood actor Hrithik Roshan might not have had a movie release in the last one year but that has not stopped his fans from showering their love on him.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/hrithik-roshan-celebrates-his-45th-birthday-with-parents-and-ex-wife-sussanne-greets-fans-outside-home-360218.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hrithik_roshan_1547189772_800x420.jpg"}