{"text": "Hrithik Roshan’s Ex-Wife Sussanne Khan Opens Up On #MeToo, Says There Are A Lot Of False Allegations\nHrithik Roshan’s Ex-Wife Sussanne Khan Opens Up On #MeToo, Says There Are A Lot Of False Allegations\nThe #MeToo movement is widely discussed on the internet as allegations about big names in Bollywood continue to emerge almost every hour. Female members of the film fraternity are calling out their male colleagues for the sexual misconduct that they have faced over the years.\nBollywood actress Kangana Ranaut too attacked Hrithik Roshan with fresh allegations. She said, no one should work with Hrithik Roshan after falsely promising to marry her and leaving her in lurch.\nBut Hritik seems to have got a firm support from his former wife and interior designer Sussanne Khan as she has opened up on #MeToo campaign by saying that women shouldn’t make false allegation on an individual without any legal evidence.\nSussanne said that people should use social media platforms in the correct manner. “I honestly don’t want to comment on this issue much but I definitely feel that there is a lot of pretences, false allegations and sort of crazy behaviour. They are using the platform badly and it’s not a good thing. If they use the platform correctly then, it’s supposed to be a good thing. They shouldn’t make allegation on an individual without any legal evidence,” she added.\nTwitter\nDon't Miss 3.1 K SHARES 353 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nSussanne Khan was interacting with the media when she attended her sister Farah Khan Ali’s new collection launch at her designer store along with Bhagyashee Patwardhan-Dasani, Fardeen Khan, Zayed Khan and Kanika Kapoor on Friday here.\nThe #MeToo campaign has gained momentum in India after actress Tanushree Dutta accused veteran actor Nana Patekar of harassment. Following her revelation, accusations were being levelled against some powerful personalities in media and the entertainment industry including Sajid Khan, Alok Nath and Vikas Bahl among others.\ntimesnow\nHritihk Roshan has taken a firm stand on the situation and has urged the producers of his upcoming film Super 30 to take a “hard stand” amid sexual harassment allegations against the movie’s director Vikas Bahl.\nEarlier this week, after accusing Vikas Bahl of his misbehaviour on Queen’s set, Kangana Ranaut launched a fresh attack on Hrithik by demanding punishment for the Kaho Naa Pyaar Hai actor for dating “young girls” while keeping a trophy wife.\nInputs from IANS", "title": "Hrithik Roshan’s Ex-Wife Sussanne Khan Opens Up On #MeToo, Says There Are A Lot Of False Allegations", "date_publish": "13/10/2018, 17:28:08", "description": "Interior designer and Hrithik Roshan’s ex-wife Sussanne Khan has opened up on #MeToo campaign by saying that women shouldn’t make false allegation on an individual without any legal evidence. Sussanne said that people should use social media platforms in correct manner. “I honestly don’t want to comment on this issue much but I definitely feel that there is lot of pretence.", "authors": [], "url": "https://www.indiatimes.com/entertainment/hrithik-roshan-s-ex-wife-sussanne-khan-opens-up-on-metoo-says-there-are-a-lot-of-false-allegations-354726.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sussanne_1539431191_800x420.jpg"}