{"text": "In the really unfavorable turn of events, Hollywood actor Hugh Grant lost something really precious from his car. The actor took to social media on Monday to appeal for the return of a script he lost when thieves broke into his car.\nThe Paddington 2 star said on Twitter that his bag had been stolen from the vehicle on Sunday night and his children's medical notes might also be missing.\n\"In the unlikely chance that anyone knows who broke into my car tonight and stole my bag, please try and persuade them to at least return my script,\" Grant posted to his 335,000 followers.\nreuters\n\"Many weeks' worth of notes and ideas,\" he added without identifying the document further, asking for the items to be returned to Coach Films in West London.\nAgencies\nIn the unlikely chance that anyone knows who broke into my car tonight and stole my bag, please try and persuade them to at least return my script. Many weeks worth of notes and ideas. And perhaps my children’s medical cards. Coach Films ,Ealing St Mary's Ealing Green W5 5EN* — Hugh Grant (@HackedOffHugh) January 13, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe 58-year-old actor, who shot to fame in 1994 as the lead in Four Weddings and a Funeral, was most recently seen on television screens in mini-series A Very English Scandal.\nInputs From Reuters", "title": "Hugh Grant's Script Gets Stolen From His Car, Actor Makes Twitter Plea For Its Return", "date_publish": "15/01/2019, 17:01:51", "description": "In the really unfavorable turn of events, Hollywood actor Hugh Grant lost someone really precious from his car. The actor took to social media on Monday to appeal for the return of a script he lost when thieves broke into his car. The Paddington 2 star said on Twitter that his bag had been stolen from the vehicle on Sunday night and his children's medical notes might also be missing.", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/hugh-grant-s-script-gets-stolen-from-his-car-actor-makes-twitter-plea-for-its-return-360461.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hugh_grant_1547554133_800x420.jpg"}