{"text": "I have seen many veteran actors who were biggest stars but have lost their relevancy and I just don’t want to get into that space, said Gulshan Devaiah in an interview with us.\nTwitter\nDespite being so talented and proving his mettle in every film, Gulshan has a fear of not getting work in Bollywood as it is the most unpredictable place, you never know what’s going to happen next. Today there are many actors who are out of work and have done odd jobs and the most recent example of the same is Gulaal actor Savi Sadhu.\nInstagram\nGulshan is one of the most gifted actors we have in B-town and we talked to him about his versatility and survival mantra in Bollywood.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTalking about his versatility, he said, “I am very passionate about acting and I can only do this, I try and give everything that I have to my work, I have learned a lot with my experiences and people I have worked with, piece by piece you keep getting better and better and that’s my goal too - to be better than my previous films.”\nTwitter\nWe quizzed him about content-driven films being accepted more these days as compared to star films he said, “Earlier the time was very different, films used to work on hero’s name. I think today is the time for content and only content, there are lots of stars who do content-driven films, slowly there is a change happening. Yes, it’s not a complete change but it’s okay, there are films that are packaged around the stars but it’s fine, they have their different target audience. Today the concept of hero and heroine has changed. For instance, I played a protagonist in Hunterrr who was not all heroic, he was the biggest loser, I think the audience should stop watching the film like ye hero ya heroine hai.”\nIt’s not easy to survive in Bollywood without having a godfather we quizzed Gulshan how did he manage to make his mark, he said, “If you want to survive here, you should have tremendous self-belief, you have to know who you are, if you don’t, you have to figure out, whatever is your ambition you have to be true to that and accept the reality first, it’s a cutthroat place, it’s a ruthless business, art ek jagah hai , business ek jagah hai. They don’t seem to travel parallel, so you have to have the clarity and vision of what you want to be.”\nTwitter\nHe further added, “I have never been drawn myself towards that business, I don’t have a natural inclination focusing on business having that kind of fame and stardom, yes, I romanticized and fanaticized in my head sometimes a little too , much , some people achieve and some don’t, you can’t manufacture stardom, maybe you can, few months you can behave like a star with your whole PR mechanism, but stardom tabhi hi milta hai jab log aapko pyaar dete hai, they will give you that love only then you can become a true star. But that is something I fantasize, if I can leave my legacy behind, I want to be remembered as the best and versatile actor of my time and in this process, If i get stardom then it's welcome.”\nWhen we asked about his biggest fear, he said,\n“It’s such a volatile business, firstly to say that you are a working actor is such a big thing, it’s nearly impossible because in India everyone wants to become a cricketer or actor, the biggest fear is I just want to be relevant to the time, I try my best to sort of be there, I have seen many veteran actors who were the biggest stars at one point, have lost their relevancy and I just don’t want to get into that space, I know that’s a harsh reality for all of us, some people have managed the transition and have really long careers. I want to work till I feel I should work and want to be in a place where i can say I am done, I don’t want it to be ki, koi muje le nahi raha, mai chodunga tab jab mai decide karunga, so I want to be able to do that and I am not sure if I can so I fear that.”\nWe hope that day doesn’t come and he continues to entertain us with his outstanding work.", "title": "'Hunterrr' Star Gulshan Devaiah's Biggest Fear Is Not Getting Work In Movies & Losing Relevance", "date_publish": "20/03/2019, 12:16:09", "description": "Despite being so talented and proving his mettle in every film Gulshan has a fear of not getting work in Bollywood as it is the most unpredictable place, you never know what’s going to happen next. Today there are many actors who are out of work and have done odd jobs and the classic example is Gulaal actor Savi Sadhu. Gulshan is one of the most gifted actors we have in B-town and we talk to him", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/hunterrr-star-gulshan-devaiah-s-biggest-fear-is-not-getting-work-in-movies-losing-relevance-363985.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/gulshan_devaiah_1553064275_800x420.jpg"}