{"text": "Anirban Blah of KWAN Entertainment was in the spotlight for being one of the key sexual offenders. Four women accused Blah of sexually harassing them on the pretext of giving them jobs. Following these accusations, Blah was sacked from the company of which he was also one of the co-founders.\nHe was also dismissed from Deepika Padukone's Live Love Laugh foundation. After these allegations, Blah was rescued while he was making a suicide attempt on the old bridge at Vashi.\nAgencies\nPolice reached the location on time and managed to rescue Blah. The suicide note that was recovered by a TOI staff member was made public and some people are claiming that it could be a well-planned decision of Blah to commit suicide. Reports claim that it was after this suicide note was recovered that it became their tip-off to the police that led to the rescue operation.\nTOI\nIn his suicide note, Blah admitted that he failed in separating sex from power and became a 'monster'. The suicide note that was recovered read,\nDon't Miss 193 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"Without trying to justify any of my actions, I just want to say that I have tried to be the best person I can be. I didn't have the strength to cope with what happened to me as a child in a healthy way. I never was able to separate sex from power, to make it a part of love, and somewhere along the way, one part of me turned into a monster. Maybe ... I am bipolar.\nBecause I know how much love I have to give. To my friends and to my family to everyone. I have tried to be the best friend I can and the best colleague and the best person I can. But unfortunately the monster inside me keeps resurfacing and I've tried to bury him and kill him but I can't.\nI wasn't good enough. And I am the only one to blame ... I know no one believes me, but that monster was a part of me, and there was goodness and kindness in me. To anyone I may have hurt, I am sorry. This isn't revenge for you. This is justice.\nYou should just know that the stories you hear are worse than the truth but whatever the truth, it still makes me a monster in my own eyes. Know though that this monster has this part of him that is pure still, and that my love for you is so great that I cannot forgive myself the hurt I have caused you. There are no justifications. You deserved better.\nYou will find my body somewhere near Vashi creek. My license will be with me as identification plus my tattoo. I am wearing blue jeans and a t-shirt. The monster inside me has won against the other part of me for too long, it's time to kill it once and for all.\"\nAccording to reports, Blah is undergoing treatment at a trust-run hospital in Byculla.", "title": "I Failed In Separating Sex From Power & Turned Into A Monster, Reads Anirban Blah's Suicide Note", "date_publish": "20/10/2018, 13:50:28", "description": "Four women accused Blah of sexually harassing them on the pretext of giving them jobs. Following these accusations, Blah was sacked from the company of which he was also one of the co-founders. He was also dismissed from Deepika Padukone's Live Love Laugh foundation. After these allegations, Blah was rescued while he was making a suicide attempt on the old bridge at Vashi.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/i-failed-in-separating-sex-from-power-turned-into-a-monster-reads-anirban-blah-s-suicide-note-355126.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anirban_1540028294_800x420.jpg"}