{"text": "When it comes to embracing parenthood and having a child, the road is not always free of bumps! Actress Sameera Reddy, who is expecting her second baby soon, says her first pregnancy left her feeling torn between the reality and the pressure to portray an “unreal life” as a celebrity.\nInstagram\nReddy was last seen in 2012 with the film Tezz later married businessman Akshai Varde in 2014 and she featured in films like Race, No Entry and Taxi Number 9211. She delivered her first born, a son in 2015. Talking to IANS, she said,\nInstagram\n\"I got pregnant in just a couple of months after my marriage. The game plan was to have the pregnancy and bounce back and getting in the limelight again. But I have never experienced anything like that... It was just the opposite. It was the worst case scenario of what I could’ve imagined in terms of my body and the way I fell apart as a person because the pregnancy was very tough for me.\"\nDon't Miss 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES 3.1 K SHARES 2.4 K SHARES\nShe recollected her experience of her first pregnancy. She added,\nInstagram\n“I had placenta previa, which had me on bed rest for almost four to five months after the pregnancy. I just started putting on weight and falling into some kind of place in my head because it went from shows, award functions and a glamorous lifestyle to just not being able to handle what pregnancy was doing to me.”\nHowever, she entered a dark-phase when she became a recluse. In hindsight, she feels it was a cowardly act.\n“There is so much pressure upon us as actors or people in the public eye to portray we have this unreal life. I was also buying into it and trying to provide to it as an actor. I was also trying to keep up with that and say, ‘Hey! look at I am so perfect’. (But) I was the poster girl of what a pregnancy shouldn’t be,” she added.\nShe added that she gained a lot of weight post-pregnancy. She said,\n“From being that ‘sexy Sam’, I went to this. I put on 32 kg up and couldn’t recognise myself. I was a complete mess,” added the actress.\nWhen people started ridiculing her for weight gain, she said that she went into depression. She said,\n“I would leave the house and they said, ‘Is this Sameera Reddy? What happened to her?’ That pushed me into a further hole.”\nSameera said there came a point she couldn’t bear any glare.\n“Everyone knew I was feeling depressed, but I was a good mother. To top it all, I got this auto ailment called Alopecia areata, which made me lose patches of my hair after almost six months of giving birth. But it did not have anything to do with my pregnancy.”\nAll of this combined led her to have a meltdown. “I worked very hard. I got help in terms of therapy and understood that I was lost and confused as a person... What I was as an actor and where I am today as a mother and a wife.”\nWell, for all those who think parenthood or pregnancy is just another phase of life, it proves that there is much more to it!\n(With IANS inputs)", "title": "I Fell Apart And Suffered Depression, Says Bollywood Actress Sameera Reddy On Weighing 102 Kgs After Pregnancy", "date_publish": "27/04/2019, 13:16:19", "description": "Sameera, whose last big screen outing was in 2012 with the film Tezz, married businessman Akshai Varde in 2014. She delivered her first born, a son in 2015. “I got pregnant in just a couple of months after my marriage. The game plan was to have the pregnancy and bounce back and getting in the limelight again. But I have never experienced anything like that... It was just the opposite.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/i-fell-apart-and-suffered-depression-says-bollywood-actress-sameera-reddy-on-weighing-102-kgs-after-pregnancy-366184.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sameera_reddy_1556353362_800x420.jpg"}