{"text": "I'm Excited For My Wedding But I Don't Think It'll Change My Life, Says Deepika On Marrying Ranveer\nI'm Excited For My Wedding But I Don't Think It'll Change My Life, Says Deepika On Marrying Ranveer\nProtecting their relationship from the media for six years, Ranveer Singh and Deepika Padukone taught everyone a lesson or two on how to separate private and professional life.\nDeepika and Ranveer's romance blossomed on the sets of Ram Leela in 2012 and even though their PDA evidently pointed at their romance, they never publicly made any comments on their romantic relationship. The couple chose to end the suspense and speculations around their wedding by making a public announcement on 21st October.\nPinterest\nThey posted a heartwarming message on social media, where they announced their wedding.\nSince then, all #DeepVeer fans are waiting to see their favorite couple tie the knot. How are things for to be bride and groom Deepika and Ranveer? Well, in a recent interview with India Today, Deepika said she is excited about her nuptials like any other girl. Just like she's excited about her film projects, she's also excited about the wedding.\nTalking about the same, she said,\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n“Of course (I am excited), I think it’s the same way that I am excited about signing my next film. Marriage is definitely something I have looked forward to in my life as would any other girl. When it does happen, it will be exciting, it should be exciting. I don’t see why my life should change at all (after marriage).\"\nDeepika’s father Prakash Padukone, who was also a part of the interview, added how things have changed and it's the couple who take the full charge of the wedding. He was quoted as saying,\n“Today, the bride and the groom decide everything, both the parents just tag along.”\nReports claim that DeepVeer's wedding will be a four-day affair in Italy, which will begin with a sangeet function on November 13. Kannadiga style wedding will take place on November 14, followed by north Indian rituals on November 15.", "title": "I'm Excited For My Wedding But I Don't Think It'll Change My Life, Says Deepika On Marrying Ranveer", "date_publish": "27/10/2018, 14:04:53", "description": "Reports claim that DeepVeer's wedding will be a four-day affair in Italy, which will begin with a sangeet function on November 13. Kannadiga style wedding will take place on November 14, followed by north Indian rituals on November 15. Deepika is looking forward to tying the knot with her long-term boyfriend Ranveer Singh.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/i-m-excited-for-my-wedding-but-i-don-t-think-it-ll-change-my-life-says-deepika-on-marrying-ranveer-355562.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/deepika_and_ranveer_1540630165_800x420.jpg"}