{"text": "A self-confessed cynic, I generally don’t believe in life’s mysterious ways and how it can bring the most unexpected turns, especially when you least expect them to. However, things are completely different now. Hello, I am Bhavya Sadhwani, a recently turned optimist who is now a firm-believer in the power of the universe.\nCut to - 9th March 2019, sitting at a press conference in Singapore, waiting with baited breath for the big double doors to open!\nbhavya sadhwani/indiatimes\nBut before that, a quick rewind of a week before:\nFirst things first, it’s important that we state the obvious. No matter how much you like or dislike cinema, there has to be at least one celebrity that you would want to meet once in this lifetime, right? Come on, if you are about to deny it, then please don’t. No one can be that indifferent towards the world of glamour and showbiz. Anyway, back to me, an ordinary person who spends five days of her life behind a laptop screen and dreams of running in the circles of Hollywood biggies, sipping wine and discussing the fine nuances of movie-making.\nWell, i do have a long bucket list of concerts i’d like to attend, celebs i’d like to interview and then some. Now, during one very random, monotonous and bland day of work last week brought a whole new yet best surprise of my life. Yes, the universe threw the best project that i wasn’t even working towards in the first place, directly in my lap. I was chosen to fly to Singapore to attend the press conference of a movie called Triple Frontier and meet Ben Affleck, Charlie Hunnam and Garrett Hedlund.\nbhavya sadhwani/indiatimes\nDon't Miss 837 SHARES 3.5 K SHARES\nAs if this wasn’t enough, the cherry on the very decorated cake was that I had to interview the three gentleman one-on-one for their upcoming which also stars Oscar Isaac and Pedro Pascal along with the trio.\nI could go on and on, giving you every minute detail of my two-day trip but fret not! That kind of information is exclusive only for my own journal.\nWhen you are high-spirited, there are not many things that can bog you down, but let me tell you a cancelled flight, after sitting inside the aircraft for almost 6 hours, isn’t one of them. I still didn't let the exhaustion and irritation in its highest form, deter my excitement. Every waking moment was spent in anticipation of the meeting.\nD-Day: The day of the meeting!\nbhavya sadhwani/indiatimes\nAll dressed up, in a super parched state and with my heart in my mouth, there i was sitting inside the ball room, waiting with for Ben Affleck to descent in his Batman suit. Okay, not really, but to see the actor in person had me on cloud 9, and if possible then even higher.\nEyes stuck on the double doors, without even registering what the compere was even announcing on the microphone, there i was waiting for what would later become one of the most cherished moments of my life.\nFractions of seconds later, the doors finally open and in walked Ben Affleck with Hunnam and Hedlund in tow, looking dapper in a denim button down shirt, jeans and sneakers, with a cuppa coffee in his hands. In full Hindi film style, i had my ‘main thehri rahi, zameen chalne lagi’ moment, right then and there.\ngifer\n40 minutes later, waiting inside the green room, i was a ball of nerves, unable to decipher whether the beads of sweat on my forehead was due to the sultry Singapore weather or because i was about to interview Affleck and his posse.\nThe minute I walk inside the studio, there they were engaged in their own silly banter and I dived right in, head first!\nBen Affleck indulged in a grave yet important discussion\nbhavya sadhwani/indiatimes\nDuring my chat with them, I happened to ask the trio about their take on Patriotism v/s War-mongering. Taking the lead and giving a sound answer, Ben Affleck said,\n“This is a question that has no great one answer to this but I can tell you one thing, you know the acts of patriotism in service when you see them. War-mongering is something that is engaged in by the political class. The military folks are there serving, so whatever service they do is in the name of their country and they put their trust in their commanding officer to make the right decision and the politicians who lead them to make the right decisions. But naturally there is a line - Patriotism, nationalism, jingoism. We have to be mindful of that.\"\nHe then went on to share his own experience and defined what patriotism means to him. He said,\n“One example of patriotic service that i got to see myself, was to work alongside some Indian peacekeepers who were working, thousands of miles away from home, in the democratic Republic of Congo where many Indians soldiers were serving in order to make the transition of another country to democracy more peaceful. I found that admirable and to me that form of service is the true act of patriotism.”\nThe Bollywood intrigue\nWell, what else do you expect from an out and out Bollywood buff? I then went on to enquire about their interest and knowledge on Bollywood and whether the Gone Girl actor would like to direct a Bollywood movie someday, to which Affleck said,\n“Bollywood is an incredible cinematic phenomenon that exists. Productive India has done this incredible contribution to global cinema. If I had to, I would be very intimidated if i had to step in. It’s folly to just think that you can swoop in from one genre, one culture to another and pick up and do something excellent. I would consider myself a student of Bollywood more than a filmmaker.”\nInterestingly, Sons Of Anarchy star Charlie Hunnam happened to tell me how our culture and cinema intrigues him. So much so, that he is all set to visit India for two and a half weeks to get acquainted with the phenomenon that is Bollywood! If you are a Mumbaikar who happens to be a fan of Hunnam, look out for the tall blonde gentleman near you. He might be in your vicinity, wearing a hat and dark shades, trying a vada pav and sipping bottled water!", "title": "I Met Ben Affleck To Discuss Patriotism, Cinema & Everything In Between. This Is What Went Down", "date_publish": "22/03/2019, 13:09:26", "description": "A self-confessed cynic, I generally don’t believe in life’s mysterious ways and how it can bring the most unexpected turns, especially when you least expect them to. However, things are completely different now. Hello, I am Bhavya Sadhwani, a recently turned optimist who is now a firm-believer of the power of the universe. Cut to - 9th March 2018, sitting at a press conference in Singapore, waiti", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/i-met-ben-affleck-to-discuss-patriotism-cinema-everything-in-between-this-is-what-went-down-363961.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ben_affleck_1552996779_800x420.jpg"}