{"text": "Last three days have been overwhelming for Made In Heaven actor Arjun Mathur. His phone hasn’t stopped ringing and congratulatory tweets and posts for his performance haven’t stopped. In just three days (the show released on 8th March), the show is already being dubbed the ‘best Indian show’ of the decade.\nTiger Baby and Excel\nSuperlatives are a mark of the times that we live in, but Made In Heaven isn’t just another show about wedding planning, is it? “I think it’s very smart that we are inviting everyone saying it’s a show about weddings but then we are hitting them with these strong reality checks,” Arjun laughs.\nArjun knows a thing or two about reality checks- he’s done everything from playing the hero’s supporting role (he was the friend Farhan Akhtar’s character fights with in Luck By Chance) to being an AD and working on small budget films that didn’t see the inside of even on cinema hall.\nIn between it all, the quick to typecast and label Indian cinema has typecast him as an actor who’s ok with playing a gay character. In a free-wheeling chat with Arjun Mathur, he decodes his journey as an actor, his preparation for Made in heaven and everything in between. Read on!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n1. Is there something like being typecast in playing a gay role?\nTiger Baby and Excel\nArjun has played the character of a homosexual twice and when he was approached to play/audition for the role of Karan - a go getter wedding planner battling with his sexuality and commitment issues (he has a long list of excuses to kick the boys out before morning) he obviously was concerned and “didn’t want to be too repetitive.”\n“First time when I met Zoya and Nitya, I expressed my fear but then they gave me eight episodes to read. By the time I was done the reading, I was so sure that it belonged to me! I didn’t want anyone else to even think of playing Karan!\" It’s another matter, that when he first auditioned for the show, he didn’t know for sure Karan if was supposed to be gay, he was told this only later.\n2. Playing gay doesn’t end one’s career\nTiger Baby and Excel\n“It (playing a gay character) f is a big challenge and the last thing you want to hear is: here goes your career in the drain because of this! *laughs* It was very disturbing. But now, I am so happy that my work speaks for itself.\"\n3. Not a show about wedding planning\nTiger Baby and Excel\nIt’s fantastic that the show is showing everyone in all their shades of gray , without sugar-coating anyone. Even though each and every character is flawed, at no point, do you feel that they are complete jerks! You are able to empathize with them and understand how and why they are behaving the way they are. For example, Faiza’s concept of love with Adil is Tara’s hell-so we have played around that! Honestly, I was very nervous, as an actor, it wasn’t easy for me. But I knew how the scenes are written and I trusted the makers to be sensitive about it. But the day when you actually shoot the scenes, there is no other way to do other than “Raam Ka Naam Lo Aur Kar Lo”! *Laughs* I just spoke to my girlfriend and explained the whole thing to people who were important! I think Zoya has done a brilliant job of filming all the intimate scenes. I was completely blown by the final scenes, they’ve come together beautifully\n4. Favorite scene and character from ‘Made In Heaven’\n\"I think right from the time I read the script, I was totally in awe of one character that was Faiza’s (Kalki Koechlin). The way it has been written! Like, she is so lost, so grey and yet so human. She’s insecure and damaged but still someone who reflects each one of us in some way. When I read her scenes with the therapist, I was just so touched. They are all so beautiful! That’s all she as she's in love with Aadil,. But everything about it is so heartbreaking and human! As Karan, my favorite scene was the dining table with the family. It was a high point of Karan’s arc. It was so emotional that two DOPs who were shooting it were trembling and in tears by the end of it.\"\n5. The Zoya Arjun journey\n\"Our's didn’t begin with Luck By Chance but it goes beyond it. She is the woman who helped me pick up my first photographs for the portfolio shoot in Mumbai. The first short film that Zoya ever wrote, it was the first short film for me as an actor, which was Mira Nair’s Migration. The first feature film that Zoya directed, I was a part of it. Even an ad campaign that she wrote for a brand, I was in it with Aamir Khan. I just feel I was born under some lucky star that someone like Zoya understands my potential and thinks for me for all her projects. It is surreal. I understand that sometimes makers are restricted with casting as they can’t cast non-stars in big films or leads. Zoya and I both know this and now that she got a chance where she wasn’t tied or trapped with any sort of restriction like box-office numbers, she thought of me for the role. I was told that the team had the picture of me on their board long before I got the first call for the audition. They never looked beyond me for the part and I can only be thankful and be hopeful that I have to give my best in everything that I am offered to do.\"\n6. The starting point as an actor\nTiger Baby and Excel\n\"Honestly, at the age of 10, I was sure that this is what I want to do. So once you make that decision, there is no looking back. Right after school I started working as an Assistant Director and I worked on 4-5 films and then I began my journey as an actor. And now, we are here! It’s 2019 and this point has come after twelve years. It’s been hard..I have spent many years facing rejections and losing out big films and big pivotal roles to star kids. I know I could have packed up my bags and left Mumbai but I chose to wait and hope and the show happened.\nI auditioned for the show and since I have played a homosexual twice in my career before, the makers didn’t disclose it to me. They loved the audition and then when I went again, Nandini (casting director) casually mentioned that “listen, they might not be too sure but it might be a homosexual character”. But later on, I realized that they knew it all along, considering that’s the way the show was written. They were just scared that it might get repetitive for me and I might turn down the role. Personally, I never had any apprehensions playing a gay character but I just didn’t want to be too repetitive with the kind of characters I take up. First time when I met Zoya and Nitya, I expressed my fear but then they gave me eight episodes to read. By the time I was done the reading, I was so sure that it belonged to me! I didn’t want anyone else to even think of playing Karan! *laughs* \"\n7. How to survive doing short films\nTiger Baby and Excel\n\"I was very naive in the beginning. I had my short films with Mira Nair and Farhan Akhtar but soon reality came crashing down I had managed to put myself into a box - actor who only does films on social causes so mainstream bollywood never happened And after Luck By Chance, I was only stereotyped as the best friend. I did a few films but then I realized I can’t just be an embellishment in the film or just be there as furniture to make the A-lister look good. I thought a lot about it and then I started doing smaller and independent films where I got to do much more\"\n8. What lies ahead for Arjun?\nTiger Baby and Excel\nWe finished shooting for Made In Heaven in March 2018 and I have basically spent an entire year saying no to projects because the quality of everything was heavily compromised. I was always very confident about Made In Heaven and I always knew what we had in our hands. But I was always sure that no matter what I do, I can’t afford to tone down the quality of my work. I was sort of counting on Made in heaven to change things for me! I have waited a lot and last two-three days have compensated for all the wait and struggle! I think I did the right thing by waiting.", "title": "I've Lost Many Roles To Star Kids In The Last 12 Years, Admits 'Made In Heaven' Actor Arjun Mathur", "date_publish": "11/03/2019, 14:26:46", "description": "Today, we spoke to Arjun Mathur, whose voice had equal parts of satisfaction and hope. Since last two days, he has lost the count of congratulatory and interview calls he has been receiving. In a free-wheeling chat with Indiatimes, he decodes his journey as an actor, his equation with Zoya Akhtar and how he embraced the role of Karan Mehra for the show. Read on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/i-ve-lost-many-roles-to-star-kids-in-the-last-12-years-admits-made-in-heaven-actor-arjun-mathur-363517.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/arjun_mathur_1552308506_800x420.jpg"}