{"text": "No matter how successful you become in life, failure still remains one of the most inevitable truths of life. For a business as dynamic and risky as the cinema business, the risk rate is high. The budget of your film can be magnanimous and it can still fail miserably at the box-office.\nEven if you are bankable and popular, audience still holds the right to reject or say no to a bad film. For Shah Rukh Khan, who is a humungous Bollywood star, the risk is always high and he does understand the business of cinema.\nAgencies\nHe has seen some major flops in his life and this includes his film Harry Met Sejal that drew him harsh criticism.\nRed Chillies\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nKhan does understand the box-office and during the promotions of his upcoming film Zero, he expressed his views on failures and much more.\nTalking to Hindustan Times, Khan was quoted as saying,\nViral Bhayani\n\"God forbid, if this film doesn’t work, what will happen? Maybe, I won’t get work for six months or 10 months, but if I believe that my craft and art is good, I will continue to get work. Then, I will probably make a comeback which I have been doing for the last 15 years, or maybe, the comeback won’t happen.\"\nHelmed by Aanand L Rai, the film stars Shah Rukh as a vertically challenged man named Baua Singh. The film also stars Katrina Kaif as an actress battling alcoholism, and Anushka Sharma as a wheelchair-bound scientist. The film is all set to test the waters of reality as it will hit the theatres on 21 December.", "title": "If 'Zero' Fails, I Won't Get Work For 6-10 Months, Claims Bollywood Superstar Shah Rukh Khan", "date_publish": "18/12/2018, 16:44:59", "description": "No matter how successful you become in life, failure still remains one of the most inevitable truths of life. For a business as dynamic and risky as the cinema business, the risk rate is high. The budget of your film can be magnanimous and it can still fail miserably at the box-office.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/if-zero-fails-i-won-t-get-work-for-6-10-months-claims-bollywood-superstar-shah-rukh-khan-358842.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/srk_1545132642_800x420.jpg"}