{"text": "When the #MeToo movement began in Hollywood about a year ago, several women including big actresses like Angelina Jolie and Gwyneth Paltrow had accused Harvey Weinstein of sexual assault, rape and harassment. And looks like there is not going to be an end to accusations against him anytime soon. Now a minor, 16-year-old, has accused the filmmaker of sexual assault.\nDisgraced Hollywood producer Harvey Weinstein has been named in a fresh sexual harassment case for assaulting a 16-year-old over a decade back. The complaint was filed on Wednesday, reports variety.com. The 66-year-old former movie mogul has denied it. An anonymous woman brought the charges against him, saying she was repeatedly attacked between 2002 and 2011 by the erstwhile American film producer.\nAP\nThe victim said she was 16 and an aspiring model in New York when she met Weinstein.\nThe accusations fall largely in line with dozens of others made against the now bankrupt The Weinstein Company (TWC) founder, including intimidation, unwanted touching and pressure to perform sexual favours in exchange for a chance at Hollywood fame.\nAfter the initial encounter, the Jane Doe had continued to have dealings with Weinstein, including trying out for America's Top Model. She alleges thogh that she did not get any work from Weinstein or TWC as she had rebuffed his advances. The victim, a Polish model, said Weinstein had arranged a business lunch which wound up being a private visit to his apartment where he encouraged her to remove her clothes and massage his genitals.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAP\nWeinstein's criminal defence attorney, Ben Brafman, has termed her claims as \"preposterous\" which would \"also be shown to be patently false like many others\".\nThe complaint serves as an update to a class action lawsuit that was dismissed in mid-September for lack of details -- accusing Weinstein, his brother Bob and board members at TWC of racketeering.\nAs it stands, Weinstein has been arraigned on sexual crime charges in a New York court. Probes are ongoing in Los Angeles and London.\nWith inputs from IANS", "title": "In A New Complaint, Harvey Weinstein Has Been Accused Of Sexually Harassing A 16-Year-Old Girl", "date_publish": "01/11/2018, 16:47:50", "description": "When the #MeToo movement began in Hollywood about a year ago, several women including big actresses including Angelina Jolie and Gwyneth Paltrow had accused Harvey Weinstein of sexual assault, rape and harassment. And looks like there is no stopping to accusations against him. Now a minor, 16-year-old, has accused the filmmaker of sexual assault.", "authors": [], "url": "https://www.indiatimes.com/entertainment/in-a-new-complaint-harvey-weinstein-has-been-accused-of-sexually-harassing-a-16-year-old-girl-355878.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/harvey_weinstein_1541068218_800x420.jpg"}