{"text": "Two years ago, the word 'Nepotism' became immensely popular in the film fraternity. All thanks to Kangana Ranaut for coming to Karan Johar’s chat show Koffee With Karan and calling the host - the “flag-bearer of nepotism.” Since then, there hasn’t been a conclusive end to this debate in Bollywood.\nThere was a war of words between Kangana Ranaut and Karan Johar, and a lot of other celebrities expressed their views on the hot topic as well. She was mocked at an award function after Karan along with Saif Ali Khan and Varun Dhawan hailed “nepotism rocks” on the stage of the show. Later on, he apologised for his quip.\nNow, at YouTube fan fest, Karan Johar was once again presented with the same question by Bhuvan Bam during an interaction. He was asked why he loves the term nepotism. To this, here’s what Karan Johar said.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n“I don’t love this subject, somebody else does. Ab hum bolega toh bologe ke bolta hai. Toh I have left it to that person to do all the talking and I will continue to do my job.”\nWas he taking a sly dig at Kangana Ranaut? Will this argument ever reach to its conclusion? Guess not!", "title": "In A Never-Ending Saga Of Nepotism, Karan Johar Takes A Sly Dig At Kangana Ranaut Yet Again!", "date_publish": "03/04/2019, 13:58:03", "description": "Now at YouTube fan fest, Karan Johar was once again pitted against the question by Bhuvan Bam during an interaction. He was asked as to why he loves the term nepotism. In his reply, he took a sly dig at Kangana Ranaut. Now at YouTube fan fest, Karan Johar was once again pitted against the question by Bhuvan Bam during an interaction. He was asked as to why he loves the term nepotism. To this, here", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/in-a-never-ending-saga-of-nepotism-karan-johar-takes-a-sly-dig-at-kangana-ranaut-yet-again-364802.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/in_this_unending_saga_of_nepotism_karan_johar_takes_a_sly_dig_at_kangana_ranaut_yet_again_1554278448_800x420.jpg"}