{"text": "In A First, Shahid Kapoor To Appear On Koffee With Karan With 'Wingman' And Brother Ishaan Khatter\nIn A First, Shahid Kapoor To Appear On Koffee With Karan With 'Wingman' And Brother Ishaan Khatter\nThis year, Karan Johar's popular chat show Koffee With Karan is all about revelations. After Sara Ali Khan-Saif Ali Khan's grand debut together on national television, KJo confirmed that Brothers Shahid Kapoor and Ishaan Khatter too have shot for an episode that will be aired this season.\nSharing the news with the world, Karan shared a photo with the caption, “Brothers in arms!”.\nShahid and Ishaan shared another photo with the captions “Baby boy I always got your back.” and “Your wingman for life”.\nIshaan too had earlier confirmed that he will be a part of the show this time. He was quoted in media reports as saying,\n“Yes, I will be a part of the show with Shahid Kapoor. I am extremely excited. Come on, did you see the hamper. Who would not be excited for that? Don’t be surprised if we do. There is no such plan but yes, you never know.”\nJust to jog your memory a little, Shahid Kapoor is one of the most popular guests of KJo's show as this will be his sixth appearance. However, for Ishaan who made his grand debut with Dharma Productions' Dhadak, this will be a first.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nBoth Ishaan and Shahid have time and again spoken about mutual admiration and respect they have for each other and this will be the first time that viewers will get a closer glance at their relationship. It'll be fun to see the brothers taking over the show and spilling out each other's secrets over a steaming cup of coffee!\n(Also read: Things She Hate About Ranveer Singh To His Best Qualities, Deepika Padukone Gushes About Her Husband-To-Be Over 'Koffee')", "title": "In A First, Shahid Kapoor To Appear On Koffee With Karan With 'Wingman' And Brother Ishaan Khatter", "date_publish": "23/11/2018, 10:55:20", "description": "This year, Karan Johar's popular chat show Koffee With Karan is all about revelations. After Sara Ali Khan-Saif Ali Khan's grand debut together on national television, KJo confirmed that Brothers Shahid Kapoor and Ishaan Khatter too have shot for an episode that will be aired this season.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/in-a-first-shahid-kapoor-to-appear-on-koffee-with-karan-with-wingman-and-brother-ishaan-khatter-357214.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shahid_1542951436_800x420.jpg"}