{"text": "In A Fresh Statement, Tanushree Dutta Says She Went Into Depression Post Her #MeToo Incident\nIn A Fresh Statement, Tanushree Dutta Says She Went Into Depression Post Her #MeToo Incident\nTanushree Dutta had kickstarted the wave of #MeToo in Bollywood. After she shared her story, a lot of other women in the industry came forward to share their stories. In a fresh statement, she says she is in deep despair seeing the judgementalism in society.\nBCCL\nActor Tanushree Dutta on Wednesday came out with a fresh statement on her alleged sexual harassment on the sets of 2008 film Horn OK Pleassss and made strong observations about \"level of consciousness and extreme judgementalism in a country known for its spiritual richness.\"\nIn a written statement issued by her public relation team, she said, \"I feel a deep despair seeing the level of consciousness and extreme judgementalism in a country known for its spiritual richness.\n\"I am asking how many talented and innocent people like Jiah, Pratyusha and others you will consume by your bigotry. How many more need to die before you become sensitive towards others. Hate begets hate and if karma and punishment is the only language you understand then the road ahead will be rocky.\"\nbccl\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Learn your lessons before it's too late. We are in this world to learn and embody compassion and love.\"\nTalking once again of the controversial incident from 2008, when she was allegedly harassed, the statement reads, \"The 'Horn 'OK' Pleassss' harassment incident and the mob attack there had sent me spiralling into a deep state of depression in 2008.\nAlthough I went on to finish my other projects with a smile on my face, deep inside I wanted to die. The harassment, manipulation, threats, the horrible things spoken about me and the humiliation I had to endure was too much for my sensitive soul to bear.\"\nShe also claimed of being on the verge of taking the extreme step owing to frequent negativity. \"After putting years of hard work to be treated this way was and still is shattering.\nbccl\nThe attitude of these kind of people and my constant upstream struggle in the face of such frequent negativity that I have received made me want to give up often. Few years later Jiah and Pratyusha committed suicide. I somehow lived,\" the statement read.\nTanushree also said that she had to face toxic stuff after speaking up this time.\"This time after I spoke again inspiring many to share their #metoo stories and exorcise their demons out, the same kind of toxic stuff was thrown at me by many especially Ganesh Acharya and Rakhi Sawant who levelled all manner of derogatory accusations on me,\" she added.\n\"Rakhi apologised but only after I questioned her faith and dragged Jesus into the fight, I will always love God no matter who says what,\" the statement added.\nbccl\nTanushree has alleged that Nana Patekar misbehaved with her on the sets of 'Horn Ok Pleasss' in 2008 while shooting for a special dance number for the movie, and filed an FIR against the 'Welcome' star.\nHowever, Patekar has refused the allegations against him. Patekar's lawyer Aniket Nikam, told ANI, \"All allegations against him (Nana Patekar) are false and far from the truth\".\nInputs From ANI", "title": "In A Fresh Statement, Tanushree Dutta Says She Went Into Depression Post Her #MeToo Incident", "date_publish": "29/11/2018, 17:48:00", "description": "Tanushree Dutta had kickstarted the wave of #MeToo in Bollywood. After she shared her story, a lot of other women in the industry came forward to share their stories. In a fresh statement, she says she deep despair seeing the judgementalism in society.", "authors": [], "url": "https://www.indiatimes.com/entertainment/in-a-fresh-statement-tanushree-dutta-says-she-went-into-depression-post-her-metoo-incident-357608.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/in_a_fresh_statement_tanushree_dutta_says_she_went_into_depression_post_her_metoo_incident_1543488537_800x420.jpg"}