{"text": "In A First, Madhu Chopra Talks About PC-Nick's Wedding And What Made Her Emotional\nIn A First, Madhu Chopra Talks About PC-Nick's Wedding And What Made Her Emotional\nFor every mother, the day their daughter gets married is both an emotional and a special one. For Dr. Madhu Chopra, this whole month has been like that. She saw her daughter get married to the love of her life and she was not just the host but a part of their celebrations at Jodhpur’s Umaid Bhawan Palace on December 1 and 2.\nPinterest\nWhile we have time and again seen and heard how Nick and Priyanka Chopra felt about their wedding, but for the first time ever, we have what Madhu Chopra as a mother felt through it all. In a recent interview with DNA, Madhu Chopra spoke about the emotions that she felt as a mother. She said,\n“It was an emotional moment for everyone. I broke into tears when I saw Priyanka dressed as a bride. I had waited for this day all my life.”\nIt was Madhu’s wish to have an Indian wedding for Priyanka and her daughter fulfilled her mother's wishes. She added,\nAgencies\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n“We followed all the rituals to the T. There were no shortcuts. I wanted an Indian Shaadi for her and Priyanka knew that. She fulfilled my wish. It’s lovely to see the amount of love people have for her and Nick.\"\nShe added how her daughter “looked like a princess” at the Christian wedding. She added,\n“I was at a loss of words. When I saw Priyanka, I couldn’t control my emotions. The white gown was so beautiful. My baby looked like a princess.\"\nWhile PC donned a red Sabyasachi outfit for her Hindu wedding, she wore an exclusive piece by Ralph Lauren that had a 75-foot long veil.", "title": "In A First, Madhu Chopra Talks About PC-Nick's Wedding And What Made Her Emotional", "date_publish": "07/12/2018, 16:57:54", "description": "For every mother, the day their daughter gets married is both an emotional and a special one. For Dr. Madhu Chopra, this whole month has been like that. She saw her daughter get married to the love of her life and she was not just the host but a part of their celebrations at Jodhpur’s Umaid Bhawan Palace on December 1 and 2.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/in-a-first-madhu-chopra-talks-about-pc-nick-s-wedding-and-what-made-her-emotional-358149.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_chopra_1544183197_800x420.jpg"}