{"text": "In A Video Interaction With Indian Fans, Robert Downey Jr Says He's Going To Come To India Soon!\nIn A Video Interaction With Indian Fans, Robert Downey Jr Says He's Going To Come To India Soon!\nIt was a lazy Sunday morning for most of us. However, for others, it turned into an excited one as they got an opportunity to interact with the Iron Man AKA Robert Downey Jr.\nI went to see the Robert Downey Jr video conference with @swatirish and it was totally awesome! When he appeared on screen, the entire theatre was screaming. It was crazy! Thank you @Marvel_India For making this possible and love you @RobertDowneyJr 💓 pic.twitter.com/NUmZn6uge2 — Rishab Karthik (@rishab_karthik) April 14, 2019\nRobert Downey Jr joined some of the Indian fans at a live-stream event via video conference. The man is currently in South Korea promoting the upcoming Avengers: Endgame there. As soon as he joined the live-stream, he was welcomed with deafening screams of fans that left him speechless, as per PTI.\nJust like how Tony Stark in the world of Marvel is – a genius, billionaire and also hilarious – he fooled around the audiences as he started the conversation.\nYou wake up on a sunday morning and talk to whom? ROBERT DOWNEY JR HIMSELFFF *screams in excitement*\nDear indian engineers i represented you all in front of IRON MAN😂😂@RobertDowneyJr pic.twitter.com/Fyqxzxas7M — Ashish Chanchlani (@ashchanchlani) April 14, 2019\n“Well, this was not a fan event. It was a recruiting event for Stark Industries. You guys will be receiving a high-security clearance positions,” he said. And of course, everybody cheered.\n@ManaByte Wonderful video conference with @RobertDowneyJr in India. The atmosphere was blazing in Chennai. pic.twitter.com/rb7yjh0O0J — Sandy Sounderrajan (@dsachin316) April 14, 2019\nDon't Miss 264 SHARES 225 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nWill he come to India soon? Revealing his plans, he said, “You guys are just amazing fans. I can't wait. I cannot believe I haven't been to India. I'm coming there so damn soon.”\nGiving another hilarious answer, when a fan asked him about his favourite memory from the wrap-up party for Avengers: Endgame, he said, “Well, I have no memory of it so it must have been pretty good.”, with a straight face. There was a roar of laughter post that!\n“I got to tell you honestly, we made both 'Infinity War' and 'Endgame', we basically shot them back to back and it was the time that most of the Avengers and Guardians and everyone was spending the most time together,” he added.\nIn just a couple of weeks, on April 26, Avengers: Endgame will hit the screen, and we’ll all be left sobbing.\nWith inputs from PTI", "title": "In A Video Interaction With Indian Fans, Robert Downey Jr Says He's Going To Come To India Soon!", "date_publish": "14/04/2019, 14:16:51", "description": "Robert Downey Jr joined some of the Indian fans at a live-stream event via video conference. The man is currently in South Korea promoting the upcoming Avengers: Endgame there. As soon as he joined the live-stream, he was welcomed with deafening screams of fans that left him speechless.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/in-a-video-interaction-with-indianfans-robert-downey-jr-says-he-s-going-to-come-to-india-soon-365428.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/in_an_interaction_with_indian_fans_robert_downey_jr_says_he_cant_wait_to_come_to_india_1555230338_800x420.jpg"}