{"text": "Recollecting years of abuse, Actress Amber Heard claims that she endured by her former husband and actor Johnny Depp, in new court documents filed in response to his $50 million defamation lawsuit against her.\nThe actress referred to Depp as \"the monster\" multiple times in the court filings and claimed he wouldn't remember the abuse due to his excessive drinking and drug use, reports variety.com.\nAP\nShe has claimed that at their apartment here in December 2015, the former Pirates of the Caribbean star grabbed Heard by the hair and throat, slapped her in the face and screamed, \"I'll f***ing kill you, you hear me?\" He allegedly dragged her on a bed and began punching her head, breaking the bed frame in the process.\n\"For a while, I could not scream or breathe. I worried that Johnny was in a blacked-out state and unaware of the damage he was doing, and that he could actually kill me,\" Heard said.\nHeard and Depp began dating in 2012, and a year later Heard recalled seeing him indulging in drugs and alcohol abuse. In May 2014, the actress claimed that Depp began drinking heavily, threw items and verbally abused her on a private flight. Depp later apologised via text, saying he couldn't remember what happened.\nDon't Miss 389 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nHeard and Depp got married in 2015, but a month later he went on a three-day bender on ecstasy. After Depp reportedly threw a cellphone at her face \"like a baseball pitcher\" in May 2016, Heard decided to leave him and filed a restraining order. They divorced in January 2017 and Heard reported the abuse, but found very little support from the public.\n\"I lost a part for a movie in which I had already been cast. People I have never met or spoken to threatened me with violence,\" she said, adding: \"People accused me of having abused Johnny. That simply is not true. I never attacked Johnny other than in self-defence.\"\nThe actor filed a $50 million defamation lawsuit for claims that his ex-wife insinuated he was the abuser and called her allegations a hoax.\n(With agency inputs)", "title": "In A New Set Of Allegations, Amber Heard Claims Johnny Depp Abused Her During Drug-Fueled Rages", "date_publish": "13/04/2019, 16:17:09", "description": "Recollecting years of abuse, Actress Amber Heard claims that she endured by her former husband and actor Johnny Depp, in new court documents filed in response to his $50 million defamation lawsuit against her. The actress referred to Depp as. Recollecting years of abuse, Actress Amber Heard claims that she endured by her former husband and actor Johnny Depp, in new court documents filed in respons", "authors": [], "url": "https://www.indiatimes.com/entertainment/in-a-new-set-of-allegations-amber-heard-claims-johnny-depp-abused-her-during-drug-fueled-rages-365397.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/amber_heard_and_johnny_depp_1555152835_800x420.jpg"}