{"text": "In The Light Of #MeToo Movement, Saif Ali Khan Hints At Changes In Core Team Of ‘Sacred Games 2’\nIn The Light Of #MeToo Movement, Saif Ali Khan Hints At Changes In Core Team Of ‘Sacred Games 2’\nThe fate of Sacred Games 2 is hanging in the balance currently. Rumours are doing the rounds that the writer of the show Varun Grover might not be onboard for season 2 after an anonymous woman accused him of sexual harassment.\nWhile the makers of the show are yet to take a call on the same, Saif Ali Khan who plays the role of Sartaj Singh on the show has recently hinted that there might be changes in the team.\nTwitter\nComparing the situation with that of House of Cards, whose lead actor Kevin Spacey was kicked out of the show after several women accused him of sexual misconduct, Saif said the core team of Sacred Games that include showrunners Anurag Kashyap, Vikramadtiya Motwane and writer Varun Grover may see a shuffle in the wake of #MeToo movement.\nshutterstockimg.com\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\n“We have been talking constantly. They don't like me talking about the show anyways. I like working with them, they are brilliant. They want to keep it a secret. But I want to give you a clue. There was a terrible scandal concerning Kevin Spacey and he had a show 'House of Cards', the show is going on but Spacey is not there. Let that be a clue,” Saif told PTI.\n“Why should I bear the brunt and even why anyone of us? who are not twisted or molesters,” he added.\nLast week, Netflix had said that it was assessing options for Sacred Games 2 in the light of the controversies surrounding Sacred Games 2.", "title": "In The Light Of #MeToo Movement, Saif Ali Khan Hints At Changes In Core Team Of ‘Sacred Games 2’", "date_publish": "14/10/2018, 16:48:32", "description": "The fate of Sacred Games 2 is hanging in the balance currently. Rumours are doing the rounds that the writer of the show Varun Grover might not be onboard for season 2 after an anonymous woman accused him of sexual harassment. Saif Ali Khan who plays the role of Sartaj Singh on the show has recently hinted that there might be changes in the team.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/in-the-light-of-metoo-movement-saif-ali-khan-hints-at-changes-in-core-team-of-sacred-games-2_-354770.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/saif_ali_khan_hints_on_changes_in_core_team_of_sacred_games_2_in_the_wake_of_metoo_movement_1539514779_800x420.jpg"}