{"text": "In The Wake Of Pulwama Attack, Salman's Notebook & Shahid's Kabir Singh To Not Release In Pakistan\nIn The Wake Of Pulwama Attack, Salman's Notebook & Shahid's Kabir Singh To Not Release In Pakistan\nIn the wake of Pulwama terror attack, Bollywood has united in solidarity. Film producer Murad Khetani on Thursday said he has decided to not release his upcoming films -- Salman Khan-produced Notebook and Shahid Kapoor starrer Kabir Singh.\n\"We are not releasing our film ('Notebook') in Pakistan. Our upcoming films 'Kabir Singh' and 'Satellite Shankar' too will also not release there,\" Khetani, of Cine1 Studios, said on the sidelines of the promotional event of his film Notebook.\n(Also read: Citing Piracy As A Legit Reason, Tigmanshu Dhulia Says Indian Films Should Never Release In Pak)\nNotebook marks the acting debut of Pranutan Bahl, daughter of actor Mohnish Bahl and granddaughter of yesteryear actor Nutan. It will also see the launch of Zaheer Iqbal.\nSet in Kashmir, the romantic-drama film is produced by Salma Khan, Khetani and Ashwin Varde and it is slated to release on March 29.\n\"Kabir Singh\", directed by Sandeep Vanga, is a remake of his own directorial Telugu language film \"Arjun Reddy\" (2017). Jointly produced by Cine1 Studios and T-Series, the film stars Shahid and Kiara Advani in the lead. It releases on June 21.\nDon't Miss 837 SHARES 174 SHARES 2.1 K SHARES\nDirected by Irfan Kamal, Satellite Shankar, produced by Bhushan Kumar, Murad Khetani, Krishan Kumar and Ashwin Varde, stars Sooraj Pancholi in the lead. The film will release in India on July 5.\n\"There is some work left on 'Kabir Singh', it will take around 12-13 days of work. We have 'Satellite Shankar', which is complete,\" Khetani said.This comes after makers of films including Total Dhamaal, Luka Chuppi and Diljit Dosanjh's Arjun Patiala had also announced the same.\nThere has also been an indefinite ban on Pakistani artists in India.\n(With agency inputs)", "title": "Notebook & Kabir Singh To Not Be Released In Pakistan", "date_publish": "22/02/2019, 11:26:38", "description": "After Total Dhamaal and Milan Talkies, makers of Notebook and Kabir Singh decide to not release their films in Pakistan Kabir Singh is a remake of Sandeep Vanga's own directorial Telugu language film Arjun Reddy. Set in Kashmir, the romantic-drama film is produced by Salma Khan, Khetani and Ashwin Varde and it is slated to release on March 29.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/in-the-wake-of-pulwama-attack-salman-s-notebook-shahid-s-kabir-singh-to-not-release-in-pakistan-362582.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/pulwama_attack_1550813149_800x420.jpeg"}