{"text": "The most Sanskari man of Bollywood, Alok Nath had sent shockwaves across the nation when sexual harassment allegations were levied against him by Vinta Nanda. She accused he raped him about 20 years ago. The man in question, however, had declined the charges.\nA month after writer-producer Vinta Nanda accused actor Alok Nath of allegedly raping her, the Cine and TV Artistes’ Association (CINTAA), on Tuesday, expelled Nath from its membership. CINTAA released a statement on Twitter stating, “In view of the various allegations of sexual harassment and misconduct against Mr. Alok Nath, after due diligence and consideration, the Exec. Committee of #cintaa has decided to expel him from the Association.”\nBCCL\nSpeaking to ANI, Amit Behl, Sr Joint Secretary CINTAA said, “CINTAA has expelled Alok Nath from its membership till further notice after he failed to respond to CINTAA. He was supposed to appear before its ICC and Executive committee yesterday but he didn’t turn up. Now CINTAA has asked him to be present in its annual general meeting on 1st May and if he fails to put his point, he will be permanently expelled from CINTAA.”\nIn October, Nanda accused Alok Nath of rape. She narrated her horrifying ordeal in a Facebook post. She was the writer and producer of teleserial ‘Tara’ in the 90s, in which Nath played a lead role.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nBCCL\nThe actor had later filed a civil defamation suit against the Nanda after she accused him of rape. He also sought a written apology, along with a compensation of Re 1 and a restraining order against Nanda. However, the application was rejected by Mumbai’s Dindoshi Sessions Court.\nWith inputs from ANI", "title": "In The Wake Of Rape Allegations By Vinta Nanda, CINTAA Strips Alok Nath's Membership", "date_publish": "14/11/2018, 14:08:46", "description": "A month after writer-producer Vinta Nanda accused actor Alok Nath of allegedly raping her, the Cine and TV Artistes’ Association (CINTAA), on Tuesday, expelled Nath from its membership. CINTAA released a statement on Twitter stating, “In view of the various allegations of sexual harassment and misconduct against Mr. Alok Nath, after due diligence and consideration, the Exec.", "authors": [], "url": "https://www.indiatimes.com/entertainment/in-the-wake-of-rape-allegations-by-vinta-nanda-cintaa-strips-alok-nath-s-membership-356636.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/alok_nath_1542180678_800x420.jpg"}