{"text": "Stan Lee was a comic book hero who’ll live through his work for centuries to come. While he created many superheros including Spider man and Iron man, he was called a real-life superhero. Of course, the news of his demise has left everyone across the world mourning in grief.\nEven though his health was deteriorating since past couple of years, the news of his death came as a shock to many.\nAlso Read: Stan Lee, The Man Who Created Spider-Man & Iron Man, Passes Away & All Superheroes Are Mourning\nThe world has lost a creative genius. But his legacy will live forever. When he was asked what’s on his wish list, he had once told The Daily Beast, “That I leave everyone happy when I leave. Well, I don’t mean happy that I left. Happy that I took the right path.”\nAP\nHe had also thought about his own obituary. In an old interview with American talk show host and comedian Conan O’Brien, Stan Lee had talked about his 50 years in comic books and how he got his start writing celebrity obituary.\nAFP\nDon't Miss 264 SHARES 974 SHARES 17.1 K SHARES 555 SHARES\nHe explained that when a celebrity dies, newspapers come out with their obituaries within 15 minutes of their death, because they have prepared that in advance. “That’s how you know you’re famous,” he said, adding that he hopes someone had prepared one for him too.\n“I would love to think somewhere my obituary is in a file. Then I’ll know I made it. I don’t wanna see it too soon, but that’s okay!”\nAP\nWatch him say this in the video below.\nSuperheros don’t die, do they? Stan Lee, the real-life superhero, will live through his work forever!", "title": "In This Old Video, Marvel Comic’s Real-Life Superhero Stan Lee Hoped People Kept His Obituary Ready", "date_publish": "13/11/2018, 17:37:57", "description": "In an old interview with American talk show host and comedian Conan O’Brien, Stan Lee had talked about his 50 years in comic books and how he got his start writing celebrity obituary. “I would love to think somewhere my obituary is in a file. Then I’ll know I made it. I don’t wanna see it too soon, but that’s okay!”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/in-this-old-video-marvel-comic-s-real-life-superhero-stan-lee-hoped-people-kept-his-obituary-ready-356600.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/in_this_old_video_marvel_comics_reallife_superhero_stan_lee_hoped_people_kept_his_obituary_ready_1542111605_800x420.jpg"}