{"text": "In The Wake Of Support Scheme Of Rs 6K For Farmers, Vishal Dadlani Says They Don't Need Charity\nIn The Wake Of Support Scheme Of Rs 6K For Farmers, Vishal Dadlani Says They Don't Need Charity\nVishal Dadlani has been actively voicing out opinions on things that matter. Often, when he is wrong he apologises too. The music composer and singer was once a celebrity supporter of Aam Aadmi Party but had later announced that he was quitting all political work after outrage over one of his tweets in which he mocked Jain religious leader Tarun Saga.\nTOI\nRecently, he slammed Prime Minister Narendra Modi over his statement on the speedy trial of rape victims during his governance. In a tweet, Vishal Dadlani called it a lie and requested the prime minister to not “turn the pain of Indian women and girls into propaganda.”\nLIE! Name one rapist who has been hung in your term, Sir. Nirbhaya's rapists, Asifa's rapists, even Unnao child-rape-accused BJP MLA Sengar are still alive and well.@narendramodi ji, we know elections are near, but don't turn the pain of Indian women & girls into propaganda. 🙏🏽 https://t.co/rJuMMJNef8 — VISHAL DADLANI (@VishalDadlani) January 30, 2019\nUnder Finance Minister Piyush Goyal's proposal of the budget for 2019, government will provide assisted income support to small and marginal farmers who own land upto two hectares (5 acres) under the Pradhan Mantri Kisan Samman Nidhi.\nDon't Miss 182 SHARES 175 SHARES 6.8 K SHARES 3.6 K SHARES 2.5 K SHARES\nTwitter\nResponding to this Vishal Dadlani wrote on Twitter that “farmers don’t need charity\". Read his entire tweet below.\nThey seem to be trying to pave over 4.5 years of sheer neglect and disastrous policy failure.\nRs. 6000 farmer per year, instead of guaranteeing a Minimum Sale Price for their crops, is adding insult to injury\nFarmers don't need charity. They need systemic reforms. — VISHAL DADLANI (@VishalDadlani) February 1, 2019\n“They seem to be trying to pave over 4.5 years of sheer neglect and disastrous policy failure. Rs. 6000 farmer per year, instead of guaranteeing a Minimum Sale Price for their crops, is adding insult to injury. Farmers don't need charity. They need systemic reforms,” he wrote.\nAlso Read: Vishal Dadlani Slams BJP Member Who Blamed The Chandigarh Stalking Victim For Staying Out Late", "title": "In The Wake Of Support Scheme Of Rs 6K For Farmers, Vishal Dadlani Says They Don't Need Charity", "date_publish": "02/02/2019, 18:32:57", "description": "Finance Minister Piyush Goyal presented the proposal of 19-20 interim budget in the parliament on Friday. During his speech, he also announced that the government will provide assisted income support to small and marginal farmers who own land up to two hectares (5 acres) under the Pradhan Mantri Kisan Samman Nidhi. Responding to this Vishal Dadlani wrote on Twitter that “farmers don’t need chari", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/in-the-wake-of-support-scheme-of-rs-6k-for-farmers-vishal-dadlani-says-they-don-t-need-charity-361482.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/farmers_dont_need_charity_says_vishal_dadlani_after_budget_handout_of_rs_6000_yearly_for_farmers_1549111088_800x420.png"}