{"text": "In just one day, one million tickets of Avengers Endgame were sold in India. The websites including BookMyShow had crashed when the sale of tickets began, because all Marvel crazy fans were trying to book the tickets at the same time. The website sold 18 tickets per second. This another level of crazy!\nBCCL\nAnd now, it is said that the movie will be screened 24x7 in India. At Mumbai’s Carnival IMAX in Wadala, the booking for shows at 3.20 am is already open. It is said that soon booking for shows post midnight will be open throughout India.\nJust in case you didn’t know, according to Indian laws, no movie should start after midnight. However, it seems Avengers: Endgame will create a history for itself, as according to a report in Bollywood Hungama, a multiplex chain has got the permission to screen the movie after midnight all over India.\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\n“The permission came through today and we were informed of the same verbally. The permission however is given only for Avengers: Endgame. We are now sitting down to chalk the programming for these post-midnight shows. However, as of now we are planning to have these shows only in A-tier cities and especially in IMAX and 4DX versions,” a source was quoted as saying.\nAvengers Endgame is just not a film. It’s a phenomenon. It’s the an epic culmination of a decade-long journey which marvel fans that includes 22 movies. So, are you ready for the emotional roller-coaster ride?", "title": "India Gets Marvel Crazy! Avengers: Endgame To Screen 24x7, Bookings For 3 AM Show Are Now Open", "date_publish": "24/04/2019, 11:45:34", "description": "Now you can watch Avengers Endgame midnight show as well. If the reports are to be believed, Avengers Endgame tickets for late night shows will soon be available. So, And now, it is said that the movie will be screened 24x7 in India. At Mumbai’s Carnival IMAX in Wadala, the booking for shows at 3.20 am is already open. It is said that soon booking for shows post midnight will be open throughout I", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/india-gets-marvel-crazy-avengers-endgame-to-screen-24x7-bookings-for-3-am-show-are-now-open-365981.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_endgame_to_screen_24x7_the_midnight_shows_can_now_be_booked_1556084913_800x420.png"}