{"text": "“I want to paint the entire canvas with a new brush altogether so that the universe I create contains valour, energy, and grit,” said SS Rajamouli, the director who is known for his work in Baahubali across the globe. He had said this some time ago about his next film titled RRR, which also stars Alia Bhatt and Ajay Devgn in a pivotal roles apart from Ram Charan and Jr NTR.\nTwitter\nThe film was making headlines for it was announced that British actress Daisy Edgar Jones will be making her Indian movie debut in this one. It was said that she will be paired alongside Jr NTR. However, she has backed out of the project recently.\nAnd now Jr NTR’s Telugu fans are trolling and unfollowing her on Instagram.\ntosshub.com\nWhy has she opted out of the project? The official Twitter handle of movie RRR says it happened “Due to unavoidable circumstances.” Daisy Edgar Jones on her Instagram wrote that it happened due to “family circumstances”. Calling it a “wonderful film”, she said that the script is brilliant and her character is great too. She wished the team all the best.\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 12.5 K SHARES\nDue to unavoidable circumstances, @DaisyEdgarJones is no longer a part of our film. We hope she has a brilliant future. #RRR — RRR Movie (@RRRMovie) April 5, 2019\nHere's how fans reacted to this!\nIt is yet to be announced as to who will replace her. Meanwhile, Ram Charan is paired opposite Alia Bhatt, who is reportedly playing Sita in RRR. Made on a budget of Rs 350-400 crore, the SS Rajamouli movie will be released worldwide on July 30, 2020 in 10 languages simultaneously.\nInstagram\nThe movie is based on real-life 1920s freedom fighters Alluri Sitarama Raju and Komaram Bheem. Rajamouli had earlier said that he wants to portray these freedom fighters in a monumental way but not showing their typical rebellion and struggling phase.", "title": "Indian Fans Troll & Unfollow British Actress Daisy Edgar Jones After She Walks Out Of Rajamouli’s RRR", "date_publish": "08/04/2019, 11:47:08", "description": "The film was making headlines for it was announced that British actress Daisy Edgar Jones will be making her Indian movie debut with this one. It was said that she will be paired alongside Jr NTR. However, she has backed out of the project recently. Made on a budget of 350-400 crore, the SS Rajamouli movie will be released worldwide on July 30, 2020 in 10 languages simultaneously.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/indian-fans-troll-unfollow-british-actress-daisy-edgar-jones-after-she-walks-out-of-rajamouli-s-rrr-365047.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/after_daisy_edgar_jones_walks_out_of_ss_rajamoulis_rrr_telugu_and_jr_ntr_fans_unfollow_and_troll_h_1554703066_800x420.png"}