{"text": "Every year, Forbes release list of most powerful people in the world and it gives us a glimpse of all those who are doing exceedingly well in their respective fields.\nThis year too Forbes recently released the list of 100 Most Powerful Women in the world and four Indian women made it to the list. Four Indian women who made the cut in the list are:\n1. Priyanka Chopra\nPinterest\n2. CEO (HCL), Roshni Nadar Malhotra\nAgencies\n3. Entrepreneur Kiran Mazumdar-Shaw\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 460 SHARES 161 SHARES\nAgencies\n4. Chairperson (HT Media), Shobhana Bhartia\nAgencies\nThat's not all. Deepika Padukone has made it to the top five of Forbes India’s 2018 list of richest Indians, becoming the first woman to do so. Padukone's Padmaavat went on to break many records, raked in a phenomenal Rs 112.8 crore this year to become the highest-earning woman celebrity.\nAgencies\nRanveer Singh is number eight with Rs 84.67 crores and Ajay Devgn ranks tenth on the list with Rs 74.5 crores.\nAccording to the publication, there are 18 women on the list (which first came out in 2012) - down from 21 in 2017. Actors Alia Bhatt, Anushka Sharma, Katrina Kaif and shuttlers PV Sindhu, Saina Nehwal are part of the 100.\nPriyanka Chopra lost her last year’s seventh rank (Rs 68 crore) and settled for No 49 with Rs 18 crore as earnings in 2018.\n(With agency inputs)", "title": "Indian Women Top Forbes List, PC Among Most Powerful & Deepika Makes A Cut In Highest Paid", "date_publish": "05/12/2018, 13:50:49", "description": "Every year, Forbes release list of most powerful people in the world and it gives us a glimpse of all those who are doing exceedingly well in their respective fields. This year too Forbes recently released the list of 100 Most Powerful Women in the world and four Indian women made it to the list.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/indian-women-top-forbes-list-pc-among-most-powerful-deepika-makes-a-cut-in-highest-paid-357987.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pc_and_dp_1543999709_800x420.jpg"}