{"text": "Indonesian Spoof Of ‘Tum Paas Aaye’, Salman Khan Comes To Saroj Khan's Rescue & More From Ent\nIndonesian Spoof Of ‘Tum Paas Aaye’, Salman Khan Comes To Saroj Khan's Rescue & More From Ent\nThey have matched the choreography and expression step-by-step, and we are stunned. People on social media say their mind is blown too.\n2. Salman Khan Comes To Saroj Khan's Rescue, Gives Her Work After She Said She Has No Projects\nNow, Salman Khan has come to her rescue. It is said that when Salman Khan got to know about this, he asked her to meet him. After a meeting on Thursday, he promised to work with her.\n3. Keeping Up With The Tradition, Priyanka Chopra Threw Cake At Audience During Steve Aoki’s Concert\nDon't Miss 812 SHARES 174 SHARES 122 SHARES\nJust in case you didn’t know, DJ Steve Aoki is known for throwing cake at the audiences during his shows. Caking is like an honour bestowed on his die-hard fans. So, this time at his Los Angeles concert, Priyanka Chopra along with Jonas Brothers hung out with the DJ. Keeping up with the tradition, they all threw cakes at the audiences and seemingly had the most fun while doing so.\n4. Taimur Ali Khan Trumps Ranveer Singh! Kareena Kapoor Says Her Son Is More Stylish Than Him\nWhen Kareena Kapoor was recently awarded the most stylish (female) award, in her acceptance speech, she went on to say that her son Taimur is the most stylish man alive. He is more stylish than Ranveer Singh, she declared.\n5. Jackie Chan Hosts A Special Dinner For Sonu Sood As They Gear Up For Kung Fu Yoga 2\nNow, it seems the talks for Kung Fu Yoga 2 are on. Sonu Sood met with Jackie Chan and filmmaker Stanley Tong in Dubai, and now it is said that the trio is all set to kick off the sequel. Jackie Chan arranged for a special dinner for Sonu Sood recently.", "title": "Indonesian Spoof Of ‘Tum Paas Aaye’, Salman Khan Comes To Saroj Khan's Rescue & More From Ent", "date_publish": "30/03/2019, 18:14:17", "description": "No matter how many great movies are made these days, we just can never get over the classics like Kuch Kuch Hota Hai and Kabhi Khushie Khabi Gham among others, right? We can recall the movie by every scene; we know all the popular dialogues as well, and we know the lyrics and choreography of all songs as well. But still, we can watch it over and over again every weekend.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/indonesian-spoof-of-tum-paas-aaye-salman-khan-comes-to-saroj-khan-s-rescue-more-from-ent-364607.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/indonesian_spoof_of_tum_paas_aaye_salman_khan_comes_to_saroj_khans_rescue__more_from_ent_1553948001_800x420.png"}