{"text": "No matter how many great movies are made these days, we just can never get over the classics like Kuch Kuch Hota Hai and Kabhi Khushie Khabi Gham among others, right? We can recall the movie by every scene; we know all the popular dialogues as well, and we know the lyrics and choreography of all songs as well. But still, we can watch it over and over again every weekend.\nScreengrab\nNot only are us, looks like people all over the world are hooked to classic films like Kuch Kuch Hota Hai. That is perhaps the reason why some Indonesian fans recreated the blockbuster song Tum Paas Aaye from the film, and boy, it's bang on. Without further ado, take a look!\nBro who did this? 😂😂😂😂 why am I cringing so hard? Why they be thinking life is a Bollywood movie? pic.twitter.com/nHL1H9hSNc — Zee (@prestigepls) March 28, 2019\nThey have matched the choreography and expression step-by-step, and we are stunned. People on social media say their mind is blown too.\nHahahahahahah oh this is brilliant!! 😂😂😂 — Bilal Alvi (@bilalalvi87) March 28, 2019\n@Ghadooraable @ordinary_me24 this gon be my fav video on the internet for a while — That weird Khan (@unusuaL_n) March 29, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThere is no cringe. This is awesome! — Gokul Nath (@ClanOfKine) March 29, 2019\nThat leg swing at the end 🤣🤣 pure dedication this must have taken. — Rain (@RainyRain_) March 28, 2019\nI have to congratulate the camera man and the editors - 👍 — MAK (@aaniskhan) March 28, 2019\nIf you’re not trying to re-enact scenes from kuch kuch hota hai like this with me then stop texting me bc my time is clearly being wasted ✋🏾 https://t.co/ubbVVZELgA — Thanos👁 (@tiffanymcb96) March 29, 2019\nI so loved it..yes,life can be as fun as shown in Bollywood movies if you want to make it. — ashutosh (@indiaforindian1) March 28, 2019\nThis is amazing I think the world needs to see this 💀💀 — Anne Thomas (@anne1598) March 28, 2019\nWtf did I just see! Can I just pretend to never seen this!! I SAW IT THREE LOOPS!!! LMFAO!! — Abhishek Srivastava (@sriabh) March 28, 2019\nHahahahahha I have been singing this song ever since I saw this video — definitely the highlight of my day! — A N J A L I (@TheWayfarerSoul) March 28, 2019\nThey did a good job! pic.twitter.com/w6u7RTh13r — Noelle Mitchell (@mitchell_noelle) March 28, 2019\nNot long ago, Tiger Shroff had also danced to K3G’s Deewana Hai Dekho and it was simply epic.\nRead More: Tiger Shroff’s Epic Dance On ‘Deewana Hai Dekho’ Is Making Our Hearts Go ‘Sambhalo Sambhalo Na Pyaar Ho’", "title": "Indonesian Fans Make A Hilarious Spoof Of Kuch Kuch Hota Hai’s ‘Tum Paas Aaye’ & It’s Bang On!", "date_publish": "30/03/2019, 11:58:53", "description": "Not only are us, looks like people all over the world hooked the classic films like Kuch Kuch Hota Hai. That is perhaps the reason why some Indonesian fans recreated the blockbuster song Tum Paas Aaye from the film, and boy, it’s bang on. Without further ado, take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/indonesian-fans-make-a-hilarious-spoof-of-kuch-kuch-hota-hai-s-tum-paas-aaye-it-s-adorable-364577.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/this_kuch_kuch_hota_hais_tum_paas_aaye_spoof_by_indonesian_fans_is_epic_1553925944_800x420.png"}