{"text": "This is the year on Koffee With Karan with a season of many firsts. From a lot of debutantes making their debut on KJo's show, there was a cricketer special episode as well. Yesterday, Cricketers Hardik Pandya and KL Rahul’s made their debut on Koffee With Karan debut and sadly, the show has backfired and how.\nStar India\nThe episode hasn't gone down too well with the audience as when they were asked to choose the better batsman among Indian skipper Virat Kohli and master blaster Sachin Tendulkar, both chose Virat over Sachin. A fan wrote,\nStar India\n“I mean, are you guys who say Virat is better than Sachin really cricket fans or mere accountants? B***** one straight drive by Sachin is more beautiful and valuable than any shot ever hit by Virat”\nThat's not all.\nFans were also shocked by Hardik Pandya's views on womanizing and more.\nHere is the internet's verdict on last night's episode.\nA thread on all the creepy, misogynist, racist, and problematic things Hardik Pandya said on Koffee With Karan:\n1) KJo: Why don't you ask women's names at nightclubs?\nHP: I like to watch and observe how they move. I'm little from the Black side so I need to see how they move. — Sreeparna Mazumder (@Sreeep) January 6, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n#HardikPandya n #KLRahul\nFools they are.\nNo doubt #Virat is a good player but #Sachin is always on top on any day. No one can match or can reach Sachin🙏🏻#KoffeeWithKaran #KoffeeWithCricketers https://t.co/njOEjnlcNy — Shruti (@proud_2beIndian) January 7, 2019\nSachin is second to none. He's the GOD. He's an emotion. Bigger than Cricket. The undisputed no.1 GOAT!\nThat's it. That's the tweet.#KoffeeWithKaran #KoffeeWithCricketers — R I D D H I T (@Nadan_Parindey_) January 6, 2019\nHardik Pandya and KL Rahul on #KoffeeWithKaran happened to be the most cringe-worthy episode. #KoffeeWithCricketers was pure SH*T in a coffee mug. — Anoop Tomer (@anooptomer) January 7, 2019\nAfter watching today's episode of #KoffeeWithKaran, it's not hard to understand why cricket isn't cool anymore. #KoffeeWithCricketers — MSD7782 (@msd7782) January 6, 2019\n#KoffeeWithCricketers was just the worst episode. What's up with all the #misogyny . Tired of this boys will be boys attitude. @klrahul11 @hardikpandya7 #KoffeeWithKaran — Ekta Chauhan (@ekta2993) January 7, 2019\nWatched #KoffeeWithCricketers\nAnd I must say #HardikPandya is one pathetic, over-rated guy. He tries too much to be cool but he is not at all. Neither he is good looking nor a good human being.\nOn the other hand @klrahul11\nIs a true gentleman. — vinay pandey (@feelvinay) January 6, 2019\n#KoffeeWithCricketers Hardik Pandya should be dropped. He thinks he's West Indian. Some people cant handle money and fame. Sick. — pranit malik (@pranitmalik) January 6, 2019\n#KoffeeWithCricketers was just the worst episode. What's up with all the #misogyny . Tired of this boys will be boys attitude. @klrahul11 @hardikpandya7 #KoffeeWithKaran — Ekta Chauhan (@ekta2993) January 7, 2019", "title": "Internet Slams Hardik Pandya For Talking About 'Womanising', Calls The Koffee Episode 'Shit'!", "date_publish": "07/01/2019, 14:09:59", "description": "This is the year on Koffee With Karan was a season of many firsts. From a lot of debutantes making their debut on KJo's show, there was a cricketer special episode as well. Yesterday, Cricketers Hardik Pandya and KL Rahul’s made their debut on Koffee With Karan debut and sadly, the show has backfired and how.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/internet-slams-hardik-pandya-for-talking-about-womanising-calls-the-koffee-episode-shit-359984.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/koffee_1546851478_800x420.jpg"}