{"text": "Internet Can't Stop Praising Keanu Reeves For Taking A Public Bus After He Missed His Flight\nInternet Can't Stop Praising Keanu Reeves For Taking A Public Bus After He Missed His Flight\n“Three things in human life are important: the first is to be kind; the second is to be kind; and the third is to be kind.”\nWell, kindness is the most cherished trait that a person can ever have and one celebrity who can easily be named as the president of world's kindness club is Keanu Reeves. His onscreen roles might be rugged and hard-hitting but in real life, his heart is of gold!\nPeople have time and again spotted him taking public transport and he has also been actively involved in charities round the world! And now, internet is again hailing and for a very special reason.\nAfter missing his flight, Keanu was seen waiting and interacting at the airport. He later took a bus ride with them. Someone who was present shot a video of the entire experience. And people are absolutely bowled away by his niceness.\ni really just cried over this man https://t.co/Rh4VoSL8H4 — periods dont stop nothing but a sentence baby girl (@redratvevo) March 25, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\ni would not hesitate to die for this man https://t.co/XU0sPpkMvM — liam, a handsome 🐓 (@discodaddeaky) March 24, 2019\nkeanu reeves is so incredible https://t.co/koeCsfqXcg — Bubba Nova (@BubbaNova1) March 24, 2019\nthat one time we had to make a powerpoint about our fav person for school and my brother did it on keanu reeves https://t.co/cthMxRs7ZR — cloe (@fiImbutera) March 25, 2019\nI would’ve given him a ride https://t.co/NwetAUpLHQ — shazam ☾ (@_cali0) March 25, 2019\nThis is the most wholesome shit and made my absolute day https://t.co/WDWJVMfaQr — millieloveatfirstgreta (@innercelestial) March 25, 2019\nThe best video on the internet https://t.co/Oq4j1BBX1V — see the movie (@balrai0110) March 25, 2019\nYo, John Wick gave Bakersfield a big shout out! Lmaaao 😂 https://t.co/6137W0wEeg — Tony Stark (@TonyyStoney) March 25, 2019\nI'm not saying I love him but that's exactly what it is — moxine (@cucumser) March 25, 2019\ni’ve rewatched it like 5 times now- it makes my heart so happy seeing him so humble ugh — 𝓪𝓿𝓪🕊 (@purekeanu) March 24, 2019", "title": "Internet Can't Stop Praising Keanu Reeves For Taking A Public Bus After He Missed His Flight", "date_publish": "25/03/2019, 15:20:07", "description": "Well, kindness is the most cherished trait that a person can ever have and one celebrity who can easily be named as the president of world's kindness club is Keanu Reeves. His onscreen roles might be rugged and hard-hitting but in real life, his heart is of gold!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/internet-can-t-stop-praising-keanu-reeves-for-taking-a-public-bus-after-he-missed-his-flight-364261.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/keanu_reeves_1553508070_800x420.jpg"}