{"text": "Internet Turns Into A Pool Of Mush After Anushka Joins Kohli For India's Iconic Win In Sydney\nInternet Turns Into A Pool Of Mush After Anushka Joins Kohli For India's Iconic Win In Sydney\nIt's a historic day for both Indian Cricket Team and Virat Kohli, who became the first Indian captain to win a Test series in Australia. The 2-1 series win against Australia is making everyone proud of our Indian cricket team.\nAgencies\nThis was a big day for the team and Kohli, who was headlining the team could not have been happier. His joy of victory doubled up as his wife Anushka Sharma joined him for the celebrations.\nAgencies\nSharma took to her Instagram account and she wrote,\nDon't Miss 3.4 K SHARES 518 SHARES 12.5 K SHARES 5.5 K SHARES 3.1 K SHARES\n\"Terming the Test series win in Australia his \"biggest achievement\" in the career so far, Kohli rated it above India's World Cup win in 2011. Kohli delivered an inspirational speech after the victory. He said,\n\"By far this is my best achievement. Has to be on top of the pile. When we won the World Cup, I was a young player. I saw the others getting emotional. This series will give us a different identity as a team. What we've been able to achieve is something to be really proud of.\"\nAnushka was overwhelmed by Virat's phenomenal achievement.\nAgencies\nShe wrote,\nThey came. They conquered !!\nHistory is written and created by this bunch !!\nHuge congratulations to all players, coaching unit and support staff; it takes undying perseverance & solid conviction to focus on what’s important and shut out the rest. So so happy and proud of you my love @virat.kohli\nInternet turned into a pool of mush after seeing the pictures and videos of Kohli and Sharma's PDA on the field after India's grand victory.\nWinning in her presence makes it more special! His strength, his love, his life! #Virushka 💙💕 pic.twitter.com/MFFnNOxlHo — M ♡ (@CheekuNushkie) January 7, 2019\n2018 #Virushka compilation. Another lovely year filled with love and happiness ❤️ Wishing them even more love and success in 2019! pic.twitter.com/Fhv2mnDisX — ❤ (@AnushkaAddict) January 3, 2019\nProtect Virat and Anushka at all costs. #Virushka https://t.co/utXKaGLyS9 — Hina Shakeel (@HinaaShakeel) January 7, 2019\nShe was there in his low phase she is here in his high phase ❤ nothing but their love for each other is permanent 😭♥\ngod bless you both 💕\nmay these smiles be protected 🙏❤#Virushka pic.twitter.com/J6Kv3fp7rs — Chirag Vasani 15 (@ChiragVasani15) January 7, 2019\nSHUT UP THIS IS THE PUREST THING ever😭💕#TeamIndia #Virushka pic.twitter.com/dUlFStemYL — P R O M I S E (@ankitaranipanda) January 7, 2019\nThere is not as much accomplished without love as there is with it. The presence of love is the greatest method, manner, mode, agent, and tool of change that there is in the universe.❤#virushka pic.twitter.com/2IEf7ZIlJV — soni kc (@sonikc18) January 7, 2019\nShe got criticised everytime when he failed to perform\nNow she deserve every moment of praise when he's ruling Australia ❤#ViratKohli #AnushkaSharma #Virushka #AUSvIND pic.twitter.com/ieV7wXsb1M — Virat Kohli's Fangirl❤❤ (@Viratkohli2456) January 7, 2019\nThe way they adore,admire and love each other!❤ This togetherness is their answer to the hatred they had to suffer from years. #Virushka #anushkasharma #ViratKohli pic.twitter.com/HIePwVKaYF — Jiya (@Jiyarohan) January 7, 2019", "title": "Virat Kohli Anushka Sharma:Internet Turns Into A Pool Of Mush After Anushka Joins Kohli's Victory Walk Post Iconic Win In Sydney", "date_publish": "07/01/2019, 17:42:50", "description": "It's a historic day for both Indian Cricket Team and Virat Kohli, who became the first Indian captain to win a Test series in Australia. The 2-1 series win against Australia is making everyone proud of our Indian cricket team. This was a big day for the team and Kohli, who was headlining the team could not have been happier. His joy of victory doubled up as his wife Anushka Sharma.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/internet-turns-into-a-pool-of-mush-after-anushka-joins-kohli-s-victory-walk-post-iconic-win-in-sydney-360003.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/virushka_1546864413_800x420.jpg"}