{"text": "Post anything on social media and if it is controversial or shocking, it will go viral – even if it’s fake. This man just proved the aforementioned with his tweets. With the advent of social media, it has become easy to share information – both true and false. But how do we spot what’s fake and what’s real?\nTV writer Ben Mekler conducted an experiment on Twitter. He posted some outrageous comments about recently released movies. He wanted to see if the major websites will pick them up. They indeed did, but they were all fake comments.\nTwitter\nIt all started with Avengers: Infinity War. The craze of the film was so high that almost everyone was talking about it. Ben Mekler also posted a fake review, which surprisingly was carried by a lot of entertainment portals. In the tweet, he wrote, Iron Man and Captain America have sex in the movie.\nDon't Miss 4.3 K SHARES 130 SHARES 1.1 K SHARES 1.1 K SHARES\nJust got out of the #AvengersInfinityWar premiere. The movie is incredible, epic beyond compare. It’s everything you want it to be. Iron Man and Captain America fuck within the first fifteen minutes. Marvel fans are going to love this one - EASILY top five. — Ben Mekler (@benmekler) April 24, 2018\nIn the fake review of Captain Marvel, he wrote, “#CaptainMarvel is RADICAL! An awesome 90s period piece & total recalibration of the MCU as we know it! From the brief Winter Soldier cameo to the six full episodes of Friends that play consecutively through a majority of the film’s runtime, this might be my favorite MCU flick yet.”\n#CaptainMarvel is RADICAL! An awesome 90s period piece & total recalibration of the MCU as we know it! From the brief Winter Soldier cameo to the six full episodes of Friends that play consecutively through a majority of the film’s runtime, this might be my favorite MCU flick yet — Ben Mekler (@benmekler) February 20, 2019\nHe even pointed out how a lot of entertainment websites fell for his fake reviews.\nBut did that stop there? He again posted a fake movie review for Disney’s Dumbo. “#DUMBO soars. My favorite live-action Disney remake yet! From the gorgeous blend of goth and whimsy to the sequence in which Dumbo replaces his trunk with a 32 inch machete and has an affair with a bored housewife, the Tim Burton we know and love is FINALLY back in full force,” he wrote.\n#DUMBO soars. My favorite live-action Disney remake yet! From the gorgeous blend of goth and whimsy to the sequence in which Dumbo replaces his trunk with a 32 inch machete and has an affair with a bored housewife, the Tim Burton we know and love is FINALLY back in full force🐘❤️ — Ben Mekler (@benmekler) March 12, 2019\nFrom Mission: Impossible – Fallout to Acquaman, he has tweeted about a lot of other films too.\nThrilled to say #SoloAStarWarsStory WORKS. Cast crushed it - true to what we know yet energetic, fresh. Only subpar thing - at least forty minutes wasted on scenes where characters wolf down raw vidalia onions? Third act drags too. Still, this is a REAL Star Wars movie - loved it — Ben Mekler (@benmekler) May 11, 2018\n#Aquaman is everything DC fans have been hoping for and more. Rollicking action, an amazing sense of world-building, spellbinding musical numbers in which Aquaman wears clams as tap shoes, and a command performance from Jason Momoa. DC has really righted the ship. The DCEU lives! — Ben Mekler (@benmekler) November 26, 2018\nThank you MISSION: IMPOSSIBLE - FALLOUT for making me audibly gasp in a theater for the first time in ages. Won’t soon forget the image of Tom Cruise squeezing pus out of a festering wound while shrieking “I have to do this” directly into the lens. I. LOVE. THESE. MOVIES. — Ben Mekler (@benmekler) July 12, 2018\nSo, are you looking forward to what he has to say about Avengers: Endgame? Don’t fall for it!", "title": "Iron Man Had Sex With Captain America: Man Posts Fake Movie Reviews, Major Websites Fall For It", "date_publish": "13/03/2019, 14:05:22", "description": "TV writer Ben Mekler conducted an experiment on Twitter. He posted some outrageous comments about recently released movies. He wanted to see if the major websites will pick them up. They indeed did, but they were all fake comments. It all started with Avengers: Infinity War. The craze of the film was so high that almost everyone was talking about it. Ben Mekler also posted a fake review, which sur", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/iron-man-had-sex-with-captain-america-man-posts-fake-movie-reviews-major-websites-fall-for-it-363639.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/iron_man_had_sex_with_captain_america_man_posts_fake_movie_reviews_major_websites_fall_for_it_1552465156_800x420.png"}