{"text": "Alia Bhatt’s mother, Soni Razdan, also opened up on the ongoing #MeToo moment and revealed that “somebody tried to rape” her years ago. She didn’t name the person only because she thought it would cause trouble to him and his family, she told The Quint.\nThis also means that his health has massively improved and doctors have given him a green signal to resume shooting. A few months ago, there were reports that the makers of the Hindi Medium franchise had film flew down to London to meet Irrfan and it was after a really heartwarming session that Irrfan decided to give this project a go ahead.\nDon't Miss 10.9 K SHARES\nAll you Yo Yo Honey Singh fans who are waiting to catch his glimpse, the good news is that he is making a comeback in a music video after four long years, and here’s the first look!\n\"On returning from a long trip to the US yesterday, I read several baseless and unfounded stories with respect to misconduct and misbehaviour on the sets of our film Kizie Aur Manny. \"I'd like to clarify that no such incident took place with me. Let's put an end to these conjectures,\" Sanjana wrote.\nThe company in a statement said they carried out an independent investigation and are satisfied with the results. Kashyap and Motwane, who co-directed the hit series, have been under fire for their alleged inaction in the sexual harassment allegations against former Phantom Films partner Vikas Bahl by an employee, a charge they both have denied.", "title": "Irrfan Khan To Return To Mumbai And Films, Soni Razdan Shares Her #MeToo Story & More From Ent", "date_publish": "24/10/2018, 18:12:57", "description": "Alia Bhatt’s mother, Soni Razdan, also opened up on the ongoing #MeToo moment and revealed that “somebody tried to rape” her years ago. She didn’t name the person only because she thought it would cause trouble to him and his family, she told The Quint.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/irrfan-khan-to-return-to-mumbai-and-films-soni-razdan-shares-her-metoo-story-more-from-ent-355387.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/trending_1540384244_800x420.jpg"}