{"text": "Viral Bhayani\nJust recently, Irrfan Khan was spotted at the Mumbai airport by the paps. He was hiding his face because reportedly he didn’t wish to be clicked. If reports are to be believed, he had returned to India last month.\n“The end of the world might be coming soon, but at least he’s in love with somebody and knows who he is — and then comes a sledgehammer,” he was quoted as saying by Entertainment Weekly.\n3. Zoya Akhtar Feels Hindi Cinema Shows Physical Abuse Not Consensual Sex, Says That's Problematic\nDon't Miss 161 SHARES 842 SHARES\n“I realised this much later that while I was growing up, I have only seen physical abuse in Hindi films. It was crazy because we were allowed to watch rape scenes, molestation and assault but we weren't allowed to see consensual sex,” she was quoted as saying by PTI.\n4. Taapsee Pannu Thinks She Isn’t ‘Extraordinarily Good Looking,' Calls It Her Biggest Strength\n“I am an average Indian girl, who isn’t extraordinarily good-looking and that is my biggest strength,” she was quoted as saying by TOI.\n5. 'He Has A Target To Kill,' GoT Actor Hints At Big Showdown Between Jon Snow & The Night King\nWinter is here.\nUse #ForTheThrone to pledge your allegiance to the #ArmyoftheDead. pic.twitter.com/2z5OdhrJMG — Game of Thrones (@GameOfThrones) February 28, 2019\n“People will see he has a target he wants to kill, and you will find out who that is. There's also that moment [in season 5, episode 8 'Hardhome'] when Jon Snow was on the boat and the Night King looked at him and raised his arms – there's a similar and even stronger moment between Jon and the Night King this time,” he was quoted as saying by Entertainment Weekly.", "title": "Irrfan Khan Spotted At Mumbai Airport, Kit Harington Talks About GoT Season 8 & More From Ent", "date_publish": "09/03/2019, 18:41:19", "description": "Jon Snow knows nothing, not even the fact that the woman he is in love with is actually his aunt. In the last season, Jon and Daenerys Targaryen can be seen making love. The two are apparently unaware that they are aunt and nephew. Fans have been predicting that this might even lead to pregnancy, but in Game Of Thrones, we shall expect the unexpected.", "authors": [], "url": "https://www.indiatimes.com/entertainment/irrfan-khan-spotted-at-mumbai-airport-kit-harington-talks-about-got-season-8-more-from-ent-363445.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/irrfan_khan_gets_clicked_at_airport_kit_harington_talks_about_got_season_8__more_from_ent_1552134301_800x420.png"}