{"text": "1. In A Gracious Note To Fans For Supporting Him During His Illness, Irrfan Khan Says He's Back In Business\n\"Maybe somewhere in the pursuit of winning we forget how much it means to be loved... In our vulnerability we are reminded. As I leave my footprints onto these steps of my life, I want to pause to be grateful for receiving your immense love and support. It soothed me in my process of healing. So, I travel back to you, thanking you from the bottom of my heart.\"\n2. Jatin Sarna AKA Bunty From Sacred Games Bags A Role In Kapil Dev Biopic, To Play Yashpal Sharma\nIn movie titled '83, Jatin Sarna will be seen playing the role of former Indian cricketer Yashpal Sharma. He is elated to have bagged a Kabir Khan directorial. “Well, honestly I am a fan of him since New York and other films which he did. The kind of sensibility and entertainment he serves in his movies grew this desire in me to work with him,” he said in a statement.\n3. Karan Johar Unveils His Statue At Madame Tussauds. Wonder What's The Criteria For Featuring There?\nDon't Miss 174 SHARES 122 SHARES 291 SHARES\nHowever, this year, exceptionally has seen quite a few celebrities being shortlisted for the Museum. There's no denying that Madame Tussauds has gone all out in opening more museums and included more countries like India but looks like they have included all the possible actors too.\n4. SRK Gives A Pep Talk To Acid-Attack Survivors Before Their Corrective Surgeries & It's Gold!\n\"The main idea is to believe the fact that you will do something for yourself. If you have the intent everything else will follow. For every one of us, it's important to ensure we work for ourselves. We should do our own work without depending on anyone else. Even if it's a small job we should do it to fend for ourselves. And at the end of the day, we must be independent. In my heart, this is like a family. All of you are like my own people. I don't know much about each of you, because everyone has their personal lives and I don't want to get into those details. The main thing is to believe we can be independent. I'll be in touch with the doctors and get regular updates. We will try and get the best people to work with us.”\n5. In A Never-Ending Saga Of Nepotism, Karan Johar Takes A Sly Dig At Kangana Ranaut Yet Again!\n“I don’t love this subject, somebody else does. Ab hum bolega toh bologe ke bolta hai. Toh I have left it to that person to do all the talking and I will continue to do my job.”", "title": "Irrfan Khan Thanks Fans For Love & Support, Jatin Sarna To Play Yashpal Sharma & More From Ent", "date_publish": "03/04/2019, 18:21:39", "description": "This universe isn't a wish-granting factory and sometimes when you are not even prepared, it throws a curve ball. For Irrfan Khan, whose career was at an all-time high, the diagnosis of cancer came as a speed breaker. Irrfan Khan, who is considered as one of the finest actors in the film industry has been battling cancer since a year. A few months ago, he shared the news and wrote,", "authors": [], "url": "https://www.indiatimes.com/entertainment/irrfan-khan-thanks-fans-for-love-support-jatin-sarna-to-play-yashpal-sharma-more-from-ent-364814.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/irrfan_khan_thanks_fans_for_love__support_jatin_sarna_to_play_yashpal_sharma__more_from_ent_1554292968_800x420.png"}