{"text": "It has indeed been a long journey for Irrfan Khan who bravely battled cancer. No one can forget the day when he shared the news with his fans via Twitter. He revealed he had Neuroendocrine Tumour and left most of his fans in agony and fear.\nAfter his treatment in London, he is back in India and has even begun shooting for Hindi Medium’s sequel titled Angrezi Medium. As he began shooting for the film, he penned down a note for his fans in order to thank them for sending so much love and prayers.\nLike they say, when a person is diagnosed with cancer, not only him but his entire family suffers along with him. Irrfan Khan’s wife Sutapa Sikdar is happy that he is back to work. In an emotional note, she wrote that it was the longest year of their lives.\n“Longest year of our life . Time was never measured with pain and hope at the same time ever.while we take our babysteps back to work,to life I am submerged in prayers wishes and faith from friends relatives strangers and a connection with universe which gives us a small chance for this new start. It seems unbelievable …never ever I realized the meaning of the word unpredictable so well…never ever I could feel peoples wishes on my bones my breath my heartbeat which helped me to stay focused and kicking.. i cant take names because there are names and there are names I don’t even know who played angels. Sorry for not been able to answer individually but I know what you mean to us. I don’t see beyond one day and that day is today where everything seems fine. For today we go back to work.and the dance and song of life continues. Thank you for believing in your prayers.,” she wrote.\nThe producer of the film Dinesh Vijan is also happy to have him back on the sets. He said when Irrfan gave his first shot, everyone was emotional.\n“Having him (Irrfan) back on the set was a surreal feeling, he’s undoubtedly one of the best actors in the country. When he gave the first shot, everyone around got emotional. For me, it was one of those life-defining moments working with him again after Hindi Medium. Having him and Homi together was something all three of us have always wanted. Irrfan was his usual self…wry humour, crackling one-liners and back on his own turf. Deepak and his improvisations brought the house down. It was just like the first day of Hindi Medium,” he said in an statement quoted by Times Now.\nDon't Miss 322 SHARES 237 SHARES 197 SHARES 2.5 K SHARES 17.1 K SHARES\nWe wish Irrfan all the luck and good health there is in the world!", "title": "Irrfan Khan's Wife Pens An Emotional Note About Their 'Longest Year' As He Finally Resumes Work", "date_publish": "07/04/2019, 16:36:48", "description": "Like they say, when a person is diagnosed with cancer, not only him but his entire family suffers along with him. Irrfan Khan’s wife Sutapa Sikdar is happy that he is back to work. In an emotional note, she wrote, it was the longest year of her life.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/irrfan-khan-s-wife-pens-an-emotional-note-about-their-longest-year-as-he-finally-resumes-work-365035.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/irrfan_khans_wife_pens_an_emotional_note_as_he_begins_shooting_for_angrezi_medium_post_cancer_tre_1554633983_800x420.png"}