{"text": "Is It Just Us, Or Does Bauji In Mirzapur Remind You Of Hector Salamanca From Breaking Bad?\nIs It Just Us, Or Does Bauji In Mirzapur Remind You Of Hector Salamanca From Breaking Bad?\nGangs of Wasseypur was perhaps the first Indian film that was gruesome, unhygienic and multi-generational crime epic – the movie showed the real India that usually Indian movies shy away from. Breaking stereotypes i.e good looks for the first time took a backseat and talent came to the forefront. People killing people for petty issues was sure a realistic gangster drama for the Indian audience.\ndfordelhi.in\nYears later, after having announced that Gangs of Wasseypur 3 will never be made, Anurag Kashyap and the team gave us Sacred Games, and since then, the game has changed. A new wave of mafia dramas took over Indian cinema and web.\nnetflixmovies.com\nPerhaps, the biggest sleeper hits in the history of Indian cinema, Gangs of Wasseypur gained a cult status setting a platform for Sacred Games whose popularity spread like a wildfire.\nDon't Miss 2.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nIt’s difficult to not draw comparisons with these projects while watching gangster drama now, and that is the reason why Mirzapur is receiving flak. It’s Kaleen Bhaiya VS Ganesh Gaitonde.\nThere’s violence, power game, sex and nudity – much more than what was required, many felt. The show blows out to be hot as well as cold but the stellar performances of the cast including Ali Fazal, Pankaj Tripathi, Vikrant Massey, Divyendu, Rasika Duggal, Shriya Pilgaonkar, Shweta Tripathi, Sheeba Chaddha and Kulbhushan Kharbanda deserves an applause undoubtedly.\n#Mirzapur doesnt beat #SacredGames cos both belong diff geographies. Writing could have been much deeper. Performances from Divyendu, Pankaj Tripathi, Guddu, Bablu, Sweety, Golu, Rasika, Abhishek, Kulbhushan Kharbanda are top notch. — Varadraj (@varadadya) November 18, 2018\nKulbhushan Kharbanda made a comeback after a very long time. His role might have been short but his performance was simply outstanding.\nBut someone says .. Mirzapur is half good as Sacred Games.. pic.twitter.com/GyZ9AOzQlj — Baked News (@Rappudada) November 20, 2018\nThe wheelchair-bound patriarch, an ex-con, who spends most of his time watching Animal Planet on TV and has devious plans to tackle the situations – that’s Bauji from Mirzapur played by Kulbhushan Kharbanda, and also Hector Salamanca from Breaking bad, don’t you think?\nIf you remember, Héctor \"Tio\" Salamanca was one of the main antagonists in Breaking Bad. He didn’t quite play an important role initially, but in the flashback it was shown that he had a major role in setting up the drug empire.\nHector Salamanca didn’t played major part in the business since years because he is confined to the wheelchair. But does that take away from the fact that he was still dangerous? Well, Walter White and Jessie Pinkman made many futile attempts to kill the crippled man.\nI found it okay okay types.... Actually underutization of actors.... 9 episode and kulbhushan kharbanda only plays a part in last 20 mins. — अबे सुनो । Abey suno (@Abey_suno) November 17, 2018\nHector Salamanca was one of the most feared dons and the patriarch of Salamanca family. He was an extremely influential man until he was crippled. And so is Bauji, right?\nWhat draws these two characters apart is the fact that Hector couldn’t also speak. He never spoke a syllable. He, in fact, had a brass service bells tapped to his wheelchair’s armrest which he used to communicate. One bell meant a “yes” and no bell meant a “no”. And sometimes, Hector also used flurry of bell rings along with expression on his face to communicate.\nYouTube\nIn Breaking Bad, Walter White had convinced Hector Salamanca to commit suicide in order to kill Gus Fring, the villain of the show. He indeed gave away his life. Does bauji in Mirzapur will have a similar fate?\nHe, sure, plays an important role as we saw in the finale episode of Mirzapur. Well, only time will tell. He had devious, ruthless plans to tackle the bestiality. He had scorching one-liners throughout. And he definitely had cast an impact in the finale.\nAlso, seeing the veteran actor Kulbhushan Kharbanda ji after so long. What's with him always bust watching animal planet 🤔 weird. This character has a secret. The #Tripathi lineage is scary. #Mirzapur — ♏ (@ManaliK13) November 16, 2018\nThere are more layers to Bauji's character than what is shown in season one, we are sure.", "title": "Is It Just Us, Or Does Bauji In Mirzapur Remind You Of Hector Salamanca From Breaking Bad?", "date_publish": "24/11/2018, 17:31:38", "description": "Wheelchair-bound patriarch, an ex-con, who spends most of his time watching Animal Planet on TV and has devious plans to tackle the situations – that’s Bauji from Mirzapur played by Kulbhushan Kharbanda, and also Hector Salamanca from Breaking bad, don’t you think?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/is-it-just-us-or-does-bauji-in-mirzapur-remind-you-of-hector-salamanca-from-breaking-bad-357049.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/was_it_just_us_or_bauji_in_mirzapur_reminded_you_too_of_hector_salamanca_from_breaking_bad_1542715884_800x420.jpg"}