{"text": "Tanushree Dutta’s sister Ishita Dutta got recognition in Bollywood with her first Bollywood film Drishyam featuring Ajay Devgn and Tabu in pivotal roles. She played Devgn’s daughter in the film. She was also seen in Kapil Sharma's second film Firangi.\nTwitter\nToday she is in a happy phase of her career as well as personal life.\nTwitter\nIndiatimes decided to get in touch with Ishita Dutta who is also Tanushree Dutta’s sister who started the #Metoo Movement in Bollywood by raising her voice against sexual harassment by Nana Patekar 10 years ago. We decided to talk to Ishita about what made her choose to make a career in Bollywood despite seeing all the bad happened to her sister.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWe first questioned Ishita, when did she think of becoming an actress, she replied, “ It was a very random decision, As a child, I used to change my decision of becoming something almost everyday - like someday i wanted to be a teacher and someday an astronaut. It continued in the same vein till I went to college. After then I did studies in media line and I knew I wanted to do something in this field, but my sister (Tanushree Dutta) told me that you want to do acting but you are not sure about it, so why don’t you join an acting course and see what happens, if you like it, continue with it and if you don’t, you can go back to doing your MBA as I was prepping for MBA at that time.”\nTwitter\nShe further added, “So when I did an acting course at Anupam Kher's school, I was sure I can do this, as a person I was very introvert, this acing course helped me open up as a person, I started enjoying it. That's when my journey started, I did a couple of ads, South films and then I got my television break, this is how my acting career started. After working for one and half years, I got Drishyam and that brought me recognition.”\nOur next question to her was, wasn’t she skeptical to come to Bollywood as her sister Tanushree’s experience in this industry was disappointing and hurtful, she replied,\n“ I saw that incident happening to a girl when she was working, it was not like, oh this happens only in Bollywood, this happens to many girls in so many different places. I never associated that harassment to Bollywood, it happens in every industry and for me, I either wanted to work or sit at home. I learned to protect myself. And the answer to this kind of harassment was not changing your clothes, time or habit, but the answer was changing the society, so that never stopped me.\n\"And my sister always encouraged me to do what I felt like, she never stopped motivating me, even my parents welcomed my decision to join Bollywood with opened arms. Everybody is not bad, there are so many men who are pro-women empowerment. I didn’t even have a single thought before joining the industry that something happened with my sister, it could have happened to anyone anywhere.”\nHaving said that, she agreed that she was alert and extremely protective, “ I was very careful because I had seen it. In fact, I was lucky to have a friendly environment at work right from my director, producer to co-actors. Also, I was not completely new to the industry, I had my sister’s name behind me and that kind of helped me.”\nInstagram\nWe questioned how her sister ‘s name helped her in shaping a career in Bollywood, as her sister was labelled as an unprofessional back then, she said, “I am a person who, if somebody says something about somebody I will experience it and then make a judgment over it. Yes, my sister was labelled unprofessional that time, but people knew what the truth was. Also, I was very punctual and true to my work. I had to work very hard to get the name that I have made today.”\nInstagram\nShe went on to say, “It’s not that I got the desired launch being Tanushree Dutta’s sister, I worked my way, but in terms of help I would say, my sister was always there to guide me, I have not even achieved half of what my sister had. If ever I had any doubt she was my go-to person, it was so nice of her that she didn’t let her episode affect my decision of entering Bollywood. She has been very supportive. In fact, she was sure Drishyam will work for me, I wasn’t sure because it was not a typical launch, but she told me - let your work speak and one day you will get what you deserve.”\nWe asked Ishita if she would ever do a bold film like her sister Tanushree and her reply deserves an applause,\n“Things have changed today, there are so many top actresses who don bikinis and lock lips on screen, they are not judged in the way, they judged my sister. I feel why aren’t these actresses judged just because it’s a big-banner film with big names? That’s not fair. Coming to me, if I like the script, I will do it, I won't have the fear of body shaming or judgments because that will anyway never happen”.\nTwitter\nRecalling the incident of goons attacking Tanushree’s car on the sets of Horn Ok Please back in 2009, she said, “ I had just shifted to Bombay, I remember it very clearly, somebody called at home and said all this is happening. My parents had no network that time and the media footage too came much later, I had no idea what was happening, but when my sister came home, she was very upset. Even today I see that footage, I feel terrible because nobody wants to see their family land in such a horrible situation.”\nClearly, Dutta sisters are strong individually but together they are rock-solid.", "title": "Ishita Dutta Asks Why A-Listers Aren't Questioned About Doing Bold Scenes Or Sporting Bikinis?", "date_publish": "31/10/2018, 14:05:28", "description": "Indiatimes decided to get in touch with Ishita Dutta who is also Tanushree Dutta’s sister who started the #Metoo Movement in Bollywood by raising her voice against sexual harassment by Nana Patekar 10 years. We decided to talk to Ishita about what made her choose to make a career in Bollywood despite seeing all the bad happened to her sister.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ishita-dutta-asks-why-a-listers-aren-t-questioned-about-doing-bold-scenes-or-sporting-bikinis-355748.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ishita_1540974513_800x420.jpg"}