{"text": "It's Official! SRK To Play Astronaut Rakesh Sharma, Will Start Shooting For The Biopic From Feb\nIt's Official! SRK To Play Astronaut Rakesh Sharma, Will Start Shooting For The Biopic From Feb\nIt’s official! After speculations that Aamir Khan will play the role of astronaut Rakesh Sharma, the first Indian to have travelled in space, Shah Rukh Khan has been zeroed in to play the titular role.\nTo be produced by Ronnie Screwvala, the movie is titled Saare Jahaan Se Achcha. Speculations are rife that Bhumi Pednekar will also star in the biopic. An official announcement on the same is expected soon.\nindianairforce.nic.in\nConfirming the news about Shah Rukh Khan playing the role of Rakesh Sharma, Ronnie Screwvala said, “We are doing that film with Shah Rukh Khan. We should begin it by February or March next year, but we haven't announced the female lead yet.”\nThe producer who is also bankrolling Sushant Singh Rajput starrer Kedarnath says he is quite excited about all his projects.\nDon't Miss 3.5 K SHARES 343 SHARES 1.3 K SHARES 555 SHARES\n“This time around there is no compulsion. I can do three movies a year, or six. Telling the stories I want to tell is most important. That's what I'm going to focus on, bring deeply involved with everything, from cast and script. That's the plan.”\nvariety.com\nShah Rukh Khan will begin shooting for Saare Jahaan Se Achcha in Feb 2019.\nAlso Read: This Man Almost Became The First Indian To Go Into Space Ahead Of Rakesh Sharma", "title": "It's Official! SRK To Play Astronaut Rakesh Sharma, Will Start Shooting For The Biopic From Feb", "date_publish": "28/10/2018, 18:15:03", "description": "It’s official! After speculations that Aamir Khan will play the role of astronaut Rakesh Sharma, the first Indian to have travelled in space, Shah Rukh Khan has been zeroed down to play the titular role. To be produced by Ronnie Screwvala, the movie is titled Saare Jahaan Se Achcha. Speculations are rife that Bhumi Pednekar will also star in the biopic. An official announcement on the same is expe", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/it-s-official-srk-to-play-astronaut-rakesh-sharma-will-start-shooting-for-the-biopic-from-feb-355615.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/shah_rukh_to_star_in_film_based_on_astronaut_rakesh_sharma_the_first_indian_to_go_to_space_1540729752_800x420.png"}