{"text": "Does he even need an introduction? Who doesn’t know Yo Yo Honey Singh, the man who became one of the biggest rockstars in the world of Indian music especially post 2010.\ntlgo.files.wordpress.com\nFrom kids mugging up the lyrics of his songs to every club playing his hit songs, Yo Yo Honey Singh was a name that ruled the music industry a few years ago. But then, he suddenly went missing, leaving the show he was judging in the middle.\nNobody knows what happened to him. Rumours suggested that he was an alcoholic who had to be admitted into a rehab, but Honey Singh denied all such rumours.\nTwitter\nHe has done a few songs in the past year including Dil Chori from Sonu Ki Titu Ki Sweety, which garnered 350 million views on YouTube, but unlike before, he didn’t feature in the music video.\nDon't Miss 233 SHARES 182 SHARES 185 SHARES 1.5 K SHARES 184 SHARES\nAll you Yo Yo Honey Singh fans who are waiting to catch his glimpse, the good news is that he is making a comeback in a music video after four long years, and here’s the first look!\nAfter a long gap of 4 years, @asliyoyo is here with a comeback single. Feast your eyes on the first look.🤩\nGet ready for India's biggest music video. Coming soon.💥@itsBhushanKumar pic.twitter.com/uZVcCEUtnl — TSeries (@TSeries) October 24, 2018\nWith his red aviator glasses, gold chain and his swagger on point, we are all singing “excited main edda” at the moment. This will be his first major single after Love Dose. It’s time to gear up for the return of Rap King y'all!", "title": "It's Time To Sing ‘Excited Main Edda’! Yo Yo Honey Singh Is Making A Music Video Comeback After 4 Years", "date_publish": "24/10/2018, 16:40:20", "description": "All you Yo Yo Honey Singh fans who are waiting to catch his glimpse, the good news is that he is making a comeback in a music video after four long years, and here’s the first look. With his red aviator glasses, gold chain and his swagger on point, we are all singing “excited main edda” currently. This will be his first major single post Love Dose. It’s time to gear up for the return of Rap King.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/it-s-time-to-sing-excited-main-edda-yo-yo-honey-singh-is-making-a-music-video-comeback-after-4-years-355369.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/its_time_to_sing_excited_main_edda_because_yo_yo_honey_singh_is_making_a_comeback_in_a_music_vide_1540378836_800x420.jpg"}