{"text": "We all need a circuit in life, don’t we? Munna Bhai MBBS was a game-changer for not only Indian cinema but also for a lot of people involved in the movie – like Sanjay Dutt. The movie revived the career of the star. What’s more? It also marked the directorial debut of one of India’s most sought after directors Rajkumar Hirani.\nIt has almost been 15 years since the first instalment was released, but still, it remains etched in our hearts. So much so, that whenever it airs on TV, its impossible to not watch it.\nFans have been waiting for the third instalment for the longest time, and finally, the good news has arrived. The script for Munna Bhai 3 is ready, and Arshad Warsi has confirmed that the shooting will start this year.\ngoogleapis.com\n“I do know that the script is pretty much ready. I do know from Raju [Rajkumar Hirani] that the film will go on floors this year - either mid or the end of the year. The work on the script is going on. As of now, yes it's Sanju and me. These are the things I've been told,” he was quoted as saying by PTI\nhungama.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe story will pick up right from where the second instalment ended. Talking about the character of circuit, Arshad said, “I tend to do my film and forget about my character and I move on to the next one. I tend to forget, which is what happened with Munna Bhai. When I came for the second part, I was doing the same role differently. I realised something isn't quite right. Then Raju and I saw a couple of scenes from the first one and remembered how I should be doing. This time too, I'm sure I'll do it.”\nTwitter\nSo, Munna Bhai fans, it’s time to rejoice!", "title": "It’s Confirmed! Sanjay Dutt-Arshad Warsi To Return In Munna Bhai 3, Shooting Starts This Year", "date_publish": "09/01/2019, 11:21:29", "description": "Munna Bhai MBBS was game changer for not only Indian cinema but also for a lot of people involved in the movie – like Sanjay Dutt. The movie revived the career of the star. What’s more? It also marked the directorial debut of one of the India’s most sought after directors Rajkumar Hirani.Fans have been waiting for the third instalment for the longest time, and finally the good news has arrived. Th", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/it-s-official-sanjay-dutt-arshad-warsi-to-return-with-munna-bhai-3-shooting-starts-this-year-360068.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/its_confirmed_sanjay_duttarshad_warsi_to_return_in_munna_bhai_3_shooting_starts_this_year_1547012735_800x420.jpg"}