{"text": "It's Official! Farhan Akhtar's Love Note For Shibani Dandekar Proves They Are Meant To Be!\nIt's Official! Farhan Akhtar's Love Note For Shibani Dandekar Proves They Are Meant To Be!\nAfter playing hide and seek with the media and their fans about their relationship status, the cat is finally out of the bag!\nFarhan Akhtar and Shibani Dandekar are indeed seeing each other since last year and today, we got a big proof that they were always meant to be. While their PDA was restricted only to social media till a few months ago, the couple is very comfortable with making public appearances together.\nAll their pictures and videos prove they are head over heels in love with each other.\nLast night, Farhan posted a picture of his ladylove Shibani with a love note that read:\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I don't know if you find love or love finds you, either way, it's a gift from the universe. So be grateful. Every. Single. Day\"\nThis proves that they have indeed found their love and bliss in each other. Several reports have hinted at the fact that they are also ready to take the plunge and might tie the knot in a private ceremony by the end of first quarter of 2019.\nWhile Farhan and Shibani have maintained a graceful silence, a report once stated that the official proposal has already been made and they have exchanged rings.\nWell, we hope this love story finds its happy ending soon because who doesn't like fairy tale endings?", "title": "It's Official! Farhan Akhtar's Love Note For Shibani Dandekar Proves They Are Meant To Be!", "date_publish": "04/02/2019, 11:06:53", "description": "Farhan Akhtar and Shibani Dandekar are indeed seeing each other since last year and today, we got a big proof that they were always meant to be. While their PDA was restricted only to social media till a few months ago, the couple is very comfortable with making public appearances together.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/it-s-official-farhan-akhtar-s-love-note-for-shibani-dandekar-proves-they-are-meant-to-be-361533.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/farhan_and_shibani_1549260221_800x420.jpg"}