{"text": "Talking about the indefinite ban on Pakistani artists in India, singer Shafqat Amanat Ali raises a valid question as he talks about no exchange of artistic talent between India and Pakistan. He asks that while all other trade between the two countries is intact, why the entertainment industry has been targeted in particular.\nInstagram\nThe Pakistani singer says the entertainment industry is a soft target and feels it is high time India lifts the ban that prevents Pakistani artistes from performing in the country.\nTalking to IANS, Shafqat said,\nAgencies\n\"Art and entertainment industry is a soft target. They know that they can't fight back, so just ban it. It is very easy. Otherwise, there is lot of trade that is happening between India and Pakistan. If you go to the Attari-Wagah border, one can see trucks bringing goods and exchanging goods from both the sides. That import and export business is running full-fledged. People are waiting with their trucks and are off-loading. If we stop that, it would lead to chaos. But they know that they if they put a ban on artistes or actors or people who are related to art, they will express themselves through media or social media platforms. Nothing else.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhen the singer was further asked if he misses performing in India, he said,\nTwitter\n\"Of course I do. If you talk to people who visited Pakistan to support their team in the last India-Pakistan match, (they will say) they went back after a very emotionally charged trip. They were given so much love. And we also received a lot of love, respect and appreciation for our work in India. I miss performing in India and it is high time that they lift the ban.\"\nFor the uninitiated, he has given some Bollywood hits that includes Mitwa, Tere naina, Allah waariyan, Bin Tere and Dildaara.", "title": "It's High Time India Should Lift Ban On Pakistani Artists, Says Singer Shafqat Amanat Ali", "date_publish": "29/01/2019, 17:15:21", "description": "Talking about the indefinite ban on Pakistani artists in India, singer Shafqat Amanat Ali raises a valid question as he talks about no exchange of artistic talent between India and Pakistan. He asks that while all other trade between the two countries is intact, why the entertainment industry has been targeted in particular.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/it-s-high-time-india-should-lift-ban-on-pakistani-artists-says-singer-shafqat-amanat-ali-361245.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shafqat_amanat_ali_1548763880_800x420.jpg"}