{"text": "Marvel Fans in India have a happy reason to rejoice! Marvel’s much anticipated upcoming film ‘Avengers: Endgame’ is going to be all the more special for the Indian marvelites out there, as the film will feature an all-new song composed by Indian music maestro AR Rahman.\nAccording to Indian film critic and trade analyst Taran Adarsh, Rahman will be composing a song for Indian fans in three languages, Hindi, Tamil, and Telugu. The song will be released on April 1.\n“#BreakingNews: AR Rahman joins Avengers: Endgame. The ace music composer will create an all-new song for Indian fans in three languages: Hindi, Tamil and Telugu. The song will be released on 1 April 2019,” Adarsh tweeted.\nbccl\nThe trailer of the film was released earlier this month, featuring almost every superhero that the fans were eagerly waiting to see in the upcoming installment of the franchise- including Captain America, Thor, Black Widow, Iron Man, Hawkeye and Ant-Man.\nThe trailer gives a solemn recap of the earliest days of the franchise to show just how far the heroes have come, which is enough to give the fans some real ‘End Game’ vibes.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\n'Avengers: Endgame' will feature a stellar star cast which includes, Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldana, Josh Brolin, and Chris Pratt.\nThe fans are eagerly waiting for the release since ‘Endgame’ will mark the final film within the Marvel Cinematic Universe's current generation, which comprises 22 films, including 'Spider-Man: Homecoming' and recently released Captain Marvel. It will also be the last Marvel movie for some of the key characters, including Chris Evans’s Captain America.\nThe film is all set to hit the theatres on April 26.\nInputs From ANI", "title": "It's Happy News For Marvel Fans! AR Rahman To Compose Song For 'Avengers: Endgame'", "date_publish": "25/03/2019, 17:40:13", "description": "Marvel’s much anticipated upcoming film ‘Avengers: Endgame’ is going to be all the more special for the Indian marvelites out there, as the film will feature an all-new song composed by Indian music maestro AR Rahman. “#BreakingNews: AR Rahman joins Avengers: Endgame. The ace music composer will create an all-new song for Indian fans in three languages: Hindi, Tamil and Telugu.", "authors": [], "url": "https://www.indiatimes.com/entertainment/it-s-happy-news-for-marvel-fans-ar-rahman-to-compose-song-for-avengers-endgame-364282.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ar_rahman_compose_song_for_avengers_endgame_1553515919_800x420.jpg"}