{"text": "Winter is coming soon and so is the end of Game of Thrones. The makers have finally confirmed that Game of Thrones season 8 will air in April 2019. The date, however, is yet to be announced.\nMeanwhile, there are a lot of questions in the minds of ardent Game of Thrones fans. Who will sit on the Iron Throne? Will the Night King be killed? Who will survive and who will die?\nWell, George RR Martin knows it all, and he has just confirmed a popular Game of Thrones theory doing the rounds.\nRemember that The Red Witch, Melissandre, had revealed about Azor Ahai – aka The Prince That Was Promised – as a chosen warrior who brought an end to the conflict when he destroyed the Great Others (basically the White Walkers) with his burning sword, the Lightbringer?\nbusinessinsider.com\nDon't Miss 161 SHARES 842 SHARES\nGeorge RR Martin has now confirmed that Jon Snow (played by Kit Harington) is Azor Ahai, the legendary hero, who has reborn to save the world yet again.\n\"Aegon finally decided to take over Westeros and unify the Seven Kingdoms that existed at the time under one rule. There is a lot of speculation that in some sense he saw what was coming 300 years later, and wanted to unify the Seven Kingdoms to be better prepared for the threat that he eventually saw coming from the north — the threat that we are dealing with in A Song of Ice and Fire,” Matin says in the video, clearly stating that Aegon knew that hundreds of years later, the White Walkers would rise again, which also hints Aegon is Azor Ahai.\nSo that means Jon Snow will kill the White Walkers, right?", "title": "It's Official! George RR Martin Confirms The Most Popular Game Of Thrones Theory About Jon Snow", "date_publish": "18/11/2018, 18:08:32", "description": "Well, George RR Martin knows it all, and he has just confirmed a popular Game of Thrones theory doing the rounds. George RR Martin has now confirmed that Jon Snow (played by Kit Harington) is Azor Ahai, the legendry hero, who has reborn to save the world yet again.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/it-s-official-george-rr-martin-confirms-the-most-popular-game-of-thrones-theory-about-jon-snow-356914.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/dropping_a_major_spoiler_for_season_8_george_rr_martin_confirms_this_popular_game_of_thrones_theory_1542543729_800x420.png"}