{"text": "Jaagte Raho! Chucky Is Coming Back In The Form Of TV Series & Sleepless Nights Are Guaranteed!\nJaagte Raho! Chucky Is Coming Back In The Form Of TV Series & Sleepless Nights Are Guaranteed!\nAfter scaring one generation after the other, Chucky is back to haunt you and give you sleepless nights. AGAIN!\ntwitter\nAmerica’s favourite homicidal doll is all set to get his own TV series. The Child’s Play franchise which has rolled out 7 films, is getting a reboot in the form of series. After a competitive bidding war, the cable channel owned by NBC Universal won the rights. The creator of Chucky, Don Mancini holds this project very close to his heart and his super excited to helm the highly anticipated television reboot.\nTitled ‘Chucky’, the series will narrate the terrifying tale of the doll but at the same time it promises to be a fresh take on the long-running franchise.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\npinterest\nChild’s Play, the first film of the franchise came out in 1988 and managed to earn a cult following. The most recent installment titled Cult Of Chucky was released in 2017.\nThe plot of the films revolve around a a murderous doll named Chucky who is possessed by the soul of serial killer Charles Lee Ray.\ngeektyrant\nAnd good news for horror lovers, the doll wants to scare the shit out of the viewers over and over again. Confused, right?\nSyfy released a statement from Chucky himself after this piece of news broke.\n\"In these troubled times, I believe it's my obligation as a horror icon to reach the widest possible audience, on TV. For over 30 years, I've been scaring the s**t out of you. But now at Syfy, I look forward to really making a difference,\" said Chucky as reported by EW.\nhorror freak news\nInterestingly, fans started inquiring whether Chucky will be allowed to use curse words now that he’ll be on TV. The producer was quick to respond on Twitter:\n(Yes, Chucky can say “fuck” on Syfy.) — Nick 🥑 Antosca (@NickAntosca) January 30, 2019\nSo, if you haven’t caught the Chucky fever till now, there’s going to be fresh content to start with.", "title": "Jaagte Raho! Chucky Is Coming Back In The Form Of TV Series & Sleepless Nights Are Guaranteed!", "date_publish": "30/01/2019, 16:46:30", "description": "After scaring one generation after the other, Chucky is back to haunt you and give you sleepless nights.AGAIN! America’s favourite homicidal doll is all set to get his own TV series. The Child’s Play franchise which has rolled out 7 films, is getting a reboot in the form of series. After a competitive bidding war, the cable channel owned by NBC Universal won the rights. The creator of Chucky, Don", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/jaagte-raho-chucky-is-coming-back-in-the-form-of-tv-series-sleepless-nights-are-guaranteed-361316.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/chucky_1548846134_800x420.jpg"}