{"text": "1. ‘Jab We Met’ & ‘Lage Raho Munna Bhai’ Actor Kishore Pradhan Passes Away At 86\nIt is said that he wasn’t keeping well since after he finished shooting for the film. In a statement to Indianexpress.com, his Subh Lagna Savdhaan co-star Subodh Bhave said, “I don’t know the exact reason of his death yet. His family is grieving and busy with preparations for his funeral.”\n2. Anupam Kher Slams Rahul Gandhi & His Supporters For Vandalizing Theatre Playing The Accidental Prime Minister\n#WATCH West Bengal: Congress workers protested and raised slogans at Inox, Quest Mall in Kolkata against #TheAccidentalPrimeMinister. The protest started while the film was being shown at the theater. (11.01.2019) pic.twitter.com/BVNTAt5fbV — ANI (@ANI) January 11, 2019\nYesterday, Congress workers reportedly entered and vandalized a theatre in Kolkata taking the protest against the film to a whole new level.\n3. Munna Bhai MBBS Actor Vishal Thakkar Has Been Missing For 3 Years, Cops Are Still Clueless\nIt was in December 2015, at around 10:30 pm, when he borrowed Rs 500 from his mother after she refused to go watch a movie with him and left his Mulund flat. Little did his family know that it was the last time they were seeing him.\nDon't Miss 174 SHARES 122 SHARES\n4. This Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together\nNow, a Facebook page called Indian Rap Memes has quite remarkably superimposed some clips from 8 Mile on Gully Boy’s trailer to make a mashup. The similarities between the two are astonishing.\n5. After Hardik Pandya, Ranveer Singh Faces Flak As Internet Digs Up His Sexist Remarks On Koffee With Karan\nNow, the internet has dug up an old video of Ranveer Singh on the same show, Koffee With Karan, in which he is making some cringe-worthy remarks. And yet again, Karan Johar is laughing his heart out at them.", "title": "Jab We Met Actor Kishore Pradhan Passes Away, Anupam Kher Slams Rahul Gandhi & More From Ent", "date_publish": "12/01/2019, 17:34:24", "description": "From Jab We Met Actor Kishore Pradhan’s death to Munna Bhai MBBS Actor Vishal Thakkar being untraceable since three years and Anupam Kher lashing out at Rahul Gandhi and his supports for vandalising a theatre in Kolkata where The Accidental Prime Minister was being played, here’s all that rocked the world of entertainment today.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/jab-we-met-actor-kishore-pradhan-passes-away-anupam-kher-slams-rahul-gandhi-more-from-ent-360312.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/jab_we_met_actor_kishore_pradhan_passes_away_anupam_kher_slams_rahul_gandhi__more_from_ent_1547293357_800x420.png"}