{"text": "Dreams come true for those who pursue it and for Devansh Misra, a Class 4 student from Jaipur, this dream came true this year.\nThis boy has been garnering acclaim for playing the lead role of a deaf and mute child named Kashmir in the film \"Chicken Biryani 2\".\nThe Bollywood film, even before its release, has earned recognition by winning over nine awards and nominations. It has won an award at the New Delhi Film Festival, Best Short Film award in Great Message International Film Festival and winner in International Children's Film Festival of Jaipur.\nBesides these, it has been officially selected for Lakeview International Film Festival, AAB International film festival and in the fourth International Film Festival of Shimla among others. In this film, scheduled for December release, Devansh plays the lead role of a lost deaf and dumb child, who despite being silent all across the film, manages to connect to the audience with his eyes and strong acting skills.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nOn details about his role, he smiled and said: \"My name is Kashmir in the film and I play the role of a lost kid who is unable to hear or speak. I give the message of uniting the two nations, India and Pakistan in this film.\"\n\"When I get lost on controversial Indo-Pak border and get fainted at zero point, the forces of both the countries try to know my identity. But when I fail to share any detail, they name me as Kashmir and want me to be with them and hence the story moves forward.\"\nEven at the tender age of 10, Devansh has a strong passion to do daring things. He loves to play stunts, drives his bicycle on one tyre without holding the handles, gives it a zooming turn and so on.\n\"I love doing adventurous things,\" he said, adding: \"Nothing on the earth can frighten me.\"\nWhen asked about his shooting experience, he said: \"I loved shooting in Gujarat on the India-Pakistan border.\"\nRecounting one scene, he said: \"I was asked to do a scene at Kutch border where I had to connect India and Pakistan's flags. As I hold the two, there were harsh wood pieces coming out which brought blood in my hands when I was holding the flags tight. But I wanted to complete the scene and hence did not share it with anyone during the shooting.\nIANS\n\"Once the scene was completed, I told the crew over there that the sharp edges in the flags' rod had pierced in my hands. Also, the sand was quite hot during our shoots, but I managed it smartly.\"\nWhen asked how he controlled his pain of those sharp wooden pointers, he, with a smiling and shy face, said: \"I am a strong boy and I am not bothered by such small injuries.\"\nDevansh, unlike other boys of his age, has his fixed timetable where he learns acting and choreography for around two hours at his residence. Thereafter, like other children, he goes for his school tuition and then plays with his friends.\nBack home at around 8 p.m., he studies and then goes to his bed. He feels happy when asked if his friends are aware of his movie being scheduled for a release this December. \"I have already hosted a big party for all my friends in my school canteen,\" he said with pride.\nHowever, he fumbled when asked if he at any time had thought of acting in any film. He simply shook his head, indicating a 'no' and responded with a smile when asked if he wants to act more.\n\"Yes, I want to act and dance and do stunts,\" he adds.\n\"Chicken Biryani 2\" has been directed by Lome Harsh, a renowned Indo-Australian director. He earned fame after making a debut with \"Yeh Hai India\" and \"Chicken Biryani\". Till date, he has earned over 25 awards and nominations.", "title": "Jaipur Kid Win Hearts With His Deaf And Mute Character In Short Film 'Chicken Biryani 2'", "date_publish": "31/10/2018, 17:42:27", "description": "Devansh Misra, a Class 4 student from Jaipur, has been garnering acclaim for playing the lead role of a deaf and mute child named Kashmir in the film \"Chicken Biryani 2\". The Bollywood film, even before its release, has earned recognition by winning over nine awards and nominations.", "authors": [], "url": "https://www.indiatimes.com/entertainment/jaipur-kid-win-hearts-with-his-deaf-and-mute-character-in-short-film-chicken-biryani-2_-355816.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/devansh_mishra_biryani_2_1540986431_800x420.jpg"}