{"text": "Just like all of us, Bollywood stars also devastated by the violence that the country witnessed on the day of love. On Feb 14, at least 44 Jawans were killed in the deadliest terror attacks in three decades. Expressing her anger and displeasure, Janhvi Kapoor also condemned the Pulwama terror attack.\n“The reasons to be angered and hurt are plenty. The one that upsets me the most is that our men didn’t even get the chance to fight for themselves,” she wrote in her Instagram post.\nWhile the entire nation has been left devastated after the deadly Pulwama terror attack, Pakistani newspaper is apparently celebrating the incident that killed the lives of at least 44 Indian Jawans.\nAfter Pakistani newspaper The Nation hailed the suicide bomber as \"valiant\" and called the terror attack a fight for freedom. The media across the border have published such propaganda stories against India in the past as well.\nDon't Miss 623 SHARES 837 SHARES 233 SHARES 232 SHARES 870 SHARES\nJanhvi Kapoor recently shared the same on her Instagram profile slamming the article.\n“The second photo is of a propagandist article that is celebrating this terrorist attack as a fight for freedom. It’s tragic and irresponsible that the truths of such a condemnable act are being distorted by the media to suit their political agendas,” she wrote.\nHere's how people reacted to this.\nName the freedom fighter who kill human and who r called freedom fighter? Those who attack from behind. If dare came infront and then fight..#StopTerrorismInKashmir — Anamika (@Anamika37487175) February 16, 2019\nOn the other hand, Sushant Singh Rajput shared a post urging people to donate for the families of martyrs.\nHere’s what Varun Dhawan said after the incident.\nAlso Read: To Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17", "title": "Janhvi Kapoor Slams Pakistani Newspaper That Called Pulwama Terror Attack A Fight For Freedom", "date_publish": "16/02/2019, 17:48:14", "description": "Just like all of us, Bollywood stars also shaken with the violence that the country witnessed on the day of love. On Feb 14, at least 44 Jawans were killed in the deadliest of all terror attacks. Expressing her anger and displeasure, Janhvi Kapoor also condemned the Pulwama terror attack. “The reasons to be angered and hurt are plenty. The one that upsets me the most is that our men didn’t even", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/janhvi-kapoor-slams-pakistani-newspaper-that-called-pulwama-terror-attack-a-fight-for-freedom-362268.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/janhvi_kapoor_lashes_out_at_pakistani_newspaper_that_called_pulwama_attack_a_fight_for_freedom_1550310789_800x420.png"}