{"text": "Janhvi Kapoor To Play Gunjan Saxena, India’s First Woman Pilot Of Kargil & Here’s The 1st Look\nJanhvi Kapoor To Play Gunjan Saxena, India’s First Woman Pilot Of Kargil & Here’s The 1st Look\nFlight lieutenant Gunjan Saxena is one of the unsung heroes of the country. Did you know she is India’s first female IAF pilot who helped evacuate soldiers during the Kargil War in 1999? The braveheart, along with her fellow lieutenant Srividya Rajan faced a lot of hurdles, but she emerged a warrior and a fighter.\nFollowing the trend of biopics in Bollywood, Karan Johar is making a film on the Gunjan Saxena, and as it was rumoured earlier, Janhvi Kapoor is starring in the titular role.\nSridevi’s daughter Janhvi Kapoor had raised many eyebrows and has also kickstarted the nepotism debate yet again after it was announced that she is making her acting debut in a Karan Johar film titled Dhadak.\nWhile she is also doing another film with Karan Johar, which is a multi-starrer historical drama Takht, she has another one on cards with KJo – a biopic on Indian Air Force Pilots Gunjan Saxena. Here’s the first look!\nWhile earlier rumours were rife that Dulquer Salman will play Janhvi Kapoor’s love interest in the movie, now the grapevine suggests that Angad Bedi has been approached for the role.", "title": "Janhvi Kapoor To Play Gunjan Saxena, India’s First Woman Pilot Of Kargil & Here’s The 1st Look", "date_publish": "26/12/2018, 15:03:20", "description": "Flight lieutenant Gunjan Saxena is one of the unsung heroes of Bollywood. Did you know she is India’s first female IAF pilot who helped evacuating soldiers during the Kargil War in 1999? The braveheart, along with her fellow lieutenant Srividya Rajan faced a lot of heart, but she emerged a warrior and a fighter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/janhvi-kapoor-to-play-gunjan-saxena-india-s-first-woman-pilot-of-kargil-here-s-the-1st-look-359306.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/janhvi_kapoor_as_gunjan_saxena_indias_1st_female_iaf_pilot_who_evacuated_soldiers_during_kargil_1545814718_800x420.png"}