{"text": "Janhvi Kapoor's Dating Situation At Her Home Will Make You Want To Say 'Same Here'!\nJanhvi Kapoor's Dating Situation At Her Home Will Make You Want To Say 'Same Here'!\nDo your parents know you have a boyfriend/girlfriend? We all have been hiding our relationships from our parents for the longest time. No matter how independent/old you get or how mature you think you are, sharing your dating life with your parents, especially in India, is not-so-easy, don’t you agree?\nTwitter\nYou’ll be glad to know that celebrities are no different. The star-kids that we talk a lot about these days also experience the same. No matter how open-minded your parents are, they deeply care for you and they will always be over-protective over the prized possessions that you are in their lives. And so, they will also be over-dramatic about your dating life too.\nPics Bucket\nJust like all of our parents, Sridevi and Boney Kapoor have never been comfortable about Janhvi Kapoor dating. Yeah, that’s right. And that’s what she revealed in a recent interview with Famously Filmfare.\npinimg.com\n“Dating has always been a situation at home. I don’t know why but it always has been. Mom and dad have always been very dramatic about it,” she said.\nbrecorder.com\nDon't Miss 106 SHARES 158 SHARES 246 SHARES\n“They would say ‘When you like a guy, come to us and we’ll get you married.’ And I’m like what!? You know we don’t have to get married to every guy we like. Like we can be chill also. They don’t understand the concept of chill.”\nPinterest\nJanhvi clarified that she isn’t dating anyone as of now, and added that because of the gossip mongers, her BFF is afraid to even hangout with her.\n“The rumour mongers have said many things. They have also said that I am dating my childhood best friend Akshat, who is now shit scared to hang out with me because he is too scared we’d be papped (photographed) together,” she said.\nInstagram\n“So that day he came home for dad’s birthday and there were paps (paparazzi) downstairs at Arjun Bhaiya’s (Arjun Kapoor) house. He had hidden like a khopcha and put on his hoodie and left,” she added.\nBut isn’t that every parent ever!\nOn the work front, Janhvi Kapoor will next be seen in Karan Johar’s Takht.", "title": "Janhvi Kapoor's Dating Situation At Her Home Will Make You Want To Say 'Same Here'!", "date_publish": "05/01/2019, 16:11:30", "description": "Just like all of our parents, Sridevi and Boney Kapoor have never been comfortable about Janhvi Kapoor dating. Yeah, that’s right. And that’s what she revealed in a recent interview with Famously Filmfare. “Dating has always been a situation at home. I don’t know why but it always has been. Mom and dad have always been very dramatic about it,” she said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/janhvi-kapoor-s-dating-situation-at-her-home-will-make-you-want-to-say-same-here-359904.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/janhvi_kapoor_says_her_mom__dad_have_been_dramatic_about_her_dating_life__thats_every_parent_ever_1546683187_800x420.jpg"}