{"text": "Janhvi Kapoor’s debut film Dhadak was released last year, but the debate on nepotism is still on. Hailed as the product of nepotism, Janhvi Kapoor found herself under the scanner yet again after she bagged her second film, titled Takht, with Karan Johar, who was called “flag-bearer of nepotism” by Kangana Ranaut.\nstackpathdns.com\nHowever, her next will be a Dinesh Vijan’s horror comedy movie titled Rooh-Afza. After Stree, the filmmaker is yet again collaborating with Rajkummar Rao in this film. In the movie which will also star Fukrey fame Varun Sharma, Janhvi Kapoor will play a double-role.\nmagzter.com\n“For the female lead, we needed someone who could portray two contrasting personalities with ease and Janhvi stood out, she really connected with the script. Her talent is still raw, but she is excited about being moulded. The script is young, refreshing and totally crazy, and she is exactly that,” producer Dinesh Vijan said in a statement as quoted by PTI.\nInstagram\nThe story of the movie revolves around a singing ghost who puts grooms to sleep so it can possess their brides. Every time there is a wedding in town, local women come together to keep the groom awake through the first night in a bid to avoid the wrath of the ghost.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nJanhvi will be seen playing the two poles-apart characters of Roohi and Afsana. Co-producer Mrighdeep Singh Lamba says Janhvi is perfect for the role. “She needed to oscillate between two characters which are poles apart. You will fall in love with her in one scene and won't believe she is the same girl in the next one. It's not an easy switch for an actor. It's the perfect casting,” he said.\nThe film will be shot in Uttar Pradesh and will be released on March 20, 2020.\nWith inputs from PTI", "title": "Janhvi Kapoor Bags Her Next Film Opposite Rajkummar Rao, To Play Double Role In A Horror-Comedy", "date_publish": "29/03/2019, 12:33:17", "description": "Janhvi Kapoor's next will be a Dinesh Vijan’s horror comedy movie titled Rooh-Afza. After Stree, the filmmaker is yet again collaborating with Rajkummar Rao in this film. In the movie, which will also star Fukrey fame Varun Sharma, Janhvi Kapoor will play double roles.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/janhvi-kapoor-bags-her-next-film-opposite-rajkummar-rao-to-play-double-role-in-a-horror-comedy-364530.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/janhvi_kapoor_will_play_double_role_in_rajkummar_rao_starrer_roohafza_1553841890_800x420.png"}