{"text": "Janhvi Kapoor Admits She Has To Work Doubly Hard Than Others To Prove She's Worthy Of Her Privilege\nJanhvi Kapoor Admits She Has To Work Doubly Hard Than Others To Prove She's Worthy Of Her Privilege\nEven before entering the world of films, Janhvi Kapoor was a popular face. More so because her mother Sridevi was an iconic actor. Janhvi made her debut with Dhadak in 2018 opposite Ishaan Khatter and the film was a sleeper hit.\nThe road towards stardom is a rocky one for Janhvi because she has often found herself bearing the brunt of being the 'privileged' one. The endless debate around nepotism landed Janhvi in harsh scrutiny and many trolled her for being the lucky one.\nFacebook\nWhat does Janhvi feel about all this?\nGrazia India\nIn an interview with Cosmopolitan India, Janhvi gave her piece of mind on the whole nepotism debate. She said,\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“The whole nepotism debate (when I was making my debut in Dhadak) did make me question if I deserved to be in this position and I realized that the right answer to it is that I’m not. I do come from a place of privilege. But I have it, so what am I supposed to do now? I’d be the dumbest person on the planet if I didn’t do anything about it. So I need to ensure that I make the best of it and push myself to work as hard as I can...only then can I justify that I’m worthy.\"\nWhile the airport and gym look of celebrities trend on the internet all the time, it's not a very delightful experience for the stars. Janhvi added,\nTwitter\n\"It's a price that all of us have to pay. I think it's so flattering that people would even give me enough attention to know about my private life. I can't crib about it, I am not in that position. Plus, people wanting to know about you also comes from a place of love. So you just have to balance it; it's your responsibility. And honestly, I want this too much to complain about anything.\"\nOn the work front, Janhvi has reportedly signed a biopic of Gunjan Saxena, who is one of India’s first women combat aviators.", "title": "Janhvi Kapoor Admits She Has To Work Doubly Hard Than Others To Prove She's Worthy Of Her Privilege", "date_publish": "08/01/2019, 11:28:44", "description": "Janhvi made her debut with Dhadak in 2018 opposite Ishaan Khatter and the film was a sleeper hit. The road towards stardom is a rocky one for Janhvi because she has often found herself bearing the brunt of being the 'privileged' one. The endless debate around nepotism landed Janhvi in harsh scrutiny and many trolled her for being the lucky one.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/janhvi-kapoor-admits-she-has-to-work-doubly-hard-than-others-to-prove-she-s-worthy-of-her-privilege-360019.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/janhvi_kapoor_1546928945_800x420.jpg"}