{"text": "Losing a parent is like losing a piece of your childhood. You lose n important fragment of your life that is irreplaceable. For Janhvi Kapoor, losing mother Sridevi was one such jolt in life. In just one day, her whole world toppled upside down.\nWhile she was all excited to enter the world of films with her mother and father by her side, just a few weeks before the release of her debut film, she lost her mother.\nInstagram\nIt was a big shock for the entire film industry but it was a bigger shock for her immediate family who couldn't see this coming.\nFor Janhvi Kapoor, it was a testing time but she took no time in returning back to the shoot of her debut film, Dhadak.\nPinterest\nIn less than two weeks, she resumed shooting for Dhadak in Kolkatta. She was praised a lot for maintaining professional ethics but she never spoke about the patch of time. In a recent interview with Filmfare, she bared her heart about those months of losing her mother and how Arjun Kapoor and Anshula Kapoor became her biggest strength.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nShe was quoted as saying,\nInstagram\n“I think, I was still in that state of shock, to be very honest. I think I am still in shock. None of it has been processed. Like, I have no memory of three or four months. You know at the end of the day, we have the same blood in us. I don't remember anything of those four months but I do remember that one day when we were sitting in Harsh (Anil Kapoor's son) Bhaiya's room and Arjun Bhaiya and Anshula (Arjun Kapoor's sister) Didi came in -- I think that was the one day when I felt like, 'Ok maybe we might be okay.\"\nJanhvi has received a lot of support from her extended family and this includes Arjun Kapoor and Anshula, with whom she used to share a strained relationship. Maybe this was the light at the end of the tunnel she needed.", "title": "Janhvi Kapoor Revisits The Time When Lost Her Mother And How Arjun Kapoor Helped Her Cope Up", "date_publish": "02/01/2019, 17:24:43", "description": "Losing a parent is like losing a piece of your childhood. You lose n important fragment of your life that is irreplaceable. For Janhvi Kapoor, losing mother Sridevi was one such jolt in life. In just one day, her whole world toppled upside down. While she was all excited to enter the world of films with her mother and father by her side, just a few weeks before the release of her debut film, she", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/janhvi-kapoor-revisits-the-time-when-lost-her-mother-and-how-arjun-kapoor-helped-her-cope-up-359720.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/janhvi_kapoor_1546431244_800x420.jpg"}