{"text": "This year has been a mixed back for Boney Kapoor and Late Sridevi's daughter Janhvi Kapoor. At an event in Goa, she revealed how the year brought out “worst and best experience” of her life in the same breath.\nThe young actor’s mother, Sridevi, passed away earlier this year, while she was still filming her debut, Dhadak.\nInstagram\nJahnvi said her personal growth has been tremendous and she has emerged stronger in the trying times.\n“It’s harder to say anything… When I say growth’, I mean personal growth, I don’t know about artistic. This year brought me both the worst and the best experience of my life. It’s a little strange… Our family is now united, so that is very big thing for me. But whatever happened that too was very heavy (tragedy). We are still in shock, so we haven’t been able to process it properly. I’m really thankful for all the love that we have received and I got a chance to work, which is a big thing for me. I got a chance to make my parents proud, which is most important for me,” she said during a session at the ongoing International Film Festival of India (IFFI).\nap\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nShe was in conversation with Rumi Jaffery and her father, producer Boney Kapoor.\nInputs From PTI", "title": "Janhvi Kapoor Gets Emotional Talking About 2018, Which Was Both Good And Bad For Her!", "date_publish": "24/11/2018, 11:11:39", "description": "Janhvi Kapoor Wednesday said the year 2018 was a mixed bag for her as she had both the “worst and best experience” of her life in the same breath. The young actor’s mother, Sridevi, passed away earlier this year, while she was still filming her debut, Dhadak. Jahnvi said her personal growth has been tremendous and she has emerged stronger in the trying times. “It’s harder to say anything… When I s", "authors": [], "url": "https://www.indiatimes.com/entertainment/janhvi-kapoor-gets-emotional-talking-about-2018-which-was-both-good-and-bad-for-her-357283.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/janhvi_kapoor_1543038320_800x420.jpg"}