{"text": "On the day Bigg Boss 12 premiered, it made a buzz across the nation. 65-year-old Bhajan singer Anup Jalota participated in the controversial show with his girlfriend, Jasleen Matahru, who is just 28-years-old. It raised a lot of eyebrows and had set numerous tongues wagging. People kept wondering if they were seriously in a relationship or was it all a publicity stunt for the longest time until Anup Jalota was evicted from the house.\nTwitter\nEarlier having hinted that he was indeed in a romantic relationship with Jasleen Matharu, Anup Jalota took a U-turn after he was evicted from the house. Hours after his elimination, he said that he was never dating Jasleen and that they only shared a “musical relationship” of a Guru and Shishya, disciple if you may. He said that he was shocked when Jasleen called him her boyfriend but later chose to play the game according to her plan.\nTwitter\nNow, that Anup Jalota has been evicted and Jasleen Matharu is still inside the house, Hina Khan who visited Bigg Boss house yesterday asked her about the ongoing controversy. Accepting that they are a couple, here’s what she said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nVoot\n“We went on a date...I kissed him...What kind of a guru-shishya (teacher-student) relationship is this?\"\nWho do you think is saying the truth and who do you think is lying, tell us in the comments section below.", "title": "Jasleen Matharu Denies Faking Relationship With Anup Jalota, Says She Kissed Him On A Date", "date_publish": "04/11/2018, 12:22:12", "description": "Now, that Anup Jalota has been evicted and Jasleen Matharu is still inside the house, Hina Khan who visited Bigg Boss house yesterday asked her about the ongoing controversy. Accepting that they are a couple, here’s what she said. “We went on a date...I kissed him...What kind of a guru-shishya (teacher-student) relationship is this?\"", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/jasleen-matharu-denies-faking-relationship-with-anup-jalota-says-she-kissed-him-on-a-date-356012.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/jasleen_matharu_denies_faking_relationship_with_anup_jalota_says_she_kissed_him_on_a_date_1541314706_800x420.jpg"}