{"text": "Javed Akhtar Reacts On Rising Indo-Pak Tensions, Says It’s Not Our Choice, It’s Forced Upon Us\nJaved Akhtar Reacts On Rising Indo-Pak Tensions, Says It’s Not Our Choice, It’s Forced Upon Us\nThe confrontation between Indian and Pakistani fighter jets have escalated the tensions between the two countries. In the wake of the current situation, Javed Akhtar says the situation is forced upon us and it’s not a choice. He added that he doesn’t understand the Pakistan’s agenda to sponsor terrorist orgnisations.\nTwitter\n“I don't understand what is their (Pakistan) agenda and what will they get out of it by constantly sponsoring terrorism. It's an open truth that they support terrorist organisations but they are constantly denying it,” he was quoted as saying by IANS.\n“Masood Azhar (the founder and leader of the militant group Jaish-e-Mohammed) was released from Indian prison when they (Jaish-e-Mohammed) hijacked an Indian aircraft and then, how he reached Pakistan from Kandahar (Afghanistan)... And why is Pakistan not arresting him if they have an honest establishment over there,” he questioned.\nHe says the situation is being forced upon India and questioned as to how many times we shall remain silent.\nDon't Miss 837 SHARES 3.5 K SHARES 189 SHARES\n“I feel this situation is actually being forced upon us (India). It was not our choice but if things go beyond your control, then till when and how many times should we be quiet about this? So, we have to react to it some day or the other.\n“I think repercussions of the current developments are really dangerous and banning Pakistani actors and artistes are minor things but whatever is happening on our borders should be stopped. We should ban terrorism. It's an unfortunate thing.”\nAfter the Pulwama attack which killed 40 Indian Jawans in Kashmir, Javed Akhtar and wife Shabana Azmi had decided to not attend an event scheduled in Karachi Pakistan.\nRead More: Javed Akhtar And Shabana Azmi Cancel Karachi Arts Council Event After Pulwama Terror Attack", "title": "Javed Akhtar Reacts On Rising Indo-Pak Tensions, Says It’s Not Our Choice, It’s Forced Upon Us", "date_publish": "28/02/2019, 16:15:14", "description": "The confrontation between Indian and Pakistani fighter jets have escalated the tensions between the two country. In the wake of the current situation, Javed Akhtar says the situation is forced upon us and it’s not a choice. He added that he doesn’t understand the Pakistan’s agenda to sponsor terrorist orgnisations.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/javed-akhtar-reacts-on-rising-indo-pak-tensions-says-it-s-not-our-choice-it-s-forced-upon-us-362939.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/javed_akhtar_reacts_on_rising_indopak_tensions_says_its_not_our_choice_its_forced_upon_us_1551351187_800x420.jpg"}