{"text": "Javed Akhtar Questions The Makers Of Modi Biopic After They Put His Name In The Movie Credits\nJaved Akhtar Questions The Makers Of Modi Biopic After They Put His Name In The Movie Credits\nJaved Akhtar was left fuming when he saw his name on the credit list of PM Modi's film poster. He expressed his anger after his name was mentioned in the credits without his knowledge.\nMovie producer Sandeep Ssingh clarified saying, “We have taken the songs Ishwar Allah from the film 1947: Earth and the song Suno Gaur Se Duniya Walon from the film Dus in our film, thus we have given the due credits to respective lyricists Javed Sahab and Sameer Ji. @TSeries is our Music partner”.\nTwitter\nHowever, this clarification didn’t go down well with Javed. He lashed out at the producer and made some valid points.\nTwitter\nDon't Miss 1.1 K SHARES 1.2 K SHARES 9.8 K SHARES 12.5 K SHARES 5.5 K SHARES\nIn conversation with Mirror, Javed said, “Firstly I don’t know who Sandip Ssingh is. Secondly, when you take an old song in your film you don’t give credit to the original person on your promotional material because I have not written anything for the film PM Narendra Modi. You can’t behave like I’m a part of your unit, as your songwriter”.\nTwitter\nHe later questioned their intention saying,\n“Such an incident has never taken place in Indian film history. Nowadays every second film has a recreated song but never has the original lyricist been mentioned on posters of the film.”\nTwitter\nNot only Javed, even his wife and veteran actress Shabana Azmi blasted at the PM Modi producer. She tweeted, “Its quite clear this was done with deliberate intentions to mislead public into believing that @Javedakhtarjadu has written the songs for Mr PM Narendra Modi when the song Ishwar Allah Tere JahaN meiN is from @IamDeepaMehta film 1947Earth.”\nTwitter\nWell, the film surely has gained a lot of publicity with this latest controversy, only time will tell if this publicity will favour the film or not.", "title": "Javed Akhtar Questions The Makers Of Modi Biopic After They Put His Name In The Movie Credits", "date_publish": "25/03/2019, 17:13:28", "description": "Javed Akhtar was left fuming when he saw his name on the credit list of PM Modi film poster. Soon Javed expressed his anger on mentioning his name in the credits without his knowledge, producer Sandeep Ssingh clarified it saying, “We have taken the songs Ishwar Allah from the film 1947:Earth and the song Suno Gaur Se Duniya Walon from the film Du s in our film, thus we have given the due credits t", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/javed-akhtar-questions-the-makers-of-modi-biopic-after-they-put-his-name-in-the-movie-credits-364278.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/pm_narendra_modi_1553517770_800x420.jpg"}