{"text": "When the country was celebrating International Labour Day, Maharashtra witnessed a brutal (improvised explosive device) IED blast carried out by Maoists targeting a police vehicle in the Naxalite-infested Gadchiroli district on Wednesday. At least 15 Jawans and a civilian were killed in the blast.\nBCCL\nNCP chief Sharad Pawar Wednesday demanded Maharashtra Chief Minister Devendra Fadnavis' resignation following the incident. \"He should step down immediately\", Pawar tweeted adding \"Those who feel shame of conscience if not shame of public opinion would have resigned. But the people who are in power today are not going to do so.\"\nBCCL\nEveryone including Prime Minister Narendra Modi and Bollywood stars including Javed Akhtar and Swara Bhasker has condemned the attack.\nWhat has happened in Gadchiroli is senseless and barbaric . This is nothing but terrorism that shouldn’t be tolerated . — Javed Akhtar (@Javedakhtarjadu) May 1, 2019\nDon't Miss 4.3 K SHARES 764 SHARES 2.1 K SHARES 174 SHARES\nI totally condemn Naxal attack in Gadchiroli, killing 16. Dastardly, inhuman & reflects the utterly degenerate mindset of the so-called ‘revolutionaries’. Ultra left & anarchist violence weakens democracy, hurts the poor. The state must crack down on perpetrators & ensure justice — Swara Bhasker (@ReallySwara) May 1, 2019\nMy tributes to the martyrs & jawans who lost their lives in terrible #NaxalAttack on our security personnel in #Gadchiroli, #Maharashtra. I pray for the families of jawans and wish the injured a speedy recovery — Sunny Deol (@iamsunnydeol) May 1, 2019\nTerrible news coming in from Maharashtra. This HAS to stop! In solidarity with the families of those that lost their loved ones. Prayers, love, strength. These words have started to seem hollow for they are said too often. Salute to our commandoes. #Gadchiroli — Mithali Raj (@M_Raj03) May 1, 2019\nStrongly condemn the despicable attack on our security personnel in Gadchiroli, Maharashtra. I salute all the brave personnel. Their sacrifices will never be forgotten. My thoughts & solidarity are with the bereaved families. The perpetrators of such violence will not be spared. — Chowkidar Narendra Modi (@narendramodi) May 1, 2019\nThis is a ghastly attack - burning a dozen vehicles to create the diversion to boobytrap security forces. Such terror tactics must be condemned by every Indian.\nTerrorism has no ideology or flag - red, green, saffron or black. Nothing justifies any kind of terrorism!#IndiaFirst https://t.co/OZUpcJHGXe — Rakesh Sharma (@rakeshfilm) May 1, 2019\nThe dastardly attack on our security personnel in Gadchiroli, Maharashtra is shameful & sad. I hope the urban naxals, Congress, tukde tukde gang , Lutyens media will not ask for proofs of this massacre of our soldiers. Heartfelt Condolences to the bereaved families. ओम् शांति ! — Ashoke Pandit (@ashokepandit) May 1, 2019\nOMG. This is terrible. This was coming. I have been saying it for long. Since the new government in Chhattisgarh Naxal movement has rejuvinated. The entire #UrbanNaxals ecosystem has been working to create unrest and chaos.\nMy prayers with the victims families. https://t.co/QcO5zFUf9B — Vivek Ranjan Agnihotri (@vivekagnihotri) May 1, 2019\nBefore the blast, Naxals had torched 25 vehicles belonging to a road construction contractor.", "title": "Javed Akhtar To Swara Bhasker, Celebs Condemn Gadchiroli Naxal Attack That Killed At Least 15", "date_publish": "01/05/2019, 18:09:29", "description": "When the country was celebrating International Labour Day, Maharashtra, on Maharashtra Day, witnessed a brutal (improvised explosive device) IED blast carried out by Maoists targeting a police vehicle in the Naxalite-infested Gadchiroli district on Wednesday. At least 15 Jawans and a civilian were killed in the blast.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/javed-akhtar-to-swara-bhasker-celebs-condemn-gadchiroli-naxal-attack-that-killed-at-least-15_-366430.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/javed_akhtar_condemn_naxal_attack_in_gadchiroli_that_killed_at_least_15_1556711712_800x420.png"}