{"text": "Jim Carrey isn’t quite fond of Facebook CEO Mark Zuckerberg. He has slammed him many times in the past.\nThe comedian turned artist/political critic, in February, had tweeted a portrait of Zuckerberg with an announcement that he was dumping his Facebook stock and deleting his Facebook account because the social networking platform “profited” from the alleged Russian interference in the US elections.\nI’m dumping my @facebook stock and deleting my page because @facebook profited from Russian interference in our elections and they’re still not doing enough to stop it. I encourage all other investors who care about our future to do the same. #unfriendfacebook pic.twitter.com/KHWgZzhhmp — Jim Carrey (@JimCarrey) February 6, 2018\n\"For a long time America enjoyed a geographical advantage in the world with oceans on both sides to protect it. Now, social media has created cyber-bridges over which those who do not have our best interest in mind can cross and we are allowing it. No wall is going to protect us from that. We must encourage more oversight by the owners of these social media platforms. This easy access has to be more responsibly handled. What we need now are activist investors to send a message that responsible oversight is needed. What the world needs now is capitalism with a conscience,\" he had told Business Insider then.\nDon't Miss 1 K SHARES 117 SHARES\nA month later, he had tweeted this.\nWho are you sharing your life with? #regulatefacebook pic.twitter.com/r7B7Ajkt0V — Jim Carrey (@JimCarrey) March 20, 2018\nReferring to congressional hearings, in April, Jim Carrey once again took a dig at Mark Zuckerberg.\nCongress gets a visit from planet Zuckerberg. “I shall prevent any further election meddling by destroying the Earth with my Illudium Q-36 Explosive Space Modulator App! The sudden drop in Facebook’s stock has made me angry! VERY ANGRY INDEED!!!” pic.twitter.com/qwCpJoUqnS — Jim Carrey (@JimCarrey) April 11, 2018\nAnd recently, yet again, he blasted the Facebook CEO by writing “Fuck You” to him in binary code.\nHey #Zuckerborg. We know who you are. And we saw what you did: https://t.co/44UvMceSLm\nHere’s a little message from me in your native language: 01000110 01110101 01100011 01101011 00100000 01111001 01101111 01110101 00101110 00100000 00001101 00001010 pic.twitter.com/EEc6ocdvBM — Jim Carrey (@JimCarrey) November 15, 2018\nThis came after The New York Times report accused Facebook of running a lobbying campaign to promote negative stories against its rivals Apple and Google.", "title": "Jim Carrey Blasts Facebook CEO Mark Zuckerberg Again, Tweets ‘F**k You’ To Him In Binary Code", "date_publish": "18/11/2018, 13:04:58", "description": "Jim Carrey isn’t quite fond of Facebook CEO Mark Zuckerberg. He has slammed him many times in the past. The comedian turned artist/political critic, in February, had tweeted a portrait of Zuckerberg with an announcement that he was dumping his Facebook stock and deleting his Facebook account because, he said, that the social networking platform “profited” from the alleged Russian interference in", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/jim-carrey-blasts-facebook-ceo-mark-zuckerberg-again-tweets-f-k-you-to-him-in-binary-code-356881.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/jim_carrey_writes_fuck_you_to_facebook_ceo_mark_zuckerberg_in_binary_code_1542525045_800x420.png"}