{"text": "In last two years, Jim Sarbh has been one of the biggest revelations as an actor. His critically-acclaimed performances in films such as Neerja and Padmaavat caught everyone's attention. This year, he was seen in Zoya Akhtar's Made In Heaven, that went on to become one of the most discussed web shows.\nHowever, as an actor, he admitted that he is disappointed. He admitted that he feels underwhelmed with the kind of scripts coming his way. The actor caught the audience's attention as the antagonist in his 2016 debut, Neerja. He has also starred in Sanjay Dutt-starrer Sanju.\nTwitter\n\"Films have always been my first love but because I kept getting cast in plays or because the school I went to didn't have film acting course. It just had theatre studies -- I came from a theatrical tradition,'' Jim told PTI.\nAs a performer, Jim added that he is spoilt. He added,\nTwitter\n\"I have spent the better part of my life reading some of the best plays in the world. I am spoilt. I imagine that each script I get should be as good as those plays and I am often sorely disappointed.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHaving played some of the most iconic parts on stage, the longing to do good work in films has only increased, Sarbh, 31, says.\nTwitter\n\"I have had the opportunity of playing, in my opinion, some of the best characters ever written in a play, Romeo in Romeo and Juliet, Jerry in Zoo Story and I can keep going. I have been lucky in theatre,'' the Neerja actor said to PTI.\n\"But how will I get those parts here? I am waiting for an opportunity to sink my teeth into roles that are complicated, interesting as any of these,'' Jim, who played bisexual in Sanjay Leela Bhansali's Padmaavat, added.\nJim, last appeared in Ritesh Batra's Photograph, that starred Nawazuddin Siddiqui and Sanya Malhotra.\n(With agency inputs)", "title": "Jim Sarbh Feels Disappointed As An Actor, Admits He Receives 'Mediocre' Scripts!", "date_publish": "12/04/2019, 12:41:15", "description": "Jim Sarbh, who has given critically-acclaimed performances in films such as Neerja and Padmaavat, says he feels underwhelmed with the kind of scripts coming his way. The actor caught the audience's attention as the antagonist in his 2016 debut, Neerja. He has also starred in Sanjay Dutt-starrer Sanju.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/jim-sarbh-feels-disappointed-as-an-actor-admits-he-receives-mediocre-scripts-365317.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/jim_sarbh_1555054222_800x420.jpg"}