{"text": "Jim Parsons Explains His Exit From Big Bang Theory, Felt The Team Had Chewed All The Meat Off This Bone\nJim Parsons Explains His Exit From Big Bang Theory, Felt The Team Had Chewed All The Meat Off This Bone\nWe finally have the answer to an important question.\nJim Parsons in a way set the ball in motion for the bowing out of The Big Bang Theory when he decided to leave the show but the actor has said there is “no negative reason” to hang his boots.\nThe 45-year-old actor, who plays the eccentric, almost always right theoretical physicist Sheldon Cooper in the hit CBS series, said he feels the team had “chewed all the meat off this bone”.\nThe 12th season finale of “TBBT” will mark the end of the longest-running multi-camera series in TV history.\nReuters\n“It’s both as complex and as simple as just feeling innately that it was time. It speaks to a lot of things, none of them bad. There is no negative reason to stop doing ‘Big Bang’. It felt like we have been able to do this for so many years now, it doesn’t feel like there is anything left on the table. Not that we couldn’t keep doing it…” Parsons told EW.\nDon't Miss 791 SHARES 6.4 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe actor said he does not know what lies ahead for him but said that bidding adieu would be an emotional moment.\nTwitter\n“I guess at a personal level, it feels like the right time in my life. It’s not like there is something specific I am aiming for. I’m firmly in my middle age now. I don’t know how much longer I can wear (the T-shirts) without looking really long in the tooth.\"\nHe added how it was really hard to bid goodbye to his team. He added,\nAFP\n“In a way, it’s exciting. What is this next chapter of life? What is this next chapter for all of us? It will be very, very sad when it does end, even knowing (I am) okay with it. People are okay when they graduate but there are frequently tears at graduation. It’s hard to say goodbye to people that you have worked with for so long.\"\nJohnny Galecki, Kaley Cuoco, Simon Helberg, Kunal Nayyar, Mayim Bialik and Melissa Rauch are also part of the show’s main cast.\n(With agency inputs)", "title": "Jim Parsons Explains His Exit From Big Bang Theory, Felt The Team Had Chewed All The Meat Off This Bone", "date_publish": "06/01/2019, 16:44:39", "description": "Jim Parsons in a way set the ball in motion for the bowing out of The Big Bang Theory when he decided to leave the show but the actor has said there is “no negative reason” to hang his boots. The 45-year-old actor, who plays the eccentric, almost always right theoretical physicist Sheldon Cooper in the hit CBS series, said he feels the team had “chewed all the meat off this bone”.", "authors": [], "url": "https://www.indiatimes.com/entertainment/jim-parsons-shares-why-he-chose-to-quit-big-bang-theory-says-there-is-no-negative-reason-359946.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/jim_parsons_1546773612_800x420.jpg"}