{"text": "Acid attack victims are undoubtedly brave and courageous. They don’t let those unfortunate scars come in their way of leading a happy life and finding their own happily ever afters. However, they do need some love and support to be constantly reminded of the fact that life, despite the circumstances, is beautiful.\nIn Lucknow yesterday, during an event near Gomti Nagar, the acid attack survivors were told that a special dish is waiting for them and to be given that as a surprise, they were blindfolded. Little did they know that as they would open their eyes, a bigger surprise would be waiting for them – JOHN ABRAHAM!\nTwitter\nTaking time out from his shooting schedule in Lucknow, John Abraham met and spent some time with acid attack survivors yesterday. He was greeted with garlands and big smiles.\n“I am really happy to shoot in Lucknow for my next film. This city is so beautiful but I think I am one of those unlucky souls who still has not got a chance to explore this city much. I really want to roam around but my shooting schedule is very hectic,” he said.\nDon't Miss 1.3 K SHARES 2.2 K SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nJohn Abraham told the acid attack victims who work at a local café that he would visit them again. “Since I am staying at a hotel nearby, I would love to come to this place any time and have a cup of coffee here. Moreover, my team members have promised me that they will make black tea for me here today. So I won’t spare them and have that for sure.”\nTwitter\nJohn Abraham is shooting for Nikhil Advani’s Batla House currently. The story of the movie revolves around Sanjeev Kumar Yadav who spearheaded the Batla House encounter. It will tell the story of the encounter that took place in Delhi between terrorist group Indian Mujahideen and police. The movie is slated to release on Aug 15, 2019.", "title": "John Abraham Takes Time Out From His Busy Schedule To Meet Acid Attack Victims In Lucknow", "date_publish": "02/12/2018, 13:22:21", "description": "Taking time out from his shooting schedule in Lucknow, John Abraham met and spent some time with acid attack survivors yesterday. He was greeted with garlands and big smiles. In Lucknow yesterday during an event near Gomti Nagar, the acid attack survivors were told that a special dish is waiting for them and to be given that as a surprise, they were blindfolded. Little did they know that as they w", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/john-abraham-takes-time-out-from-his-busy-schedule-to-meet-acid-attack-victims-in-lucknow-357769.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/john_abraham_takes_time_out_from_his_busy_shoot_schedule_to_meet_acid_attack_victims_in_lucknow_1543734748_800x420.png"}