{"text": "John Abraham Teams Up With Nikkhil Advani To Tell The Historic Story Of ‘1911’ Football Match\nJohn Abraham Teams Up With Nikkhil Advani To Tell The Historic Story Of ‘1911’ Football Match\nAfter winning applauses with films including Parmanu: The Story of Pokhran and Satyameva Jayate, John Abraham is working on Batla House in which he plays the role of a DCP. And his next project is apparently one of his dream projects. To be directed by Nikkhil Advani, John Abraham’s next is based on historic 1911 football match.\nTwitter\nFilmmaker Nikkhil Advani says he is honoured that actor-producer John Abraham chose him to helm \"1911\", which will tell the story of an iconic event in India's sports history.\n\"Totally honoured that John Abraham entrusted me to tell the story of 1911'. Truly an inspiring story of an iconic event in our country's history. Wait for it,\" Advani tweeted on Monday.\nJohn has joined hands with Advani's Emmay Entertainment and Bhushan Kumar's T-Series for the project.\nIn response to Advani, John wrote: \"The honour is all mine.\"\nBCCL\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n1911 has been a dream project of sorts for John, who is a football fanatic himself. The movie, John had earlier told IANS, is a story of late Indian footballer Sibdas Bhaduri, who captained Mohun Bagan in the historic 1911 IFA Shield final when they defeated the East Yorkshire Regiment to become the maiden Asian team to emerge victorious in the competition.\nBCCL\nJohn, a co-owner of Indian Super League (ISL) Guwahati franchise North East United FC, in a 2014 interview to IANS, had not ruled out roping in some real football players for the project.\nWith inputs from IANS", "title": "John Abraham Teams Up With Nikkhil Advani To Tell The Historic Story Of ‘1911’ Football Match", "date_publish": "26/11/2018, 18:07:31", "description": "Filmmaker Nikkhil Advani says he is honoured that actor-producer John Abraham chose him to helm \"1911\", which will tell the story of an iconic event in India's sports history. \"Totally honoured that John Abraham entrusted me to tell the story of 1911'. Truly an inspiring story of an iconic event in our country's history. Wait for it,\" Advani tweeted on Monday.", "authors": [], "url": "https://www.indiatimes.com/entertainment/john-abraham-teams-up-with-nikkhil-advani-to-tell-the-historic-story-of-1911-football-match-357422.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nikkhil_advani_and_john_abraham_1543234692_800x420.jpg"}