{"text": "From becoming a criminal mastermind, goofy prankster and then returning to its darker roots, Joker might have had no superpowers over the years but his sadistic sense of humour always manages to shake you up. One of the most iconic characters in popular culture, the Joker has been listed among the greatest comic book villains and fictional characters ever created.\nAnd now the wait for Joker is finally over. The movie which was in the news for over 2 years finally released a trailer and it will spook you for more reasons than one. The trailer is powerful, dark and strangely you don't miss Heath Ledger in this one. Don't believe us. Take a look.\nScreengrab\nThe upcoming American psychological thriller film is a stand alone film based only on the DC Comics character Joker. From comics, TV series to movies, this character has remained with us for so many years. So here's taking a look at the evolution of 'Joker' over the years. Choose your pick.\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 151 SHARES\n1. Batman - 1966\nThe 60's Batman TV series is still a favourite of many especially the Alfred Vs Joker episode. The best part about the show was Caeser Romero's peculiar laugh. Romero was best known as the white-faced, green-haired, cackling villain 'The Joker' of the campy series and we can't help but agree. Take a look at this spectacular showdown.\n2. Batman - 1989\nIf you have seen this, you know, Nicholson was called the best Joker in the history of Jokers. In fact, Jack's version always felt a little scarier. Ledger's Joker is a traditional psychopath taken to extreme scary and understandable but Jack's role in this one was completely unbalanced and very unpredictable.﻿ And that's what makes Batman from 1989 so watchable.\n3. Birds Of Prey - 2002\nThe series takes place in a Gotham City abandoned by Batman. Batman and Joker seem to have a long rivalry, but as always Joker never managed to defeat him. The Joker was portrayed by Roger Stoneburner in the TV series - Birds of Prey and his role left an impression on us. Although the show started off on a great note, it soon was cancelled after ratings fell sharply in subsequent weeks.\n4. The Dark Knight - 2008\nHeath Ledger's performance as Joker in The Dark Knight is a masterpiece from all points of view. His performance as the Joker has been hailed as one of the greatest performances in cinema history. The movie came out in 2008, the same year when Ledger passed away.\nLedger died on 22 January 2008 due to accidental intoxication from prescription drugs. A few months before his death, Ledger had finished filming his performance as the Joker in The Dark Knight. And what a performance. Ledger received numerous posthumous accolades for his critically acclaimed performance in The Dark Knight, including the Academy Award for Best Supporting Actor\n5. Under the Red Hood - 2010\nThe Joker has had many iterations in animated movies and series, but none as impactful as his appearance in 2010's Under the Red Hood. It follows an older story, of how the Joker brutally murders the second Robin, Jason Todd. After being resurrected through an occult ritual, the now Red Hood comes back to Gotham to capture the Joker, kill criminals, and confront Batman about why his murderer is still alive.\nThe climactic ending makes for a powerful dialogue sequence, but what really stands out is John DiMaggio's Joker. Not only is he gleefully celebrating the torment and pain being caused by Jason and Bruce's clash, he's also willing to sacrifice his own life in order to see everyone kill each other. This Joker is not so much a sociopath here as he is an unhinged thrill-seeker.\n6. Gotham - 2015\nHe was not the Joker but Joker like in the TV show. Speaking earlier in an interview, the actor described, “This is a character that is involved in the Joker mythos. He might be the Joker, he might not. We know what we’re doing but we’re not going to be able to tell you.” I said, “Okay, well, I’m going to study the Joker a lot and just do with that what I can.” So I did and one could see shades of Jack Nicholson's 1989 Joker in him. Needless to say, he was phenomenal.\n7. Suicide Squad - 2018\nA bunch of homicidal maniacs having a good. Suicide Squad is an irregular popcorn movie and Jared Leto was invited to play the joker. Jared admitted he had a blast playing the part and the character was special to him, as well as offering a great opportunity.\nA lot of people thought that Jared Leto’s portrayal of Joker didn't really strike as a crazy, funny, sociopathic, or at least intimidating which are the defining traits of the character in the comics. And some thought he didn't have sufficient scenes in the film.\n8. Joker - 2019\nAnd now we have a standalone movie on Joker and might we add, Joaquin Phoenix has impressed us already in the teaser. Leonardo DiCaprio was considered to play the Joker before Joaquin Phoenix became attached to the project in February 2018. Joker is scheduled to be released on October 4, 2019.\nWhile we know he can't replace Heath Ledger but it won't be wrong to say that another legend is on its way. Kudos, Joaquin Phoenix, we're eagerly waiting for the film.", "title": "Joker Trailer Released! Here's A Look At The Evolution Of DC's Iconic Villain Over The Years", "date_publish": "04/04/2019, 11:22:10", "description": "From becoming a criminal mastermind, goofy prankster and then returning to its darker roots, Joker might have no superpowers over the years but his sadistic sense of humour always manages to shake you up. From becoming a criminal mastermind, goofy prankster and then returning to its darker roots, Joker might have no superpowers over the years but his sadistic sense of humour", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/joker-trailer-released-here-s-a-look-at-the-evolution-of-dc-s-iconic-villain-over-the-years-364831.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/joker_1554357341_800x420.jpg"}