{"text": "Josh Brolin AKA Thanos Wants To Snap Up Avengers:Endgame Box Office Collection, Says He Should Get Half Of It!\nJosh Brolin AKA Thanos Wants To Snap Up Avengers:Endgame Box Office Collection, Says He Should Get Half Of It!\nJosh Brolin, who played Thanos, one of the evilest villains in the world of cinema, recently appeared on Jimmy Kimmel Live, and while addressing Avengers: Endgame’s record breaking success at the box office, he said that he should get half of it.\nAlso Read: What’s Next After Avengers: Endgame? Here Are 7 Upcoming Marvel Movies To Watch Out For\n“How much of that $1.2 billion do you get?,” asked Jimmy Kimmel, adding that “there are a lot of superheroes but there’s only one super villain.”\nTwitter\nTo this, the man quipped, “There’s a whole 50 percent thing too, so the Avengers get 50 percent and I get the other 50 percent.”\nFor the unversed, Avengers: Endgame has grossed $1.2 billion worldwide in its opening weekend, breaking all records.\nOf course, he was kidding. Next, when he was asked about his signature move -- Thanos’ span – and compared it to a West Side Story-esque musical. Answering this, Josh Brolin proved his sense of humour is actually incredible.\nTwitter\nDon't Miss 1.2 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“It was a whole musical before but they cut most of it… I actually go into this whole song and dance thing. It was brilliant, it was brilliant.”\nTwitter\nAnd after that, Brolin also showed off his diaper-changing prowess. “I'm very good,” he said as he used Guillermo as his test subject. “Hey, the fastest in the world seems stupid, but yes. I'm the fastest in the world,” he added. Take a look!", "title": "Josh Brolin AKA Thanos Wants To Snap Up Avengers:Endgame Box Office Collection, Says He Should Get Half Of It!", "date_publish": "01/05/2019, 13:33:16", "description": "Josh Brolin, who played Thanos, one of the evilest villains in the world of cinema, recently appeared on Jimmy Kimmel Live, and while addressing Avengers: Endgame’s record breaking success at the box office, he said that he should get half of it. Of course, he is kidding.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/josh-brolin-aka-thanos-wants-to-snap-up-avengers-endgame-box-office-collection-says-he-should-get-half-of-it-366401.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/josh_brolin_aka_thanos_jokes_he_wants_half_of_avengers_endgame_box_office_collection_1556697931_800x420.png"}