{"text": "New orders from the judge is that Actor Kevin Spacey will have to attend his arraignment on sexual assault charges in Nantucket, Massachusetts.\nThis decision was made on Monday. According to People magazine, in papers filed with the court last week, attorneys for Spacey had asked a Massachusetts judge to waive the Oscar winner’s mandatory appearance at the January 7, 2019 proceeding.\n“Presence will amplify the negative publicity already generated in connection with this case,” an affidavit from Spacey noted.\nReuters\nThe actor indicated his lawyers would enter not guilty pleas on his behalf at the arraignment.\nIn the supporting documents his attorneys claimed that if Spacey attended the hearing, it would “only serve to heighten prejudicial media interest in the case and will increase the risk of contamination of the pool of jurors available for the trial.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nCape and Islands Assistant District Attorney Michael Giardino had opposed Spacey’s request.\nReuters\nThe 59-year-old actor has been charged with felony, indecent assault and battery for his alleged role in a 2016 incident inside a Nantucket restaurant.\nAccording to the allegations in Massachusetts, Spacey touched an 18-year-old man against his wishes in a sexual manner inside an eatery in July 2016.\nThe charges comes more than a year after former Boston TV news anchor Heather Unruh publicly accused Spacey of assaulting her son in July 2016.\n(With agency inputs)", "title": "Judge Orders Kevin Spacey To Attend Arraignment For His Impending Sexual Assault Case", "date_publish": "01/01/2019, 17:34:58", "description": "New orders from the judge is that Actor Kevin Spacey will have to attend his arraignment on sexual assault charges in Nantucket, Massachusetts. This decision was made on Monday. According to People magazine, in papers filed with the court last week, attorneys for Spacey had asked a Massachusetts judge to waive the Oscar winner’s mandatory appearance at the January 7, 2019 proceeding.", "authors": [], "url": "https://www.indiatimes.com/entertainment/judge-orders-kevin-spacey-to-attend-arraignment-for-his-impending-sexual-assault-case-359648.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kevin_spacey_1546344467_800x420.jpg"}