{"text": "Justin Bieber Seen Crying After Selena Gomez Gets Hospitalised For Emotional Breakdown\nJustin Bieber Seen Crying After Selena Gomez Gets Hospitalised For Emotional Breakdown\nSelena Gomez was recently admitted to a mental health facility after her emotional breakdown. According to TMZ, this is the second time in 2 weeks when Selena got hospitalised.\nEver since the news broke, social media went abuzz and fans from across the world have been praying for her well being. One such person could possibly be Justin Bieber.\nJustin who has on and off dated Selena Gomez before getting engaged to Hailey Baldwin was shocked at the recent developments with Selena. The 24-year-old looked distraught after maybe learning about former girlfriend's ill health.\nHe could be seen crying with wife Hailey Baldwin inside the car. In the video, Justin can be seen having an intense conversation with Hailey and continuously rubbing his eyes. While Justin couldn't hold back his teats, Hailey looks calm and stone faced.\nDon't Miss 106 SHARES 282 SHARES 186 SHARES\nPrior to this, the 'Baby' singer was spotted attending the church alone where he looked shattered and heartbroken.\nTwitter\nAccording to TMZ, Selena was hospitalised twice at Cedars-Sinai Medical Center in L.A. in recent weeks for a low white blood cell count. She reportedly had an emotional breakdown during her second stay, which led her to seek treatment.\nWe hope, Selena Gomez gets well soon and Justin passes the first official marriage hurdle with Hailey too (because this clearly looks like one).", "title": "Justin Bieber Seen Crying After Selena Gomez Gets Hospitalised For Emotional Breakdown", "date_publish": "12/10/2018, 13:07:41", "description": "He could be seen crying with wife Hailey Baldwin inside the car. In the video, Justin can be seen having an intense conversation with Hailey and continuously rubbing his eyes. While Justin couldn't hold back his teats, Hailey looks calm and stone faced. Justin Bieber Seen Crying After Selena Gomez Gets Hospitalised For Emotional Breakdown", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/justin-bieber-seen-crying-after-selena-gomez-gets-hospitalised-for-emotional-breakdown-354651.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/justin_1539327941_800x420.jpg"}