{"text": "Just Like Fans, Smriti Irani Is Also Eagerly Waiting For DeepVeer's Wedding Pic & Here's Proof\nJust Like Fans, Smriti Irani Is Also Eagerly Waiting For DeepVeer's Wedding Pic & Here's Proof\nRemember when Virat Kohli and Anushka Sharma had tied the knot, one after the other, pictures and videos from their pre-wedding and wedding ceremonies were leaked on the social media. From Mehendi to Haldi, the entire nation collectively gushed on how adorable and happy they looked together.\nThis time, when Ranveer Singh and Deepika Padukone confirmed the rumours and announced that they are indeed getting married on Nov 14-15, all DeepVeer fans couldn’t hold their excitement to see them tying the knot happily and in love.\nAlso Read: Dulha Ranveer Singh Will Arrive With ‘Band Baaja Baaraat’ On A Seaplane At Wedding Number 2\nTo our surprise, Deepika Padukone and Ranveer Singh decided to seal all their guests' phones at the wedding venue so that no pictures or videos are leaked. They wanted to keep it all hush-hush, and hence, fans were left disappointed. While all details about what happened – like Ranveer fed Deepika with his own hands when she had Mehendi applied on her hands and asked for a kiss in return or that he danced like crazy and sang ‘Tune Maari Entriyaan’ for the love of his life – no pics, not even one, came out.\nDon't Miss 106 SHARES 233 SHARES 5.1 K SHARES 2.1 K SHARES\nAlso Read: From Ring Ceremony To Sangeet, Here’s How Deepika & Ranveer Celebrated Day 1 Of Wedding Festivities In Italy\nHazy and blurry back shots were brought to us by some of those who were around their wedding destination, but no picture of the bride and groom could be leaked. This one picture of Ranveer Singh apparently from his wedding is doing the rounds, but we don’t know how credible this is.\nAnd just like DeepVeer fans, Indian politician and Textile minister Smriti Irani is also starving for the photos of the Bollywood couple. So much so, that she recently shared this meme.\nThat was funny, wasn’t it? But what was funnier was Ronit Roy’s comment on it that has left the fans ROFLing.\nInstagram\nIf reports are to be believed, Deepika Padukone and Ranveer Singh will share their wedding picture at 6 pm today. Finally, some relief to our anxious souls!", "title": "Just Like Fans, Smriti Irani Is Also Eagerly Waiting For DeepVeer's Wedding Pic & Here's Proof", "date_publish": "15/11/2018, 13:23:06", "description": "just like DeepVeer fans, Indian politician and Textile minister Smriti Irani is also starving for the photos of the Bollywood couple. So much so, that she recently shared a meme. If reports are to be believed, Deepika Padukone and Ranveer Singh will share their wedding picture at 6 pm today. Finally, some relief to our anxious souls!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/just-like-fans-smriti-irani-is-also-eagerly-waiting-for-deepveer-s-wedding-pic-here-s-proof-356713.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/just_like_deepika_padukone_and_ranveer_singh_fans_smriti_irani_is_also_starving_for_their_wedding_p_1542266799_800x420.png"}