{"text": "Just Like The Rest Of Us, Will Smith Can't Get Enough Of Ranveer, Is All Praises For Gully Boy!\nJust Like The Rest Of Us, Will Smith Can't Get Enough Of Ranveer, Is All Praises For Gully Boy!\nEver since the trailer of Gully Boy released, all of us have been jamming to Apna Time Ayega, haven’t we? Now, finally, the time has come. Starring Ranveer Singh and Alia Bhatt, Zoya Akhtar's Gully Boy hit the screens on Thursday.\nInspired by real life of street rappers Divine and Naezy, Gully Boy has been receiving rave reviews from critics as well as fans. Catchy beats, intriguing story and stellar performances have struck a chord with the audiences, not only in India but abroad as well.\nAnd so much so, that Will Smith, who will be doing a cameo in Tiger Shroff starrer Student Of The Year 2, has watched Gully Boy too. Not only did he give a thumbs up to the film but he also showered praises upon Ranveer Singh. Take a look!\nDon't Miss 185 SHARES 544 SHARES 2.4 K SHARES 411 SHARES\n“Yo, Ranveer. Congrats Man. I’m loving what you’re doing with Gully Boy. For me, old school hip hop it is and I’ve seen hip hop all over the world and I’m loving it (Gully Boy) Man. Congrats, Go Get them!,” said Will Smith in the video. The Hollywood star had also shared the trailer of the movie on his Instagram story.", "title": "Just Like The Rest Of Us, Will Smith Can't Get Enough Of Ranveer, Is All Praises For Gully Boy!", "date_publish": "16/02/2019, 12:29:36", "description": "Will Smith, who will be doing a cameo in Tiger Shroff starrer Student Of The Year 2, has watched Gully Boy too. Not only did he give a thumbs up to the film but he also showered praises upon Ranveer Singh. Inspired by real life of street rappers Divine and Naezy, Gully Boy has been receiving rave reviews from critics as well as fans.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/just-like-the-rest-of-us-will-smith-can-t-get-enough-of-ranveer-is-all-praises-for-gully-boy-362253.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/will_smith_watches_gully_boy_praises_ranveer_singh_and_gives_the_movie_a_big_thumbs_up_1550298840_800x420.png"}