{"text": "Just In: Here Are The First Pictures Of Newly-Weds Deepika-Ranveer From Their Bangalore Reception\nJust In: Here Are The First Pictures Of Newly-Weds Deepika-Ranveer From Their Bangalore Reception\nAfter full-fledged celebrations in Italy, Deepika-Ranveer have kick-started their celebrations in India and the first stop is DP's home-town Bengaluru.\nViral Bhayani\nThe couple flew down from Mumbai yesterday to host a reception in Bangalore. Not many know that Leela Hotel was chosen not just because of the venue but DP's love for Italian cuisine is another reason why this was chosen. A source has been quoted in a news18 report saying,\nViral Bhayani\n\"The biggest reason why Deepika chose to have the reception at the Leela, Bangalore was renowned Italian restaurant of New York Le Cirque which goes by the name Le Cirque Signature. DeePee loves the restaurant in NYC and their franchise in Bengaluru drew Deepika to The Leela.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nHer mother has also gone for food tasting 2-3 times. The food will be pre-dominantly South Indian though. They will check into the hotel on 20th and check out on 22nd.\"\nReports claimed that Deepika's mother has herself managed all the arrangements for the celebrations.\nInstagram\nDecked up in a gold saree, Deepika looked ethereal and graceful, while Ranveer looked elegant in his black-gold sherwani and as they hosted their close friends and family. Have a look.", "title": "Just In: Here Are The First Pictures Of Newly-Weds Deepika-Ranveer From Their Bangalore Reception", "date_publish": "21/11/2018, 19:55:30", "description": "Deepika and Ranveer, Ranveer Singh and Deepika Padukone, DeepVeer Wedding Pics, Deepika Padukone MarriageDeepika and Ranveer, Ranveer Singh and Deepika Padukone, DeepVeer Wedding Pics, Deepika Padukone MarriageDeepika and Ranveer, Ranveer Singh and Deepika Padukone, DeepVeer Wedding Pics, Deepika Padukone Marriage", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/just-in-here-are-the-first-pictures-of-newly-weds-deepika-ranveer-from-their-bangalore-reception-357095.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1542813496_800x420.jpg"}