{"text": "1. Kader Khan’s Wish Finally Comes True After His Death, Gets Honoured With A Padma Shri Award\n25 days after Kader Khan’s death, he has finally been honoured with a Padma Shri by the government of India. Kader Khan has been recognised for his contribution to the world of films as a writer and an actor par excellence.\n2. 13 Years Of Rang De Basanti: Here's How It Awakened An Entire Generation & Changed India Forever\nWhile Bollywood was obsessing over films such as Don, Dhoom and Krissh among others, Rakeysh Omprakash Mehra changed it all with a more relatable, goosebumps-inducing movie that had some stellar dialogues and an amazing storyline, which even after 13 years, remains to be very much relevant for everyone, particularly millennials.\n3. A Nation Like No Other! Celebs Share Heartwarming Messages To Mark India's 70th Republic Day\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nCelebrating the spirit of the nation, Bollywood celebrities also expressed their love for the nation by posting heartfelt messages on social media. From Vicky Kaushal to Katrina Kaif, here’s how B-town is wishing everyone a happy 70th Republic Day.\n4. Game Of Thrones Fans Share Why They Hate Daenerys Targaryen & Some Of The Opinions Are Quite Brutal\nWe’re sure, you are not surprised at the fact that a lot of people dislike Daenerys Targaryen. She is one the most powerful women characters on the show, but if you ask people around yourself as to who are they rooting for to sit on the Iron Throne, nobody would take her name. It’s a tough call between Jon Snow and Tyrion Lannister, according to my friends.\n5. New Generation Of FRIENDS Fans Confuse Matt LeBlanc For Joey's Dad & He Just Shoos Them Away!\n“I was walking down the street one day, this was a few years ago. This kid, he must have been 13, 14, he's like, 'Oh my god, you're Joey's dad!' And, my response was 'Scram! Like an old guy would say.”", "title": "Kader Khan Honoured With Padma Shri, 13 Years Of Rang De Basanti & More From Entertainment", "date_publish": "26/01/2019, 18:30:58", "description": "Kader Khan’s wish finally comes true as he gets honoured with a Padma Shree award 25 days after his death. On 70th Republic Day, everyone including Bollywood celebrities posted heartfelt wishes. With that, Rang De Basanti just turned 13. Here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/kader-khan-honoured-with-padma-shri-13-years-of-rang-de-basanti-more-from-entertainment-361097.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khan_honoured_with_padma_shri_13_years_of_rang_de_basanti__more_from_entertainment_1548503088_800x420.png"}