{"text": "Kader Khan's Son Sarfaraz Rubbishes Rumours Of His Death, Confirms He's Alive & In The Hospital\nKader Khan's Son Sarfaraz Rubbishes Rumours Of His Death, Confirms He's Alive & In The Hospital\nAiling Bollywood veteran star Kader Khan, who has made us laugh with his antics onscreen is struggling to keep well. He has been wheelchair-bound since a long time. Recently, he was admitted to a hospital in Canada after complaints of breathing issues. Soon, rumours of him passing away started doing the rounds. However, it turned out they were all unsubstantial.\nAlso Read: Kader Khan’s Knee Operation Goes Wrong, Rushed To Canada For Medical Treatment\nVeteran actor Kader Khan’s son Sarfaraz has said that his father has been admitted to a hospital in Canada, dismissing media reports of his demise.\n“It is all a lie. It (is) just a rumour. My father is in the hospital,” Mr. Sarfaraz told PTI.\nThe 81-year-old actor has developed breathing issues and the doctors have reportedly transferred him from regular ventilator to BiPAP ventilator.\nAFP\nMr. Khan is reportedly suffering from Progressive Supranuclear Palsy, a degenerative disease that causes loss of balance, difficulty in walking and dementia.\nDon't Miss 180 SHARES 1.3 K SHARES 229 SHARES\nMegastar Amitabh Bachchan, who has worked with Khan in films such as Do Aur Do Paanch, Muqaddar Ka Sikandar, Mr. Natwarlal, Suhaag, Coolie and Shahenshah, took to Twitter on Friday to pray for the veteran actor’s well-being and recovery.\n“Kader Khan... actor writer of immense talent... lies ill in Hospital... Prayer and duas for his well being and recovery... Saw him perform on stage, welcomed him and his prolific writing for my films. Great company, a libran and many not know, taught Mathematics,” Mr. Bachchan tweeted.\nBorn in Kabul, Mr. Khan made his acting debut in 1973 with Rajesh Khanna’s Daag and has featured in over 300 films.\nAlso, he has written dialogues for over 250 movies. Before becoming an actor, he had written dialogues for Randhir Kapoor-Jaya Bachchan’s Jawani Diwani.\nAs a screenwriter, Khan frequently collaborated with Manmohan Desai and Prakash Mehra. His films with Desai include Dharam Veer, Ganga Jamuna Saraswati, Coolie, Desh Premee, Suhaag, Parvarish and Amar Akbar Anthony and films with Mehra include Jwalamukhi, Sharaabi, Lawaaris, Muqaddar Ka Sikandar.\nWith inputs from PTI", "title": "Kader Khan's Son Sarfaraz Rubbishes Rumours Of His Death, Confirms He's Alive & In The Hospital", "date_publish": "31/12/2018, 11:26:10", "description": "Ailing Bollywood veteran star Kader Khan, who has made us laugh with his antics onscreen is struggling to keep well. He has been wheelchair bound since a long time. Recently, he was admitted to a hospital in Canada after complaints of breathing issue. Soon, rumours of him passing away started doing the rounds. However, it turned out they were all unsubstantial.", "authors": [], "url": "https://www.indiatimes.com/entertainment/kader-khan-s-son-sarfaraz-rubbishes-rumours-of-his-death-confirms-he-s-alive-in-the-hospital-359541.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/kader_khan_1546234361_800x420.jpg"}