{"text": "Legendary actor and a skilled dialogue writer – Kader Khan’s death has left many shattered including his fans and people from the film fraternity who worked for him.\nAfter he passed away, a lot of people from the industry paid their last respect to the star. However, some of them, including Shatrughan Sinha, were angry at how he was neglected in the last years when he was ill.\nKader Khan’s son Sarfaraz also spilled some bitterness while talking about how the film industry neglected him after he migrated to Canada to live with his three sons.\nTwitter\nAmong others who he lashed out at was Govinda, who yesterday paid an emotional tribute to his “ustaad” and “father-figure”. Kader Khan’s son is, however, called him out for not checking on his “father figure’s” health even once.\nRIP Kader Khan Saab.\nHe was not just my \"ustaad\" but a father figure to me, his midas touch and his aura made every actor he worked with a superstar. The entire film industry and my family deeply mourns this loss and we cannot express the sorrow in words.#ripkaderkhansaab🙏🏻 pic.twitter.com/NISPM1UMs1 — Govinda (@govindaahuja21) January 1, 2019\nDon't Miss 235 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“Please ask Govinda how many times he inquired about his father figure's health. Has he even bothered to call us even once after my father's passing away? This is the way our film industry has become. There are no real feelings for those who have contributed to Indian cinema when they're no longer active.\n“The top guns may be seen getting clicked with these retired veterans. But the affection goes only as far as photographs. No more. Look at the condition in which Lalita Pawarji and Mohan Chotiji died. Luckily, my father had three sons to look after him. What about those who die with no financial and emotional support?” he was quoted as saying by IANS.\nHe added that his father would be happy to know that he passed away surrounded by his loved ones. “There was a smile on my father's face when he passed away. I cherish that smile more than anything else in the world,” he added.\nWith inputs from IANS", "title": "Kader Khan’s Son Slams Govinda, Asks ‘How Many Times He Inquired About His Father Figure's Health’?", "date_publish": "03/01/2019, 17:22:09", "description": "Kader Khan’s son Sarfaraz also spilled some bitterness while talking about how the film industry neglected him after he migrated to Canada to live with his three sons. Among others who he lashed out at was Govinda, who yesterday paid an emotional tribute to his “ustaad” and “father-figure”. Kader Khan’s son is, however, called him out for not checking on his “father figure’s” health even once.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kader-khan-s-son-slams-govinda-asks-how-many-times-he-inquired-about-his-father-figure-s-health-359797.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khans_son_slams_govinda_asks_if_at_all_he_inquired_about_his_father_figures_health_1546516746_800x420.jpg"}