{"text": "For the world of showbiz, 2019 began on a heavy note as people woke up to the sad news of demise of legendary actor Kader Khan. After having slipped into coma, the veteran actor who tickled our funny bones for over three decades regaling the audiences with over 300 films, breathed his last at a hospital in Canada.\nTwitter\nThe entire industry mourned and remembered Kader Khan when they heard of this news. However, Kader Khan’s son Sarfaraz wasn’t happy about it. He lashed out at the film fraternity for neglecting the veteran star for so many years. Hitting back at Govinda, who had posted a tribute for his “ustaad” and “father figure”, Sarfaraz questioned “how many times did he call to inquire about his father figure’s health?”.\ninstagram/torontomuslims/\nKader Khan was suffering from Progressive Supranuclear Palsy, which is a degenerative disease that causes loss of balance, dementia and difficulty in walking.\ninstagram/torontomuslims/\nDon't Miss 3.4 K SHARES 832 SHARES 247 SHARES\nKader Khan was buried at a cemetery in Canada on Wednesday.\n“My father was laid to rest on Wednesday at the Meadowvale Cemetery in Mississauga (Canada). It was attended by us -- his family of three sons, relatives and fans who got to know of his passing,” Sarfaraz told IANS.\ninstagram/torontomuslims/\n\"Canada was my father's home during his last years. All of us have moved to Canada,\" said Sarfaraz who once tried making a career in Bollywood. He played Salman Khan's friend in Tere Naam.\ninstagram/torontomuslims/\nBorn in Kabul, Kader Khan's family migrated to Mumbai when he was a year old. Khan went on to write dialogues for over 250 films, including some of the biggest blockbusters of the '70s and '80s such as Dharam Veer, Ganga Jamuna Saraswati, Coolie, Desh Premee Suhaag, Parvarish, Amar Akbar Anthony, Sharaabi, Lawaaris and Muqaddar Ka Sikandar.", "title": "Kader Khan’s Funeral Held In Canada, Son Sarfaraz & Fans Pay Their Last Respects", "date_publish": "04/01/2019, 11:22:58", "description": "Kader Khan was buried at a cemetery in Canada on Wednesday. “My father was laid to rest on Wednesday at the Meadowvale Cemetery in Mississauga (Canada). It was attended by us -- his family of three sons, relatives and fans who got to know of his passing,” Sarfaraz told IANS. \"Canada was my father's home during his last years. All of us have moved to Canada,\" said Sarfaraz who once tried making", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kader-khan-s-funeral-held-in-canada-son-sarfaraz-fans-pay-their-last-respects-359815.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khans_funeral_held_in_canada_son_sarfaraz__fans_pay_their_last_respect_1546580426_800x420.png"}