{"text": "Kader Khan's Son Lashes Out At The Film Fraternity, Says Bollywood Has No Real Feelings\nKader Khan's Son Lashes Out At The Film Fraternity, Says Bollywood Has No Real Feelings\nVeteran actor Kader Khan passed away on 31st December, 2018 leaving a void in the film industry. Writing screenplay, dialogues and acting, Kader Khan was a man of many talents.\nTwitter\nAfter his demise in Canada due to prolonged illness, the Bollywood industry expressed shock. They paid tribute to the actor on social media. But his son Sarfaraz is disappointed with the way no one reached out to him after his father's demise.\nTwitter\nDuring a media interaction, Sarfaraz said, \"It is the way the Indian film industry has become now. There are too many fragmented camps and loyalties. The out-of-sight-out-of-mind mentality can't be helped. My father always told us, his sons, not to expect anything from anybody and we grew up with the belief that one must do what is required in life and expect nothing in return.\"\nHis son even mentioned how much Khan saab missed his long time friend Amitabh Bachchan.\nCineblitz\nDon't Miss 106 SHARES 282 SHARES 862 SHARES\n\"There are so many people in the film industry whom my father was close to. But the one person that my father loved the most was Bachchan saab (Amitabh Bachchan). I'd ask my father whom he missed the most from the film industry and the answer promptly would be Bachchan Saab. And I know the love was mutual. I want Bachchan saab to know that my father spoke about him till the end,\" he added.\nT 3045 - Kadar Khan passes away .. sad depressing news .. my prayers and condolences .. a brilliant stage artist a most compassionate and accomplished talent on film .. a writer of eminence ; in most of my very successful films .. a delightful company .. and a mathematician !! pic.twitter.com/l7pdv0Wdu1 — Amitabh Bachchan (@SrBachchan) January 1, 2019\nBig B even took to Twitter to pay condolences to his friend and guide.", "title": "Kader Khan's Son Lashes Out At The Film Fraternity, Says Bollywood Has No Real Feelings", "date_publish": "03/01/2019, 16:13:09", "description": "Kader Khan's Son Lases Out At Bollywood Industry, Says Not Too Many Called After His DemiseKader Khan's Son Lases Out At Bollywood Industry, Says Not Too Many Called After His DemiseKader Khan's Son Lases Out At Bollywood Industry, Says Not Too Many Called After His DemiseKader Khan's Son Lases Out At Bollywood Industry, Says Not Too Many Called After His DemiseKader Khan's Son Lases Out At Bollyw", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kader-khan-s-son-lashes-out-at-the-film-fraternity-says-bollywood-has-no-real-feelings-359778.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khan_1546510048_800x420.jpg"}