{"text": "When Kader Khan was alive, he was upset by the fact that the country couldn't recognise his talent. He was a straight-shooter and didn’t ever prefer to mince his words. In 2016, when he didn’t get a Padma Shri award, he said he was glad about it because they had no meaning anymore and that politics had slowly taken over it.\nTwitter\nMocking the Padma Shri Award, he had told IANS in 2016, “People have now forgotten to respect others and have become way too selfish. I would think that I was not as capable as those who were chosen for the Padma awards this year. I, however, thank all those who proposed my name for it”.\nTwitter\n25 days after Kader Khan’s death, he has finally been honoured with a Padma Shri by the government of India. Kader Khan has been recognised for his contribution to the world of films as a writer and an actor par excellence.\nInstagram\nMohanlal, Manoj Bajpayee, Shankar Mahadevan are among other artistes who have been conferred with Padma Awards. Also, recognising the colossal contribution of Northeast's multi-faceted cultural icon, Bhupen Hazarika was picked posthumously to be conferred the Bharat Ratna.\nThe songs and music of Shri Bhupen Hazarika are admired by people across generations. From them radiates the message of justice, harmony and brotherhood.\nHe popularised India's musical traditions globally.\nHappy that the Bharat Ratna has been conferred on Bhupen Da. — Narendra Modi (@narendramodi) January 25, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn the times of gender equality, Padma awardee list, however, didn’t mention any woman from the film industry.", "title": "Kader Khan’s Wish Finally Comes True After His Death, Gets Honoured With A Padma Shri Award", "date_publish": "26/01/2019, 11:28:48", "description": "25 days after Kader Khan’s death, he has finally been honoured with a Padma Shri by the government of India. Kader Khan has been recognised for his contribution to the world of films as a writer and an actor par excellence. 25 days after Kader Khan’s death, he has finally been honoured with a Padma Shri by the government of India. Kader Khan has been recognised for his contribution to the world of", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kader-khan-s-wish-finally-comes-true-after-his-death-gets-honoured-with-a-padma-shri-award-361054.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khan_honoured_with_a_padma_shri_award_for_his_contribution_to_the_world_of_films_1548480609_800x420.png"}