{"text": "Kailash Kher Responds To The #MeToo Allegations, Says Accusations Without Formal Complaint Is Not Authentic\nKailash Kher Responds To The #MeToo Allegations, Says Accusations Without Formal Complaint Is Not Authentic\nBollywood singer Kailash Kher's name was dragged when the whole #MeToo movement erupted in India. While many A-listers were dragged in public and shaming, Kailash Kher too was slapped with charges.\nMultiple women came out in the open on Twitter to share their unpleasant experiences. In fact, celebrity singer Sona Mohapatra had shared her experience with Kailash Kher. Yes, in an interview, she has said she will not lodge a police complaint against Kailash Kher, but she will make sure he doesn't repeat his alleged act in future.\nTwitter\nSoon after, four other women raised allegations against the Teri Deewani singer. Now responding to this, Kailash Kher said,\nReacting to this, Kailash Kher said: \"Everyone has their own thinking. If I accuse someone only by taking that individual's name over and over again then, nothing will come out of it. If you will take legal recourse against that person, then it becomes another matter altogether.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n\"If I tell you that I will not make a complaint against that individual, but still I will accuse him of doing certain criminal activity, then I feel it's not an authentic complaint,\" he added.\nKailash Kher will be seen doing a live concert of Kailasa all over India and the world. Along with that, he's also working on a new album Tham Ja.\nInputs from IANS", "title": "kailash kher:Kailash Kher Responds To The #MeToo Allegations, Feels Accusing Without Formal Complaint Is Not Authentic", "date_publish": "07/02/2019, 18:54:28", "description": "Kailash Kher Responds To The #MeToo Accusations, Feels Accusing Without Formal Complaints Is Not AuthenticKailash Kher Responds To The #MeToo Accusations, Feels Accusing Without Formal Complaints Is Not AuthenticKailash Kher Responds To The #MeToo Accusations, Feels Accusing Without Formal Complaints Is Not AuthenticKailash Kher Responds To The #MeToo Accusations, Feels Accusing Without Formal Com", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kailash-kher-responds-to-the-metoo-allegations-says-accusations-without-formal-complaint-is-not-authentic-361773.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kailash_1549544914_800x420.jpg"}