{"text": "After a big dud that Yashraj's Thugs Of Hindostan turned out to be, Kalank's fate also looks a little bleak with all the first reactions that are pouring in. In case you are confused whether to watch the film or not, here are the first reactions.\n2. Prakash Raj Gets Nostalgic As He Casts His Vote In The Same Classroom He Sat ‘41 Years’ Ago!\nI got to VOTE in my school and in the very class room I sat 41 years ago ..NOSTALGIC.. a NEW JOURNEY.. a NEW HORIZON.. feeling blessed by LIFE. pic.twitter.com/CVWlZ7XOJv — Prakash Raj (@prakashraaj) April 18, 2019\nSharing a photograph, Prakash Raj wrote on Twitter, “I got to VOTE in my school and in the very class room I sat 41 years ago ..NOSTALGIC.. a NEW JOURNEY.. a NEW HORIZON.. feeling blessed by LIFE.”\n3. Save The Date! Avengers: Endgame Tickets Will Most Likely Go On Sale From April 21st In India\nDon't Miss 638 SHARES 460 SHARES\nAccording to a report in NDTV, the tickets are likely to go on sale this Sunday, on April 21. This they have predicted on the basis of the trend witnessed last year during the releasing of Avengers: Infinity War. Even the sales for Captian Marvel began five days in advance.\n4. Vikas Gupta Slams Kubbra Sait For Praising Tik Tok Ban, Says The Artists Are As Talented As Her\nFollowing this, while some of the people expressed joy, others were unhappy. One of them was Kubbra Sait who took to Twitter to write she has never been happier about a ban so much.\n5. Telugu TV Actresses Bhargavi And Anusha Reddy Die In A Car Accident While Returning From Shoot\nAccording to the police, the car driver was trying to avert collision with a truck which was coming from the opposite direction. However, in the process, he hit a roadside tree near Appareddy Guda in the early hours of the day.", "title": "Kalank Movie Review In Tweets, Prakash Raj Gets Nostalgic And More From Entertainment", "date_publish": "18/04/2019, 18:30:14", "description": "From Kalank movie’s tweet review to Prakash Raj getting nostalgic as he casts the vote in the same classroom in which he sat 41 years ago, here’s all that rocked the world of entertainment. After pan India promotions and luring the audience with its splendid ensemble cast, Karan Johar's Kalank hit the theaters yesterday. Starring Alia Bhatt, Varun Dhawan, Aditya Roy Kapoor, Madhuri Dixit, Sanjay D", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kalank-movie-review-in-tweets-prakash-raj-gets-nostalgic-and-more-from-entertainment-365715.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kalank_movie_review_in_best_tweets_prakash_raj_gets_nostalgic_and_more_from_entertainment_1555592496_800x420.png"}