{"text": "“Divorce is a huge step. It gave me freedom in the sense that I could make a choice that I stand by. It is a choice that is not applauded by many but it gives you the freedom to move on, to make new choices, to go ahead in the world with your head held high and without feeling the past baggage,” she was quoted as saying by Film Companion.\n\"Taapsee keeps me on my toes and is on a mission to make me take on challenges. I have never done anything like this before, so I am looking forward to it.\"\nA leading daily claims that the makers of Udham Singh approached Sara Ali Khan for the film but she turned down the offer. The report further claims that Sara is currently looking for experimental and meaty roles.\nFirst arrives Madhuri Dixit as Begum Bahar, then comes Sonakshi Sinha as Satya and Alia Bhatt as Roop is the final character to be introduced from the \"Women Of Kalank\" cast. Varun Dhawan is introduced next as the daredevil Zafar, who plays a bullfighter, followed by Aditya Roy Kapur's Dev Chaudhary and in the end, Sanjay Dutt's character as the \"formidable\" Balraj Chaudhary is introduced.\nTalking about how emotionally draining Faiza’s character was, Kalki says, “I was miserable playing Faiza because it’s a roller coaster that’s she is going on. I was very tired at that point of my life so I used to come tired on the sets only but, of course now when I look back, I am happy because she is such a powerful character, I love the scenes where she is going to the therapist and the truth come out from those scenes.\"\nDon't Miss 862 SHARES", "title": "Kalki Koechlin Defines What Success Is For Her, Kalank Teaser Is Out & More From Ent.", "date_publish": "12/03/2019, 18:54:41", "description": "“Divorce is a huge step. It gave me freedom in the sense that I could make a choice that I stand by. It is a choice that is not applauded by many but it gives you the freedom to move on, to make new choices, to go ahead in the world with your head held high and without feeling the past baggage,” she was quoted as saying by Film Companion.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kalki-koechlin-defines-what-success-is-for-her-kalank-teaser-is-out-more-from-ent-363609.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1552397572_800x420.jpg"}