{"text": "The #MeToo movement in India gained a surprising momentum after Tanushree Dutta stood strong and started a sincere conversation around it. The movement spread like a wildfire on social media and some very shocking names came out after several women shared their horror tales of getting harassed by men in power.\nIt won't be right to say that the movement has fizzled out because the conversation around it is still happening. The latest one to join this conversation is actress Kalki Koechlin.\nPinterest\nAccording to Kalki, #MeToo movement has been an empowering one for women in India. In a conversation with Cosmopolitan, Kalki said,\nPinterest\n\"It's an empowering time for women. It's been about a year since it began in Hollywood, and I don't think anyone, including myself, expected it to blow up so suddenly. And we have seen results. People have resigned, people are being investigated in workplaces, new rules are being set up, facilitating processes for women to lodge complaints-so much has happened and it's only been three weeks. All of it is very encouraging.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nKalki also pointed out the drawbacks that women had to face. She adds how a lot of women are being threatened for naming and shaming men publicly but she wants them to not live in fear. She was quoted as saying,\n\"We can't let fear steer the way, dictate our lives. This movement has proved that we can't sit here and fear what might or might not happen. It's true that women who've been speaking are hugely threatened; their lives are under stress for calling out their abusers.\"", "title": "Kalki Koechlin Explains The Challenges That Women Who Shared Their #MeToo Stories Had To Face!", "date_publish": "06/11/2018, 18:21:38", "description": "It won't be right to say that the movement has fizzled out because the conversation around it is still happening. The latest one to join this conversation is actress Kalki Koechlin. According to Kalki, #MeToo movement has been an empowering one for women in India.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kalki-koechlin-explain-the-challenges-that-women-who-shared-their-metoo-stories-had-to-face-356193.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/koechlin_1541509111_800x420.jpg"}