{"text": "'Panga' is not just the name of Kangana Ranaut's upcoming film but it is something she is really good at doing in real-life. She is royally taking pangas (read: digs) at A-listers of Bollywood and she is unstoppable.\nYesterday, she was addressing the media at the success bash of her last film Manikarnika.\nAgencies\nWhen asked if she planned to join politics or to participate in an election campaign, Kangana said:\n\"I don't have any intention to join politics or an election campaign of a political party. Many people feel that I want to enter politics but that's not true. There are few actors in our industry like Ranbir Kapoor where he has been seen talking in an interview that 'We have regular supply of water and electricity at my home so, why should I comment about politics?' But I feel because of this country's people you are living in your luxurious home and you are travelling in your Mercedes so, how can you talk like that? This is irresponsible behaviour and I am not that kind of person.\"\nIn a 2018 interview, Ranbir was asked why he shied away from making political statements. The actor replied that he doesn't follow politics as it makes no difference to his life. He added that as he lives in a luxurious life and has complete access to basic needs like water, and electricity, he was fairly satisfied.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nAgencies\nKangana said that if expressing her opinions about a certain issue ruins her film career then, she is okay with it.\nAgencies\n\"If talking about politics can hamper my career then let it be. I also have regular supply of water and electricity at my home but that doesn't mean that I will not talk about other issues. This has to change and the media should change that,\" she said.\nShe added,\nTwitter\n\"I feel you shouldn't distance yourself from issues of the country. In a democracy, you should speak about how the government has performed and also speak about your political inclination as a youth of this country. You cannot say why should I talk about politics when I get all the facilities. I don't understand why they think of their career so much that they don't have anything to do with their own country?\"\nOn the professional front, Kangana will be next seen in Mental Hai Kya opposite Rajkummar Rao, slated to release in May. She will also be appearing with Punjabi singer Jassi Gill, Richa Chadha, Pankaj Tripathi and Neena Gupta in Ashwini Iyer Tiwari's Panga.", "title": "Kangana Ranaut Slams Ranbir Kapoor And Other Actors For Refusing To Comment On Politics", "date_publish": "04/03/2019, 14:53:32", "description": "Kangana Ranaut Slams Ranbir Kapoor For Old Interview Refusing To Comment On Politics In 2018, Ranbir Kapoor said he doesn't follow politics as it makes no difference to his life. Kangana said that's \"irresponsible\". Kangana said that if expressing her opinions about a certain issue ruins her film career then, she is okay with it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-slams-ranbir-kapoor-and-other-actors-for-refusing-to-comment-on-politics-363126.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_1551692829_800x420.jpg"}