{"text": "Kangana Ranaut is talking about the same 'sanskaari Pahlaj' Nihalani who often used to chop scenes from films as he used to the head of Censor Board and a controversial one at that.\nTwitter\nPahlaj is one man, who has made number of filthy and double meaning films, his latest release Rangeela Raja too was full of double meaning and sexist jokes. And now the latest one to talk about his filth is Bollywood Queen Kangana Ranaut.\nTwitter\nThe actress in conversation with Mid Day revealed how she was asked to do some uncomfortable photo shoots for a Pahlaj Nihalani film when she was young.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nTwitter\nKangana said, \"The fact that people met, and promised to guide, help, but then I was put under house-arrest. And then Pahlaj Nihalani had offered me a film called I Love You Boss. They had a photo-shoot where they gave me a robe to wear, and no undergarments. So I just had a satin robe for a show-girl pose, from which I had to stick my leg out, coming out of darkness.”\nTwitter\nShe even recalled the time how her parents were super skeptical and scared with her decision of entering Bollywood, \"I was supposed to play a young girl lusting after her middle-aged boss. So it was a soft-porn sort of character. And I had this epiphany that I can't do this. I felt like this is exactly what my parents were talking about.\"\nTwitter\nClearly the actress has seen a lot and come a long way. It takes courage to talk about the dark side of Bollywood, but Kangana is fearless, in fact, she is the one who started this nepotism debate and everyone is thankful to her.\nTwitter\nMore power to this fearless woman. Kangana will be next seen in Mental Hai Kya with Rajkummar Rao, and will soon start shooting for Jayalalithaa's biopic titled Thalaivi.", "title": "Kangana Ranaut Makes A Shocking Revelation About Pahlaj Nihalani ,Says He Asked Her To Wear A Robe Without Undergarments", "date_publish": "28/03/2019, 15:45:46", "description": "Yes, Kangana Ranaut is talking about the same so called sanskaari Pahlaj Nihalani who often used to love to chop scenes from films he was the head of Censor Board. Pahlaj is one man, who has made filthy and double meaning films, his latest release Rangeela Raja too was full of double meaning jokes an sexist. And now the latest one to talk about his filth is Bollywood Queen Kangana Ranaut. The ac", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-reveals-pahlaj-nihalani-asked-her-to-wear-a-robe-without-undergarments-for-a-shoot-364467.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_1553759938_800x420.jpg"}