{"text": "Twitter\n“I have been speaking about it every day. But, now, more significantly, more people need to come out and talk about it. It's just not one person to talk about it. It's important for people like... Where are people like Karan Johar, Shabana Azmi, they should also come out and talk. Karan Johar always has views about gym looks, airport looks, he tweets ten times about it, what about this?\nBryan Adams finally concluded his three-day concert with his last performance in Gurugram last night, and fans are still hungover and are singing Summer of 69. From singing his popular tracks to expressing his love for India, the Grammy Award-winning singer-songwriter gave his Indian fans a joyful night to remember.\nBadhaai Ho is a hilarious take on Indian’s mentality on parent’s having sex. The film's trailer will tickle your funny bone, especially watching Ayushmaan Khurrana’s embarrassment after he learns that his mom played by Neena Gupta is pregnant. The trailer of the film definitely left us curious and now Neena’s daughter Masaba Gupta’s review on the film has made us even more eager.\nTwitter\nI have also been harassed in my career, not sexually, but I have been harassed 25 years ago and I am still angry about it\nTwitter\nBefore fighting their own battles to claim the Iron Throne, the lead characters in Game of Thrones season 8 have a more pressing issue to deal with first - the White Walkers led by the Night King.\nJon Snow (played by Kit Harington) and Daenerys Targaryen (Emilia Clarke) have already witnessed the power of the Night King and they are desperately looking for a way to kill him.", "title": "Kangana Ranaut Slams KJo Yet Again, Saif Ali Khan Shares His Harassment Story & More From Ent", "date_publish": "15/10/2018, 17:45:16", "description": ".After Nepotism, Kangana Ranaut Calls Out Karan Johar For Not Speaking Up About #MeToo Movement “I have been speaking about it every day. But, now, more significantly, more people need to come out and talk about it. It's just not one person to talk about it. It's important for people like... Where are people like Karan Johar, Shabana Azmi, they should also come out and talk. Karan Johar always ha", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-slams-kjo-yet-again-saif-ali-khan-shares-his-harassment-story-more-from-ent-354839.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/saif_1539605295_800x420.jpg"}