{"text": "Kangana Ranaut Gives It Back To Karni Sena, Says She's A Rajput & Will Destroy Each One Of Them\nKangana Ranaut Gives It Back To Karni Sena, Says She's A Rajput & Will Destroy Each One Of Them\nIt feels like it’s an annual activity for Karni Sena. Last year, around this time, Karni Sena was protesting against the release of Padmaavat. From threatening the director, cutting Deepika’s nose to violent protests across the nation that including the burning of a bus, they did everything to express their anger because they thought the movie distorted historical facts.\nTwitter\nYet again, this time, before the release of Kangana Ranaut starrer Manikarnika: The Queen Of Jhansi, they have once again issued a threat to the makers that if there is distortion of facts, they will have to bear the dire consequences.\nBut Kangana Ranaut, being the bold and beautiful woman she is, didn’t choose to ignore this. Without mincing words, she said that Karni Sena continues to harass her, she will “destroy them”. She is also a Rajput, she stated.\n“Four historians have certified 'Manikarnika...'. We have got censor certificate as well. Karni Sena has been conveyed this but they are continuing to harass me. If they don't stop then they should know I am also a Rajput and I will destroy each one of them,” she was quoted as saying by IANS.\nThe movie based on the life story of Rani Laxmibai, Manikarnika: The Queen Of Jhansi is slated to release on Jan 25.\nDon't Miss 193 SHARES 126 SHARES 769 SHARES 336 SHARES\nWith inputs from IANS", "title": "Kangana Ranaut Gives It Back To Karni Sena, Says She's A Rajput & Will Destroy Each One Of Them", "date_publish": "18/01/2019, 15:49:40", "description": "Yet again, this time, before the release of Kangana Ranaut starrer Manikarnika: The Queen Of Jhansi, they have once issued a threat to the makers that if there is distortion of facts, they will have to bear the dire consequences. But Kangana Ranaut, being the bold and beautiful woman she is, didn’t choose to ignore this. Without mincing words, she said that Karni Sena continues to harass her, she", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-gives-it-back-to-karni-sena-says-she-s-a-rajput-will-destroy-each-one-of-them-360646.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_ranaut_slams_to_karni_sena_says_shell_destroy_them_if_they_continue_to_harass_her_1547805830_800x420.jpg"}