{"text": "Makers of Kangana Ranaut and Rajkummar Rao starrer Mental Hai Kya on Saturday denied that the film discriminates against people battling mental health issues and in fact encourages the audience to embrace their individuality.\nThe response from the production house Balaji Motion Pictures comes a day after the Indian Psychiatric Society (IPS) wrote a letter to the censor board to object against the film's recently released posters.\nIn a letter addressed to CBFC chairperson Prasoon Joshi, the IPS had also objected to the title of the movie and said it was \"discriminative, stigmatising, degrading and inhuman in projecting mental disorders and persons who suffer from mental disorders.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe production banner countered that the film aims to celebrate distinctiveness. \"The makers of the film, believe that their movie - 'Mental Hai Kya' will encourage people to embrace their individuality and distinctiveness.\n\"'Mental Hai Kya' starring Kangana Ranaut and Rajkummar Rao marks the coming together of some of the most talented and responsible media personalities, who in no way intend to hurt anyone's sentiments,\" the statement read.\nafp\nThe IPS had also demanded to censor any sequence in the film which violates the rights of persons with mental disorder. The makers, however, said it is a \"fictional thriller genre feature film meant to entertain audiences\".\n\"It does not offend, discriminate or disregard any person. In fact the film is a mainstream entertainer which makes a larger point,\" the statement further read. Kangana's sister Rangoli also defended the film. In her tweet, she wrote:\nOn behalf of Kangana all I want to say is that everyone will be proud of ‘Mental Hai Kya’ the topic and subject she has chosen will trigger relevant talk and discussions around the stigma 🙏 — Rangoli Chandel (@Rangoli_A) April 20, 2019\nInputs From PTI", "title": "Kangana's Sister Rangoli Defends 'Mental Hai Kya', Says She's Proud Of The Film", "date_publish": "20/04/2019, 16:52:37", "description": "The production banner countered that the film aims to celebrate distinctiveness. Makers of Kangana Ranaut and Rajkummar Rao starrer Mental Hai Kya on Saturday denied that the film discriminates against people battling mental health issues and in fact encourages the audience to embrace their individuality.", "authors": [], "url": "https://www.indiatimes.com/entertainment/kangana-s-sister-rangoli-defends-mental-hai-kya-says-she-s-proud-of-the-film-365815.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/mental_hai_kya_1555763727_800x420.jpg"}