{"text": "It all began after Kangana Ranaut's sister shared a story about Alia Bhatt’s mom Soni Razdan stating that “these non Indians who are living off this land, using and abusing its people and its resources, lying about intolerance and spreading hatred” can’t vote in the elections. And henceforth, the mudslinging began.\nThese non Indians who are living off this land, using and abusing its people and its resources, lying about intolerance and spreading hatred, time to think about their agenda and not to get carried away with their provocations. https://t.co/FAwHChqopC — Rangoli Chandel (@Rangoli_A) April 14, 2019\nRangoli Chandel had slammed Soni Razdan over her British passport. To this, Soni Razdan couldn’t hold back. She wrote this on Twitter –\n“Mahesh Bhatt is the man who has given her a break … she goes on to attack his wife and daughter. Daughter over and over again. What is left to be said then about abusing and hatred I wonder. Apart from character of course. Agenda ? What’s hers … ?”\nShe, however, deleted the tweet soon.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES\nAnd to this, Rangoli accused Mahesh Bhatt of throwing a chappal at the 19-year-old Kangana Ranaut during a film screening.\nDear Soni ji, Mahesh Bhatt never gave her a break, Anurag Basu did, Mahesh Bhatt ji works as a creative director in his brothers production house....(contd) @Soni_Razdan https://t.co/SD22ztrQ29 — Rangoli Chandel (@Rangoli_A) April 16, 2019\n(Contd).... please note that he doesn’t own that production house, after Woh Lamhe when Kangana refused to do a film written by him called ‘Dhokha where he wanted her to play a suicide bomber he got so upset that he not only shouted at her in his office..... (contd) @Soni_Razdan — Rangoli Chandel (@Rangoli_A) April 16, 2019\n.... but later when she went for Woh Lamhe preview to a theatre he threw chappal on her, he didn’t allow her to see her own film, she cried whole night .... and she was just 19years old . @Soni_Razdan — Rangoli Chandel (@Rangoli_A) April 16, 2019\nOf course Kangana is jealous of Alia’s super model looks and fashion sense, remarkable multiple national awards winning acting skills along with superhuman action style, Her exceptional IQ and speeches along with refreshing writings, directorial skills....(contd) @nina11_arora https://t.co/3aFeYanrN3 — Rangoli Chandel (@Rangoli_A) April 16, 2019\nTaking the Bhatt family’s side, Randeep Hooda on Twitter called her “very occasional actors” who are “chronic victims.”\nDearest @aliaa08 I’m so glad you are not letting the opinions of very occasional actors and chronic victims affect you and your work .. kudos to you for your continued efforts to outdo yourself 🤗 — Randeep Hooda (@RandeepHooda) April 16, 2019\nAlia baby ko bachane ko nepotism gang ki khud ki himmat nahin toh tujhko aage kiya, I know during film Ungli what u did, kitna harass kiya tune Kangana ko aur kitna bada chatukar hai tu Karan Johar ka....(contd) @RandeepHooda — Rangoli Chandel (@Rangoli_A) April 16, 2019\n(Contd).....magar phir bhi tera kuch nahin hua, at least people like Alia are successful because of chamchagiri, bhai tu to permanent failure hai 🙏 @RandeepHooda — Rangoli Chandel (@Rangoli_A) April 16, 2019\nYesterday, Rangoli Chandel took another dig at Ajay Devgn for working with rape accused Alok Nath in his movie De De Pyaar De. In a series of tweets, she lashed out at him.\nIt is because of these men our country is a black spot on world map as far as crimes against women are concerned,shame on you bollywood for mocking #MeToo https://t.co/nSQ6DuA0We — Rangoli Chandel (@Rangoli_A) April 17, 2019\nThese men are so intoxicated with power and money, they are teasing the movement by supporting fellow harassers and slyly mocking the victims, also shamelessly defending their actions with lame excuses...(contd) — Rangoli Chandel (@Rangoli_A) April 17, 2019\n(Contd)....and all those who are enjoying the sweetness of silence just because it is happening to somebody else’s daughter shall know the world is round and everything comes around 🙏 #Metoo — Rangoli Chandel (@Rangoli_A) April 17, 2019\nOn the other hand, Ajay Devgn had earlier clarified that the movie was shot before the sexual harassment allegations against Alok Nath.", "title": "Kangana Ranaut’s Sister Rangoli Chandel Now Targets Ajay Devgn, Says ‘These Men Are Intoxicated With Money’", "date_publish": "18/04/2019, 12:08:56", "description": "Yesterday, Rangoli Chandel took another dig at Ajay Devgn for having working with rape accused Alok Nath in his movie De De Pyaar De. In a series of tweets, she lashed out at him. On the other side, Ajay Devgn had earlier clarified that the movie was shot before the sexual harassment allegations against Ajay Devgn.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-s-sister-rangoli-chandel-now-targets-ajay-devgn-says-these-men-are-intoxicated-with-money-365666.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kangana_ranauts_sister_rangoli_chandel_now_targets_ajay_devgn_1555566685_800x420.png"}