{"text": "Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.\nKangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.\nDear @iamsrk, when on a brief visit to Munnar yesterday I took rest in the room you occupied in 2013, which has been converted into a shrine for you & #ChennaiExpress! Every wall is decorated w/posters of the film &the suite is dominated by this cut-out of you. No place for rest! pic.twitter.com/hFUYCgXLEc — Shashi Tharoor (@ShashiTharoor) January 21, 2019\nTharoor took to his social media accounts to share this news and friends have gone berserk since then. He tweeted,\n“Jhansi aap bhi chahte hai aur mein bhi, fark sirf itna hai, aapko raj karna hai, aur mujhe apno ki seva.” Hrithik delivered the same in Ashutosh Gowariker’s film, “Antar hai Maham, tu Mohenjo Daro pe raaj karna chahta hai aur main seva.”\n1. Age is just a number - From Malaika to Sara - everyone works out religiously\nDon't Miss 862 SHARES 346 SHARES\nHe is perhaps one of the few actors who can blend in playing a second lead or a supporting role (like he did in Sanju) and also stand out playing a solo lead, as he did in Uri: The Surgical Strike.\nWhile we gushed over the #DeepVeer wedding pictures for months, we now have a fresh batch of pictures that will make you wish, you had a friend like Deepika on your wedding day too. Fashion designer Sabyasachi Mukherjee shared pictures from Deepika's friend Srila Rao's wedding who was also his client.", "title": "Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.", "date_publish": "22/01/2019, 18:31:41", "description": "Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deepika As A Bridesmaid & More From Ent.Kangana Takes A Dig At Hrithik Roshan Again, Check Out These Pics Of Deep", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-takes-a-dig-at-hrithik-roshan-again-check-out-these-pics-of-deepika-as-a-bridesmaid-more-from-ent-360879.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_1548162413_800x420.jpg"}