{"text": "Kangana Ranaut is basking success with her latest release Manikarnika. The queen once again proved she doesn’t need Khans or Kumars to make her film a smashing hit.\n#Manikarnika has an excellent weekend... Crosses ₹ 40 cr mark after a sluggish start [Day 1]... Kangana’s biggest opener... Delhi, NCR, UP, Punjab and Rajasthan have performed best... Fri 8.75 cr, Sat 18.10 cr, Sun 15.70 cr. Total: ₹ 42.55 cr. India biz. #Hindi #Tamil #Telugu — taran adarsh (@taran_adarsh) January 28, 2019\nTwitter\nHowever ever since Manikarnika has released, co-director of the film Raja Krishna Jagarlamudi has been claiming that he made the 70 percent of the film and that Kangana taking over as the first director in the film is totally unfair.\nTwitter\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nIn an interaction with Spotboye, Krish said, “I don’t think how Kangana can sleep well by taking the first credit in direction when she does not deserve it”. Krish has been alleging how he was removed from the film when demanded certain change.\nTwitter\nKangana, who is out of town, celebrating her success couldn’t respond to his allegations, but her support system and sister Rangoli Chandel came in her support and asked Krish to calm down, she took to twitter and wrote,\n“Chalo maan liya you directed the whole film now please calm down, still, Kangana is the leading face of the film let her enjoy this moment of her success and great appreciation, please leave her alone, we all believe you now please take a seat”.\nTwitter\nWe wonder if Krish will calm down or take strict action the queen of Bollywood.", "title": "Kangana Ranaut’s Sister Rangoli Lashes Out At Manikarnika's Co-Director Krish, Tells Him To Calm Down", "date_publish": "28/01/2019, 18:01:55", "description": "Kangana Ranaut is basking success with her latest release Manikarnika. The queen once again proved she doesn’t need Khan’s or Kumar’s to make her film a smashing hit. However ever since the Manikarnika has released, co-director of the film Raja Krishna Jagarlamudi has been claiming that he made the 70 percent of the film and Kangana taking the first director of the film is totally unfair.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-s-sister-rangoli-lashes-out-at-manikarnika-s-co-director-krish-tells-him-to-calm-down-361190.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_ranaut_1548679832_800x420.jpg"}