{"text": "Kangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo Daro\nKangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo Daro\nThis year all eyes are on Kangana Ranaut as her epic historical film, Manikarnika is all set to release this month. After a year long of waiting, the Bollywood actress is back with a spectacular performance on the silver screen.\nTwitter\nKnown for playing women oriented role, Manikarnika is no different. Based on the struggles of Rani Jhansi, Kangana has not only played the tough role but also co-directed the film.\nShe has been going all out to promote the film and the songs. At a recent press conference, the movie was compared to Hrithik Roshan's Mohenjo Daro. Infact, one of the dialogue from Manikarnika's trailer is eerily similar to that of Hrithik's film.\nDon't Miss 126 SHARES 336 SHARES 3.1 K SHARES 353 SHARES\n“Jhansi aap bhi chahte hai aur mein bhi, fark sirf itna hai, aapko raj karna hai, aur mujhe apno ki seva.” Hrithik delivered the same in Ashutosh Gowariker’s film, “Antar hai Maham, tu Mohenjo Daro pe raaj karna chahta hai aur main seva.”\nWhen asked about it, Kangana promptly said, “Who has seen that film? Let’s not even get there.\" Producer Kamal Jain also rubbished the claims saying that there can't be a copyright on one dialogue and also that line is a very general comment.\nIn case you don't know about Hrithik Roshan and Kangana's equation, then you have been living under a rock. Kangana had gone on record to say that Hrithik had proposed to her in 2014 and they were dating for 2 years. Hrithik Roshan, however, denied these rumours and said he only met her during the working of Krrish 2.\nMeanwhile, Manikarnika is slated to release on Jauary 25, 2019.", "title": "Kangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo Daro", "date_publish": "22/01/2019, 12:04:41", "description": "Kangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo DaroKangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo DaroKangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo DaroKangana Takes A Dig At Hrithik Roshan Again, Says Manikarnika Can't Be Compared To Mohenjo DaroKangana Takes A Dig", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-takes-a-dig-at-hrithik-roshan-again-says-manikarnika-can-t-be-compared-to-mohenjo-daro-360816.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_1548142440_800x420.jpg"}