{"text": "Kangana Ranaut is unstoppable. The diva is on a slamming spree. A lot of people in Bollywood have spoken openly about sexism and pay-disparity, but Kangana Ranaut was the only one who took names, even during the nepotism controversy.\nNow, attacking the entire film fraternity, Kangana Ranaut said that she’ll expose each and everyone. “Inki vaat laga dungi,” she said.\nShe had also lashed out at Alia Bhatt saying that she sent her the trailer of her movie Raazi and spoke to director Meghna Gulzar for half-an-hour. She said that all these stars including Alia call her at the screenings of their movies, which attends too, but they never show any support to her films.\nReplying to this, Alia Bhatt had stated that she would personally call her and apoligise.\n\"I hope she doesn't dislike me and I don't think she dislikes me. I don't think I have done anything intentionally to upset her. If I have, I will apologise to her on a personal level,\" she told PTI.\nAlso Read: Kangana Ranaut Attacks Bollywood Again, Says The Industry Never Takes A Stand For Her\nBut Kangana Ranaut feels the entire industry is ganging up against her. In a recent interaction with Pinkvilla, she revealed she called Alia Bhatt. Talking about her conversation, here’s what Alia Bhatt said:\n“I reached out to Alia and asked her what makes her think Manikarnika is my personal controversy, it’s a film whole nation is talking about and wondering why Bollywood is keeping quiet on such a relevant work...I suggested that she grows some spine and supports an important film about woman empowerment and nationalism...if she doesn’t have a voice of her own and her existence is all about being KJo's (Karan Johar) puppet then I don’t consider her successful...I told her if she is only focusing on earning bucks and not raise a voice, then her success has no value...,” she said.\nDon't Miss 126 SHARES 336 SHARES 247 SHARES 699 SHARES\nAlso Read: Kangana Ranaut Disses Bollywood Yet Again, Says Won’t Spare Anyone For Ganging Up Against Her", "title": "Kangana Ranaut Slams Alia Bhatt, Calls Her Karan Johar's Puppet & Tells Her To Grow A Spine", "date_publish": "08/02/2019, 18:14:35", "description": "Kangana Ranaut feels the entire industry is ganging up against her. She said she talked to Alia Bhatt and told her to grow a spine. \"if she doesn’t have a voice of her own and her existence is all about being KJo's (Karan Johar) puppet then I don’t consider her successful,\" she said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood/kangana-ranaut-slams-alia-bhatt-calls-her-karan-johar-s-puppet-tells-her-to-grow-a-spine-361809.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kangana_ranaut_slams_alia_bhatt_calls_her_karan_johars_puppet__tells_her_to_grow_a_spine_1549629032_800x420.jpg"}