{"text": "1. Kangana Ranaut Gives It Back To Karni Sena, Says She's A Rajput & Will Destroy Each One Of Them\n“Four historians have certified 'Manikarnika...'. We have got censor certificate as well. Karni Sena has been conveyed this but they are continuing to harass me. If they don't stop then they should know I am also a Rajput and I will destroy each one of them,” she was quoted as saying by IANS.\n2. Ranveer Singh Performing On ‘Mere Do Anmol Ratan’ For Rappers Divine & Naezy Will Crack You Up\nRanveer Singh took to social media to introduce his fans to his ‘Do Anmol Ratan’ AKA Divine and Naezy by performing the song, and the video, we are sure, will leave you in splits.\n3. Ranveer, Varun To Star In Reloaded Version Of ‘Andaz Apna Apna’ & We Have Some Mixed Feelings!\nGrapevine was buzz with rumour that Ranveer Singh and Varun Dhawan are likely to star in the film. People were worried if anyone would be able to do justice to the magic that Salman Khan and Aamir Khan had weaved in the original. Now it turns out, it is neither going to be a remake and nor a sequel, but a reloaded version of the film.\nDon't Miss 126 SHARES 185 SHARES 336 SHARES\n4. Giving In To Temptation, Malaika Arora Posts 20-Year-Old Pic For #10YearChallenge, Gets Trolled\nChaiyya Chaiyya girl Malaika Arora also took up the challenge recently. However, instead of posting a 10-year-old picture, she apparently posted a 20-year-old photo. As you may have expected, people were quick to notice it.\n5. Master Storyteller Of B-Town, Imtiaz Ali To Make A Film On The Love Story Of Radha & Krishna\n\"It was last year on the occasion of Janmashtami that Imtiaz Ali had announced the movie on Radha and Krishna. “I am definitely going to make it, but I want to make it on a huge scale and that's what I am thinking. I think it will take time to make it properly. It's a big film but at the same time, I feel that the purity also should come so, it will take time to go on and actually make Radha Krishna,” he said.", "title": "Kangana Gives It Back To Karni Sena, Ranveer Performs For Rappers Divine-Naezy & More From Ent", "date_publish": "18/01/2019, 19:17:51", "description": "“Four historians have certified 'Manikarnika...'. We have got censor certificate as well. Karni Sena has been conveyed this but they are continuing to harass me. If they don't stop then they should know I am also a Rajput and I will destroy each one of them,” she was quoted as saying by IANS.", "authors": [], "url": "https://www.indiatimes.com/entertainment/kangana-gives-it-back-to-karni-sena-ranveer-performs-for-rappers-divine-naezy-more-from-ent-360664.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_gives_it_back_to_karni_sena_ranveer_performs_for_rapper_divine__naezy__more_from_ent_1547814398_800x420.png"}