{"text": "Kangana Ranaut had taken an oath recently on picking up on everyone in Bollywood as according to her they all are ganging up against them. She had said, \"Main inke peeche padh jauangi, main inki watt laga duni\". And she is living by what she had promised to herself.\nTwitter\nJust recently, she lashed out at Ranbir Kapoor and Alia Bhatt once again, and the reason is she doesn't like them being called the young-age actors.\nTwitter\nWhile talking to Mid-day, she said,\n\"I do only that when I am rubbed the wrong way. And what is this thing of calling them young... Ranbir Kapoor is, what, 37 years old, young kid of the generation and Alia Bhatt just turned turned 27... my mother had three children at 27. This is absolutely unfair... bachche hai, ki dumb hai ki kya hai...\"\nTwitter\nDon't Miss 126 SHARES 336 SHARES 247 SHARES 699 SHARES\nWell, she didn't stop here, she picked on Ranbir once again for not sharing his views on any national topic. According to her, these star kids will happily talk about their sex lives but not about the country.\nTwitter\nFor the uninitiated, Kangana had slammed Alia for not appreciating her film Manikarnika, but wants her to applaud all her films. Alia was also asked about Kangana slamming her to which she said, \"I don't deserve this hatred, It was never my intention to hurt her and if I have ever, I will apologise to her\".\nTwitter\nWell, the actress is clearly making more enemies in Bollywood with her bold statements, but does she care? Not really!", "title": "Kangana Ranaut Targets Ranbir Kapoor & Alia Bhatt Once Again, Calls Them 'Dumb' This Time", "date_publish": "28/03/2019, 16:44:09", "description": "Kangana Ranaut had taken an oath recently on picking up on everyone in Bollywood as according to her they all are ganging up against them. She had said, \"Main inke peeche padh jauangi, main inki watt laga duni\". And she is living by what she had promised to herself.Just recently, she lashed out at Ranbir Kapoor and Alia Bhatt once again, and the reason is she doesn't like them being called the yo", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-targets-ranbir-kapoor-alia-bhatt-once-again-calls-them-dumb-this-time-364492.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_1553768584_800x420.jpg"}