{"text": "\"I'm planning a film on women warriors, and taking a trilogy forward. Manikarnika can be the first part and there can be one on Durgawati or Razia Sultan and there are so many of them.\"\nInternet, like always had too many feelings after watching the video. But the one that takes the cake is the Hum Saath Saath Hain spoof. Reacting to the real life jodis in the video, people commented that Suraj Barjatya did this before the Jonas brothers.\nSpielberg had last month taken a potshot at the streaming services by urging directors to make movies for the “big dark theatres”. He had previously said that films which debut on streaming services should compete for the Emmys instead of the Oscars.\n“I wanted to be charge of my narrative from the start. When you are a public figure, there are so many narratives out there. And suddenly you lose hold of that narrative very quickly. It becomes a different thing all together,” the actor said at the India Today Conclave 2019.\nDon't Miss 862 SHARES 126 SHARES\n“Karan mocked me on the IIFA stage and said that I am jobless and I am looking for jobs from him or something like that. I mean, look at my talent and look at your movies. I mean, really? He really called me jobless on some platform? I think some people need a dose of chyawanprash.”", "title": "Kangana Ranaut Slams KJo Again, Check Out Spoof Of Hum Saath Saath Hai & More From Ent.", "date_publish": "03/03/2019, 18:25:12", "description": "\"I'm planning a film on women warriors, and taking a trilogy forward. Manikarnika can be the first part and there can be one on Durgawati or Razia Sultan and there are so many of them.\"\"I'm planning a film on women warriors, and taking a trilogy forward. Manikarnika can be the first part and there can be one on Durgawati or Razia Sultan and there are so many of them.\"", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-slams-kjo-again-check-out-spoof-of-hum-saath-saath-hai-more-from-ent-363097.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_1551618222_800x420.jpeg"}