{"text": "1. After Kangana Ranaut Refuses To Apologise, Karni Sena Protests Outside Her House In Mumbai\n“I will not apologize to anybody. I have never apologized whenever I haven’t made a mistake. We have promised that we haven’t shown anything wrong about Rani Lakshmibai in the film so, they should support us. Rani Lakshmibai is not my relative and I feel she is daughter of the entire country so, we all should support the film. Shri Rajput Karni Sena should not play their ego card with me because I am not here to say sorry to anyone,” she was quoted as saying by IANS.\n2. The Winter Will Last Really Long! Runtime Of Game Of Thrones Season 8 Episodes Has Been Leaked\nAccording to reports, French TV channel Orange Cinéma Séries hosted a presentation to tease Game of Thrones season 8. The presentation accidentally leaked the runtime of each episode. The episodes won’t be as long as we thought they would be.\n3. Courteney & Lisa AKA Monica-Phoebe Went On A Lunch Date & It Proves They Are FRIENDS For Life!\nCourteney & Lisa AKA Monica-Phoebe Went On A Lunch Date & It Proves They Are FRIENDS For Life!\n4. All Set To Make His Reality TV Debut, Hockey Star Sandeep Singh Wants To Take Up Acting As Well\nDon't Miss 161 SHARES 126 SHARES\n\"Rannvijay Singha was of the view that I should have starred in Soorma and he feels that post Roadies there will be a lot of film offers for me. I love experimenting and doing new things in life and if things fall into place, I'm ready to take up acting too. I'm sure it will be a wonderful experience for me,\" Singh told IANS in an email interview.\nThe Los Angeles County District Attorney's Office earlier investigated claims that male minors were pressured into stripping naked for a shower scene in Apt Pupil but declined to press charges. Lawsuits filed by families of the minors involved were settled out of court.", "title": "Kangana Ranaut Refuses To Apologise, Runtime Of Game Of Thrones Season 8 Episodes Leaked & More From Ent", "date_publish": "24/01/2019, 18:15:24", "description": "From Kangana Ranaut and Karni Sena to Game of Thrones season 8, here is all that rocked the world of entertainment today. Winter is coming soon! Finally, we have a date – April 14 – when Game of Thrones season 8 will air. After a really long wait, the final season of the epic American fantasy series will reveal who sits on the Iron Throne and how it will all end. Who will die and who will survive", "authors": [], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-refuses-to-apologise-runtime-of-game-of-thrones-season-8-episodes-leaked-more-from-ent-360995.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_ranaut_refuses_to_apologise_runtime_of_game_of_thrones_season_8_episodes_leaked__more_from_1548331718_800x420.png"}