{"text": "Kangana Ranaut Shares Her Harassment Story, Amrita Rao Reveals She Was Replaced By A Star Kid And More From Ent.\nKangana Ranaut Shares Her Harassment Story, Amrita Rao Reveals She Was Replaced By A Star Kid And More From Ent.\nTwitter\nDuring a media interaction, Kangana opened up about her personal experience and shared her story of harassment by different actors. She further added that even though the harassment doesn't come under #MeToo and wasn't sexual in nature, her experience was daunting and humiliating.\nTwitter\n\"I remember I was given the narration and even confirmed that I was the heroine of the film and then suddenly I got to know some sugar daddy picked up the phone and his relative was replaced by me.\" Amrita Rao reveals this to Indiatimes in an exclusive conversation.\nTwitter Don't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n“I won’t say I am disappointed. I will need to understand (what went wrong). This is the story I wanted to say and I made it. After making Ranjhaanaa and Tanu Weds Manu and the second one, this film (Zero) was due for me to make... To take a certain flight and I have not landed on it properly. It is a learning and it will help me grow as a director. I am not afraid to take risks and experiment.\"\nTwitter\n“Hirani was on a journey to make a commercial film, and the numbers suggest that he has succeeded in doing so. As a film, I enjoyed it, but as a biopic I was a little disappointed”.\nSunny Leone has had a fantastic journey in Bollywood so far. She made her debut with reality show Bigg Boss and since then there has been no looking back. She came into the silver screen with Jism 2.", "title": "Kangana Ranaut Shares Her Harassment Story, Amrita Rao Reveals She Was Replaced By A Star Kid And More From Ent.", "date_publish": "21/01/2019, 18:25:54", "description": "1. Kangana Ranaut Shares Her Story Of 'Harassment' On Film Sets, Says People Had Ego Issues During a media interaction, Kangana opened up about her personal experience and shared her story of harassment by different actors. She further added that even though the harassment doesn't come under #MeToo and wasn't sexual in nature, her experience was daunting and humiliating.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-shares-her-harassment-story-amrita-rao-reveals-she-was-replaced-by-a-star-kid-and-more-from-ent-360800.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_1548076009_800x420.jpg"}