{"text": "Bollywood actress Kangana Ranaut is one of the most fierce and bold artist we have. She speaks her mind and definitely does not think about mincing her words. This is one of the main reasons why she had a tough time taking on Bollywood, especially last couple of years.\nTwitter\nWhether it was openly addressing the Hrithik Roshan relationship or calling Karan Johar the Bollywood mafia, Kangana did not get support from her fellow colleagues. But she continues to fight her battle single handedly. Yes, she also took up direction of her upcoming film, Manikarnika, after the director Krish walked out of the film mid-way.\nSpeaking to a leading daily, DNA, Kangana looks back at her past experiences and says, “People were trying to put me behind bars, can you believe that? They should make a film on my life also (laughs uncontrollably).”\nDon't Miss 862 SHARES 126 SHARES 346 SHARES\nShe added, “I have had a really horrible time and I hope it changes this year. My films weren’t working, cases were filed against me; it was going really downhill, till a point, it couldn’t go any further down. But you never know; life has a way of surprising you.”\nKangana spoke about how professionally also, things weren't looking up either, “At times I did feel cornered, especially after Simran’s failure. Script writer Apurva Asrani, filmmakers Ketan Mehta, Karan Johar and Rakesh Roshan and some others singled me out for criticism. The industry was having these intense meetings to make sure I was put in my place. Probably that was the only phase when I felt suffocated.”\nStarworld/Screengrab\nShe finally concluded by saying it was a terrible time of her life, \"Ketan went to the Economic Offences Wing (EOW), Aditya Pancholi filed a case and Rakesh Roshan continued to say he would ‘reveal’ something. However, all of this didn’t go anywhere. The EOW withdrew the case. Nothing came out of that propaganda they did. As for nepotism, Karan had to apologise.”\nFor uninitiated, Kangana Ranaut came on Koffee With Karan last season where she called Karan Johar the nepotism mafia. Karan kept taking a dig at her on various platforms and eventually apologised to her.\nIn Hrithik Roshan's case, Kangana opened up about dating him in 2017 on a TV show followed which Hrithik came out publicly too. The Roshans even filed an FIR and she was expected to surrender her devices which could prove Kangana's statement.\nIn Apurva Asrani case, Apurva co-wrote Simran with Kangana Ranuat in the titular role. The film was in the news for a controversy regarding sharing of writing credits between Kangana & Apurva.", "title": "Kangana Ranaut Admits She Felt Suffocated When Bollywood Stars KJo & Rakesh Roshan Singled Her Out", "date_publish": "15/01/2019, 16:19:13", "description": "Kangana Ranaut Admits She Felt Suffocated When Bollywood Stars KJo, Rakesh Roshan Singled Her OutKangana Ranaut Admits She Felt Suffocated When Bollywood Stars KJo, Rakesh Roshan Singled Her OutKangana Ranaut Admits She Felt Suffocated When Bollywood Stars KJo, Rakesh Roshan Singled Her OutKangana Ranaut Admits She Felt Suffocated When Bollywood Stars KJo, Rakesh Roshan Singled Her Out", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-admits-she-felt-suffocated-when-bollywood-stars-kjo-rakesh-roshan-singled-her-out-360456.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_1547551888_800x420.jpg"}