{"text": "Kangana Ranaut has been fighting her own battle in Bollywood since a very long time now. From nepotism controversy to the latest debate surrounding Manikarnika, she has often made some explosive statements leaving everyone in shock. This time, the diva has lashed out at Bollywood saying that no one takes a stand for her.\nCiting Alia Bhatt’s example and taking a jibe at her, she told Pinkvilla how people call her “shamelessly” and never comes back to support her work. She said after the release of Raazi, she spoke to Alia and Meghna Gulzar for half-an-hour.\n“These girls send me their trailers like Alia (Bhatt) sent me the trailer of Raazi and said, ‘Please watch it’. For me, it was not a Karan Johar film or Alia film, for me, it was a film on Sehmat Khan, the girl who has given her everything to the country,” she said.\nShe added that while earlier she would cancel shoots to attend the screening of their films, now she has stopped doing the same because it is getting too much. Kangana Ranaut starrer Manikarnika has minted about Rs 76 crores now, and it is getting mixed reviews from the audiences.\nDon't Miss 862 SHARES 126 SHARES 346 SHARES", "title": "Kangana Ranaut Attacks Bollywood Again, Says The Industry Never Takes A Stand For Her", "date_publish": "05/02/2019, 11:42:01", "description": "Kangana Ranaut has been fighting her own battle in Bollywood since a very long time now. This time, the diva has lashed out at Bollywood saying that no one takes a stand for her. Citing Alia Bhatt’s example and taking a jibe at her, she revealed how people call her “shamelessly” and never comes back to support her work.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-attacks-bollywood-again-says-the-industry-never-takes-a-stand-for-her-361596.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/taking_a_jibe_at_alia_bhatt_kangana_ranaut_says_bollywood_never_stands_up_for_her_1549347552_800x420.jpg"}