{"text": "Kangana Ranaut Targets Hrithik Roshan Once Again, Insists That No One Should Work With Him\nKangana Ranaut Targets Hrithik Roshan Once Again, Insists That No One Should Work With Him\nAs more and more sexual harassment allegations against people are cropping up in the wake of #MeToo movement, which has finally hit India harder, our hearts are breaking to read what these women have gone through keeping all these incidents to themselves as a secret for as long as 19 years.\nIt all started with Tanushree Dutta’s allegations against Nana Patekar, after which even actress Kangana Ranaut broke her silence and revealed her #MeToo story involving Queen director Vikas Bahl.\nAlso Read: After Tanushree Dutta, Kangana Ranaut Takes #MeToo Forward, Accuses ‘Queen’ Director Of Sexual Misconduct\nIn the wake of the #MeToo movement, Kangana Ranaut has recently targeted Hrithik Roshan once again. She wants the industry to not work with him.\n“Whatever is happening with Vikas Bahl is absolutely correct. Our industry still has a lot of people who don't behave well with women. They assault them, they harass them, they should also be punished”\n“People who keep their wives as trophies and keep young girls as their mistresses should also be punished,” she told Zee News in an interview.\nBCCL\nDon't Miss 193 SHARES 126 SHARES 336 SHARES 3.1 K SHARES\nAlso Read: Vikas Bahl Likely To Be Fired From 'Super 30' After Hrithik Roshan Hints He Won’t Work With Him\nWhen asked who she was talking about, Kangana Ranaut, said, “I am referring to Hrithik Roshan, people should not work with him as well.”\nKangana Ranaut and Hrithik Roshan, who were allegedly dating at one point of time, had a public fallout involving mudslinging and a slew of legal notices.", "title": "Kangana Ranaut Targets Hrithik Roshan Once Again, Insists That No One Should Work With Him", "date_publish": "11/10/2018, 15:21:43", "description": "In the wake of the #MeToo movement, Kangana Ranaut has recently targeted Hrithik Roshan once again. She wants the industry to not work with him. Kangana Ranaut and Hrithik Roshan, who were allegedly dating at one point of time, had a public fallout involving mudslinging and a slew of legal notices.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-targets-hrithik-roshan-once-again-insists-that-no-one-should-work-with-him-354599.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kangana_ranaut_targets_hrithik_roshan_once_again_insists_that_no_one_should_work_with_him_1539251908_800x420.jpg"}