{"text": "Kangana Ranaut Disses Bollywood Yet Again, Says Won’t Spare Anyone For Ganging Up Against Her!\nKangana Ranaut Disses Bollywood Yet Again, Says Won’t Spare Anyone For Ganging Up Against Her!\nKangana Ranaut might not have had as many hits as her contemporaries but she is hailed as the queen of Bollywood. Unlike others, she isn’t diplomatic. Seldom does she minces her words and prefers to speak her mind.\nJust recently, she had lashed out at Aamir Khan and Alia Bhatt for not supporting her film Manikarnika: The Queen of Jhansi. She said that she always goes for the screening of their films, but never receives any support. After this, Alia Bhatt even said that she will apologise to Kangana personally.\nNow, the diva said that the entire industry has ganged up against her for calling them out on nepotism.\nWhen asked about the lack of support she received, she said, “How will it benefit me? I've already won 3-4 national awards. At the age of 31, I am a filmmaker. Khud ko he promote kar le bohot badi baat hai (it would be a big deal if they can promote themselves).\n“Is Rani of Jhansi my aunt? She's as much mine as she's yours. Then why are these people scared? They are worried just because I spoke on nepotism? They have formed a gang: 'Why did she speak on nepotism?”\nYouTube\nDon't Miss 862 SHARES 126 SHARES\nShe thinks everyone has ganged up against her.\n“They have all gathered together, like a classroom where 59 have ganged up against one, trying to bully one. How will you feel if someone did that? Aren't they ashamed? Some of them are my grandfather's age. They are after me. Don't they feel ashamed that it's not about me. I don't even want to work with them and I've said that often,\" she said.”\nTwitter\nBut she won’t spare anyone.\n“What Bollywood is doing, the planning and plotting, one thing is for sure, earlier I used to call them out for sexism, nepotism or pay disparity, but now I'll be after them. 'Inki vaat laga dugi'. I'll expose each and every one. They have asked for trouble by ganging up against me.”\nAlso Read: Kangana Ranaut Attacks Bollywood Again, Says The Industry Never Takes A Stand For Her", "title": "Kangana Ranaut Disses Bollywood Yet Again, Says Won’t Spare Anyone For Ganging Up Against Her!", "date_publish": "08/02/2019, 12:45:02", "description": "Kangana Ranaut had lashed out at Aamir Khan and Alia Bhatt for not supporting her film Manikarnika: The Queen of Jhansi. She said that always goes at the screening of their films, but never receives any support. After this, Alia Bhatt even said that she will apologise to Kangana personally.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-disses-bollywood-yet-again-says-won-t-spare-anyone-for-ganging-up-against-her-361785.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kangana_ranaut_disses_bollywood_yet_again_says_wont_spare_anyone_for_ganging_up_against_her_1549614419_800x420.jpg"}