{"text": "Happy to have bagged this opportunity, Kangana Ranaut said, “Jayalalithaaji is one of the biggest female success stories of this century. She was a superstar and went on to become an iconic politician, it’s a great concept for a mainstream film. I am honoured to be a part of this mega project.”\n2. Tyrion Lannister’s Look-Alike Rozi Khan Has Never Heard Of GoT But Hopes To Meet The Man Who Made Him Famous\nThe man named Rozi Khan is a waiter by profession. He had never heard about the show Game of Thrones and its popularity. He didn’t even know he looked like an actor from the show, Peter Dinklage. He got to know about it when he was working at the restaurant and people asked if they could get clicked with him.\n3. Priyanka Chopra Shares Her Bedroom Secrets, Admits To FaceTime Sex & Sexting With Husband Nick\nDon't Miss 837 SHARES 126 SHARES 2.4 K SHARES\nShe appeared on Watch What Happens Live when she made the confession. When host Andy Cohen asked her if she believes in sexting or FaceTime sex during long stints apart, she replied, “for sure.”\n4. From Posing With SRK To Calling Him A 'Legend', DJ Snake Fanboying Over King Khan Is All Of Us!\nWhen Shah Rukh Khan spreads his arms, we are all left swooning, right? His charismatic personality can charm almost everyone, including DJ Snake, who got clicked with him in the Indian pose of Namaste. As he shared the picture online, he captioned it as “Legend”.\n5. On Their 88th Anniversary Of Martyrdom, Celebs Pay Tribute To Bhagat Singh, Rajguru & Sukhdev\nOn March 23, 1931, three bravehearts of the nation Bhagat Singh, Rajguru and Sukhdev sacrificed their lives fighting for the freedom of India from the colonial rulers. They were hanged to death by the British Police Officer John Saunders. As people celebrate the Shaheed Day today, they remember and pay tribute to the martyrs and make sure that their sacrifice doesn’t go unnoticed.", "title": "Kangana To Play Jayalalithaa, Tyrion Lannister’s Look-Alike Found In Pakistan & More From Ent", "date_publish": "23/03/2019, 18:22:00", "description": "From Kangana Ranaut playing Jayalalithaa in the biopic to Peter Dinklage AKA Tyrion Lannister’s look-alike being found in Pakistan, here’s all that rocked the world of entertainment today. The man named Rozi Khan is a waiter by profession. He had never heard about the show Game of Thrones and its popularity. He didn’t even know he looked like an actor from the show, Peter Dinklage. He got to know", "authors": [], "url": "https://www.indiatimes.com/entertainment/kangana-to-play-jayalalithaa-tyrion-lannister-s-look-alike-found-in-pakistan-more-from-ent-364199.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_to_play_jayalalithaa_tyrion_lannisters_lookalike_found_in_pakistan__more_from_ent_1553344775_800x420.png"}