{"text": "“Spare me this embarrassment, please,” says Kangana Ranaut when compared to Alia Bhatt.\nTwitter\nWell, recently an entertainment website did a poll where Kangana defeated Alia Bhatt to be the best performer of the year, when she was contacted for the same, she said,\n“I am embarrassed. What is there to beat in Gully Boy performance, same snappy muh phat girl. Bollywood’s idea of a fiery girl, woman empowerment and good acting, spare me this embarrassment, please. Media have taken filmy kids love too far. Stop pampering mediocre work or else bar will never be raised”.\nTwitter\nThe queen of Bollywood clearly is in no mood to settle down with them, just recently the Manikarnika actress had targeted Alia by calling her a puppet of Karan Johar and asked her to grow some spine. She was mighty upset with Alia for not supporting her film, “I reached out to Alia and asked her what makes her think Manikarnika is my personal controversy, it’s a film whole nation is talking about and wondering why Bollywood is keeping quiet on such a relevant work .I asked her if I can be courteous and gracious to acknowledge her requests for encouraging relevant work that she does, why is she so scared to see my film”.\nTwitter\nDon't Miss 126 SHARES 336 SHARES 247 SHARES 699 SHARES\nShe didn’t stop here, “I suggested that she grows some spine and support an important film about woman empowerment and nationalism, if she doesn’t have a voice of her own and her existence is all about being KJo (Karan Johar) puppet then I don’t consider her successful, I told her if she is only focusing on earning bucks and not raise a voice, then her success has no value, hope she understands the true meaning of success and her responsibilities, Napo gang life is simply restricted to give and take favours hope she rises above that”.\nTwitter\nHowever, when Alia was asked about Kangana being upset with her, she acknowledged it and said she will apologise to her, “I hope she doesn’t dislike me and I don’t think she dislikes me. I don’t think I have done anything intentionally to upset her. If I have, I will apologise to her on a personal level”.\nKangana Ranaut is an outspoken actress and by far the entire Bollywood and her followers know, but she doesn’t give her damn as she has sworn to live her life on her terms.\nTwitter\nOn the professional front, Kangana will be next seen in Mental Hai Kya, Panga and Jayalalitha’s biopic.", "title": "Kangana Ranaut Attacks Alia Bhatt Once Again, Calls Her Performance In 'Gully Boy' Mediocre", "date_publish": "11/04/2019, 17:15:14", "description": "Well, recently an entertainment website did a poll where Kangana defeated Alia Bhatt to be the best performer of the year, when she was contacted for the same, she said, “I am embarrassed. What is there to beat in Gully Boy performance, same snappy muh phat girl. Bollywood’s idea of a fiery girl, woman empowerment and good acting, spare me this embarrassment, please. Media have taken filmy kids l", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-attacks-alia-bhatt-once-again-calls-her-performance-in-gully-boy-mediocre-365282.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kangana_ranaut_1554981225_800x420.jpg"}