{"text": "Kangana Ranaut Confirms Tanu Weds Manu 3 And We Just Can't Contain Our Excitement!\nKangana Ranaut Confirms Tanu Weds Manu 3 And We Just Can't Contain Our Excitement!\nKangana Ranaut and R Madhavan's Tanu Weds Manu franchise is one of the most successful franchises in Bollywood. Both the films didn't just leave the audience in splits but they left the audience wanting for more.\nThe collaboration has been super successful and for all those who have been eagerly waiting for the third part, there's good news.\nIn a recent media interaction, Kangana Ranaut confirmed that the third part of the film is indeed on its way and Anand L Rai will make an official announcement soon.\nAnand L Rai Films\nConsidering how both the parts had the same ensemble cast, we are just hoping that nothing changes in the third part.\nAnand L Rai Films\nFrom Pappiji to Raja Awasthi, there are some of the most iconic characters in the films that definitely make the franchise what it actually is.\nAnand L Rai Films\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nJust to jog you down the memory lane, here are a few iconic dialogues from Tanu Weds Manu Returns that will make you all excited for the third part.\n#1\n#2\n#3\n#4\n5.", "title": "Kangana Ranaut Confirms Tanu Weds Manu 3 And We Just Can't Contain Our Excitement!", "date_publish": "21/01/2019, 13:10:37", "description": "Kangana Ranaut and R Madhavan's Tanu Weds Manu franchise is one of the most successful franchises in Bollywood. Both the films didn't just leave the audience in splits but they left the audience wanting for more. The collaboration has been super successful and for all those who have been eagerly waiting for the third part, there's good news.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-confirms-tanu-weds-manu-3-and-we-just-can-t-contain-our-excitement-360771.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_ranaut_1548056551_800x420.jpg"}