{"text": "It won't be wrong to say that Kangana Ranaut is the Queen of controversies. The actress is all geared up for the release of her upcoming film, Manikarnika, that is based on the life of Rani Laxmi Bai.\nDuring a media interaction, Kangana opened up about her personal experience and shared her story of harassment by different actors. She further added that even though the harassment doesn't come under #MeToo and wasn't sexual in nature, her experience was daunting and humiliating.\nTalking to PTI, Kangana added, \"Harassment happens on many levels. So many times on sets, I wasn't sexually harassed, but some people had ego issues. I was harassed on many other fronts. It wouldn't come under #MeToo but it was still harassment.\"\nRecalling one of the most traumatic experiences of her life, she added,\n\"Making me wait on set for six hours, willingly giving me wrong call time to make me stand, always giving me the wrong set of dates so I'm missing out on opportunities and then cancelling the schedule last minute by these heroes.\"\nPeople had even ganged up against her. She added,\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n\"Ganging up on me and not inviting me to film events, launching trailers without me and then someone else dubbed for me without even telling me, which is violating the basic right of taking permission from an actor.\"\nTalking about the #MeToo, Kangana added,\n\"People are scared, obviously and they should be. Men are scared in the industry. This isn't going to stop. This will continue till we really go into the root cause of it because essentially it's a patriarchal society which is extremely chauvinistic. We need to come to a point where they are scared. All the talks of 'what if women lose work' should stop. I believe there's no life without dignity. You shouldn't worry about raising your voice.\"", "title": "Kangana Ranaut Shares Her Story Of 'Harassment' On Film Sets, Says People Had Ego Issues", "date_publish": "21/01/2019, 17:00:26", "description": "During a media interaction, Kangana opened up about her personal experience and shared her story of harassment by different actors. She further added that even though the harassment doesn't come under #MeToo and wasn't sexual in nature, her experience was daunting and humiliating.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-shares-her-story-of-harassment-on-film-sets-says-people-had-ego-issues-360789.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_1548074037_800x420.jpg"}