{"text": "Kangana Ranaut Reacts To Rani Mukerji's Views On #MeToo, Says People In Need Of Support Should Be Empowered\nKangana Ranaut Reacts To Rani Mukerji's Views On #MeToo, Says People In Need Of Support Should Be Empowered\nA feminist that Kangana Ranaut is, she has always expressed herself without a fear in the world. Be it talking about her alleged sexual harassment or nepotism, Kangana believes in standing up for what she believes in.\nHer upcoming film Manikarnika, where she plays the role of Rani Laxmibai looks like an extension of her real-life avatar. And now, Kangana was present at an event where she was asked to comment on Rani Mukerji's comments on #MeToo.\nThe actress landed herself in trouble when her views on #MeToo at Rajeev Masand's roundtable came across as regressive. She had said,\nScreengrab\n“I think as a woman you have to be that powerful within yourself, you have to believe that you’re so powerful that if you ever come into a situation like that you have the courage to say ‘back off.’ I think you have to have the courage to be able to protect yourself. You have to take responsibility for your own self.”\nTalking to Times Now, Kangana Ranaut reacted to this and said,\nScreengrab\n“People who need support, who need to be empowered, we must empower but if our society can produce a woman like Rani Laxmi Bai, then why not, they must not be discouraged. If they are strong women, we should not discourage women. I was 16-years-old when I filed my first FIR against sexual assault so there are people who can stand up for themselves, they shouldn’t be discouraged.”\nDon't Miss 155 SHARES 1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nRanaut is gearing up for the release of her film and is looking forward to directing more films in the future.", "title": "Rani Mukerji Roundtable:Kangana Reacts To Rani's Views On #MeToo, Says People In Need Of Support Should Be Empowered", "date_publish": "03/01/2019, 12:09:28", "description": "Rani Mukerji, #MeToo movement, Rani Mukerji Round Table Rajeev Masand, Rani Mukerji Trolled, Kangana ReactsRani Mukerji, #MeToo movement, Rani Mukerji Round Table Rajeev Masand, Rani Mukerji Trolled, Kangana ReactsRani Mukerji, #MeToo movement, Rani Mukerji Round Table Rajeev Masand, Rani Mukerji Trolled, Kangana Reacts", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-ranaut-reacts-to-rani-mukerji-s-views-on-metoo-says-people-in-need-of-support-should-be-empowered-359745.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rani_mukerji_1546497084_800x420.jpg"}