{"text": "While speaking to Good Morning America, he said, “In this next one, ha — everybody dies!” He was almost about to say “half” the Avengers die but realised he is giving away a major spoiler and stopped. Meanwhile, Don Cheadle’s panicked. Take a look (at around 2:16 in the clip below).\n“I am embarrassed. What is there to beat in Gully Boy performance, same snappy muh phat girl. Bollywood’s idea of a fiery girl, woman empowerment and good acting, spare me this embarrassment, please. Media have taken filmy kids love too far. Stop pampering mediocre work or else bar will never be raised”.\nWell, now Vivek should take a breather as Swara and Renuka have come out and reacted on the stay of the film. Swara was asked about her opinion on the EC’s ban on the film, she said, “Same rules should apply to everyone is my only reaction to anything the EC does or says”.\nThe movie journeys to the African savanna where a future king must overcome betrayal and tragedy to assume his rightful place on Pride Rock. Most people are looking forward to the movie thanks to Simba's adorable looks but some are extremely disappointed with the way Scar has been portrayed on-screen. From calling him malnutritioned to massacred, Internet is upset with the look of the Lion. Before you check out the comments, watch the trailer and decide.\nDon't Miss 862 SHARES 346 SHARES\nAccording to a report on News 18, a complaint has been filed against Sara Ali Khan. In a statement, Delhi Police have said that necessary action will be taken against the actress under the Motor Vehicles Act after facts pertaining to the incident are received, perused and verified.", "title": "Kangana Lashes Out At Alia Again, Renuka Shahane Backs Vivek's PM Modi Biopic & More From Ent", "date_publish": "11/04/2019, 18:12:08", "description": "While speaking to Good Morning America, he said, “In this next one, ha — everybody dies!” He was almost about to say “half” the Avengers die but realised he is giving away a major spoiler and stopped. Meanwhile, Don Cheadle’s panicked. Take a look (at around 2:16 in the clip below).While speaking to Good Morning America, he said, “In this next one, ha — everybody dies!” He was almost about to say", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-lashes-out-at-alia-again-renuka-shahane-backs-vivek-s-pm-modi-biopic-more-from-ent-365293.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bollywood_1554986289_800x420.jpg"}