{"text": "“These girls send me their trailers like Alia (Bhatt) sent me the trailer of Raazi and said, ‘Please watch it’. For me, it was not a Karan Johar film or Alia film, for me, it was a film on Sehmat Khan, the girl who has given her everything to the country,” she said.\n“I was this crazy, insecure pregnant person when Vicky Donor happened and that was the worst phase for the both of us. I think both of us were very immature. I’m sure he didn’t have the maturity to kind of hold my hand and tell me it’s okay, especially, when I am crazy or my hormones because I was pregnant at the time and I also didn’t have the maturity to just take it easy and say that this thing will get over.”\n“What do I say to this? I don’t wake up as early as him.” While Akshay is known for waking up early and managing his schedules with precision, Shah Rukh prefers to work late at night.\nYou would be lying if you say that you never really found a fine actor in him. If you still have doubts, don’t you remember his performance in Mani Ratnam’s Yuva, a film in which he played such an intense role with so much ease? He even won a Screen Award for Best Supporting Actor.\nNot many know that the film has also broken Baahubali’s record on Day 23 and Day 24. While Baahubali collected Rs 6.35 crore on day 23 and Rs 7.8 crore on day 24, Uri managed to earn Rs 6.53 crore on day 23 and Rs 8.71 crore on day 24.\nDon't Miss 862 SHARES 346 SHARES", "title": "Kangana Attacks Bollywood Again, Here's Why Abhishek Bachchan Is The Actor & More From Ent.", "date_publish": "05/02/2019, 17:12:50", "description": "Kangana Attacks Bollywood Again, Here's Why Abhishek Bachchan Is The Actor & More From Ent.Kangana Attacks Bollywood Again, Here's Why Abhishek Bachchan Is The Actor & More From Ent.Kangana Attacks Bollywood Again, Here's Why Abhishek Bachchan Is The Actor & More From Ent.Kangana Attacks Bollywood Again, Here's Why Abhishek Bachchan Is The Actor & More From Ent.Kangana Attacks Bollywood Again, Her", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kangana-attacks-bollywood-again-here-s-why-abhishek-bachchan-is-the-actor-more-from-ent-361638.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1549367427_800x420.jpg"}