{"text": "Today’s day is dedicated to Deepika Padukone and for all right reasons. The actress released her first look form Chhapaak where she plays the acid attack survivor Lakshmi Agarwal aka Malti. The first look of DP blew everyone’s mind as her resemblance was uncanny.\nEver since the first look is out, everyone is lauding Deepika for taking up such a courageous role. Infact, the actress too mentioned that this character will stay with her for life. Right from her fans to Bollywood celebs, everyone is going gaga over her look.\nThis is brilliant. Can’t wait to see you as #Malti. It’s path breaking. More power to you Deepika. ❤️🤗 https://t.co/Shu5QqoVSP — Rajkummar Rao (@RajkummarRao) March 25, 2019\nDon't Miss 126 SHARES 336 SHARES 460 SHARES 1.7 K SHARES\nBeautiful. @deepikapadukone @meghnagulzar & the entire team deserve to be given credit for this remarkably accurate visual portrayal. https://t.co/LCUg6SfU9m — Arjun Kapoor (@arjunk26) March 25, 2019\nBut the biggest cheerleader for her Chhapaak look is Kangana Ranaut’s sister Rangoli. The actress sister shared her review on DP’s look, she wrote, “No matter how unfair and unjust the world is we musn’t reflect what we hate, this is commendable on @deepikapadukone and @meghnagulzar part, being an acid attack survivor I pledge to be their biggest cheerleader #Chhapaak”.\nNo matter how unfair and unjust the world is we musn’t reflect what we hate, this is commendable on @deepikapadukone and @meghnagulzar part, being an acid attack survivor I pledge to be their biggest cheerleader #Chhapaak 👏🏻👏🏻👏🏻👏🏻 https://t.co/TdY5WpZjtE — Rangoli Chandel (@Rangoli_A) March 25, 2019\nKangana's sister and manager, Rangoli is an acid attack survivor and it’s so courageous from her side too that she is living her life like a boss today. Deepika's project has obviously found a special place in every acid survivor attacker’s hearts as they will connect with it. So more power to these survivors. And we just hope the hatred just ends in this world and we all live in peace and harmony.\nComing back to Deepika’s Chhapaak look, she has just left us mesmerized and how. Do post your comments below on how much you liked DP’s this outstanding first look from Chhapaak.", "title": "Kangana Ranaut's Sister Rangoli Showers Praises On Deepika Padukone's First Look From Chhapaak", "date_publish": "25/03/2019, 16:01:40", "description": "Today’s day is dedicated to Deepika Padukone and for all right reason. The actress released her first look form Chhapaak where she plays the acid attack survivor Lakshmi Agarwal. The first look of DP blew everyone’s mind as her resemblance was uncanny. Ever since the first look is out everyone is lauding Deepika for taking up such a courageous role, in fact, the actress too mentioned that this cha", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kangana-ranaut-s-sister-rangoli-showers-praises-on-deepika-padukone-s-first-look-from-chhapaak-364267.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/deepika_padukone_1553510594_800x420.jpg"}