{"text": "1. Baby Doll Singer Kanika Reveals People Called Her A Sh** Performer Earlier, Accepts She Was Bad\n“Now I am not only a playback singer but also a performing artiste. But at the beginning of my career, people said on my face that I am a 'sh** performer',” she said adding that she didn’t make it an ego issue.\n2. Rajkummar Rao Feels The Era Of Superstardom That SRK, Salman & Aamir Enjoyed Isn't Coming Back\n\"They are superstars for some reason and we all love them. I am myself a fan of Khans. We should not compare. We are very new and we have a long way to prove ourselves. I don't think the kind of superstardom that these superstars have seen will ever come back again,\" Rajkummar Rao told PTI.\n3. Nick Jonas Jokes About Hosting Several Wedding Receptions, Says He's Walking Into 100047th One\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nWhen Nick Jonas and Priyanka Chopra attended Learning Lab Ventures 2019 Gala at Beverly Hills Hotel recently, he joked about it while posting a photo on Instagram and wrote, “Walking into wedding reception 100047 like…”\n4. After Anushka Travels With Virat To New Zealand, BCCI Calls Touring With Families A ‘Headache’\n“If the team is travelling with less number of members, it is easier to manage. It's easy for BCCI staff to make off-field arrangements. Right from booking tickets to rooms, the entire management of handling the arrangement is with BCCI,” a source close to BCCI told TOI.\n5. Kit Harington Told Wife Rose Leslie The Ending Of Game Of Thrones Season 8 & She Didn’t Talk To Him For 3 Days\n“I told my wife last year how it ended, and she wouldn't talk to me for about three days. And she'd asked!,” he said at a UK based radio show, as quoted by Entertainment Weekly.", "title": "Kanika Kapoor Was Called A Sh** Performer, Rajkummar Rao On Era Of Superstardom & More From Ent", "date_publish": "02/02/2019, 18:43:47", "description": "Singing was her passion, but life had different plans for Kanika Kapoor, the singer who is known for her chartbusters like Baby Doll and Chittiyan kalaiyaan among others. After she married NRI businessman at the age of 18 in 1997, she moved to London where she spent her days as a homemaker until one day when Meet Bros, her Rakhi brothers whom she has known since childhood, called her for an opport", "authors": [], "url": "https://www.indiatimes.com/entertainment/kanika-kapoor-was-called-a-sh-performer-rajkummar-rao-on-era-of-superstardom-more-from-ent-361483.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kanika_kapoor_was_called_a_sh_performer_rajkummar_rao_on_era_of_superstardom__more_from_ent_1549111968_800x420.png"}