{"text": "Kapil Sharma Gets Candid About His Failures, Admits That He Talks Nonsense & Needs To Mature\nKapil Sharma Gets Candid About His Failures, Admits That He Talks Nonsense & Needs To Mature\nKapil Sharma’s name would definitely go down in history. He tried his luck in the industry as a singer but became the most popular comedian instead. Venturing into the world of showbiz with a comedy talent hunt show, he swiftly climbed the ladder of success to having his own comedy show on Indian television.\nTwitter\nBut then, the downfall began. Kapil Sharma has always been the centre of controversies since then. His alcohol problem, tiff with Sunil Grover and other comedians on his show and always coming late to shoot keeping the celebs waiting at times – Kapil Sharma went through a lot of trouble in the recent past, which reportedly includes going to the rehab as well.\nTwitter\nBut Kapil Sharma says he has learnt a lot from his failures. “I talk straight from my heart. I am bit cautious now. There is a responsibility as a celebrity and I feel I need to mature and not talk nonsense (faltu)”.\nInstagram\n“You learn a lot from failure. I also learnt a lot during this phase and I would try not to repeat it again. I am thankful to those who stood by me.”\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHe accepted the fact that he now shies away from the media and isn’t easily accessible to them. “I am afraid of something. Today negativity sells more. There is not much authenticity when it comes to publishing news. I am accessible to some and not to some.”\nKapil Sharma says he needs to stop talking nonsense, but isn't this nonsense that his fans mostly find funny?\nAlso Read: In An Epic Episode Of The Kapil Sharma Show, Kapil Dev To Appear Along With 1983 Cricket World Cup Winning Team\nWith inputs from PTI", "title": "Kapil Sharma Gets Candid About His Failures, Admits That He Talks Nonsense & Needs To Mature", "date_publish": "16/03/2019, 11:48:58", "description": "Kapil Sharma thinks he needs to mature and not talk nonsense. He thinks he needs to mature and not talk nonsense. Kapil Sharma’s name would definitely go down in the history. He tried his luck in the industry as a singer but became the most popular comedian instead. Venturing into the world of showbiz with a comedy talent hunt show, he swiftly climbed the ladder of success to having his own comedy", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kapil-sharma-gets-candid-about-his-failures-admits-that-he-talks-nonsense-needs-to-mature-363796.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/as_kapil_sharma_talks_about_his_failures_he_admits_that_he_talks_nonsense__needs_to_mature_1552716237_800x420.jpg"}