{"text": "Weddings might be one of the most lavish and expensive affairs in India but a good change we got to see in 2018 was how couples went ahead with smarter choices.\nWhile some chose to make their weddings as environmentally friendly as possible, a few focused on the minimization of food-wastage at weddings.\nJust to jog your memory a little, when Sonam Kapoor married Anand Ahuja, the couple opted for an e-invite as they wanted to make an environment-friendly choice by reducing the wastage of paper.\nFollowing suit, were model-actor Milind Soman and his girlfriend and now wife, Ankita. The couple planted a sapling for every guest who attended the wedding and proved how their heart was at the right place.\nLast year, in 2017, Anushka Sharma and cricketer Virat Kohli too proved that they are self-aware individuals and they made a smarter choice by gifting a sapling with their wedding invitations to the guests.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThis year, Deepika Padukone and Ranveer Singh also requested their wedding guests to donate and not extend any monetary or other gifts to them. A source was quoted in Mid-day saying,\n\"The bride and groom have requested the guests to not shower them with gifts. If they wish to give them anything, they've requested that donations be made to Deepika's foundation that actively works towards creating awareness and removing the stigma around depression. Both Ranveer and Deepika are deeply committed to the cause and want to involve all their guests in the good deed.\"\nAnd now, Kapil Sharma is making headlines and thankfully for all the right reasons. A press release by Kapil Sharma's team states that when the NGO got to know about Kapil's wedding, the officials approached him as they knew it would be a big fat Punjabi wedding and there will not only be a lavish spread of food but also in excess quantity. The source was quoted as saying,\nAgencies\n\"When they told Kapil about their cause, he said yes without thinking twice. He told them to take the food from all his functions including the reception in Amritsar and distribute it.\"\nEvery little step we take today counts as it might just be a drop in the ocean but this definitely means we are heading in the right direction!", "title": "Kapil Sharma Donates Leftover Food From His Wedding, Wins Hearts With This Kind Gesture", "date_publish": "18/12/2018, 14:01:18", "description": "And now, Kapil Sharma is making headlines and thankfully for all the right reasons. A press release by Kapil Sharma's team states that when the NGO got to know about Kapil's wedding, the officials approached him as they knew it would be a big fat Punjabi wedding and there will not only be a lavish spread of food but also in excess quantity.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kapil-sharma-donates-leftover-food-from-his-wedding-wins-hearts-with-this-kind-gesture-358818.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/kapil_sharma_1545119511_800x420.jpg"}