{"text": "Karan Johar Expresses His Desire To Break The Mould, Wants To Direct A Homosexual Love Story Next\nKaran Johar Expresses His Desire To Break The Mould, Wants To Direct A Homosexual Love Story Next\nWe are in 2019 and the kind of films Bollywood is offering us, it surely deserves appreciation.\nBe it compelling biopics or making homosexual love stories, film directors are open to experimentation and taking up bigger risks and challenges. Bollywood producer and director Karan Johar expressed his desire of taking up a project to direct the unconventional tale of love between a gay couple.\nJohar was speaking at the World Economic Forum in Davos, where he expressed his desire to create a homosexual love story that comes from the heart. He said that his idea of ‘heartfelt gay romance’ would feature two lead actors who as of now remain undecided. He said,\n“Being a leading filmmaker, I can make movies on the subject. I would love to make a homosexual love story and would want to cast two leading actors in the film. I don’t have in mind specific names of the actors I want to cast in the film, but I surely want to make such a film.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nEarlier, KJo had made Dostana featuring John Abraham, Bobby Deol, Priyanka Chopra and Abhishek Bachchan that revolved around a funny story of three friends.\nDharma\nEven though the film touched the topic of homosexuality, it was used in the context of adding funny take which ended up losing its subjective importance. Let's see how KJo redeems himself and take this challenge up.", "title": "Karan Johar Expresses His Desire To Break The Mould, Wants To Direct A Homosexual Love Story Next", "date_publish": "27/01/2019, 13:51:33", "description": "Be it compelling biopics or making homosexual love stories, film directors are open to experimentation and taking up bigger risks and challenges. Bollywood producer and director Karan Johar expressed his desire of taking up a project to direct the unconventional tale of love between a gay couple.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/karan-johar-expresses-his-desire-to-break-the-mould-wants-to-direct-a-homosexual-love-story-next-361118.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/karan_johar_1548578315_800x420.jpg"}