{"text": "Bigg Boss 12 has reached its mid season and now the show is picking up with intense tasks, fights between contestants and Weekend Ka Vaar. Despite the pressure, celebrity contestants Dipika Kakar, Srishti Rode and Karanvir Bohra try and stick together during the show.\nScreengrab\nHowever, not everyone is pleased with Karanvir's captaincy and how he won it during the bowl task inside the show. While Dipika was called an unfair sanchalak, some called it KV's game plan. But many outside the house have come out in support of Karanvir realising that during the Weekend Ka Vaar, the celebrity contestant is ridiculed by the host Salman Khan, not once but multiple times.\nInstagram/Teejay Sindhu\nAnd it certainly hasn't gone down well with Karanvir's wife Teejay Sindhu. The TV actress and mother of two has written an open letter after watching the latest episode of Bigg Boss 12.\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 12.5 K SHARES\nIt is out of concern, and with the utmost respect that I write to you.. I needed to share with you how deeply hurt I am by the way #KaranvirBohra is being treated in BiggBoss... @ColorsTV @endemolshineind #BiggBoss12 #BB12 #KaranvirBohra #KVB #TeamKVB #KVBarmy pic.twitter.com/lpCSMRSZ2D — Teejay Sidhu (@bombaysunshine) November 12, 2018\nShe's not happy with the way KV is constantly made fun of, whether it's his choice of clothes, hair and looks. She has lashed out at the makers and and even apologized if KV has done something wrong to deserve this.\nTwitter/Teejay Sindu\nTaking an instance from this Weekend Ka Vaar, Teejay mentioned how Salman Khan taunted Karanvir saying there's no fizz left in him. Salman has apparently hurt not only Teejay but celebs from the TV fraternity as well.\nTwitter/Teejay Sindu\nNow TV celebs and Karanvir's fans have come together on social media in support of Teejay and KV. While some want Bigg Boss shut, some want Salman to be kinder to Karanvir. Take a look\nHey @KVBohra giving u lots of strength to be a fighter inside.this game #BB12 #BIGGBOSS12 ain’t easy at all but since u r in it fight till the end. — Arjun Bijlani (@Thearjunbijlani) November 13, 2018\nI hope tv industries should come to oppose big boss what they are doing with kv after all big boss maker use tv personality to run there show #BiggBoss12 #BB12 — RK FAN (@durgoo87) November 13, 2018\nWe have seen him getting trolled & bullied on Social Media & #WeekendKaVaar!\nbut let's also focus on his attributes & traits which teach us a lesson or two!\n\"THE TRUE GENTLEMEN #KaranvirBohra \"\nFrom @realakashbhaipic.twitter.com/TrsRCabUEF — The Khabri (@TheKhbri) November 11, 2018\n@KVBohra is one fine human being.. Amongst the sweetest I've met.. He should not only win the 'muqabla', he should win the show!!!@ColorsTV #BiggBoss12 https://t.co/p7BeTBxJ1v — Ashish Chowdhry (@AshishChowdhry) November 11, 2018\nSalman Khan is so mean to @KVBohra 😡 and only him . donno why ??? Hated his nasty comment on fizz #BigBoss12 — Simple kaul (@simplekaulpics) November 11, 2018\nWhy is @KVBohra targeted for everything .. poor guy gets questioned for the tiniest things and is ridiculed .. #notfair @BiggBoss #BiggBoss12 — Nigaar Z. Khan (@NigaarZKhan) November 10, 2018\nIf these are Bigg Boss' ways to spice up the show, then we really think they can do better than this.", "title": "Karanvir's Wife Teejay Writes An Open Letter To Bigg Boss Makers, Says He's Ridiculed Every Weekend", "date_publish": "13/11/2018, 13:57:16", "description": "Bigg Boss 12 has reached its mid season and now the show is picking up with intense tasks, fights between contestants and Weekend Ka Vaar. Despite the pressure, celebrity contestants Dipika Kakar, Srishti Rode and Karanvir Bohra try and stick together during the show. Many outside the house have come out in support of Karanvir.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/karanvir-s-wife-teejay-writes-an-open-letter-to-bigg-boss-makers-says-he-s-ridiculed-every-weekend-356569.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/karanvir_1542102270_800x420.jpg"}