{"text": "Karan Johar Apologises For Hardik Pandya Row, Says He Had Sleepless Nights Wondering How To Undo It\nKaran Johar Apologises For Hardik Pandya Row, Says He Had Sleepless Nights Wondering How To Undo It\nThey say just one incident can change your lives forever and rightly so. Lauded for their skills in cricket, Hardik Pandya and KL Rahul appeared on Karan Johar’s chat show Koffee With Karan and made headlines for all the wrong reasons.\nA lot of sexist and misogynistic remarks were made on the show and so they had to bear the burnt of the same. “When I lost my virginity, I came home and said, 'Main karke aya hai aaj (I had sex today)” – this line erupted a massive outrage. Hardik Pandya apologised thereafter but that didn’t calm the situation down.\nAlso Read: Hardik Pandya And KL Rahul Are Suspended For Their Sexist Comments And We Are Wondering What Punishment They Will Get\nHardik Pandya : When i lost my virginity, i told them, \"Mai Aj kar kay aya ho\" pic.twitter.com/6HfX0zRWHy — Thakur (@ThakurHassam) January 6, 2019\nKaran Johar who kept mum for the longest time has finally reacted to the entire controversy. He apologised and revealed that he has had sleepless nights wondering how to undo the damage.\n“I'm not justifying the conversation that happened on the episode. I'm saying that perhaps things were said that may have crossed boundaries and I apologise because it was my platform where it happened,” he was quoted as saying by ET Now.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHe says boys have paid the price for what happened.\n“I haven't spoken about it really... I feel very responsible because it was my show and my platform. I invited them as guests and so the ramifications and repercussions of the show are my responsibility. I have had so many sleepless nights, just wondering about how I can undo this damage. Who is going to listen to me? It has now gone into a zone that is beyond my control.”\nAlso Read: Hardik Pandya Wasn’t The Only One! 11 Times Celebs Made Sexist & Misogynistic Remarks On Koffee With Karan", "title": "Karan Johar Apologises:Karan Johar Apologises For Hardik Pandya Row, Says He Had Sleepless Nights Wondering How To Undo Damage", "date_publish": "23/01/2019, 14:53:00", "description": "Karan Johar who kept mum for the longest time has finally reacted to the entire controversy. He apologised and revealed that he has had sleepless nights wondering how to undo the damage. A lot of sexist and misogynistic remarks were made on the show and so they had to bear the burnt of the same. “When I lost my virginity, I came home and said, 'Main karke aya hai aaj (I had sex today)” – this line", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/karan-johar-apologises-for-hardik-pandya-row-says-he-had-sleepless-nights-wondering-how-to-undo-it-360920.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/karan_johar_apologises_for_hardik_pandya_row_says_he_had_sleepless_nights_wondering_how_to_undo_dam_1548235074_800x420.jpg"}