{"text": "Madame Tussauds is one of the most prestigious wax museums across the world. While there are many museums in smaller cities around the globe doing wax statues, Madame Tussauds continues to be the premium celebrity museums of all. It won't be wrong to compare the place to Hollywood walk of fame. Celebrities take immense pride getting featured in Madame Tussauds. It's nothing short of a milestone to unveil and pose with their own wax figures.\nEarlier back in 2000's, there used to be selective stars, at least in Bollywood, who used to make the cut. Veteran actors like Amitabh Bachchan, Aishwarya Rai, Shah Rukh Khan, Madhuri Dixit and Salman Khan were the Bollywood faces at Madame Tussauds and Indians used to look forward to visiting the Bollywood arena in London.\nHowever, this year, exceptionally has seen quite a few celebrities being shortlisted for the Museum. There's no denying that Madame Tussauds has gone all out in opening more museums and included more countries like India but looks like they have included all the possible actors too.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nLatest being, filmmaker Karan Johar, who has flown to Singapore with his mother to unveil his wax statue. It's easy to tell, Madame Tussauds is no longer the niche museum it used to be. Recently, Diljit Dosanjh, Mahesh Babu, Deepika Padukone, Ranbir Kapoor, Anil Kapoor, Varun Dhawan, Sunny Leone have all become a part of the Madame Tussauds family as the wax figures.\nWith no brilliant career graph or a long run at the cinema, these movie stars have found their place in the Delhi, Singapore, Hong Kong and Singapore outlets. There were also reports of TV personality Kapil Sharma getting immortalised, and yes, it's true, you can meet him at the Delhi museum. Sigh! (*What happened to working hard and making a place there?*)\nAs Indians, we have to agree, how weirdly obsessed we are with Bollywood. And now with celebrities who usually have a no hug and shake hand policy, this is the only way, fans can feel stardom up, close and personal.\nIndians, when travelling abroad, book their tickets of Madame Tussauds along with their flight and travel package. They touch, kiss, cry, photograph their favourite celebrities and it's another level SHOOK sometimes.\nIn fact, way before Madam Tussauds came to India, there were a handful of wax figure outlets in Simla, Lonavla and Mussoorie, which enjoyed tourists taking selfies with real life sculptures.\nIn fact, in one of her earlier interviews, Priyanka Chopra had mentioned how she has never seen this kind of fan fervour in LA or other places. She said, \"Paparazzi culture might be stronger in the West but fans are a lot more in abundance and forthcoming in India which can be really overwhelming.\"\nAnd with Delhi getting the latest branch of Madame Tussauds, everyone gets to own a slice of their favourite stars. However, we do miss Madame Tussauds as the one which was exclusive, premium and the one with a bunch of talented and veteran stars. Because now it's become a place to get amused to see the choicest of celebrities right up there.\nIndian celebrities are more popular in the Madam Tussauds museum and the reason clearly looks like it's become a way to attract the Indian audience and make more money than make statues on the basis of their achievements.", "title": "Karan Johar Unveils His Statue At Madame Tussauds. Wonder What's The Criteria For Featuring There?", "date_publish": "03/04/2019, 13:31:11", "description": "Celebrities take immense pride getting featured in Madame Tussauds. They are also seen unveiling and posing with their own wax figures. Celebrities take immense pride getting featured in Madame Tussauds. They are also seen unveiling and posing with their own wax figures. Celebrities take immense pride getting featured in Madame Tussauds.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/karan-johar-unveils-his-statue-at-madame-tussauds-wonder-what-s-the-criteria-for-featuring-there-364780.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/madame_tussauds_1554270339_800x420.jpg"}