{"text": "Kareena Kapoor has shattered a lot of stereotypes in Bollywood as a working mother. Even when she was pregnant she walked the ramp with a baby bump making headlines. Soon after giving birth to Taimur Ali Khan, she returned to doing films. But still, she often becomes a target of trolls.\npinimg.com\nKareena Kapoor had recently given a befitting response to the trolls who slammed her for keeping a nanny for Taimur. “To you judgemental folks who know nothing about my life, please note that there’s a finger I’m showing you in my mind right now,” she had said.\nBut somewhere Kareena feels guilty for leaving her little one at home and going out to work.\n“I think the most important thing for a working mother is to believe in herself. Even when I leave in the morning, I am constantly worried about what Taimur would be doing at home. There is that looming guilt that is sometimes on your head,” she told Miss Malini.\nDon't Miss 174 SHARES 3.1 K SHARES\nBut she knows that Taimur will be proud of her when he grows up. She feels it’s important for a child to see his mother as a working mom.\n“I think your child will grow up realising, respecting and understanding a woman so much more that when she goes out to work and comes back home, she is still happy. Even though she could be tired, but she is still happy because she is doing what she loves the most.”\nMore power to you, Kareena Kapoor!", "title": "Kareena Kapoor Says ‘There’s A Looming Guilt’ On Leaving Taimur At Home And Going To Work!", "date_publish": "07/02/2019, 17:50:01", "description": "Kareena Kapoor has shed a lot of stereotypes in Bollywood as working mother. Even when she was pregnant she walked the ramp with a baby bumps making headlines. Soon after giving birth to Taimur Ali Khan, she returned to doing films. But still, she often becomes a target of trolls. But somewhere Kareena feels guilty for leaving her little one at home and going out to work.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kareena-kapoor-says-there-s-a-looming-guilt-on-leaving-taimur-at-home-and-going-to-work-361767.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kareena_kapoor_says_theres_a_looming_guilt_on_leaving_taimur_home_and_going_to_work_1549541341_800x420.png"}