{"text": "Kareena Kapoor Gives A Befitting Reply To Trolls Who Slammed Her For Keeping A Nanny For Taimur\nKareena Kapoor Gives A Befitting Reply To Trolls Who Slammed Her For Keeping A Nanny For Taimur\nTaimur Ali Khan was a born star. From the day his first picture went viral on social media to until yesterday when he was spotted on the sets of Sacred Games 2 with daddy Saif Ali Khan, his every picture makes headline.\nTwitter\nJust like little munchkin Taimur, his nanny is a star too. She is often seen accompanying him almost everywhere he goes. But did you know that her salary is more than that of the prime minister of our nation. While the nanny’s salary is Rs. 1.75 lakhs depending on the extra hours she works, PM’s salary is 1.60 Lakh per month as revealed by an RTI filed in 2012.\nIf Taimur’s pictures are your guilty pleasure too, you would know that Kareena Kapoor is often trolled for keeping a nanny. And not only her, Shahid Kapoor’s wife Mira Rajput is also trolled for the same.\nDon't Miss 4.5 K SHARES 222 SHARES 707 SHARES\nRecently, on her radio show, Kareena Kapoor opened up about people shaming celeb moms.\n“I have to address one thing… recently I got trolled on a photo where I was getting into a private jet… and the trolling was about how apparently, I’m a careless mother who’s letting my kid be brought up by nannies. To you judgemental folks who know nothing about my life, please note that there’s a finger I’m showing you in my mind right now.”\nvia GIPHY\nThat was indeed a befitting reply, wasn’t it?", "title": "Kareena Kapoor Gives A Befitting Reply To Trolls Who Slammed Her For Keeping A Nanny For Taimur", "date_publish": "30/01/2019, 18:43:30", "description": ", Kareena Kapoor opened up about people shaming celeb moms. Kareena has often been trolled keeping a nanny for Taimur. She gave it back to the trolls recently. “I have to address one thing… recently I got trolled on a photo where I was getting into a private jet… and the trolling was about how apparently, I’m a careless mother who’s letting my kid be brought up by nannies. To you judgemental folks", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-gives-a-befitting-reply-to-trolls-who-slammed-her-for-keeping-a-nanny-for-taimur-361329.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kareena_kapoor_gives_a_burning_reply_to_the_trolls_who_slammed_her_for_keeping_a_nanny_for_taimur_1548853021_800x420.jpg"}