{"text": "Kareena Kapoor Has The Funniest Things To Share About Son Taimur And Husband Saif Ali Khan!\nKareena Kapoor Has The Funniest Things To Share About Son Taimur And Husband Saif Ali Khan!\nYou certainly live under a rock if you're unaware of the fact that Kareena Kapoor Khan is witty and hilarious. She is as real as any of us and that's what makes her endearing! She has time and again spoken about her son Taimur in her interview.\nThe social media superstar that her son is, she again spoke to Rajeev Masand and opened up about her son Taimur and in a first, she called him a terror, very naughty and exactly like his father (Saif Ali Khan).\nSharing a detail of how it is to see Taimur grow up, Kareena said,\n“Now he is going through that phase where he says, ‘Mama, don’t laugh’, ‘Mama don’t cough’, everything we are doing and he says ‘Mama, don’t do that’. I think it’s because we are always like ‘Taimur, don’t do that’ so he is now picking it and telling us.”\nShe added that the constant media attention does bother her. She added,\n“He is so innocent that since he has been told that ‘you have to say hi and hello to everyone’, he is like ‘hi’ while waving to the media. They (paparazzi) say hello, they are very polite and are always at a distance. But they do constant kind of movement. The only thing I can give him is for him to go out and play, walk the street, like we do.\"\nHowever, she insisted that she is working hard as a mother to make sure that her son lives a normal life. She added,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“If they have got their photograph from a distance, they can go and do something else, go on and click Ranveer Singh. Why a two-and-a-half year old? Let him go and play. What he has to do?” She added that she can’t cover his face, cover his eyes because she doesn’t want him to grow in that fear”\nOn the professional front, Kareena Kapoor Khan has a line-up of interesting films including Karan Johar's Takht and Good News with Akshay Kumar.\n(Pictures: Viral Bhayani and Taimur's Fan pages on Instagram)", "title": "Kareena Kapoor Has The Funniest Things To Share About Son Taimur And Husband Saif Ali Khan!", "date_publish": "24/04/2019, 17:47:28", "description": "You certainly live under a rock if you're unaware of the fact that Kareena Kapoor Khan is witty and hilarious. She is as real as any of us and that's what makes her endearing! She has time and again spoken about his son Taimur in his interview. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-has-the-funniest-things-to-share-about-son-taimur-and-husband-saif-ali-khan-366030.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/taimur_ali_khan_1556107012_800x420.jpg"}