{"text": "Kareena Kapoor Feels She's Forgotten By The Paparazzi When Her Son Taimur Is Around\nKareena Kapoor Feels She's Forgotten By The Paparazzi When Her Son Taimur Is Around\nWe all know, Taimur Ali Khan has become nation’s favorite child. Wherever he goes, he is been followed. Every day his pictures and videos brighten our day. He is a superstar already, in fact even his mom Bebo feels he has overshadowed her.\nTalking to Vogue, Kareena speaks about how Taimur has become the total focus point for everyone, “It’s like I’m forgotten! Is Taimur here? Is Taimur coming? What is Taimur doing?”\nBebo even confessed how much she hates the constant media glare on her son but can’t help it,\n“I hate it, but what can we do but ignore it? We (She and husband Saif Ali Khan) both believe that children are a product of their parents and their surroundings, and at home, we plan to keep it as normal as possible. That will be his foundation.”\nViral Bhayani\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nTalking about not letting her motherhood affect her career, she said, “It’s so important to do the things you love. If I am not happy, how do I keep my family happy?”\nShe further added,\n“I wanted to be a mother, but at the same time I was not ready to give up my entire life. It’s important that Taimur sees a woman who comes home after a hard day’s work and is happy. Also, let’s be honest, women are better at multitasking.”\nClearly, Kareena’s upbringing for Taimur is bang on. Expecting mothers could maybe take a tip or two from Bebo on how to raise their children.", "title": "Kareena Kapoor Feels She's Forgotten By The Paparazzi When Her Son Taimur Is Around", "date_publish": "06/11/2018, 14:53:08", "description": "Now we all know Taimur Ali Khan has become nation’s favorite child. Wherever he goes he is been followed. Every day his picture and video brightens our day. He is a superstar already, in fact even his mom Bebo feels he has overshadowed her too. Talking to Vogue, Kareena how Taimur has become the total focus point for everyone, “It’s like I’m forgotten! Is Taimur here? Is Taimur coming? What is T", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kareena-kapoor-feels-she-s-forgotten-by-the-paparazzi-when-her-son-taimur-is-around-356165.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/bebo_1541497098_800x420.jpg"}