{"text": "Star kids stay in the limelight all the time but the attention that Taimur Ali Khan hogs, it's bizarre and different. From clicking him at the playground to taking his airport shots, it was revealed that Taimur's pictures are in high demand and photographers get paid a bomb for them.\nTaimur Ali Khan is already a household name thanks to the constant media attention on the two-year-old but mother Kareena Kapoor Khan says the scrutiny is sometimes too much.\nTwitter\nThe actor said while she and husband Saif Ali Khan don’t believe in stopping the paparazzi from clicking pictures of their son, the media should be a little more responsible. When asked how does she look at the massive popularity of Taimur, Kareena told PTI,\nAgencies\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“We view it as something socially irresponsible because we have been such good parents, we haven’t shied away, we never hid Taimur’s face. In Hollywood, they don’t allow children’s faces to come (publish). But because Saif and I took the modern approach, we can’t do that.”\nThe 38-year-old actor said both Saif and her don’t want to to cover Taimur’s face when they are out as it will “probably scar him more.” “He would think ‘what is happening?’ I don’t want him to grow up in that fear. I want him to grow up and fly, that’s what parents want their children to do. I can’t keep him away.”\nHowever, Kareena added that media should handle it all with a “little bit more responsibility” should be there because he is a child.\nInstagram\n“That would be nice from the media. I have never stopped them. But the constant attention, scrutiny (isn’t good). Hopefully he’s going to be a cool kid like his parents, be more interested in music and sports. That’s what we want.\"\nKareena said she has become a lot more responsible after becoming a mother and feels her life now revolves around Taimur.\nInstagram\n“It’s important for mothers to have the knowledge of vaccination, they have to get the child immunised. It’s important for mothers to have more knowledge because for a newborn infant, they are taking that responsibility. “That’s why my life is in Taimur’s hands because everything’s about him. I hope people understand that and take it in a positive way,” she added.\n(With agency inputs)", "title": "Kareena Kapoor Feels Hiding Taimur's Face Would Scar Him More, Asks Paps To Be More Responsible", "date_publish": "22/02/2019, 12:27:35", "description": "Kareena Kapoor says that while she and Saif Ali Khan have decided not to hide son Taimur from media, the photographer should also act responsibly around him. Kareena Kapoor on Taimur: Hiding his face from media will probably scar him more. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-feels-hiding-taimur-s-face-would-scar-him-more-asks-paps-to-be-more-responsible-362587.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kareena_kapoor_khan_1550819087_800x420.jpg"}