{"text": "Karan Johar Calls Kareena The 'Minister Of Gossip', Reveals She Calls Her PR Team For The Day's Gossip\nKaran Johar Calls Kareena The 'Minister Of Gossip', Reveals She Calls Her PR Team For The Day's Gossip\nKoffee With Karan is not just a show about stars but Karan Johar, the host, himself goes reveals a lot about his life.\nLike, time and again, he has confessed that he himself and his best friend Kareena Kapoor Khan are the biggest gossip-mongers in the industry. Just to jog your memory a little, a few years ago when Kareena Kapoor Khan came on the show with Ranbir Kapoor, the trio revealed that they are the biggest gossip-mongers of the industry.\nKJo recently made an appearance on the Kapil Sharma Show, where he was put into a hypothetical situation.\nHe was made the Prime Minister of Bollywood and he had to announce his ministers and in his answer, he revealed that he would like to elect Kareena Kapoor Khan as the 'Minister of Gossip Affairs'. He added,\nTwitter\n\"She wakes up and calls her PR team for the day’s gossip. Then, she calls me up to confirm them. If we need to broadcast the news, we should give it to Ranbir (Kapoor). He’ll have it published in the papers in two days.\"\nLater on, he gave the responsibility of Ministry of Social Media to Varun Dhawan. He explained that it's because Dhawan himself handles his social media pages and he assigned Akshay Kumar as the Health Ministry. KJo added,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"He is the fittest person in the industry.\" Karan said Sonam Kapoor will be the Ministry of Fashion and called himself 'House Party Minister'.\"\nKajol, who was present on the show with Karan exclaimed that Karan Johar should be the 'Show Off Minister'. To which Karan replied, \"“Am I a show-off? I am so down to earth that I am talking to you.\"\nWell, this looks like one fun episode!", "title": "Karan Johar Calls Kareena The 'Minister Of Gossip', Reveals She Calls Her PR Team For The Day's Gossip", "date_publish": "23/04/2019, 13:56:19", "description": "Like, time and again he has confessed that he himself and his best friend Kareena Kapoor Khan are the biggest gossip-mongers in the industry. Just to jog your memory a little, a few years ago when Kareena Kapoor Khan came on the show with Ranbir Kapoor, the trio revealed that they are the biggest gossip-mongers of the industry.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-khan-wakes-up-and-calls-her-pr-team-for-the-day-s-gossip-reveals-kjo-365936.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/karan_johar_1556010080_800x420.jpg"}