{"text": "Kareena Kapoor Is Giving Us Fitness Party Goals, Janhvi-Ishaan Just Might Be Dating & More From Ent.\nKareena Kapoor Is Giving Us Fitness Party Goals, Janhvi-Ishaan Just Might Be Dating & More From Ent.\nBut if you are wondering whether these celebrations will get a filmy twist with Bollywood celebrities making a cut in their guest list, you're mistaken. According to reports, no Bollywood celebrity has been invited for the wedding ceremonies and functions that will take place in Jodhpur.\nFrom accompanying each other to events and birthdays to just being around each other as a constant in life, their equation has sparked a lot of rumours of them dating.\nDon't Miss 862 SHARES 346 SHARES\n\"He had called me and talked about making his ancestral home into a museum. Now the federal and provincial governments are working on this and will will transform the house into a museum soon,\" Mr Afridi said.\nBebo loves working out and hardly skips a day. Whether it's attending an awards night or a house party, she is always back in the morning to continue her regime. Kareena swears by Pilates and has constantly given fitness goals.\nBut have you ever heard of a fitness party? Well, we suggest you take a look at this video.\n“I feel mentally good when I am working. At the same time, you have to create work-life balance, which I think I did even before I got married. Like I was always somebody who understood that categorising is important. That this is my work and this is my personal life, is very important and I think both of us have managed to do that really well.\"", "title": "Kareena Kapoor Is Giving Us Fitness Party Goals, Janhvi-Ishaan Just Might Be Dating & More From Ent.", "date_publish": "30/11/2018, 18:08:17", "description": "From accompanying each other to events and birthdays to just being around each other as a constant in life, their equation has sparked a lot of rumours of them dating. Bebo loves working out and hardly skips a day. Whether it's attending an awards night or a house party, she is always back in the morning to continue her regime. Kareena swears by Pilates and has constantly given fitness goals.", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-is-giving-us-fitness-party-goals-janhvi-ishaan-just-might-be-dating-more-from-ent-357680.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/wrap_1543582086_800x420.jpg"}