{"text": "The way Bollywoood actress Kareena Kapoor has lead her life is phenomenal. She knows how to set an example and has always believed in breaking stereotypes. Whether it was living in with Saif before marriage, working during the entire tenure of her pregnancy, bouncing back to work right after Taimur, looking after her body and getting back in shape, Kareena Kapoor has too much on her plate and she is not complaining.\nBebo loves working out and hardly skips a day. Whether it's attending an awards night or a house party, she is always back in the morning to continue her regime. Kareena swears by Pilates and has constantly given fitness goals.\nBut have you ever heard of a fitness party? Well, we suggest you take a look at this video.\nMaking work out super fun, Kareena can be seen exercising to Aaj Ki Party Meri Taraf Se with her instructor and trainer, Namrata Purohit. In the video, Bebo can be seen sweating and panting, but is not giving up. Kareena is one of the few celebs who has always been comfortable in her own skin.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nWhether Kareena was size zero or large, she always strutted with utmost grace and gave us confidence goals too.\nFor people who are still thinking of joining a gym or have plans to pick up some sort of fitness regime, Kareena's videos should be able to give you just the right dose of inspiration and if you are already a fitness freak, how about hosting a fitness party this Sunday!", "title": "Kareena Kapoor Works Out To 'Aaj Ki Party Meri Taraf Se', Makes Exercising Look So Much Fun", "date_publish": "30/11/2018, 12:11:19", "description": "kareena kapoor, bollywood, movies, songs, aaj ki party meri taraf se, pilateskareena kapoor, bollywood, movies, songs, aaj ki party meri taraf se, pilateskareena kapoor, bollywood, movies, songs, aaj ki party meri taraf se, pilateskareena kapoor, bollywood, movies, songs, aaj ki party meri taraf se, pilateskareena kapoor, bollywood, movies, songs, aaj ki party meri taraf se, pilateskareena kapoor,", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kareena-kapoor-works-out-to-aaj-ki-party-meri-taraf-se-makes-exercising-look-so-much-fun-makes-it-s-much-fun-357646.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kareena_1543560690_800x420.jpg"}