{"text": "Katrina Kaif Likely To Play PT Usha In Her Biopic But Do You Think She Is An Apt Choice?\nKatrina Kaif Likely To Play PT Usha In Her Biopic But Do You Think She Is An Apt Choice?\nMost of the Bollywood actors aspire to be versatile. They want to step out of their comfort zone to experiment with roles. While sometimes it pays off, other times it goes horribly wrong.\nA biopic on PT Usha, also called the queen of Indian track and field, the sprinter who has won as many as 101 international medals, the woman who had the courage to break stereotypes and follow her dreams, is being made. And guess who’ll be cast in the role?\nIf reports are to be believed, Katrina Kaif is under consideration to the play role, and here’s what fans think about it.\nWhen you don’t have enough money for a good casting director...\nKatrina Kaif to play ex-sprinter PT Usha in biopic: Reports https://t.co/Axzpa37bup\n-via ⁦@inshorts⁩ — Manan Vora (@mananjv) April 24, 2019\nSources should also suggest Katrina Kaif and the film's makers to google what PT Usha actually looks like. https://t.co/xTwn8Etq07 — Poulomi (@PouloCruelo) April 24, 2019\nKouch bhi dono kahan se match honewali hai ???PT Usha is south Indian & #KatrinaKaif is from Britain\nHow it will get matched ? https://t.co/zV50V7YKyv — Bharat 05/06/19 (@Harshada_tweets) April 23, 2019\nDon't Miss 159 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 699 SHARES\nKatrina Kaif as PT Usha 😷 R u serious or is this an April fool joke folks ????\nPT Usha was never known for her glamour, but for her achievements.\nBe ready to bite dust. — Sudipto speaks (@Sudipto_93) April 23, 2019\nDo you think Katrina Kaif is the apt choice? Earlier, it was rumoured that Priyanka Chopra is under consideration to play the role. Maybe, Priyanka was still a better option. But this is not the first time where the choice of role for an actor has gone terribly wrong.\nMary Kom was a successful venture, but when it was revealed that Priyanka Chopra is playing the titular role, a lot of people were disappointed. Don’t you think a woman hailing from North-East India would have played the role better? That was perhaps a great opportunity for Bollywood to introduce a new face.\nWhy the fuck is Priyanka Chopra playing Mary Kom in the movie? Why can't they cast a North-East Indian actress? — Mr. N (@LadyClonidine) November 5, 2012\nRecently, when the posters of Anurag Kashyap’s Saand Ki Aankh were out, it just didn’t feel right. With all that make-up and prosthetics, Bhumi Pednekar and Taapsee Pannu looked so unreal in the role of the world's oldest sharpshooters. We have brilliant actors of that age who, perhaps, could have pulled this role with sheer brilliance – like Seema Pahwa, Supriya Pathak, Surekha Sikri or Neena Gupta?\nWe often complaint about the dearth of Sikh men in the film industry, but we haven’t cast them in roles when required? From Akshay Kumar to Shah Rukh Khan and Ajay Devgn, men in Bollywood have played Sikh roles many times but none apart from Diljit Dosanjh in Udta Punjab aced it better than ever.\nAlso Read: Comedian Jaspreet Singh Slams Bollywood For Stereotyping Sikhs In Films, Makes A Valid Point!\nIf Chitrashi Rawat a real-life hockey player can be cast in the same role for Chak De! India, why can’t casting directors choose apt people to portray roles. Do you really thing Katrina is an good choice for the role? If not, tell us who according to you should play the role in the comments section below.", "title": "Katrina Kaif Likely To Play PT Usha In Her Biopic But Do You Think She Is An Apt Choice?", "date_publish": "24/04/2019, 16:17:25", "description": "A biopic on PT Usha, also called the queen of Indian track and field, the sprinter who has won as many as 101 international medals, the woman who had the courage to break stereotypes and follow her dreams, is being made. And guess who’ll be cast in the role. If reports are to be believed, Katrina Kaif is under consideration to the play role, and here’s what fans think about it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/katrina-kaif-likely-to-play-pt-usha-in-her-biopic-but-do-you-think-she-is-an-apt-choice-366024.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/a_picture_of_katrina_kaif_who_will_most_likely_play_pt_usha_in_the_biopic_1556100369_800x420.png"}