{"text": "Katrina Kaif Gives Preference To Salman Khan's Bharat As She Walks Out Of Remo D'souza's Dance Film\nKatrina Kaif Gives Preference To Salman Khan's Bharat As She Walks Out Of Remo D'souza's Dance Film\nBollywood actress Katrina Kaif is on cloud no. 9 after Zero opened to warm reviews. In fact, Katrina's role has been appreciated and audience has even called it her best movie so far.\nscreengrab\nAnd 2019 will be another year where Katrina will be shining in Salman Khan's Bharat. The actress was also starring alongside Varun Dhawan in a dance film. Vaurn had even announced the movie on Instagram and the duo even came together on Koffee With Karan.\nBut looks like we will see only one film of hers next year as she has walked out of the Varun Dhawan starrer.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n\"Katrina Kaif had to opt out of Remo D'Souza's upcoming dance film owing to her hectic schedule for 'Bharat'. Katrina has always been a thorough professional. She decided to step out of the film as her dates were clashing with 'Bharat', which she is currently shooting for,\" Katrina's official spokesperson said in a statement.\nThe dance film to be produced by Bhushan Kumar's T-Series, is touted to be India's biggest dance film. The yet-to-be-titled film also features actor-choreographer-director Prabhudeva, Dharmesh Yelande, Raghav Juyal and Punit Pathak. The project was scheduled to release in November, 2019.\nInstagram/Salman Khan\nAs far as Bharat is concerned, Katrina was roped in as the leading lady for the film after Priyanka Chopra walked out of the project owing to personal reasons. The film is slated to arrive in theatres on Eid 2019.\nWell, you lose some, you win some!", "title": "Katrina Kaif Gives Preference To Salman Khan's Bharat As She Walks Out Of Remo D'souza's Dance Film", "date_publish": "29/12/2018, 17:06:27", "description": "As far as Bharat is concerned, Katrina was roped in as the leading lady for the film after Priyanka Chopra walked out of the project owing to personal reasons. The film is slated to arrive in theatres on Eid 2019.As far as Bharat is concerned, Katrina was roped in as the leading lady for the film after Priyanka Chopra walked out of the project owing to personal reasons.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/katrina-kaif-gives-preference-to-salman-khan-s-bharat-as-she-walks-out-of-remo-d-souza-s-dance-film-359490.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/katrina_1546084181_800x420.jpg"}