{"text": "“India, Sheila Ki Jawani, Katrina Ki Deewani.” – Varun Dhawan\nWhat happens when two of the goofiest stars of Bollywood – Varun Dhawan and Katrina Kaif – come together on a chat show? Well, it gets hard for a host like Karan Johar to control his two guests. That’s exactly what happened on this Sunday’s episode of Koffee With Karan.\nScreengrab\nVarun Dhawan and Katrina Kaif, sure spilled a lot of beans about their personal lives, and also managed to set the temperatures soaring with their crackling chemistry. The episode was all-in-all a fun one hour almost! Here are all the revelations made on the show.\n#1 Did you know Varun Dhawan and Arjun Kapoor started ‘I hate Katrina Club’ because of Salman Khan? Twitter\nThey were just jealous that Salman gave her more attention on the sets Maine Pyaar Kyun Kiya.\n#2 Varun Dhawan finally admitted that he is dating Natasha Dalal and would get hitched soon.\nbizasialive.com\nDon't Miss 207 SHARES 699 SHARES 1.1 K SHARES 12.5 K SHARES\n#3 Katrina shared her idea of love and the kind of relationship she wants to be in.\nTwitter\nKatrina Kaif, who is currently single, said that she doesn’t believe that a woman always needs a man by her side and that if she doesn’t have him, she is incomplete.\n“You somehow always judge yourself based on how much love or attention you’re getting from your partner. Your relationship suffers just a little bit, and your self esteem and your image take a beating, which is not a good thing.”\nTalking about the kind of relationship she wants, she said, “When neither of you need each other, when there’s no great dependency on the other person. There’s just admiration, there’s respect, there’s companionship and there’s a space of ease between you.”\n#4 Katrina also opened up about her relationship with Alia Bhatt post the latter started dating her ex-beau Ranbir Kapoor.\npinterest\n“It isn't tough for me to keep a good equation with Alia. Everyone needs to judge for themselves what's best for them and how they want to handle their equations and their relationships. My equations with Alia is independent. My equation with Ranbir is independent and same with Deepika. I have individual relationships with all. We are not everyday phone conversation buddies, but I like who she (Alia) is. There is a certain enjoyment of each other's company and a certain comfort and fun element that we have when we are together and it was a decision that I made. I respect and I value that relationship and it shouldn't change for anything.”\n#5 Varun Dhawan wants to set up Katrina Kaif with Bradley Cooper.\nTwitter\nWell, that’s what he said during the rapid fire round.\n#6 Do you know Katrina's guilty pleasure? Well, it's pancakes! She can have them in breakfast, lunch and dinner as well.\nTwitter\n#7 Katrina would rather be stuck in a room with her exes than be stranded in an island alone. Why? Because she thinks the conversations there would be fun.\n#8 Varun Dhawan reveals Katrina Kaif is a thief.\nIf you meet Katrina Kaif, and she likes what you have or you’re wearing, she would ask and take. Like Karan Johar added, “She shops off people”.\n#9 Katrina Kaif is very excited for upcoming Bollywood weddings including Ranveer Singh - Deepika Padukone, and Priyanka Chopra - Nick Jonas – even though she is not invited.\n“I might not be invited to any. But in my head, I am looking forward to the invitation.”\nIf you can’t get enough of their sparkling chemistry, the good news is that Varun Dhawan and Katrina Kaif are starring together in ABCD 3. Well, that should be fun, don’t you think?", "title": "Katrina Kaif & Varun Dhawan Bring The House Down With Their Humour & Wit On Koffee With Karan!", "date_publish": "12/11/2018, 12:20:19", "description": "What happens when two of the goofiest stars of Bollywood – Varun Dhawan and Katrina Kaif – come together on a chat show? Well, it gets hard for a host like Karan Johar to control his two guests. That’s exactly what happened on this Sunday’s episode of Koffee With Karan. Varun Dhawan and Katrina Kaif, sure, spilled a lot of beans about their personal lives, and also they had set the temperatures so", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/katrina-kaif-varun-dhawan-bring-the-house-down-with-their-humour-wit-on-koffee-with-karan-356484.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/from_revealing_philosophical_to_emotional_side_varun_dhawan__katrina_kaif_get_real_like_never_befo_1542004716_800x420.jpg"}