{"text": "Katrina Kaif Responds If Her Role In 'Zero' Was Inspired From Her Break Up With Ranbir Kapoor\nKatrina Kaif Responds If Her Role In 'Zero' Was Inspired From Her Break Up With Ranbir Kapoor\nEver since Shah Rukh Khan starrer Zero has hit the theatres, there have been a lot of speculations, criticism, and scrutiny of the roles and the story.\nThe film has been dissed on social media and not many liked it. On the other hand, there are people who have tagged the film as the bravest love story of the year. While the fate of the film is still juggling between criticism and applause, there were a lot of speculations around Katrina Kaif's role in the film.\nRed Chillies\nKatrina plays the role of a heartbroken actress who gets addicted to alcohol. A lot of people spoke about the fact that her role of Babita has drawn inspiration from her real breakup with actor Ranbir Kapoor.\nTalking to Film companion, the actress opened up and said,\nInstagram\n\"I knew that people are gonna try and connect the dots but I also knew that when they see the film they can't do that because the pitch of that character is so different. The pitch of that character is not me...That's not me. That's not my behavior.\"\nIn another interview, she had similar thoughts to share. She said,\nRed Chillies\nDon't Miss 5.1 K SHARES 153 SHARES 2.4 K SHARES 360 SHARES 699 SHARES\n\"To me the way she's (Babita) talking (in the film), to me it is outlandish as a person that I am. In my mind, I'm exactly the opposite of her. I'm very subtle. Everything for me is underplayed.\"\nReports claim that Zero opened quite well at the box office (Rs 20 crore), but on the second day (Rs 16 crore) itself, the collections started to dip.", "title": "Katrina Kaif Responds If Her Role In 'Zero' Was Inspired From Her Break Up With Ranbir Kapoor", "date_publish": "28/12/2018, 12:06:30", "description": "Katrina plays the role of a heartbroken actress who gets addicted to alcohol. A lot of people spoke about the fact that her role of Babita has drawn inspiration from her real breakup with actor Ranbir Kapoor. While the fate of the film is still juggling between criticism and applause, there were a lot of speculations around Katrina Kaif's role in the film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/katrina-kaif-responds-if-her-role-in-zero-was-inspired-from-her-break-up-with-ranbir-kapoor-359397.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/katrina_kaif_1545979779_800x420.jpg"}