{"text": "Katrina Kaif Explains How Breaking Up With Ranbir Kapoor Was A 'Blessing In Disguise' For Her!\nKatrina Kaif Explains How Breaking Up With Ranbir Kapoor Was A 'Blessing In Disguise' For Her!\nHeartbreaks are not just about pain and grief but in long-term, they become life's best teachers. Apart from learning a lot more about love and relationships, heartbreaks teach a lot about how you are as an individual and the strength that you posses.\nFor Katrina Kaif, breaking up with boyfriend Ranbir Kapoor was heart-shattering. She has time and again spoken how it was difficult and challenging for her to bounce back to life.\nPinterest\nBut she is a fighter and she emerged as a winner. Fighting against all odds and trauma that comes with a break-up, Kat joined back work and gave her 100% to all her professional commitments.\nIn a recent interview with Vogue, Katrina spoke about her old wounds and how this break-up became her life's biggest teacher. She said,\nPinterest\nDon't Miss 247 SHARES 699 SHARES 1.7 K SHARES 1.1 K SHARES 12.5 K SHARES\n“I now see it (the breakup) as a blessing because I was able to recognize my patterns, thought processes and things that I had been so sure of my whole life. I could see them from a whole different perspective,”\nShe added how this break-up added a different perspective on her own life and how she began to focus on herself. She adds,\nPinterest\n“It’s probably one of the first times in my life where I really had only myself to focus on. And when you focus on yourself, often, the first thing you realize is that you don’t really know yourself. It’s like a period of not knowing, a period of being uncomfortable because you’re seeing yourself in your raw form without embellishments and then accepting that you don’t really know who you are.\"\nShe further added how she likes to be a reserved personality. She added,\nAgencies\n“I don’t like to blame other people. The responsibility is on me… but the trigger is how you approach me. I’m very sensitive, and if someone approaches me with a lack of warmth or affection, the wall goes up.”\nApart from juggling between projects like Thugs of Hindostan, Zero and Bharat, she added that she had a remarkable year. She concludes by saying,\nAgencies\n“It has been wonderful because I’m really enjoying the process of creating. It began with Aanand L Rai’s Zero, and then with Bharat—even though it came to me out of the blue, the process has been wonderful. I’ve enjoyed learning, and I feel incredibly happy at work when I feel like I’m learning something new.\"\nKaif is currently busy promoting her upcoming film Zero, that stars SRK and Anushka Sharma in pivotal roles.", "title": "Katrina Kaif Explains How Breaking Up With Ranbir Kapoor Was A 'Blessing In Disguise' For Her!", "date_publish": "04/12/2018, 14:29:32", "description": "“I don’t like to blame other people. The responsibility is on me… but the trigger is how you approach me. I’m very sensitive, and if someone approaches me with a lack of warmth or affection, the wall goes up.”“I don’t like to blame other people. The responsibility is on me… but the trigger is how you approach me. I’m very sensitive, and if someone approaches me with a lack of warmth or affection,", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/katrina-kaif-explains-how-breaking-up-with-ranbir-kapoor-was-a-blessing-in-disguise-for-her-357903.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/katrina_kaif_1543915362_800x420.jpg"}