{"text": "When Katrina Kaif appeared with Varun Dhawan on the last season of Koffee With Karan, she was in an absolute zen mode. She spoke her heart out and opened up on her equation with her ex Ranbir and friend Alia. For Katrina, choosing her own peace of mind and living a regret-free life is very important and it shows.\nTwitter\nWhile Ranbir and she have a history that's not very pleasant, she has time and again expressed her thoughts over it and said that she has no time and energy to keep any regret. Maintaining a similar stance on the whole idea of being friends with Ranbir and Alia, Katrina spoke to DNA and again gave a closer look at her perspective.\nTalking about being cordial and having a perfectly fine equation with both Alia and Ranbir on an individual basis, Katrina said,\nTwitter\nDon't Miss 336 SHARES 247 SHARES 1.1 K SHARES 12.5 K SHARES 5.5 K SHARES\n\"I will tell you something important. A certain thing is already playing out in a certain manner. My reaction to it makes no difference. I can sit here and feel anger and bitterness. I can make myself unhappy. Or I can take into consideration that, how miserable I am makes no difference to anyone else. So, instead, I can lighten my own burden and say — let me be happy and at peace. And what is meant for me, will come my way.\"\nShe added that she believes in living in the present. She adds,\nTwitter\n“I’m not trying to be Ms Goody Two Shoes. I’m not some extra-terrestrial being. I do go through my own share of pain and angst. But I see no point in holding a grudge. Whoever it is (no names taken), I don’t see the point of holding on to anything unpleasant from the past. I would rather let bygones be bygones. I don’t think anyone is out there to hurt me. People are trying to do the best for you. But, sometimes, in trying to do the best for you, you get hurt. Too bad. However, I would rather have a friend than an enemy.”\nOn the professional front, Katrina is all geared up for the release of Bharat, that also stars Salman Khan. In her recent interview with Pinkvilla, Katrina spoke in length on her equation with Salman. She also added that she and Salman never take their work commitments for granted. She said,\n\"The best thing about me and Salman coming together to work is that there’s no sense of us taking it for granted. We don’t go to the sets thinking, ‘dekhte hai’. He knows that I’m going to come after putting 1000% of my time and effort behind finding the character, doing my prep. He has that confidence in me and I know when he comes, he’s going to come up with something unique. However, well, I know him or whatever our equation is, when we come on a set, we both come respecting that this is the producer and director’s place and not a playground. It’s not about fun and games but a professional territory. We come and we do our scenes and rehearsals. That’s how we work well together. There’s no sense of taking anything easy or for granted.\"\nDirected by Ali Abbas Zafar, Bharat is slated to release in June, 2019.", "title": "Katrina Kaif Has The Most Dignified Take On Her Equation With Ex Ranbir Kapoor And Friend Alia Bhatt", "date_publish": "26/04/2019, 13:01:54", "description": "While Ranbir and she have a history that's not very pleasant, she has time and again expressed her thoughts over it and said that she has no time and energy to keep any regret. Maintaining a similar stance on the whole idea of being friends with Ranbir and Alia, Katrina spoke to DNA and again gave a closer look at her perspective.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/katrina-kaif-has-the-most-dignified-take-on-her-equation-with-ex-ranbir-kapoor-and-friend-alia-bhatt-366131.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/katrina_kaif_1556267010_800x420.jpg"}