{"text": "Katrina Kaif Opens About Ranbir’s Reference In Zero, Ranveer Singh Gatecrashes Screening of Simmba And More From Ent.\nKatrina Kaif Opens About Ranbir’s Reference In Zero, Ranveer Singh Gatecrashes Screening of Simmba And More From Ent.\nYesterday was a special screening of Simmba in Mumbai and Ranveer being Ranveer reached there! Apart from gatecrashing the screening, Singh also danced on 'Aankh Maare' while the audience cheered on and whistled!\nTwitter\nKatrina plays the role of a heartbroken actress who gets addicted to alcohol. A lot of people spoke about the fact that her role of Babita has drawn inspiration from her real breakup with actor Ranbir Kapoor.\nTwitter Don't Miss 185 SHARES 544 SHARES 814 SHARES 699 SHARES 411 SHARES\nActor of many iconic films of the '90s, Kader Khan is admitted to hospital and is critical. The health of the veteran actor has deteriorated in the last few months. Apart from acting, Kader Khan has also written 12 films that also includes Aunty No 1 being his last. His most iconic roles include Dulhe Raja, Haseena Maan Jayegi and Mujhse Shaadi Karogi. The actor last appeared in a 2015 film Ho Gaya Deemag Ka Dahi.\nInstagram\nAfter many star kids made a debut this year (Janhvi Kapoor, Sara Ali Khan, Ishaan Khatter to name a few) , this new year will have many more too. Yes, make way for the new kid in the block, Khushi Kapoor. The youngest daughter of Sridevi and Boney Kapoor, Khushi Kapoor will be making her smashing debut with the help of Dharma head honcho Karan Johar. Needless to say, KJo has officially become the godfather for all the newcomers.\nAK’s wife Twinkle Khanna recently won the best author award. Being her witty best, Twinkle Khanna took a sly dig at husband while accepting the reward.\nAnd this seems to be the beginning of Abhimaan Part 2😜\nOn a more serious note...I’m so so proud of you ❤️ https://t.co/QgkwYZDj7t — Akshay Kumar (@akshaykumar) December 27, 2018", "title": "Katrina Kaif Opens About Ranbir’s Reference In Zero, Ranveer Singh Gatecrashes Screening of Simmba And More From Ent.", "date_publish": "28/12/2018, 17:02:09", "description": "After many star kids made a debut this year (Janhvi Kapoor, Sara Ali Khan, Ishaan Khatter to name a few) , this new year will have many more too. Yes, make way for the new kid in the block, Khushi Kapoor. The youngest daughter of Sridevi and Boney Kapoor, Khushi Kapoor will be making her smashing debut with the help of Dharma head honcho Karan Johar. Needless to say, KJo has officially become the", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/katrina-kaif-opens-about-ranbir-s-reference-in-zero-ranveer-singh-gatecrashes-screening-of-simmba-and-more-from-ent-359436.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_1545997176_800x420.jpg"}