{"text": "Shah Rukh Khan’s Zero posters have left the fans restless to watch the trailer. On his birthday today, the superstar will be releasing the much-awaited trailer of his film, which also features Katrina Kaif and Anushka Sharma in the pivotal roles.\nThe first look of Katrina and Anushka along with Shah Rukh Khan has gone viral. Fans are glued onto social media to get the newest updates on their respective characters. While Anushka is playing a scientist, Katrina is most likely playing an alcoholic.\nAs per reports, Katrina Kaif will be playing the role of an actress who is an alcoholic. It is also said that this is her toughest role so far. A close source to Mid Day even revealed that Kat extensively read about the lives of Hollywood actresses Lindsay Lohan, Demi Moore and Liza Minnelli who battled alcoholism.\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES 555 SHARES\nTwitter\nA source quoted to Midday, “Katrina read up on their stories to bring more gravitas to her role. Demi Moore, for instance, has spoken at length about how she would constantly be having thoughts of self-destruction, regardless of the success that came her way. Katrina also read up on Lohan's stints in the rehab. She also referred to books like Blackout and More, Now, Again that includes stories of people at different stages of addiction and how they kicked the habit.”\nTwitter\nWe are damn excited to watch the trailer and the movie. What about you?", "title": "Katrina Kaif To Play An Actress Battling Alcohol In Anand L Rai's Zero, Inspired By Lindsay Lohan", "date_publish": "02/11/2018, 14:26:18", "description": "Shah Rukh Khan’s Zero posters have left the fans restless to watch the trailer. On his birthday today, the superstar will be releasing the much-awaited trailer of his film, which also features Katrina Kaif and Anushka Sharma in the pivotal roles. The posters of Katrina and Anushka along with Shah Rukh Khan has gone viral and left fans asking for more and now this latest update on Kat’s character", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/katrina-kaif-to-play-an-actress-battling-alcohol-in-anand-l-rai-s-zero-inspired-by-lindsay-lohan-355926.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/katrina_1541149386_800x420.jpeg"}