{"text": "Kedarnath Gets Targeted For Hurting Religious Sentiments, Banned In 7 Districts Of Uttarakhand\nKedarnath Gets Targeted For Hurting Religious Sentiments, Banned In 7 Districts Of Uttarakhand\nSara Ali Khan's big dream debut has hit a rocky road as Uttarakhand Tourism Minister Satpal Maharaj on Friday said screening of Hindi film Kedarnath has been stopped across the state.\nThis comes a day after the state High Court dismissed a plea seeking to ban the movie.\nGuy In Sky Pictures\nAdditional Director General of Police (Law and Order) Ashok Kumar said the film has been banned in seven districts, reported PTI.\nSatpal Maharaj,Uttarakhand Tourism Minister:Our committee has forwarded our advice to CM&decided that law&order should be reviewed.We asked District Magistrates to maintain peace&everyone has decided that #Kedarnath movie should be banned. The movie is banned everywhere in state. pic.twitter.com/f9yWjKVd5l — ANI (@ANI) December 7, 2018\nAccording to agency reports, Chief Minister Trivendra Singh Rawat chaired a meeting on Thursday evening after a committee headed by Maharaj submitted a report and decided not to officially ban the movie, reported Outlook. Talking to ANI, Maharaj said,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nGuy In The Sky Pictures\n“Our committee has forwarded our advice to [the] chief minister [and] decided that law [and] order should be reviewed. We asked district magistrates to maintain peace [and] everyone has decided that Kedarnath movie should be banned. The movie is banned everywhere in state.”\nAnother report quotes Maharaj saying, the movie “is not according to our culture and the film can instigate people.\"\nInstagram\nStarring Sushant Singh Rajput and Sara Ali Khan, the film is a love story that revolves around the tragic Uttarakhand of June 2013.\nAgencies\nOn Thursday, the high court had dismissed the plea of petitioner Darshan Bharti, who had alleged that the film hurt the sentiments of the Hindu community.\nIANS further reported that the petitioner claimed that the movie promoted “love jihad”", "title": "Kedarnath Gets Targeted For Hurting Religious Sentiments, Banned In 7 Districts Of Uttarakhand", "date_publish": "07/12/2018, 15:17:44", "description": "Kedarnath banned in 7 Uttarakhand districts, disruption of peace expected Sushant Singh Rajput and Sara Ali Khan-starrer, Kedarnath, has been banned in seven Uttarakhand districts by two district magistrates. The state government hasn’t imposed an official ban.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kedarnath-gets-targeted-for-hurting-religious-sentiments-banned-in-7-districts-of-uttarakhand-358131.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/kedarnath_1544176359_800x420.jpg"}