{"text": "Kedarnath To Be Banned In Uttrakhand, Priyanka Chopra Gets A Warm Welcome From Nick Jonas' Brother Joe & More From Ent..\nKedarnath To Be Banned In Uttrakhand, Priyanka Chopra Gets A Warm Welcome From Nick Jonas' Brother Joe & More From Ent..\nSatpal Maharaj,Uttarakhand Tourism Minister:Our committee has forwarded our advice to CM&decided that law&order should be reviewed.We asked District Magistrates to maintain peace&everyone has decided that #Kedarnath movie should be banned. The movie is banned everywhere in state. pic.twitter.com/f9yWjKVd5l — ANI (@ANI) December 7, 2018\nSara Ali Khan's big dream debut has hit a rocky road as Uttarakhand Tourism Minister Satpal Maharaj on Friday said screening of Hindi film Kedarnath has been stopped across the state.This comes a day after the state High Court dismissed a plea seeking to ban the movie.\n2. Sonam Kapoor To Appear On Koffee With Karan With Her Siblings Rhea And Harshvardhan\nAfter her marriage with Anand Ahuja, Sonam keeps a perfect work-life balance and keeps flying to Delhi to be with in laws. But the gorgeous actress hasn't forgotten her siblings. Infact, she will be making her appearance in Karan Johar’s show Koffee With Karan along with siblings Rhea Kapoor and Harshvardhan Kapoor. Well, we would really want Anand to join them for a little at least and surprise us.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nAfter PC and Nick’s grand wedding, her brother in law welcomed her into the sweetest way possible. Joe Jonas shared a beautiful picture of Priyanka and Nick on Instagram and wrote, “ Super Married! I Love You Both! Welcome to the Family Pri! Congratulations! My face hurts from all the smiling this week.”\nTwitter\nBollywood actor Saif Ali Khan might have been in the industry for long and does not think twice before taking a plunge like the one in Sacred Games but when it comes to his daughter, he is nervous.\nThe teaser, titled Dragonstone (which is the ancestral seat of House Targaryen), starts by showing ice apparently taking over Westeros. Some theories say that the clash between fire and the ice is when the Dragonstone forms. The 54 second-long clip promises to show a battle between fire and ice.", "title": "Kedarnath To Be Banned In Uttrakhand, Priyanka Chopra Gets A Warm Welcome From Nick Jonas' Brother Joe & More From Ent..", "date_publish": "07/12/2018, 17:33:20", "description": "Kedarnath Gets Targeted For Hurting Religious Sentiments, Banned In 7 Districts Of Uttarakhand Sara Ali Khan's big dream debut has hit a rocky road as Uttarakhand Tourism Minister Satpal Maharaj on Friday said screening of Hindi film Kedarnath has been stopped across the state.This comes a day after the state High Court dismissed a plea seeking to ban the movie.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kedarnath-to-be-banned-in-uttrakhand-priyanka-chopra-gets-a-warm-welcome-from-nick-jonas-brother-joe-more-from-ent-358158.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_1544184699_800x420.jpg"}