{"text": "The war of words between the Bhatts, Rangoli Chandel and Kangana Ranaut is getting worse day by day. On Monday, Alia Bhatt was asked to comment on people who are attacking online and taking digs at her and family members.\nReacting to this, Alia said,\n\"If I am mature then my family is 10 times more mature and stronger than I am. I don't want to get into this. I just want to be happy, positive, work hard, be a better version of myself every day. I should not pay attention to what people are saying. Everyone has the right to say and what they want to say. I'll remain quiet. This is my stand.\"\nAnd now, reacting to Alia's stand of choosing to be single, Rangoli sent out a series of tweets to slam her. In one of her tweets, she wrote:\n“I really hope you go quiet darling... You and papa have milked enough backhand PR from this, please take a seat now. People arnt stupid, they see who stands alone and where is gang of movie mafia, in this time and age honesty and transparency is most valued so keep your medieval age ‘ Main chup rahoongi’ sob story to yourself, no need to make this viral everyday...”\nDon't Miss 126 SHARES 336 SHARES 247 SHARES 699 SHARES\nChandel, who is also Kangana's spokesperson added,\n“Snatching others work and opportunities everyday, begging and pleading makers to cast, playing games and using connections to grab films doing back hand PR and on surface behaving like a sheep , as if people are idiots not to see through this. While whole world propagating speak up or me too Alia ji is going ‘ main chup rahoongi aur zulm sahoongi. How regressive is that, coming from a British girl sounds strange, if you take a leaf from Papa Jo’s book obviously it will be melodramatic.\"\nRead her tweets here:\nPeople arnt stupid, they see who stands alone and where is gang of movie mafia, in this time and age honesty and transparency is most valued so keep your medieval age ‘ Main chup rahoongi’ sob story to yourself, no need to make this viral everyday... 🤚🏼 — Rangoli Chandel (@Rangoli_A) April 23, 2019\nSnatching others work and opportunities everyday, begging and pleading makers to cast, playing games and using connections to grab films doing back hand PR and on surface behaving like a sheep , as if people are idiots not to see through this... — Rangoli Chandel (@Rangoli_A) April 23, 2019\nWhile whole world propagating speak up or me too Alia ji is going ‘ main chup rahoongi aur zulm sahoongi 😂 How regressive is that, coming from a British girl sounds strange 😜, if you take a leaf from Papa Jo’s book obviously it will be melodramatic 😂 — Rangoli Chandel (@Rangoli_A) April 23, 2019\nThis drama is getting murkier than a daily soap and not sure if people are enjoying it at all. What's your take?", "title": "Keep Your 'I'll Remain Silent' Sob Story To Yourself, Kangana Ranaut's Sister Rangoli Slams Alia Bhatt!", "date_publish": "23/04/2019, 18:04:06", "description": "The war of words between the Bhatts and Rangoli Chandel and Kangana Ranaut is getting worse day by day. On Monday, Alia Bhatt was asked to comment on people who are attacking online and taking digs at her and family members. Reacting to this, Alia said,", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/keep-your-i-ll-remain-silent-sob-story-to-yourself-kangana-ranaut-s-sister-rangoli-slams-alia-bhatt-365972.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/alia_1556028356_800x420.jpg"}