{"text": "The countdown for the biggest film of the year has begun. Two days before the release of the movie, a cam print of Avengers: Endgame was leaked online in India. But you know the drill, right? True Marvel fans watch the movie in theatres and after they have watched, they don’t leak the spoilers and ruin the film for others.\nAFP\nIt’s going to be an emotional roller coaster ride for everyone. Even the cast of the film is having an emotional time currently. At the film’s premiere in Los Angeles, Chris Evans, who plays the role of Captain America, revealed he cried six times after watching the movie.\n“I have a lot of my friends and family here tonight, and a lot of them are right up here. We have this bond that transcends what we do for a living… I cried like six times [tonight],” he told Variety.\nBCCL\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES\nMeanwhile, the Marvel frenzy had hit India. Avengers: Endgame will be screened 24x7. As the online sale of tickets began a week in advance, BookMyShow website had crashed because of mass booking. It is said that the website sold 18 tickets per second.\nBCCL\nAvengers: Endgame is just not a film. It’s an emotion. It’s an epic culmination of a decade-long journey which Marvel fans that includes 22 movies. So, have you booked your tickets yet?", "title": "Keep Your Tissues Handy! Chris Evans Says He Cried 6 Times While Watching Avengers: Endgame", "date_publish": "25/04/2019, 16:19:24", "description": "Avengers: Endgame going to be an emotional roller coaster ride for everyone. Even the cast of the film is having an emotional time currently. At the film’s premiere in Los Angeles, Chris Evans, who plays the role of Captain America, revealed he cried six times after watching the movie.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/keep-your-tissues-handy-chris-evans-says-he-cried-6-times-while-watching-avengers-endgame-366086.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/keep_your_tissues_ready_chris_evans_says_he_cried_6_times_while_watching_avengers_endgame_1556186163_800x420.jpg"}