{"text": "“Finding someone you love and loves you back is a wonderful feeling. But finding a true soulmate is an even better feeling. A soulmate is someone who understands you like no other will be there for you forever no matter what.” -P.S I Love You\n15 years ago, Gerry and Holly broke our hearts into million pieces. Cecelia Ahern's 2004 debut novel, PS I Love You went on to become one of the biggest best-sellers and over a million copies of the book were sold.\nTwitter\nLater, Gerry and Holly's story got a cinematic adaptation and feature film starring Hilary Swank and Gerard Butler of the name name released in 2007.\nAnd now, the book is all set to get a sequel and Cecelia Ahern herself confirmed the news. She took to Twitter to write,\n“I have BIG NEWS! I’ve written the sequel to PS I LOVE YOU - titled POSTSCRIPT. POSTSCRIPT will be published September 19th in the UK & Ireland. I hope you’ll welcome back Holly... & Gerry...& that reading it will be as emotional for you as it was for me.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe title, Postscript, is a homage to the original novel with PS being short for Postscript.\n🚨 I have BIG NEWS! 🚨\nI’ve written the sequel to PS I LOVE YOU - titled POSTSCRIPT.\nPOSTSCRIPT will be published September 19th in the UK & Ireland. I hope you’ll welcome back Holly... & Gerry...& that reading it will be as emotional for you as it was for me. 💙#Postscript pic.twitter.com/ldAqLfFpmv — Cecelia Ahern (@Cecelia_Ahern) March 11, 2019\nThe new novel will revisit the title characters of the first book – that revolved around Holly Kennedy after she loses her husband Gerry – and will take everyone on Holly's new journey, that will be post-seven years after her husband’s death.\nThere she is\nBeside her sister\nReady to go...#Postscript 💙 pic.twitter.com/RvQBC1WboU — Cecelia Ahern (@Cecelia_Ahern) March 11, 2019\nThe synopsis explains that Holly is approached by a group called the ‘PS, I Love You Club’.\nTwitter\n“Her safe existence is turned on its head. Inspired by hearing about her late husband Gerry’s letters, the club wants Holly to help them with their own parting messages for their loved ones to discover after they’re gone. Holly is sure of one thing – no way is she being dragged back to the grief she has left behind. It’s taken seven years to reinvent herself, and she’s ready to move on with her life. But Holly comes to realise that when you love someone, there’s always one more thing to say…\"\nIn a statement, Cecelia Ahern said,\nTwitter\n“Postscript is the PS to my PS and while it is a sequel, it is also a story that stands alone about living a purposeful life in the face of illness, grief and loss. I hope that new readers and PS, I Love You fans alike will embrace Holly’s new journey.\"\nKeep your tissue-box handy, guys! Another emotional roller-coaster ride that would make us sob uncontrollably!", "title": "Keep Your Tissue Box Handy! 15 Years On, Author Of Bestseller 'P.S I Love You' Confirms Sequel!", "date_publish": "13/03/2019, 16:59:10", "description": "The new novel will revisit the title characters of the first book – that revolved around Holly Kennedy after she loses her husband Gerry – and will take everyone on Holly's new journey, that will be post-seven years after her husband’s death. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/keep-your-tissue-box-handy-15-years-on-author-of-bestseller-p-s-i-love-you-confirms-sequel-363658.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ps_i_love_you_1552475116_800x420.jpg"}