{"text": "Khal Drogo Will Likely Return To 'Game Of Thrones' S8 & This Ardent Fan Has Figured Out How!\nKhal Drogo Will Likely Return To 'Game Of Thrones' S8 & This Ardent Fan Has Figured Out How!\nDo you remember Khal Drogo? He married the Mother of Dragons Daenerys Targaryen long before we even knew that she would make a reigning queen.\nWarning: There are spoilers ahead! Don't blame us later.\nTwitter\nAlso Read: Dropping A Major Spoiler For Season 8, George RR Martin Confirms This Popular Game Of Thrones Theory\nJason Momoa’s character had bid adieu to the show long ago in the show, but fans still miss him. Remember when Emilia Clarke & Jason Momoa had a mini reunion, fans went gaga over their picture on the Iron Throne. They demanded he should make a comeback on the show, and looks like he will.\nAlso Read: Emilia Clarke & Jason Momoa Had A Super Fun ‘Game Of Thrones’ Reunion & Fans Are Convinced Khal Drogo Is Coming Back\nWell, an ardent fan of Game of Thrones has just cracked it how. In a Reddit post, the man with username u/cadiacman said that every character who has been burned to death would make a comeback in the same way as the White Walkers did. The Red God that the Red Priestess Melisandre keeps talking about will help the dead come back.\nDon't Miss 161 SHARES 842 SHARES\n“All characters that have been burned to death/after death by fire will be reincarnated by R'hllor (god of fire/light/red god). You fight an army with an army, an army of burned dead people that you resurrect,” he wrote.\nAlso Read: Missing The Friendly 'Ghost'? Jon Snow’s Direwolf Is Returning In Game Of Thrones Season 8\nIn May this year, Jason Momoa had posted a picture with the writers of Game Of Thrones. Is he hinting on a comeback in the caption?\nAlso Read: After Getting Brutally Killed In Season 1, Ned Stark Will Return In Game Of Thrones Finale For A Special Episode!\nFans are freaking out! Game Of Thrones season 8 will air in April 2019. It’s hard to curb the curiosity until then, right?\nAlso Read: Game Of Thrones Season 8 Premiere Plot Has Been Disclosed & It’s Not What You May Have Expected", "title": "Khal Drogo Will Likely Return To 'Game Of Thrones' S8 & This Ardent Fan Has Figured Out How!", "date_publish": "22/11/2018, 15:26:40", "description": "Jason Momoa’s character had bid adieu to the show long ago in the show, but fans still miss him. Remember when Emilia Clarke & Jason Momoa had a mini reunion, fans went gaga over their picture on the Iron Throne. They demanded he should make a comeback on the show, and looks like he will.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/khal-drogo-will-likely-return-to-game-of-thrones-s8-this-ardent-fan-has-figured-out-how-357172.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/this_game_of_thrones_theory_suggests_that_khal_drogo_might_return_in_season_8_1542879434_800x420.png"}