{"text": "Kick-Starting #MeToo In India, Tanushree Dutta Says Backing Down The Second Time Wasn't An Option\nKick-Starting #MeToo In India, Tanushree Dutta Says Backing Down The Second Time Wasn't An Option\nThe #MeToo movement is taking the country by storm. All the women who suffered sexual harassment in the past are finally coming out to share their stories. And the credit for kick-starting this movement goes to Tanushree Dutta, who said she had to quit acting because of the harassment she faced in the industry. Once again, she is speaking what she had spoken before, and this time, she is not ready to back off.\nreutersmedia.net\nThe Bollywood actress who helped trigger the #MeToo movement in India challenging sexual harassment and abuse sees it as part of her religious education after an experience 10 years ago she said effectively ended her career.\n“I feel God used me to start something which had to happen,” Tanushree Dutta told Reuters. “All these women had this buried deep in their hearts out of shame.”\nDutta, who said she was inspired by Christianity, Buddhism, yoga and the #MeToo movement in the United States, said last month that prominent actor Nana Patekar had sexually harassed her on the set of a movie in 2008.\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\nAFP\nPatekar has denied all the charges.\nDutta said Patekar, 67, had demanded she do intimate dance steps with him in one song in the Hindi-language romantic comedy “Horn OK Pleassss”. When she refused, she said, members of a far right-wing Hindu group attacked her car while she was in it, including jumping on the roof and trying to smash the windscreen.\nDutta, who walked out of the movie, went public with the allegations the same day, but was threatened with legal action by the Hindu fringe group and felt so shamed by those questioning her story and by the way the Indian media treated her that she left Bollywood altogether and went to live in the United States.\nOther than a few bit parts, she hasn’t worked in a movie since.\n“All of that disgusted me - it took my faith and confidence from the industry,” she said in an interview. “I didn’t want to work here. I still kept in touch and did some work which needed short-term commitments.”\nAP\nRajendra Shirodkar, Patekar’s lawyer, has sent Dutta a legal notice asking her to apologise to Patekar or face further legal action. He hasn’t specified what that action would be.\nThe far-right group, Maharashtra Navnirman Sena (MNS), this month filed a complaint with the police against Dutta for comments she made about their chief. The police in turn filed a defamation case against Dutta, currently under investigation, based on the MNS complaint.\nDutta, on holiday in Mumbai, said she hadn’t intended to bring up the issue in public again until she was asked by a reporter whether the #MeeToo movement would ever come to India.", "title": "Kick-Starting #MeToo In India, Tanushree Dutta Says Backing Down The Second Time Wasn't An Option", "date_publish": "17/10/2018, 11:16:02", "description": "The Bollywood actress who helped trigger the #MeToo movement in India challenging sexual harassment and abuse sees it as part of her religious education after an experience 10 years ago she said effectively ended her career. “I feel God used me to start something which had to happen,” Tanushree Dutta told Reuters. “All these women had this buried deep in their hearts out of shame.”", "authors": [], "url": "https://www.indiatimes.com/entertainment/kick-starting-metoo-in-india-tanushree-dutta-says-backing-down-the-second-time-wasn-t-an-option-354919.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kickstarting_metoo_movement_in_india_tanushree_dutta_says_isnt_backing_down_the_second_time_1539753513_800x420.jpg"}