{"text": "Kim Kardashian Forced To Evacuate Her Home As Fire Sweeps Through Her Hidden Hills Neighborhood\nKim Kardashian Forced To Evacuate Her Home As Fire Sweeps Through Her Hidden Hills Neighborhood\nSome unfortunate set of events unfurled after which reality TV star Kim Kardashian-West was forced to grab much of what she could in an hour and flee her home on Thursday night.\nThe \"Keeping Up with the Kardashians\" star revealed that she had just arrived back to her Hidden Hills property to find that her neighborhood was under threat from a wildfire that was burning out of control.\nKim, 38, had originally filmed the flames from her private jet only to find on landing that those flames were part of the Woolsey Fire burning near hers and Kanye West's compound, reports people.com.\nreuters\nSharing the aerial video she had filmed earlier on her Instagram Stories, Kim explained to fans she was evacuating and asked them to \"pray for Calabasas.\"\n\"Just landed back home and had 1 hour to pack up & evacuate our home. I pray everyone is safe,\" she wrote.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nKim thanked the first responders for keeping the community safe before recording the firetrucks and police cars driving down her neighborhood's streets.\n\"They're evacuating everyone right now from all of our homes,\" she said in the video as she watched on from her car.\nThe widespread fire also impacted surrounding areas including Calabasas, where Kim's sister Kourtney lives. Kourtney also chose to evacuate.\n\"I pray that everyone is kept safe and protected from these fires. No Calabasas tonight,\" she wrote alongside a photo of her car trunk packed with bags.\nInputs From IANS", "title": "Kim Kardashian Forced To Evacuate Her Home As Fire Sweeps Through Her Hidden Hills Neighborhood", "date_publish": "10/11/2018, 13:12:58", "description": "Reality TV star Kim Kardashian-West was forced to grab much of what she could in an hour and flee her home on Thursday night. The \"Keeping Up with the Kardashians\" star revealed that she had just arrived back to her Hidden Hills property to find that her neighbourhood was under threat from a wildfire that was burning out of control. Kim, 38, had originally filmed the flames from her private jet on", "authors": [], "url": "https://www.indiatimes.com/entertainment/kim-kardashian-forced-to-evacuate-her-home-as-fire-sweeps-through-her-hidden-hills-neighborhood-356391.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/wildfire_forces_kim_kardashian_to_evacuate_her_home_1541835951_800x420.jpg"}