{"text": "Kim Kardashian West Says She Was High On Ecstasy During 1st Marriage And Made Her Own Sex-Tape\nKim Kardashian West Says She Was High On Ecstasy During 1st Marriage And Made Her Own Sex-Tape\nIn a candid confession, Kim Kardashian West revealed that she was high on ecstasy during her first wedding as well as during the filming of her infamous sex tape.\nOn Sunday's episode of Keeping Up with the Kardashians, Kim, during a conversation with sister Kendall Jenner and Scott Disick, who is currently in a relationship with Kourtney Kardashian, spilled some beans about her \"Wild\" years.\nSpeaking about her first wedding to music producer Damon Thomas in 2000, Kim said, \"I got married on ecstasy. The first time.\"\nreuters\nBut that was not all, she also said, \"I did ecstasy once and I got married. I did it again, I made a sex tape. Like, everything bad would happen.\"\nIn 2007, a sex tape featuring Kim and American singer Ray J went viral and made Kim famous. The revelation took both Disick and Jenner by surprise. \"I just can't believe that was you,\" Jenner said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I definitely went through a wild phase, I would say in my late teens. I'm not like that anymore. But I still have fun - don't get it twisted, I'm always the life of the party,\" Kim asserted.\nreuters\nKim's first marriage and her sex tape is now a thing of the past, as she is currently married to rapper Kanye West. Kim and Kanye share three children, namely, daughters North (5), and Chicago (8 months), and a son, Saint, who will be turning 3 on December 5.\nInputs From ANI", "title": "Kim Kardashian West Says She Was High On Ecstasy During 1st Marriage And Made Her Own Sex-Tape", "date_publish": "27/11/2018, 11:23:10", "description": "Kim Kardashian West has revealed that she was high on ecstasy during her first wedding as well as during the filming of her infamous sex tape. On Sunday's episode of Keeping Up with the Kardashians, Kim, during a conversation with sister Kendall Jenner and Scott Disick, who is currently in a relationship with Kourtney Kardashian, spilled some beans about her \"Wild\" years. Speaking about her first", "authors": [], "url": "https://www.indiatimes.com/entertainment/kim-kardashian-west-says-she-was-high-on-ecstasy-during-1st-marriage-and-made-her-own-sex-tape-357443.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kim_kardashian_west_was_high_on_ecstasy_during_1st_marriage_1543298071_800x420.jpg"}