{"text": "Kim Kardashian Studying To Become A Lawyer To 'Fix the System' And Twitter Can't Get Over It!\nKim Kardashian Studying To Become A Lawyer To 'Fix the System' And Twitter Can't Get Over It!\nAmerican television star Kim Kardashian, known for her reality shows and marriage to hip-hop artist Kanye West, revealed in her recent magazine interview that she is studying law and hopes to pass her California bar exams by 2022.\nThe 38-year-old lifestyle mogul, who has 134 million Instagram followers, has been interning at a California law firm since last year.\nAgencies\nShe said she was inspired to study law after successfully petitioning US President Donald Trump last year to pardon Alice Marie Johnson. Johnson, a 63-year-old great-grandmother, had served nearly 22 years of a life sentence for cocaine trafficking.\nAgencies\nAs soon as the news spread on social media platforms like a wildfire, people haven't stopped reacting. While only a few could digest the news, a few had the funniest reactions. The reactions are so funny that some of them will crack you up. Read on!\nActual footage of Kim Kardashian after she realized you have to study to become a lawyer pic.twitter.com/wP2Nae1uD2 — π (@thistayday) April 11, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nKim Kardashian to the prosecutors on her first trial as a criminal justice lawyer: pic.twitter.com/xmkvcqeANO — Olivia Cohen (@OliviaMCohen) April 11, 2019\nIs it a joke? — SugarHoney (@SugarHoneyBitch) April 10, 2019\nKim Kardashian is studying to become a lawyer? Wow honestly didn't expect that, but given who her father was and her slight interest in prison reform, it's not too surprising. If she's serious about this then s/o to her I can fw that. — taylor 🌙 (@quattlestrology) April 10, 2019\nApparently, Kim Kardashian doesn't need a college degree or law school to take the bar exam in California. If you're privileged and complete an apprenticeship with a lawyer or a law firm, you can do whatever you want. Ain't that a blimp. — FERRARI SHEPPARD (@stopbeingfamous) April 11, 2019\nKim Kardashian is studying to become a lawyer omfg she’s literally more qualified to be president than Trump at this point... but then again who isn’t — it’s paris, bitch! (@ITSPARISBXTCH) April 10, 2019\nPeople: \"Kim Kardashian is useless and she doesn't contribute anything to society.\"\nKim Kardashian: \"I'm studying to become a criminal justice lawyer.\"\n*People: \"How dare you. Stay in your lane.\" pic.twitter.com/TuObBVmaKw — ℰ𝑟𝑖𝑛 🌻🌺 (@pinklionheart) April 10, 2019\n(With agency inputs)", "title": "Kim Kardashian Studying To Become A Lawyer To 'Fix the System' And Twitter Can't Get Over It!", "date_publish": "12/04/2019, 11:40:24", "description": "American television star Kim Kardashian, known for her reality shows and marriage to hip-hop artist Kanye West, is studying law and hopes to pass her California bar exams by 2022, the magazine Vogue has reported. Kim Kardashian West wants to be a lawyer and has already began apprenticing at a law office in hopes of taking the bar in 2022.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kim-kardashian-studying-to-become-a-lawyer-to-fix-the-system-and-twitter-can-t-get-over-it-365304.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kim_kardashian_1555050308_800x420.jpg"}