{"text": "King Khan Admits He Has No Exciting Future Projects To Work On. Now That's A First For SRK!\nKing Khan Admits He Has No Exciting Future Projects To Work On. Now That's A First For SRK!\nThe whole era of superstars kick-started in the 90s when SRK, Aamir Khan and Salman Khan made their debut in Bollywood. Whether the film had content or not, the mere presence of the Khans ensured massive hits.\nTwitter\nSRK delivered some super successful movies and launched quite a few actresses. In one of the TV interview, he considers himself as how he has had the privilege to romance the yesteryear actresses and still gets to do it with the newbies.\nBut with social media stepping in and the audience get more options on digital platforms, it is getting difficult for actors to sell just songs and dancing around trees. The audience wants content driven cinema.\nFB/SRK\nSRK was last seen in Zero which received mixed responses, Prior to that, he starred in Jab Harry Met Sejal and Fan, both were again poorly acknowledged. SRK clearly, understands the industry is going through major changes and there are many refined actors ready to replace the older stars.\nDon't Miss 623 SHARES 837 SHARES\nAfter a string of flops, SRK has no qualms in admitting that he still doesn't have something concrete and scintillating in hand.\nTwitter\nSpeaking to a Chinese publication, the actor said, “I haven’t decided what I will do next. I thought I will take a few months off and try and work on what I want to do because it’s very important for me to be most excited about it. I work 16 hours a day, so if it doesn’t excite you in the morning, you should not wake up. At my stage, when I have worked in over 80 films, have done some satisfactory roles and have made a career out of what I do, I should be like I don’t want to get up and go if it’s not going to be an absolutely, stunning, scintillating and exciting day as an actor. So, right now I don’t have anything that stunning, scintillating and exciting, If I will have it, I will start working on it.”\nAs reports, SRK will next be seen making a digital debut alongside Bobby Deol.", "title": "King Khan Admits He Has No Exciting Future Projects To Work On. Now That's A First For SRK!", "date_publish": "18/04/2019, 16:02:56", "description": "Because Only SRK Can! King Khan Admits He Has No Exciting Future Projects To Work OnBecause Only SRK Can! King Khan Admits He Has No Exciting Future Projects To Work OnBecause Only SRK Can! King Khan Admits He Has No Exciting Future Projects To Work OnBecause Only SRK Can! King Khan Admits He Has No Exciting Future Projects To Work OnBecause Only SRK Can! King Khan Admits He Has No Exciting Future", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/king-khan-admits-he-has-no-exciting-future-projects-to-work-on-now-that-s-a-first-for-srk-365693.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/srk_1555581377_800x420.jpg"}