{"text": "King Of Spoilers, Mark Ruffalo Was Forced To Film Five Endings For 'Avengers: Endgame'!\nKing Of Spoilers, Mark Ruffalo Was Forced To Film Five Endings For 'Avengers: Endgame'!\nMore than playing the role of The Hulk in Marvel films, if there’s one thing that Mark Ruffalo is known for, it is for giving out spoilers. If you are a Marvel fan, you know spoiling its movies isn’t a good idea. He has fu**ed real bad, and very often.\ncinemaexpress.com\nRemember when he live streamed Thor: Ragnarok? He accidentally forgot to switch off his Instagram live. And Disney had to send somebody to tell him to turn his Instagram live phone off.\nRead More: Mark Ruffalo AKA Hulk Forgets To Turn Off Instagram Live, Streams 15 Minutes Of Thor: Ragnarok\nHe even revealed a massive spoiler for Avengers: Infinity War in 2017, a year before it the movie had released.\nWhile speaking to Good Morning America, he said, “In this next one, ha — everybody dies!” He was almost about to say “half” the Avengers die but realised he is giving away a major spoiler and stopped. Meanwhile, Don Cheadle’s panicked. Take a look (at around 2:16 in the clip below).\nDon't Miss 583 SHARES 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES\nSo, now that Avengers: Endgame is gearing up for the release… ummm… no… he has not given out any spoilers. He perhaps doesn’t even know the ending to the movie. That’s because he was forced to film five endings. Even the directors were worried that he would end up ruining the surprise.\nTwitter\n“I shot, like, five different endings to this movie. I didn't even get a whole script to this movie. And I don't know why. The script I did get had dummy scenes in it,” he told E News.\ncdn.vox-cdn.com\nAfter his appearance on Jimmy Fallon’s show, he wrote to him to delete the spoiler he accidentally gave away on the show.\n.@JimmyFallon, I trust that you will cut my spoiler slip on the show tonight. That was “off the record” homey. Please don’t get me in trouble with Marvel (Barry) again. DM me back. M — Mark Ruffalo (@MarkRuffalo) October 5, 2018\nOf course, that was a joke.\nJimmy Fallon played along with him.\nDude, it’s too late - already sent the final show to Burbank for air. Are you sure you’re gonna be in trouble? We could maybe bleep it out. What is “DM”? https://t.co/GMds1hGO8X — jimmy fallon (@jimmyfallon) October 5, 2018\nAnd then apparently he was fired.\nMark, you’re fired. — Russo Brothers (@Russo_Brothers) October 6, 2018\nOf course, everyone was kidding here. It was just a prank.\nGuys... can we talk about this? https://t.co/PYe56UiUgO — Mark Ruffalo (@MarkRuffalo) October 7, 2018\nWhen he was cast in Avengers: Endgame, after all this, even he was shocked that he wasn’t fired.\nWith a well-documented history of inadvertently dropping spoilers to Marvel movies, Mark Ruffalo has finally mend his ways for Avengers: Endgame, it seems.", "title": "King Of Spoilers, Mark Ruffalo Was Forced To Film Five Endings For 'Avengers: Endgame'!", "date_publish": "11/04/2019, 17:18:29", "description": "More than playing the role of The Hulk in Marvel films, if there’s one thing that Mark Buffalo is known for, it is for giving out spoilers. He perhaps doesn’t even know the ending to Avengers: Endgame. That’s because he was forced to film five endings. Even the directors were worried that he would end up ruining the surprise.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/king-of-spoilers-mark-ruffalo-was-forced-to-film-five-endings-for-avengers-endgame-365283.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/king_of_giving_out_spoilers_mark_ruffalo_was_forced_to_film_5_endings_for_avengers_endgame_1554981465_800x420.png"}