{"text": "The third episode of HBO's Game of Thrones was an epic one and for reasons more than one. It was on Sunday that the epic Battle of Winterfell took place and we all know the end! We all saw the epic moment when Arya Stark killed the Night King.\nPeople were shocked and surprised to see that Maisie Williams aka Arya Stark saved Winterfell from the dead and managed to stab the supreme leader of the wights with her Valyrian steel dagger.\nReacting to this epic scene, Jon Snow actor AKA Kit Harington said that he was both shocked and angry to know that Arya was the chosen one to kill the Night King. Talking to entertainment weekly, Harington said,\nTwitter\n“I was surprised, I thought it was gonna be me! But I like it. It gives Arya’s training a purpose to have an end goal. It’s much better how she does it the way she does it. I think it will frustrate some in the audience that Jon’s hunting the Night King and you’re expecting this epic fight and it never happens — that’s kind of Thrones. But it’s the right thing for the characters. There’s also something about it not being the person you expect. The young lady sticks it to the man.\"\nFor those who haven't seen, in one of the behind-the-scenes video that was released by HBO on Monday, Harington had also jokingly mentioned that he was a little pissed that he didn't get to kill the night king. He added,\nDon't Miss 159 SHARES 842 SHARES\n\"I was pissed. I was pissed that it wasn't me killing the Night King. I would've bet you thousands before we read the finals. I was like, 'Yeah, it's definitely me. And then they lead you on — that Jon is chasing the Night King.\"\nJust a few days ago, Actor Kit Harington had admitted that one of his favourite scenes involves his actress-wife Rose Leslie. He added that he liked the bit where she tragically dies in his arms as a bloody battle continued around them.\nHBO\n\"I liked her death. I know, it sounds bizarre. I thought she nailed that. And it's the first time in '...Thrones' that slow motion was used. I think it's a beautiful, cradling moment as this battle is raging in the background. It was one of those incredible shots,\" Harrington told people.com.", "title": "Kit Harington Reacts To Arya Killing Night King In Battle Of Winterfell, Admits He Was Pissed", "date_publish": "01/05/2019, 15:17:17", "description": "The third episode of HBO's Game of Thrones was an epic one and for reasons more than one. It was on Sunday that the epic Battle of Winterfell took place and we all know the end! We all saw the epic moment of how Arya Stark killed the Night King. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kit-harington-reacts-to-arya-killing-night-king-in-battle-of-winterfell-admits-he-was-pissed-366405.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/kit_harington_1556702310_800x420.jpg"}