{"text": "Kit Harington Opens Up About His Darkest Time On Game Of Thrones, Says Jon Snow’s Death Sent Him To Therapy\nKit Harington Opens Up About His Darkest Time On Game Of Thrones, Says Jon Snow’s Death Sent Him To Therapy\nIf Kit Harington AKA Jon Snow had to watch earlier seasons of Game Of Thrones, then “there’ll be 70% of the scenes that I’ll just never be happy with,” he admitted recently. However, talking about the end of the show, he said, “it’s the most satisfied I will be with my work as Jon Snow.”\nvia GIPHY\nGame of Thrones is simply one of the most loved shows to grace television screens. For the actor behind Jon Snow - Kit Harington, looking back at the journey of Game of Thrones that brought him name and fame, he revealed the dark time on the show which led him to therapy.\nvia GIPHY\nTalking about how it was to be playing the role of Jon Snow at the time when the character was at the height of his popularity on the show, Jon Snow said, “My darkest period was when the show seemed to become so much about Jon, when he died and came back.”\nvia GIPHY\nFor Kit Harington, it was the darkest time until the character was resurrected in the next season.\n“It wasn't a very good time in my life. I felt I had to feel that I was the most fortunate person in the world, when actually, I felt very vulnerable. I had a shaky time in my life around there - like I think a lot of people do in their 20s,” he said.\nvia GIPHY\nIt is that time when Kit Harington had to take help of the therapy.\n“That was a time when I started therapy, and started talking to people. I had felt very unsafe, and I wasn't talking to anyone. I had to feel very grateful for what I have, but I felt incredibly concerned about whether I could even f***ing act,” he said,\nvia GIPHY\nHe was so helpless that Jon Snow’s fate made it \"f***ing terrifying\" for him to step out in public.\n“You get people shouting at you on the street, 'Are you dead?' At the same time you have to have this appearance. All of your neuroses, and I'm as neurotic as any actor, get heightened with that level of focus.”\nvia GIPHY\nFurthermore, talking about the show and its relevance in today’s world, Kit Harington compared US President Donald Trump to Joffrey Baratheon. He said that if people paid attention to the HBO show, they could avoid living in “Thrones-like world.”\nDon't Miss 159 SHARES 842 SHARES\nvia GIPHY\n“About dysfunctional families -- or families in general, always where the best drama is -- and the everlasting idea that people who seek power are very often the last people who should have it. Unfortunately, we're leaving Thrones with a Joffrey as the President of the United States of America,” he said.\nvia GIPHY\n“I'm deeply sad of the state of the world as Thrones ends. Because if it was prophetic, you'd hope that people would have watched Thrones and tried to avoid some of the situations these characters find themselves in, and I feel like we are living in a more Thrones-like world (sic),” he added.\nGame of Thrones season 8 will air on April 14.\nWith inputs from PTI and IANS", "title": "Kit Harington:Kit Harington Talks About His Darkest Time On Game Of Thrones, Says Jon Snow’s Death Sent Him To Therapy", "date_publish": "22/03/2019, 11:34:24", "description": "If Kit Harington AKA Jon Snow was to watch earlier seasons of Game Of Thrones, “there’ll be 70% of the scenes that I’ll just never be happy with,” he admitted recently. However, talking about the end of the show, he said, “it’s the most satisfied I will be with my work as Jon Snow.” Talking about how it was to be playing the role of Jon Snow at the time when the character was at the height of his", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kit-harington-opens-up-about-his-darkest-time-on-game-of-thrones-says-jon-snow-s-death-sent-him-to-therapy-364100.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kit_harington_talks_about_his_darkest_time_on_got_says_jon_snows_death_sent_him_to_therapy_1553233673_800x420.jpg"}