{"text": "Kit Harington Was Paid More Than Sophie Turner For 'Game Of Thrones' And She Explains Why It Makes Complete Sense!\nKit Harington Was Paid More Than Sophie Turner For 'Game Of Thrones' And She Explains Why It Makes Complete Sense!\nWhile the storyline of shows and films are getting more and more progressive, there are certain issues that still persists in the film industry. Talking about the same, Game of Thrones star Sophie Turner revealed that co-actor Kit Harington makes more money than her on the hit HBO show but it does not bother her.\nThe actor, a vocal supporter of the Time’s Up campaign and gender equality, said that Harington received a bigger pay cheque than her because he has a bigger role in the epic fantasy series, which also involved more night shoots. She said demanding equal pay on the show was a little tricky.\nJeff Kravitz/FilmMagic for HBO\n“Kit got more money than me, but he had a bigger storyline. And for the last series, he had something crazy like 70 night shoots, and I didn’t have that many. I was like, ‘You know what… You keep that money’,” Turner told Bazaar UK magazine.\nThe actor, who plays Sansa Stark in the series, said now all her contracts come with an inclusion rider, which ensures a 50:50 male/female workforce on the sets. “Now, you see women in the camera departments, producing, directing. It’s exciting,” she added.\nYoutube\nTurner said nowadays people are engaging in conversations about pay more readily.\n“(Executives are) more willing to listen to people saying, ‘I want the same amount of money.’ So things are getting done, but it will take a while, I think…” she said.\nThe excitement for the show is at an all-time high as the show is all set to return with its eighth and final season on April 14. Turner will also be seen reprising her role of mutant Jean Grey/Dark Phoenix in X-Men: Dark Phoenix.\nDon't Miss 365 SHARES 159 SHARES\n(With Agency inputs)", "title": "Kit Harington Was Paid More Than Sophie Turner For 'Game Of Thrones' And She Explains Why It Makes Complete Sense!", "date_publish": "02/04/2019, 17:42:17", "description": "The actor, a vocal supporter of the Time’s Up campaign and gender equality, said that Harington received a bigger pay cheque than her because he has a bigger role in the epic fantasy series, which also involved more night shoots. She said demanding equal pay on the show was a “little tricky”.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/kit-harington-was-paid-more-than-sophie-turner-for-game-of-thrones-and-she-explains-why-it-makes-complete-sense-364765.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kit_harrington_1554210703_800x420.jpg"}