{"text": "How will Game of Thrones season 8 end? Who will sit on the Iron Throne? All the ardent Game of Thrones fans have so many questions that will only be answered when the finale season will air in April, but until then we are all impatient and making blind guesses.\ndenofgeek.com\nDid you know Sophie Turner AKA Sansa Stark has already told the ending of Game of Thrones to her friends? Why? Because she is bad at keeping secrets! Since the time she has revealed this, fans have been speculating if Priyanka Chopra is one of those people who know the Game of Thrones ending too.\nTwitter\nAnd now, Kit Harington AKA Jon Snow has revealed that even he has told the Game of Thrones ending to wife Rose Leslie who played the role of Ygritte in the early seasons before her character died. And he says Rose Leslie didn’t talk to him for three days after he told her about the end.\nDon't Miss 842 SHARES 596 SHARES 246 SHARES 3.1 K SHARES 406 SHARES\nAlso Read: Kit Harington Credits ‘Game Of Thrones’ For Meeting Wife Rose, Says The Show Changed His Life Forever\n“I told my wife last year how it ended, and she wouldn't talk to me for about three days. And she'd asked!,” he said at a UK based radio show, as quoted by Entertainment Weekly.\nAlso Read: Maisie Williams Shares A Disappointing News About Game Of Thrones Finale, Says No One Will Be Satisfied\nKit Harington says the ending of Game of Thrones season 8 will be “groundbreaking” and not everyone will be happy.\n“It's a weird one to answer, that. I can't really answer whether I'm happy or not,\" he said. Earlier, he had said, “it was designed to break us”.\nAlso Read: Kit Harington Pranked Fiance Rose Leslie Which Left Her Screaming & Collapsing On The Floor", "title": "Kit Harington Told Wife Rose Leslie The Ending Of Game Of Thrones Season 8 & She Didn’t Talk To Him For 3 Days", "date_publish": "02/02/2019, 15:40:50", "description": "Kit Harington AKA Jon Snow has revealed that even he has told the Game of Thrones ending to wife Rose Leslie who played the role of Ygritte in the early seasons before her character died. And he says, Rose Leslie didn’t talk to him for three days after he told her about the end.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kit-harington-told-wife-rose-leslie-the-ending-of-game-of-thrones-season-8-she-didn-t-talk-to-him-for-3-days-361468.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kit_harington_told_wife_rose_leslie_the_ending_of_game_of_thrones_season_8_1549103896_800x420.jpg"}