{"text": "Kit Harington Shares How He Almost Lost A Testicle While Filming The 1st Episode Of Game Of Thrones S8\nKit Harington Shares How He Almost Lost A Testicle While Filming The 1st Episode Of Game Of Thrones S8\nDo you think filming for Game Of Thrones is an easy feat? With so much of action and dragons involved, the cast probably ends up getting a lot of bruises and scars.\nthisisinsider.com\nBut Kit Harington recently revealed how he almost lost a really important body part while filming Game Of Thrones season eight’s premiere – his testicle!\nTwitter\nIt happened while Kit Harington AKA Jon Snow was filming for the scene in which he has to fly a dragon. Well, that’s one of the many scenes from the first episode of Game Of Thrones season 8 that sent shivers down our spines. We’ve all been waiting to see that for so long, after all.\nDon't Miss 159 SHARES 842 SHARES\nTwitter\nSo, in the behind-the-scenes video that was released by HBO, Kit Harington revealed he had to ride a mechanical-bull-like structure in order to create the scene on which the CGI team would do the magic later on.\nEmilia Clarke has been doing it for years, but this was Kit Harington’s first attempt. And boy, hell went lose when he did it. It went terribly wrong.\n“Buck work is not easy. I think what sums up the buck for me was there was a bit where Jon almost falls off. The dragon swings around really violently, like this, and my right ball got trapped, and I didn’t have time to say ‘Stop!’ And I was being swung around.”\nTwitter\n“In my head, I thought, This is how it ends, on this buck, swinging me around by my testicles, literally. Sorry. Probably too much information.”\nI don’t think that’s too much information, but it’s a bit funny. I mean, it’s difficult to read it with a straight-face. Sorry, Kit Harington. But guys, he nearly lost a ball!", "title": "Kit Harington Shares How He Almost Lost A Testicle While Filming The 1st Episode Of Game Of Thrones S8", "date_publish": "17/04/2019, 11:51:29", "description": "Kit Harington AKA Jon reveals he almost lost a testicle while filming a scene where he has to ride a dragon in Game Of Thrones season 8 episode one. Emilia Clarke has been doing it for years, but this was Kit Harington’s first attempt. And boy, hell went lose when he did it. It went terribly wrong. “Buck work is not easy. I think what sums up the buck for me was there was a bit where Jon almost f", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kit-harington-shares-how-he-almost-lost-a-testicle-while-filming-the-1st-episode-of-game-of-thrones-s8-365594.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kit_harington_aka_jon_snow_revealed_he_almost_lost_a_testicle_while_filming_the_scene_on_dragon_1555481740_800x420.jpg"}