{"text": "The interest has been more in metropolitan cities like Delhi and Mumbai. Rahul Kadbet, Vice President Programming, Carnival Cinemas, told IANS: “Around 2.25 lakh tickets have been sold which is about 74 per cent of the capacity for weekend. We have 1000+ shows per day for the movie in over 100 cities. Maximum tickets were sold in Delhi/NCR and Mumbai.”\n“Satish and Salman share a great bond and have recently worked together in Bharat. But it is yet to be decided if Salman will feature in the film or a new cast will be brought on board.”\n\"She wakes up and calls her PR team for the day’s gossip. Then, she calls me up to confirm them. If we need to broadcast the news, we should give it to Ranbir (Kapoor). He’ll have it published in the papers in two days.\"\nRecently, he was seen carrying Deepika Padukone’s silver heels in his hands. And this is melting our hearts. Isn’t he just so sweet?\nDon't Miss 264 SHARES 233 SHARES 862 SHARES 4.3 K SHARES\n“It would be very wrong for me to say that someone is someone’s daughter and that is why she got this or that role. I can crib about that or I can say that I actually started with a fantastic role and got appreciation for my first film which is 1920. After all, somebody who didn’t know me at all trusted me and gave the film.\"", "title": "KJo Calls Kareena The Minister Of Gossip, Ranveer Continues Giving Husband Goals & More From Ent.", "date_publish": "23/04/2019, 17:45:30", "description": "The interest has been more in metropolitan cities like Delhi and Mumbai. Rahul Kadbet, Vice President Programming, Carnival Cinemas, told IANS: “Around 2.25 lakh tickets have been sold which is about 74 per cent of the capacity for weekend. We have 1000+ shows per day for the movie in over 100 cities. Maximum tickets were sold in Delhi/NCR and Mumbai.”", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/kjo-calls-kareena-the-minister-of-gossip-ranveer-continues-giving-husband-goals-more-from-ent-365969.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bollywood_1556022133_800x420.jpg"}