{"text": "Looking gorgeous and radiant in a white dress, Kubbra Sait spoke to us about the hurdles she faced as a woman to make her dreams come true. In conversation with Indiatimes, Kubbra revealed how every woman including her has been told that we ain’t capable of doing anything but she overcame all the negativity and today she has emerged as a winner.\nTwitter\nTalking about the hurdles she had to face being a woman, she said,\n“We have been told for years that we ain’t capable of anything and you obviously get hurt by it, so let it be, what you should do is, reconstruct your pain and move on from that situation. I have made things beautiful for myself and today when I look back, I can truly say that I can face anything. The world will tell you what you should do and you shouldn’t but what did I do with that criticism is important. Did I pick it up and crushed and moved on, that is the true test of time, and according to me, I have done it. It’s not that people have stopped telling you or judging you but I chose a positive road and that is the result of who I am today.”\nTwitter\nShe further went on, “No matter what the world says, what important is, how you emerge yourself, because we have to emerge, we have to fly and people will not stop talking, we have to decide whether we let that voice of them affect us or we make that voice music for us, all depends on us”.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWe quizzed Kubbra what’s the hardest part of being a woman according to her and her answer won us over, “The hardest part of being a woman is that I am too beautiful and I mean it, I have never seen the difference between a boy or a girl because that’s not my upbringing, that my brother got this better than me and I haven’t, all this never happened, if I played with a doll even my brother did and even he played with a car even I did, so unfortunately because of this conditioning, I cannot see, ‘oh he is a boy and so he got this opportunity or he is a boy he got it easy,’ but that doesn’t mean it doesn’t exist, it does. So what is important, is we as women start speaking about the problems we face if you find a problem even in a small thing speak up because unless you won’t speak up it will not be addressed or solved. Once you speak up we will support”.\nWell, the classic example is the MeToo Movement started by Tanushree Dutta against Nana Patekar.\nInstagram\nTalking about her expectations from Women's day 2019, she said, “We don’t need a day to celebrate our gender, if this world has given this day to celebrate we should take an advantage of it and try to be the best version of yourself, embrace all things that jack people provide, you just flip it and just see how things work for you. All I want to say to every woman is, ‘You are amazing and no matter what you can face anything.’\nTwitter\nKubbra's claim to fame was with Sacred Games where she played a transgender, her character Cuckoo won millions of hearts. She was last seen in Gully Boy as an anchor.", "title": "Kubbra Sait Was Once Told She's Not Capable Because She's A Woman. Guess Who Proved Them Wrong!", "date_publish": "08/03/2019, 11:17:33", "description": "Looking gorgeous and radiant in the little white dress Kubbra Sait talks about the hurdles she faced as a woman to make it to her dreams. In conversation with Indiatimes Kubbra reveals how every woman including her has been told that we ain’t capable of doing anything but she crossed all the negativity and today she has emerged as a winner. Talking about the hurdles she has to face being a woman", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/kubbra-sait-was-once-told-she-s-not-capable-because-she-s-a-woman-guess-who-proved-them-wrong-363270.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kubbra_sait_1551869147_800x420.jpg"}