{"text": "In a shocking set of allegations against the actor Nawazuddin Siddiqui, his ex-girlfriend Niharika Singh, former Miss India and actress came out with her side of the story.\nNiharika came into the spotlight when Nawazuddin courted controversies during the launch of his autobiography. While the matter had fizzled out, today, in some fresh set of allegations against the Manto actor, Singh has managed to cause a stir.\nSharing her #MeToo story, Niharika alleged that apart from sharing a failed relationship with Nawazuddin Siddiqui, the actor was involved with a number of women and that he had married someone else in Haldwani.\n(Also read: Calling Nawazuddin Siddiqui A 'Sexually Repressed Man', Model-Actor Niharika Singh Shares Her #MeToo Story)\nJournalist Sandhya Menon has carried Niharika's detailed ordeal on Twitter stating, \"2005 Miss India Niharika Singh's experiences in Bollywood but especially with Nawazuddin Siddiqui and Mayank Singh Singvi Niharika and other women accused Siddiqui of making up lies in his autobiography, due to which he withdrew the book. This is her side of the story.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"One morning, when I was home and he had been shooting all night, Nowaz sent me a text saying he was near my building. I invited him over and asked him to come and have breakfast with me. When I opened the door, he grabbed me. I tried to push him away but he wouldn’t let go. After a little coercion, I finally gave in. I wasn’t sure what to make of this relationship. He told me it was his dream to have a Miss India or an actress wife, just like Paresh Rawal and Manoj Bajpayee. I found his little confession funny but endearing.\"\nWhile Nawaz has continued to maintain silence over it, his Sacred Games co-star Kubbra Sait has stood up for him. Taking a stand for him, she explains how there should be a thick line drawn between a failed relationship and sexual harassment.\nTwitter\nGaslighting cannot be equated to #MeToo, she adds. In series of tweets, she wrote,\nA relationship gone sour, isn’t #MeToo someone needs to recognise the toxic difference before we go picking sides.\nI stand by #NawazuddinSiddiqui or #Nowaz as a man. — Kubbra Sait (@kubrasait) November 10, 2018\nI stand by the fact that although Niharika Singh may have had a tough time in the industry, categorising her once personal relationship as a #MeToo statement is incorrectly placed. We as humans are flawed. That isn’t gender specific. — Kubbra Sait (@kubrasait) November 10, 2018\nNot many understood her point of view and started backlashing her. Reacting to all the negative comments she received after voicing her opinion, Kubbra wrote,\nIts interesting how when one doesn’t agree with a discussion or a point of view - it steamrolls into an argument. — Kubbra Sait (@kubrasait) November 10, 2018", "title": "Kubbra Sait Backs Sacred Games Co-Star Nawazuddin Siddiqui Amidst #MeToo Allegations On Him", "date_publish": "10/11/2018, 15:31:34", "description": "We need to recognise the toxic difference before picking sides, urges Kubbra Sait. She adds, I stand by the fact that although Niharika Singh may have had a tough time in the industry, categorising her once personal relationship as a #MeToo statement is incorrectly placed. We as humans are flawed. That isn’t gender specific.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/kubbra-sait-backs-sacred-games-co-star-nawazuddin-siddiqui-amidst-metoo-allegations-on-him-356404.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kubbra_sait_1541844511_800x420.jpg"}