{"text": "With a lot of Gaana Bajaana and comical hosting, Indian Award Shows are more of a source of entertainment for Indian audiences. For instance, when you have no plans for New Year’s Eve, what do you do? You sit and watch award shows on television, right? Just for entertainment!\ndmcdn.net\nThings are a lot different when it comes to International Awards. Oscars, for instance, is one of the most reputed award functions, and people actually wait to see who wins the awards in various categories. For People’s Choice Awards, on the other hand, fans vote to make their favourite artiste win.\nusmagazine.com\nIn India, the credibility of award shows has often been questioned with top-notch actors such as Akshay Kumar revealing that a lot of times the name of the awardees is changed at the last minute in order to please sponsors and others and on the basis of the attendance of the stars. No award means no show by a celebrity!\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nTwitter\nTaking a dig at the entire scenario, filmmaker Kunal Kohli who is known for films including Fanna, Hum Tum and Mujhse Dosti Karoge, went on a sarcastic rant on Twitter. He said Oscars needs to learn from Indian award shows. He added that international award shows don’t know how to keep everyone happy and that it is all about TRPs and sponsors.\n#Oscars need to learn from our awards.They don’t have a best actor critics award!\nThey actually give someone who’s not a ⭐️ best actor award? Learn from us. Stars get best actors awards. Non stars get best actor critics. Oscars don’t realise awards are about TRPs n sponsors — kunal kohli (@kunalkohli) March 24, 2019\nProblem with international awards is they don’t know how to make everyone happy.They only make makers of a few films happy. We?Performers.Hosts. Audience.Everyone is happy. International awards think awards are to honour talent.We know it’s about honouring sponsor commitments — kunal kohli (@kunalkohli) March 24, 2019\nAnd if 2 or more stars perform well in a year then various factors here can decide who gets critics and who gets popular. Basically we keep everyone happy. — kunal kohli (@kunalkohli) March 24, 2019\nAnd can you\nImagine how much revenue #Oscars have lost by not getting a name sponsor? These guys really need to learn from us. I mean wouldn’t it sound lovely to have XYZ garam masala Oscar awards?\nWasted opportunity by the academy and bafta & Cannes uffff — kunal kohli (@kunalkohli) March 24, 2019\nIt got interesting when a Twitter user pointed out how Shah Rukh Khan lost a national award for his impeccable performance in Swades to an “okayish performance in a movie like Hum Tum,” a film directed by Kunal Kohli himself. To this, here’s what he replied.\nSRK did not get the national award for Swades inspite of not only being the best male performance that year but also the biggest superstar. Imagine loosing out on for performance in a film like Swades to an okayish performance in a movie like Hum Tum. https://t.co/ew8388yakk — Suchita (@Suchita_14) March 24, 2019\nSRK’s performance in Swades will always remain one of the best ever. Some performances like his in Swades & many others stand the test of time. That’s the true brilliance & class of actors like @iamsrk — kunal kohli (@kunalkohli) March 24, 2019\nWhat is your take on Indian Award shows? Do you feel that they have lost credibility? A lot of actors have said that they don’t work to win awards. Others including Aamir Khan and Kangana Ranaut don’t even attend the award functions. Do you also feel that Indian Award shows’ relevance has been reduced to mere source of entertainment? Tell us about it in the comments section below.", "title": "Kunal Kohli Takes Sarcastic Dig At Indian Award Shows, Says Oscars Doesn't Keep Everyone Happy", "date_publish": "27/03/2019, 12:19:27", "description": "In India, the credibility of award shows have often been questioned with top-notch actors such as Akshay Kumar revealing that a lot of times the name of the awardees is changed at the last minute. Taking a dig at the entire scenario, filmmaker Kunal Kohli who is known for films including Fanna, Hum Tum and Mujhse Dosti Karoge, went on a sarcastic rant on Twitter. He said Oscars needs to learn from", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/kunal-kohli-takes-sarcastic-dig-at-indian-award-shows-says-oscars-doesn-t-keep-everyone-happy-364373.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kunal_kohlis_takes_sarcastic_dig_at_indian_award_shows_says_oscars_need_to_learn_from_us_1553668026_800x420.png"}