{"text": "The #MeToo movement has gained momentum in Bollywood over the last month. Many A-listers have been named and shamed in public. Apart from celebs, other people related to the fraternity are also being called out.\nKWAN Entertainment founder Anirban Das Blah, a popular Bollywood celebrity manager who has been accused of sexual misconduct, reportedly tried to end his life early on Friday but was saved at the last minute, police said.\nThe incident happened at 1 a.m. on Friday. Blah was caught and rescued by a traffic police patrol in Vashi area and handed over to police, a traffic police official told IANS.\nBlah's statement was recorded and he was released. The police advised his family to seek professional counselling for him.\nfacebook\nBlah was asked to step aside from his position in the wake of sexual misconduct allegations against him after multiple reported accounts indicated that Blah had made sexual advances towards women.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nFollowing this, KWAN Entertainment said on Wednesday that Blah had resigned from all his responsibilities and designations (including as a member of the Board of Directors) at KWAN and its subsidiaries/affiliates with immediate effect.\nThe company manages prominent names like Ranbir Kapoor, Hrithik Roshan, Tiger Shroff, Deepika Padukone, Sonam Kapoor, Shraddha Kapoor, Jacqueline Fernandez, Pritam, Mahesh Babu and Rana Dagubatti.\nfacebook\nThe #MeToo movement in India sparked with actor Tanushree Dutta renewing a 10-year-old allegation against fellow actor Nana Patekar, opening the floodgates for a sea of complaints against several other celebrities.\nActors and corporates in the movie industry have stepped up efforts to take stern action against offenders.\nInputs From IANS", "title": "Kwan Entertainment Co-Founder Aniran Blah Attempts Suicide After #Metoo Allegations", "date_publish": "19/10/2018, 17:17:49", "description": "KWAN Entertainment founder Anirban Das Blah, a popular Bollywood celebrity manager who has been accused of sexual misconduct, reportedly tried to end his life early on Friday but was saved at the last minute, police said. The incident happened at 1 a.m. on Friday. Blah was caught and rescued by a traffic police patrol in Vashi area and handed over to police, a traffic police official told IANS. Bl", "authors": [], "url": "https://www.indiatimes.com/entertainment/kwan-entertainment-co-founder-aniran-blah-attempts-suicide-after-metoo-allegations-355102.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kwan_founder_attempts_suicide_after_metoo_allegations_1539949826_800x420.jpg"}