{"text": "Nick Jonas and Priyanka Chopra's wedding celebrations are not just about two people in love finding their happily ever after. Rather, the celebrations have involved both the families in a way that it is more like a holiday for them.\nAgencies\nAfter Mehendi and Sangeet yesterday, the families were hooked in a cricket match, where the two teams were divided into ladkiwale and Ladkewale. The teams were called P and N.\nAgencies\nApart from the cricket match, the couple has solemnised their love affair by exchanging vows according to Christian tradition. Reports claim that Priyanka Chopra looked like a dream in her Christian bride attire. She donned Ralph Lauren's customized wedding gown. Nick Jonas looked handsome in a purple tuxedo by the same label. The couple exchanged wedding bands by the star jeweler Chopard as Nick's father, Paul Kevin Jonas Sr. officiated the wedding.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nNick and Priyanka will be getting married in both Christain and Hindu wedding ceremonies\nPTI\nAccording to a DNA report, a small gathering of 250 guests will assemble at the Darbar Hall in Umaid Bhawan for a party post the Christian wedding.", "title": "It's Official! Priyanka Chopra-Nick Jonas Get Hitched In A Traditional Christian Ceremony!", "date_publish": "01/12/2018, 16:49:43", "description": "The celebrations have involved both the families in a way that it is more like a holiday for them.The celebrations have involved both the families in a way that it is more like a holiday for them.The celebrations have involved both the families in a way that it is more like a holiday for them.The celebrations have involved both the families in a way that it is more like a holiday for them.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ladkiwale-vs-ladkewale-cricket-match-christian-wedding-here-s-how-nick-priyanka-s-day-looked-like-357747.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_chopra_and_nick_jonas_1543672963_800x420.jpg"}