{"text": "In her speech, she said, \"If I don't get another chance to say this, I just want to say I'm so proud to be a part of a movie that addresses mental health issues. They're so important. A lot of artists deal with that. And we gotta take care of each other. So if you see somebody that's hurting, don't look away. And if you're hurting, even though it might be hard, try to find that bravery within yourself to dive deep and go tell somebody and take them up in your head with you. I love you, thank you so much.\"\nHe shared, Tum muskuraado zaraa, Chiraag jalaado zaraa...andhera hataado zaraa, roshni phailaado zaraa @shibanidandekar\nDuring the Grammy awards, Michelle Obama also posted about female friendship on Twitter, writing, “A big part of friendship is showing up for your girls—that’s why I was thrilled to be there for the one and only @aliciakeys at the #GRAMMYs. She is one of the most genuine and thoughtful people I know—there’s no one better to help us all celebrate the unifying power of music!”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nToday, he is balancing his personal and professional life and adding value to Hindi Cinema with his acting calubre. However, not many know that there was also a tough time that he and his family had to face.\nRajkummar Rao had once revealed that for two years, his teachers paid his school fees. While they encouraged him to study harder, no one ever stopped him from pursuing his dream of acting.\nThe pictures from their wedding celebrations are all over the internet. The ceremony took place today and the couple tied the knot. But it is Rajinikanth who is winning the internet and everyone's hearts-thanks to his special dance moves at the wedding.", "title": "Lady Gaga's Moving Speech, Farhan's Love Note For Shibani And More From Ent World", "date_publish": "11/02/2019, 17:26:48", "description": "In her speech, Gaga said, \"If I don't get another chance to say this, I just want to say I'm so proud to be a part of a movie that addresses mental health issues. They're so important. A lot of artists deal with that. And we gotta take care of each other. So if you see somebody that's hurting, don't look away. And if you're hurting, even though it might be hard, try to find that bravery within you", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/lady-gaga-s-moving-speech-farhan-s-love-note-for-shibani-and-more-from-ent-world-361973.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/top_entertainment_news_1549886296_800x420.jpg"}