{"text": "Legendary singer Lata Mangeshkar has pledged to donate Rs 1 crore to the families of the Pulwama martyrs.\nAdinath Mangeshkar, grandson of Master Deenanath Mangeshkar, revealed that the singer will donate the money from her personal account to the NGO Bharat ke Veer, that works for India’s bravehearts under the Ministry of Home Affairs.\nAt least 40 CRPF jawans were killed when a suicide bomber drove an explosive-laden vehicle into a bus at Lethpora in Pulwama district of Jammu and Kashmir in February.\nAdinath Mangeshkar said apart from Rs 1 crore by Lata Mangeshkar, the Mangeshkar family and friends will be donating an additional Rs 11 lakh to the families of the BSF jawans who lost their lives in the Kashmir Valley. He was speaking at the announcement of Master Deenanath Mangeshkar Awards, here. Present on the occasion were Lata Mangeshkar’s sister Usha and brother Hridaynath Mangeshkar.\nBCCL\nThis year, the Master Deenanath Mangeshkar award for music and art has been conferred upon the well-known classical dancer, Sucheta Bhide-Chapekar.\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nMaster Deenanath Mangeshkar Lifetime Award will be conferred on writer Salim Khan (of the famous Salim-Javed duo), while his wife and former actor Helen will be given a special award for her contribution to Indian cinema.\nFilmmaker Madhur Bhandarkar will also receive a special award for his contribution to Indian cinema. The awards, that aim to felicitate legends from the field of music, drama, art and social work, will be presented on April 24 at a function here. The awardees will be felicitated at the hands of RSS chief Mohan Bhagwat.\n(With agency inputs)", "title": "Pulwama Terror Attack: Lata Mangeshkar Pledges To Donate Rs 1 Crore To CRPF Martyrs’ Kin", "date_publish": "16/04/2019, 14:33:43", "description": "Legendary singer Lata Mangeshkar Monday pledged to give Rs 1 crore to the families of the Pulwama martyrs. Adinath Mangeshkar, grandson of Master Deenanath Mangeshkar, revealed that the singer will donate the money from her personal account to the NGO Bharat ke Veer, that works for India’s bravehearts under the Ministry of Home Affairs.", "authors": [], "url": "https://www.indiatimes.com/entertainment/lata-mangeshkar-pledges-to-donate-rs-1-crore-to-pulwama-martyrs-kin-365539.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/lata_mangeshkar_1555405604_800x420.jpg"}