{"text": "1. Laxmi Is Elated With Deepika Padukone's 'Chhapaak' Prep, Says 'They Are Finding Beauty In Acid-Burnt Face'\n“I was happy to see Deepika’s first look from the film. The response and the messages I got on social media was overwhelming. In fact, it was my daughter’s birthday, and more than messages for her, I got congratulatory messages about the film. I was feeling good that a celebrity has come in that look. A lot of make-up artistes changed a natural face to acid distorted face after that (on social media). And I felt, ‘see, they are finding beauty in an acid-burnt face’.”\n2. Fans Rejoice As Irrfan Khan Gets Clicked Looking Healthier Post His Cancer-Treatment!\nHowever, today, it was a delightful change for all his fans as the actor was spotted without any masks and looked evidently comfortable with the camera and paps.\n3. Ranbir Kapoor Asking A Photographer 'Yeh Chappal Kahan Se Li' Proves He's Like All Of Us!\nWell, Ranbir was being clicked by the paps at the Mumbai airport today and before they could probably ask him questions related to his and Alia's rumored engagement, he asked a pap \"Yeh Chappal kahan se li\", to which the pap replied “Andheri Station.”\nDon't Miss 460 SHARES 174 SHARES 122 SHARES\n4. Yuvraj Singh’s Wife Hazel Keech Undergoes Nose Surgery, Thanks Mother-In-Law In A Heartfelt Note\nt’s been long that we haven’t heard about them, right? Hazel Keech has been keeping away from social media for a about a month. She recently revealed that she underwent a nose surgery after her mother-in-law suggested, because she couldn’t see her uncomfortable. She took her to the hospital and insisted on getting the treatment. In a heartfelt note, Hazel revealed how happy she is and thanked her mother-in-law writing “Love You Shabu.”\n5. Avengers Director Joe Russo Inspired By Rajinikanth's Robot, Also Loved Watching Salman Khan’s Dabangg\n“'Robot' almost influenced the climatic moments in 'Avengers: Age of Ultron'... In one of the final scenes all the Ultrons were suppose to form a large Ultron and Avengers were set to fight that but the sequence got cut for time. It was this close. I was inspired directly by 'Robot',” he was quoted as saying by PTI.", "title": "Laxmi Is Elated With Deepika's Prep For 'Chhapaak', Irrfan Khan Gets Clicked & More From Ent", "date_publish": "02/04/2019, 18:04:41", "description": "From Laxmi Agarwal being impressed with Deepika Padukone’s prepration for Chhapaak to Irrfan Khan being clicked after a long time, here is all that rocked the world of entertainment. In the film, that also marks her debut as a producer, Deepika Padukone will be seen playing an acid-attack survivor named Malti.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/laxmi-is-elated-with-deepika-s-prep-for-chhapaak-irrfan-khan-gets-clicked-more-from-ent-364768.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/laxmi_is_elated_with_deepikas_prep_for_chhapaak_irrfan_khan_gets_clicked__more_from_ent_1554208550_800x420.png"}