{"text": "Breaking one record after the other, Uri The Surgical Strike has apparently become one of the most loved films of the year so far. Gripping the entire nation in a high josh, the Vicky Kaushal starrer film won applauses from fans and critics alike. Adding another feather to the cap, Uri: The Surgical Strike has now bagged second spot on IMDb’s list of Top Rated Indian Films ever.\nUri The Surgical Strike, which has minted over 200 crores already, has the IMDb rating of 8.6. The movie is behind Amitabh Bachchan starrer 1971 classic Anand, which is at the first spot.\nUri has left behind films like AndhaDhun, Dangal, 3 Idiots, Taare Zameen Par, Black Friday, Khosla Ka Ghosla, Black, Rang De Basanti and Queen among others.\nThe movie, which hit the big screens on January 11, is based on the 2016 Indian Army's surgical strikes and showcases the instances of what went down during the Indian army's surgical strike in Pakistan following the attacks in Jammu and Kashmir's Uri town. The 2016 surgical strike was initiated on September 29 after four militants attacked the Indian army at Uri on September 18 and killed 19 unarmed soldiers.\nWith inputs from ANI\nDon't Miss 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES", "title": "Leaving Behind AndhaDhun & 3 Idiots, Uri Bags 2nd Spot On IMDb’s Top Rated Indian Films Ever", "date_publish": "21/02/2019, 11:29:36", "description": "Breaking one record after the other, Uri The Surgical Strike has apparently become one of the most loved films of the year so far. Gripping the entire nation in a high josh, the Vicky Kaushal starrer film won applauses from fans and critics alike. Adding another feather to the cap, Uri: The Surgical Strike has now bagged second spot on IMDb’s list of Top Rated Indian Films ever.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/leaving-behind-andhadhun-3-idiots-uri-bags-2nd-spot-on-imdb-s-top-rated-indian-films-ever-362518.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/uri_the_surgical_strike_bags_second_spot_on_imdbs_top_rated_indian_films_ever_1550728230_800x420.png"}