{"text": "Lena Headey AKA Cersei Lannister Was Devastated After Wrapping GoT, She ‘Broke Down In Tears' After Last Scene\nLena Headey AKA Cersei Lannister Was Devastated After Wrapping GoT, She ‘Broke Down In Tears' After Last Scene\nGame of Thrones has been playing with the emotions of its fans for a long time. What will happen to White Walkers and Night King? Who will defeat them and sit on the Iron Throne? Fans are done speculating.\nvia GIPHY\nThe show has not only touched the emotional chords of the fans, but also of the cast and crew. Remember, Kit Harington had said that he wept when he read the script for the finale of Game of Thrones. \"Every season, you read at the end of the last script ‘End of Season 1,' or ‘End of Season 2.' This read ‘End of Game of Thrones.',\" he told EW.\nvia GIPHY\nNow, Lena Headey who plays the role of Cersei Lannister, has revealed she was devastated after wrapping the Game of Thrones season 8. Talking about the last day at shoot, she said, \" I thought I wasn’t going to let myself get to that point because I had the last day to get through. And then when I left and I got in the car, I broke down in tears and I was ... devastated.\"\nvia GIPHY\nNikolaj Coster-Waldau who plays Jamie Lannister on the show had also revealed he cried after wrapping up the finale.\n\"It was a little bit emotional at the very, very end. It’s also just a build-up because throughout the season we had a lot of teary goodbyes and farewell dinners. When my turn came around, I really didn’t think it was going to phase me, but I have to admit that right when they said, 'This is a series wrap for Nikolaj,' there might have been a tiny bit of moisture in the air, just around my eyes,\" he had said.\nvia GIPHY\nGame of Thrones is all set to premiere on April 14. The trailer was finally released yesterday. Take a look!\nDon't Miss 161 SHARES 842 SHARES", "title": "Cersei Lannister:Lena Headey AKA Cersei Was Devastated After Wrapping GoT, Broke Down In Tears After Last Scene!", "date_publish": "06/03/2019, 14:22:38", "description": "Game of Thrones has been playing with the emotions of its fans since a long time. When will the finale season air? What will happen to White Walkers and Night King? Who will defeat them and sit on the Iron Throne? Fans are done speculating. The show has not only touched the emotional chords of", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/lena-headey-aka-cersei-was-devastated-after-wrapping-got-broke-down-in-tears-after-last-scene-363219.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/lena_headey_aka_cersei_lannister_was_devastated_after_wrapping_got_she_broke_down_in_tears_after_1551860132_800x420.jpg"}