{"text": "Lena Headey AKA Cersei Reveals Kit Harington Cried The Most During The Final Season Of GoT!\nLena Headey AKA Cersei Reveals Kit Harington Cried The Most During The Final Season Of GoT!\nThis is clearly going to be our emotion when the final season will come and go. It's not even released yet but the thought that this season of Game Of Thrones is the final one makes us emotional.\nBut we aren't the only ones feeling this pain, the entire cast and crew are finding it difficult to deal with the 'last season' withdrawals.\nThe person sitting on the Iron throne at the moment, Lena Headey aka Cersei Lannister spilled some beans about the finale. She is currently promoting her film, Fighting With My Family, when she revealed that Kit Harington got the most teary-eyed towards the end.\nWho cried the most during the final #GameOfThrones read through? @IAMLenaHeadey told us as much as she can at #Sundance pic.twitter.com/O64wygIClT — MTV NEWS (@MTVNEWS) January 27, 2019\nDon't Miss 161 SHARES\nBut this is not the first time, he sobbed on the sets of GoT. When he received the script of the final episode earlier last year, Jon Snow aka Kit Harington revealed that he was reduced to tears at a read-through for the final episode of HBO's hit fantasy series.\n“We had the read-through last week, in fact, so I know everything now,\" he said. \"I cried at the end! It wasn’t anything particular that happens. You have to remember, I’ve done eight years of it. I think, no-one really cares about it more than us.\n\"I get a bit weepy thinking about it. It’s going to be a strange year saying goodbye to everyone and having last scenes with this person and that person. Not only you’re attached to it, loads of people around the world are attached to it.”\nThe final season is all set to premiere on April 14 2019.", "title": "Lena Headey AKA Cersei Reveals Kit Harington Cried The Most During The Final Season Of GoT!", "date_publish": "30/01/2019, 12:26:34", "description": "This is clearly going to be our emotion when the final season will come and go. It's not even released yet but the thought that this season of Game Of Thrones is the final one makes us shudder. But we aren't the only ones feeling this pain, the entire cast and crew are finding it difficult in dealing with the 'last season' fact.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/lena-headey-aka-cersei-reveals-kit-harington-cried-the-most-during-the-final-season-of-got-361277.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/got_1548829255_800x420.jpg"}