{"text": "In the world of Hollywood, content is definitely the king. When you see the work of filmmaker Martin Scorsese, you know you're spending your time on good cinema. He's one of the most celebrated directors we have in world movies today and he's only getting better.\nTwitter\nAnd when a big name like him collaborates with a superb actor like Leonardo DiCaprio, you know the movie will be an unmissable one. Hollywood star Leonardo DiCaprio and filmmaker Martin Scorsese are reuniting for the film Killers Of The Flower Moon.\nYes, they are the same director-actor duo who teamed on the Oscar-nominated The Wolf of Wall Street.\nTwitter/LeonardoFC\nEric Roth is penning the script for the film, which is the feature adaptation of David Grann’s book Killers of the Flower Moon, reports variety.com.\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 151 SHARES\n“When I read David Grann’s book, I immediately started seeing it — the people, the settings, the action — and I knew that I had to make it into a movie,” said Scorsese.\nHe added: “I’m so excited to be working with Eric Roth and reuniting with Leonardo DiCaprio to bring this truly unsettling American story to the screen.”\nMedium\nThe story is set in 1920s Oklahoma and revolves around the Osage Nation, who were the richest people per capita in the world, after oil was discovered under their land and then they were murdered, one by one.\nPenguin Random House\nAs the death toll rose, the newly created FBI took up the case and unravelled a chilling conspiracy and one of the most monstrous crimes in American history. The shooting of the same will begin in Summer 2019.\nInputs from IANS", "title": "Leonardo DiCaprio And Filmmaker Martin Scorsese Are Reuniting For Killers Of The Flower Moon", "date_publish": "25/10/2018, 13:16:28", "description": "In the world of Hollywood, content is definitely king. When you see the work of filmmaker Martin Scorsese, you know you spend your time on good cinema. He's one of the most celebrated directors we have in world movies today and he's only getting better. Hollywood star Leonardo DiCaprio and filmmaker Martin Scorsese are reuniting for the film Killers Of The Flower Moon.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/leonardo-dicaprio-and-filmmaker-martin-scorsese-are-reuniting-for-killers-of-the-flower-moon-355431.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/leonardo_1540455635_800x420.jpg"}