{"text": "Leonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of 'Once Upon A Time In Hollywood'\nLeonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of 'Once Upon A Time In Hollywood'\nThe Quentin Tarantino-directed film is finally here. Hollywood actor Brad Pitt has joined Leonardo DiCaprio in for an upcoming Manson movie. The film is titled 'Once Upon A Time in Hollywood'.\nTwitter\nTarantino, who is writing and directing the film, has described the project as “a story that takes place in Los Angeles in 1969, at the height of hippy Hollywood.\"\nAnd the new posters are giving the same vibe. Take a look.\nTwitter\nDiCaprio will play Rick Dalton, former star of a western TV series, while Pitt will be his longtime stunt double, Cliff Booth. “Both are struggling to make it in a Hollywood they don’t recognise anymore. But Rick has a very famous next-door neighbour...Sharon Tate,” said Tarantino in an interview.\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 151 SHARES\n“I’ve been working on this script for five years, as well as living in Los Angeles County most of my life, including in 1969, when I was 7 years old. I’m very excited to tell this story of an LA and a Hollywood that don’t exist anymore. And I couldn’t be happier about the dynamic teaming of DiCaprio and Pitt as Rick and Cliff,” he added.\nSome of the fans are not happy with the poster and are labelling it as photoshop. One person tweeted, “Remember when REAL artist would paint real works of art for posters… Sigh, I mean I am still excited as hell for this movie but this poster is lame as f---!”\nAnother social media user wrote, “Brad Pitt looks photoshopped,” while another chimed in saying the poster looked as though Pitt’s face was fixed over Matthew McConaughey’s body.\nTwitter\nBut there are many others like us who can't wait for the trailer to come out. Here are the tweets that will get you all excited for the release of this masterpiece.\nonce upon a time in hollywood (2019) coming for every single award pic.twitter.com/06dNyh7x2G — bauti (@loganmarshaII) March 18, 2019\nONCE UPON A TIME IN HOLLYWOOD is the first Tarantino I'll have seen since JACKIE BROWN where I didn't read the screenplay ahead of time. I know a *few* things about it, but basically nothing. That's so, so exciting. — Scott Wampler™ (@ScottWamplerBMD) March 18, 2019\nTHE RELEASE DATE FOR ONCE UPON A TIME IN HOLLYWOOD CHANGED FROM AUGUST TO JULY pic.twitter.com/vHvpT90sYU — nika (@MVDICNE) March 18, 2019\nInglorious Basterds poster:\n- Minimal\n- Visceral\n- Provocative\n- Enticing\nOnce Upon a Time in Hollywood poster:\n- Minimal pic.twitter.com/Ho4UQKqKKi — Cameron Frew (@FrewFilm) March 18, 2019\nI feel like I’m the only one who in the world who doesn’t care about The Avengers. Give me the Once Upon A Time in Hollywood trailer already! pic.twitter.com/z3e1KBFJp1 — Joel (@_supjoel) March 14, 2019\nThis will be Quentin Tarantino's 9th film that he is directing. The movie is slated to release on July 26th, 2019. What do you think of the posters?", "title": "Leonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of 'Once Upon A Time In Hollywood'", "date_publish": "19/03/2019, 11:49:57", "description": "Leonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of Once Upon A Time In HollywoodLeonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of Once Upon A Time In HollywoodLeonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of Once Upon A Time In HollywoodLeonardo DiCaprio & Brad Pitt Are Sizzling It Up In The New Poster Of Once Upon A Time In HollywoodLeon", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/leonardo-dicaprio-brad-pitt-are-sizzling-it-up-in-the-new-poster-of-once-upon-a-time-in-hollywood-363933.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/hollywood_1552978135_800x420.jpg"}