{"text": "I picked up 11 films that didn't just manage to rake in box-office numbers but proved that content eventually ends up becoming the strongest USP of a film. If you have missed watching any of these, make sure you watch these before 2018 ends. You have got a week.\nReports claim that the actor's charitable foundation has raised more than $100 million in the fight against climate change. Just to jog your memory a little, it's been years since Leo's started focusing on raising awareness. In 1998, he formed his own foundation to combat several issues.\nShe said, “I was extra naive when I joined the industry. There was an incident that did not harm me so much, but it still had an impact on me. I had to make a choice, and obviously, for me, the choice was clear. I chose not to submit. I did not find work for eight months. I snapped out of it. Today, I'm working with people I want to work with.”\nDon't Miss\nHe said the death of a cow was being given importance over killing of a policeman. Wondering why his comments on mob violence were being misconstrued with some people calling him a \"traitor\", actor Naseeruddin Shah said on Friday that he spoke as a \"worried Indian\" and has the right to express concerns about the country he loves.\nA source said, \"After their honeymoon in Switzerland, Priyanka will fly down to Mumbai for a schedule of The Sky Is Pink. She will join Nick in LA towards the month-end, to host a reception for their friends. Her team is currently doing a recce in Malibu and will soon finalise a venue. It will be a black-tie event, with Priyanka’s close friends Kerry Washington, Dwayne Johnson, Ellen DeGeneres, and Meghan, Duchess of Sussex, on the guest list. Many other Hollywood stars, including her co-stars from A Kid Like Jake and Isn’t It Romantic?, and Nick’s friends from the music fraternity are also expected. Besides her family, Priyanka’s cousin Parineeti Chopra is also likely to fly down for the soiree.”", "title": "Leonardo DiCaprio's Foundation's Noble Gesture, Top 11 Movies Of 2018 And More From Ent", "date_publish": "22/12/2018, 17:45:24", "description": "I picked up 11 films that didn't just manage to rake in box-office numbers but proved that content eventually ends up becoming the strongest USP of a film. If you have missed watching any of these, make sure you watch these before 2018 ends. You have got a week.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/leonardo-dicaprio-s-foundation-s-noble-gesture-top-11-movies-of-2018-and-more-from-ent-359098.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ent_trending_1545478927_800x420.jpg"}