{"text": "Some film stars know how to make a valuable contribution and give it back to society. One of them is award-winning actor Leonardo DiCaprio.\nReports claim that the actor's charitable foundation has raised more than $100 million in the fight against climate change. Just to jog your memory a little, it's been years since Leo's started focusing on raising awareness. In 1998, he formed his own foundation to combat several issues.\nLeonardo DiCaprio Foundation has always aimed at providing disaster relief aid in the past and went on to make donations to the victims of the 2004 Indian Ocean tsunami, the 2010 Haiti earthquake, and Hurricane Sandy in 2012.“\nAnd now, a statement from DiCaprio on the foundation’s website read,\nAgencies\nDon't Miss 2.8 K SHARES 1.8 K SHARES 299 SHARES 12.5 K SHARES 5.5 K SHARES\n“When I founded LDF 20 years ago, I did so base on the simple idea that we could make a real difference by directly funding some of the most effective environmental projects. Whether it be individuals, grassroots movements or major non-profits, we wanted to focus on getting critical funding to those who could have the greatest impact. We are extremely proud to celebrate 20 years of this model. Since 1998, we have supported over 200 projects on every continent and in every ocean from habitat and species conservation, renewable energy, climate change, indigenous rights, and more. I am pleased to announce $11 million in new grants across our six program areas, bringing the total financial impact of LDF to over $100 million. (sic)”\nThe 44-year-old actor also produced and starred in the 2016 documentary film ‘Before the Flood’, that majorly focused on the issue of climate change.", "title": "Leonardo DiCaprio’s Charitable Foundation Donates $100 Million To Battle Against Climate Change", "date_publish": "22/12/2018, 15:59:28", "description": "Reports claim that the actor's charitable foundation has raised more than $100 million in the fight against climate change. Just to jog your memory a little, it's been years since Leo's started focusing on raising awareness. In 1998, he formed his own foundation to combat several issues.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/leonardo-dicaprio-s-charitable-foundation-donates-100-million-to-battle-against-climate-change-359092.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/leonardo_1545474797_800x420.jpeg"}