{"text": "Like Father, Like Son! Saif Ali Khan's Childhood Picture Is Going Viral, Reminds Us Of Taimur Ali Khan\nLike Father, Like Son! Saif Ali Khan's Childhood Picture Is Going Viral, Reminds Us Of Taimur Ali Khan\nSaif Ali Khan’s childhood picture has been going viral on the internet for all right reasons. The Chote nawab’s snap will instantly remind you of his tiny tot and the most loved kid on earth right now - Taimur Ali Khan.\nTwitter\nYes! Taimur is an uncanny resemblance of papa Saif, don’t believe us? Well, they say pictures don’t lie. Just look at this childhood picture of the Bazaar star and now compare it with little Taimur.\nBollywoodShaadi.com\nTaimur has become the apple of our eyes, thanks to paparazzi. The little kid is followed everywhere and his videos and little glimpses get viral in no time. He is mostly spotted with his father Saif when they are on their way to play time.\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nSaif once revealed to the media how he loves spending time with his youngest son,\n“He has learnt a few new words. He calls me ‘abba’ and has now started to say ‘baby’ and ‘gum’. Whenever he sees a chewing gum, he would just scream ‘gum’. He likes to watch the moon, so I sit with him in my office and show him the moon”.\nThis little boy definitely blossoms our day. And now with his father's image doing the rounds, it's tough to tell who's cuter.", "title": "Like Father, Like Son! Saif Ali Khan's Childhood Picture Is Going Viral, Reminds Us Of Taimur Ali Khan", "date_publish": "27/10/2018, 18:52:15", "description": "Saif Ali Khan’s childhood picture has been going viral on the internet for all right reasons. The chote nawab’s childhood picture will instantly remind you of his chote Nawab and the most loved kid on earth right now- no guesses- It’s Taimur Ali Khan.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/like-father-like-son-saif-ali-khan-s-childhood-picture-is-going-viral-reminds-us-of-taimur-ali-khan-355532.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/taimur_1540560914_800x420.jpg"}