{"text": "In the iconic cartoon created by Bill Watterson, six-year-old Calvin has an imaginary friend, a tiger called Hobbes. In a strip published in 1988, Calvin finds out that tigers face extinction, and with that Hobbes comes to this unsettling realisation, ‘This explains why I don’t meet many babes.’\nHobbes is absolutely right. Chances of him finding a mate have always been rather dim as, according to recent data from the WWF, there are around 3,900 wild tigers left in the world.\nAvni was one such tigress prowling the forests of Yavatmal, and two years ago she had been deemed a ‘man-eater’ by forest rangers. So on one hand, you had poor villagers living in fear of animal attacks and on the other, there was a frightened mother, struggling to feed and protect two ten-month-old cubs from all sorts of predators, including those of her own kind. In the animal world, the dominant male tiger usually kills cubs, which could be another reason why Avni and her cubs moved towards the outskirts of the forest. Each time she and her children were hungry, she had to go looking for food in a degraded forest with scarce resources. But instead of encountering boars and deer, her prey became the two-legged creatures who entered her territory. This volatile situation led to 13 tragic deaths and soon, the forest department was under immense pressure to capture the tigress.\nThe absurd incidents involved in tracking down Avni could have easily appeared in Watterson’s comic strip. Five elephants were brought in to track Avni and I suppose the rangers were too busy looking for Calvin Klein perfume to notice that one had wandered off and killed a local woman instead. The perfume, by the way, wasn’t used by them to attract members of the opposite sex, but to lure Avni with its intoxicating pheromones.\nDon't Miss 9.8 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nTOI\nAt one point, the forest department officials met a man and I assume the conversation went this way. ‘Arre bhaisaab, I have an idea, let’s use my dogs to sniff out Avni.’ When the officials asked him if he was a conservationist or a trained veterinarian, he said, ‘Nope! I’m just a golfer dude.’ So the forest department, instantly impressed with these fine credentials, abandoned all their other plans and decide to chase a feline with a canine till they all went down the rabbit hole. It was finally concluded that the dogs were clearly inexperienced. A statement that could perhaps be applied to the department itself.\nShafath Ali Khan, the sharpshooter hired by the forest department, has been quoted in the New York Times as saying, ‘She has learned from all these botched capture operations; we’ve made her very smart. Brilliant, actually.’\nThis pursuit ended when Avni, who was meant to be tranquilised, was shot dead by Shafath Ali Khan’s son, Asghar Ali, earlier this month. The official statement claimed that Avni charged at the hunting party and was shot in self defence.\nThe narrative gets murkier when Avni’s autopsy revealed that the dart did not have the kind of impact it would have had had it been fired from a tranquilising gun. The trajectory of the bullet also indicated that she was facing away from the shooter. How could the forest department and the hunters then claim that she was killed in self-defence, unless like Michael Jackson, Avni had also perfected the moonwalk?\nBCCL\nAvni’s death has led to widespread criticism, with Union minister and animal rights activist Maneka Gandhi demanding that Sudhir Mungantiwar, minister of forests, step down for ordering the killing. It has also resonated with protesters who have been marching across multiple cities with banners demanding ‘Justice for Avni.’\nAvni the tigress has become a symbol for all the things that India does not want to tolerate anymore — callousness, ineptitude and, above all, the sab chalta hai attitude that has governed our mindsets all these years.\n‘Tyger Tyger, burning bright,’ wrote poet William Blake, but today it is India’s heart that is burning for Avni and her orphaned cubs.\nMuch of the onus of this heart-breaking tale is on our ever-shrinking forest space as 1.3 billion humans force themselves into closer and closer proximity with animals. These are the real issues at stake here, and ones that need realistic solutions quickly. Or else we will continue having Man and Tiger, staring at each other across the void, waiting to see who will blink first.\nA situation that perhaps Hobbes had already foreseen because when Calvin, walking through snowy fields, asks him, ‘What’s our purpose in life?’ The tiger shrugs and says, ‘We are here to devour each other alive.’\nOriginally published in The Times of India", "title": "Linking Calvin & Hobbes To The Tragic Avni Row, Twinkle Khanna Blogs About Killing Of Animals", "date_publish": "18/11/2018, 11:38:05", "description": "In the iconic cartoon created by Bill Watterson, six-year-old Calvin has an imaginary friend, a tiger called Hobbes. In a strip published in 1988, Calvin finds out that tigers face extinction, and with that Hobbes comes to this unsettling realisation, ‘This explains why I don’t meet many babes.’ Hobbes is absolutely right. Chances of him finding a mate have always been rather dim as.", "authors": ["Twinkle Khanna"], "url": "https://www.indiatimes.com/entertainment/linking-calvin-hobbes-to-tragic-avni-row-twinkle-khanna-blogs-about-killing-of-animals-356876.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/linking_calvin__hobbes_to_tragic_avni_row_twinkle_khanna_blogs_about_killing_of_animals_1542527250_800x420.jpg"}