{"text": "It's safe to assume that Taimur Ali Khan's popularity meter ranks way higher than his parents Saif Ali Khan and Kareena's put together. His parents might be popular public figures but everyday our social media timelines are only full of pictures from Taimur's everyday schedule.\nInstagram/Taimur\nFrom pictures of him going to his playschool to him, playing in his balcony, everything and anything that Taimur does as a kid of his age suddenly become a news, thanks to the paps who go to any extent to get these pictorial updates from Taimur's life.\nWhile we gush over his cuteness, this in totality has become extremely worrisome for his parents. In a recent interview with Film Companion, Kareena expressed how she feels as Taimur's mother with all the spotlight that is constantly on him. She said,\nAgencies\n“Taimur can’t run away from his popularity and neither can his parents. When I saw the doll, I wondered what was I supposed to say. But Saif pointed out that it is because people love him so much and such things are a blessing for him. There is so much genuine warmth for our son that it’s bad to stop people from clicking his pictures or making his dolls. But, they should understand that he is a two-year-old child and needs a normal life. Both Saif and I are struggling to give him that and will continue to do so without telling the media to back off, no matter how annoying it gets after a point. It’s tough on him as it’s on Saif and me.”\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nKareena spoke about Saif's idea of sending Taimur to a British boarding school. She was quoted as saying,\nViral Bhayani\n“They are leaving us with no choice. But of course, as a mother, it would kill me to send him away. And I think it'd be unfair and I tell Saif that it'd be like running away from reality because this is the reality.”\nA few days ago, even Saif had echoed similar thoughts as Bebo. He too was open to the idea of sending him to a boarding school. He said,\nViral Bhayani\n“Maybe I’ll send him to a boarding school when he is 13. I don’t know, growing up as a star kid, going to the schools of Bandra and Juhu. He needs to see the world.”\nIn other news, internet's favorite kid and the apple of Kareena and Saif's eyes Taimur is going to turn two.", "title": "Looking At Taimur's Popularity In India, Kareena Might Consider Sending Taimur To A Boarding School", "date_publish": "24/11/2018, 12:58:39", "description": "From pictures of him going to his playschool to him, playing in his balcony, everything and anything that Taimur does as a kid of his age suddenly become a news, thanks to the paps who go to any extent to get these pictorial updates from Taimur's life.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/looking-at-taimur-s-popularity-in-india-kareena-might-consider-sending-taimur-to-a-boarding-school-357297.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kareena_1543046033_800x420.jpg"}