{"text": "Looking For Inspiration? Disha Patani's Insta Posts Will Help You Set Fitness Goals Like A Boss\nLooking For Inspiration? Disha Patani's Insta Posts Will Help You Set Fitness Goals Like A Boss\nBollywood actress Disha Patani might have not featured in a lot of Bollywood movies but she already has a massive fan following on social media. The actress is leading on Instagram with 14 million followers leaving behind many A-listers.\nInstagram/Disha Patani\nWhether it's her workout videos or just being her happy fashionable self, Disha Patani became the national crush of India in no time. Recently, the actress was seen practicing kickboxing for her upcoming film Bharat.\nAnd we bet she will make your jaw drop. Here's taking a look at Disha Patani's videos and photos that will make you fall in love with her and inspire you. Again.\n1. Disha is a part of the Salman Khan-starrer Bharat in which she is playing the role of a trapeze artist\nDon't Miss 106 SHARES\n2. Disha is a fitness freak and that is no secret. For the film, Disha is required to gain a lot of strength and flexibility\n3. She takes her fitness regime seriously and hardly ever misses a day in the gym. Yes, she trains on Sundays as well\n4. Despite her petite body and an adorable face, Disha makes sure she doesn't take her body for granted.\n5. She made her Bollywood debut with MS Dhoni and since then there has been no looking back\n6. She is one of the youngest actresses to have created waves, whether it's her rumoured relationship with Tiger Shroff or her upcoming film with Salman, Disha is on the top of her game\n7. She has one of the most well-sculpted bodies and does not shy away from flaunting it\n8. Her washboard stomach can make anyone green with jealousy. Not only work out, Disha has also been giving tremendous fashion goals\n9. Interestingly, she has been training with Rakesh Yadav, a celebrity action trainer and martial arts expert who is Tiger Shroff's trainer too.\n10. Whether it's her fun work out videos or sultry bikini pictures, Disha Patani makes her fans keep wanting for more\n11. She was last seen in Baaghi 2 with Tiger Shroff which did an average business on the box office\n12. Disha had earlier shared the excitement by saying, “I’m excited to be a part of Bharat, it’s like a dream come true to get an opportunity to work with Salman sir and I can’t wait for the journey to begin. I am a big fan of Ali Abbas sir’s work”.\n13. Continue to sizzle and look hot, you!", "title": "Looking For Inspiration? Disha Patani's Insta Posts Will Help You Set Fitness Goals Like A Boss", "date_publish": "25/10/2018, 15:32:36", "description": "disha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bharat, kickboxingdisha patani, bollywood, news, work out, bhara", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/looking-for-inspiration-disha-patani-s-insta-posts-will-help-you-set-fitness-goals-like-a-boss-355447.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/disha_1540463056_800x420.jpg"}