{"text": "Lovebirds Alia & Ranbir Will Celebrate Christmas And Ring In The New Year In New York\nLovebirds Alia & Ranbir Will Celebrate Christmas And Ring In The New Year In New York\nLove is in the air for our Bollywood stars. This year we saw our lovebirds Ranveer Singh- Deepika Padukone, Sonam Kapoor- Anand Ahuja and Priyanka Chopra- Nick Jonas taking their relationship one step ahead by getting hitched and taking a promise to be one for life.\nTwitter\nWhile other lovebirds Arjun Kapoor- Malaika Arora and Alia Bhatt – Ranbir Kapoor are painting the town red with their dinner and movie dates.\nTwitter\nAnd now the latest update about lovers Alia and Ranbir is that they are all set to ring in Christmas and New York in RK’s favourite city - New York. Yes!\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES\nTwitter\nAs per reports in an entertainment portal,\n“Ranbir and Alia are planning to spend some time in New York during Christmas and New Year. Also, Rishi Kapoor is undergoing treatment in NYC, so they have plans to even join them. Neetu Kapoor has been with Rishi since he was detected by an unknown disease.”\nTwitter\nThere is also a huge buzz that the couple will get hitched by next year once they complete shooting for their first film together Brahamstra.", "title": "Lovebirds Alia & Ranbir Will Celebrate Christmas And Ring In The New Year In New York", "date_publish": "06/12/2018, 15:20:09", "description": "Love is in the air for our Bollywood stars. This year we saw our lovebirds Ranveer Singh- Deepika Padukone, Sonam Kapoor- Anand Ahuja and Priyanka Chopra- Nick Jonas taking their relationship one step ahead by getting hitched and taking a promise to be one for life. While other lovebirds Arjun Kapoor- Malaika Arora and Alia Bhatt – Ranbir Kapoor are painting the town red with their dinner and movi", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/lovebirds-alia-ranbir-will-celebrate-christmas-and-ring-in-the-new-year-in-new-york-358066.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranbir_1544087671_800x420.jpg"}