{"text": "Who is happy in a marriage? I am yet to meet a person who says wedding is the end of the world – a beginning of happily ever after! I am single and unmarried. And according to the society’s norms and values, it’s time I should “settle down”.\nvia GIPHY\nA lot of aunties and even uncles – some of whom I know and others just being my 'well-wishers' – often come to me to give free advice on why I should “settle down”. “Beta aapki umar kya hai? 26? Aur Aapne Abhi Tak Shaadi Nahi Ki? Hawwww! Beta, career toh banta rahega, shaadi kar lo… humari toh 21 saal mein ho gayi thi… yahi sahi umar hai shaadi karni ki…”\nvia GIPHY\nYou know what I am talking about, right? Your billion family members and distant relatives and even people who you’ve never met in the past have only goal in life – to get you married! My parents have given me all the freedom to live my life on my own terms, but that doesn’t stop other people from worrying, does it?\nvia GIPHY\nMarriages – they are made in heaven. That’s what they say! But maybe on Earth, things are a little different. What is made in heaven often finds it tough to survive on Earth.\nSorry to burst your bubble, but seriously, things that you see in movies don’t exist in real life.\nDon't Miss 1 K SHARES 168 SHARES 479 SHARES\nvia GIPHY\nRemember being glued to the TV screens and watching DDLJ, Hum Aapke Hain Kaun and Hum Saath Saath Hain during childhood, and waiting for your D-day to arrive so that you can finally fulfill your #ShaadiGoals? Music, dance, fun, frolic and showbaazi – you thought they were synonymous to wedding. But weddings in real are no joyride.\nYour relatives might want you to tie the knot soon. These aunties might convince you to say 'yes' for marriage but they'll not tell you what happens after that. The process is not similar to what you've seen in movies. Bollywood has apparently ruined the idea of love and marriages for us. They have given us dreams but the reality is far from it. The wedding is for a day, but marriage is for a lifetime. These aunties might allure you to get ready for that one big day in your life, but nobody's going to tell you what follows after that. In such an era, Made in Heaven comes as a breath of fresh air. A show that is much more close to reality than what you have seen so far.\nvia GIPHY\nA beautifully told tale about Delhi’s ‘upper crust’, its fake classiness, homophobia and rampant hypocrisy, Made in Heaven is perhaps one of the best ever Indian shows that aptly reflects what’s wrong with the current-age society. It shows a true a picture of how wedlock looks like – no exaggeration, no dreams and no illusions.\nEach episode introduces you to a new family and tells you a new story about Indian weddings and what problems people face while going through it. It's not a cakewalk, it comes with a lot of responsibilities, confusions, tough decision and much more.\nAll marriages have secrets!\nvia GIPHY\nSometimes even in love marriages, people aren’t honest with each other. Sometimes, marriages are political or business deals. Every wedding has a secret, each one of them.\nBe it Dubai princess Harsimran Mann who kept her one night stand affair with Sarfaraz Khan a secret before she married the love of her life Joginder Sethi in episode 2, or be it Devyani Singh, a pilot who is getting married into a royal family, paying off the mehendiwali to keep her mouth shut about an incident of abuse at her pre-wedding festivities in episode 7, there are deep dark secrets and selfish motives involved in every wedding.\nShaadi Ke Side Effects!\nvia GIPHY\nIt’s a lie. You never really get settled in life after wedding. If you feel that life after the wedding will set you free, it might cause you more trouble and responsibility. And sometimes, it will trap you and crush your freedom-loving spirit.\nIn one of the episodes of the show, a woman ties a knot with divorced-impotent NRI man because he offered her ticket to America. Did she get the freedom she was looking for? Of course not!\nPeople CHOOSE to be in a marriage; it’s a choice!\n“What do really you want? I want to have happy marriage. Then sweetheart, you’re going to have to shut the fuck up!”\nvia GIPHY\nReal relationships are complex and people choose to be in them. Made In Heaven throws light upon people’s self-interest involved in weddings.\nLove is defected!\nvia GIPHY\nNo love story is perfect. Love is made of compromises. You have to decide where and when to compromise. Each episode sheds light on this very fact.\nHappily ever after doesn’t exist!\nvia GIPHY\nYou have to create happiness in life. Dull moments can succumb you into the dark side of life. If you feel that your marriage will change your life, think about it once again. Think about the married people in your life. It’s going to be a new phase, but not necessarily a dreamy fairytale.\nMade in Heaven is an intelligent show – not everyone’s cup of tea. But I would still want all the aunties and uncles who give me false hope in order to convince me to get married to watch this show once and agree with me on the fact that marriages are not made in heaven – they are not the beginning of happily ever afters!\nvia GIPHY\nLike other things in life, marriage is also a choice, and there’s nothing wrong and right about it. Everyone gets to choose what they want and what’s best for them, right?\nIf I were to ask you how your life has significantly changed after you tied the knot, would you have a convincing answer for me?", "title": "A Show Every Aunty Who Wants You To Get Married & ‘Settle Down’ Should Watch", "date_publish": "13/03/2019, 12:50:47", "description": "Beautifully told tale about Delhi’s ‘upper crust’, its fake classiness, homophobia and rampant hypocrisy, Made in Heaven is perhaps one of the best ever Indian shows that aptly reflects what’s wrong with the current-age society. It shows a true a picture of how wedlock looks like – no exaggeration, no dreams and no illusions.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/made-in-heaven-is-a-show-every-aunty-who-wants-you-to-get-married-settle-down-must-watch-363572.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/made_in_heaven_a_show_every_aunty_who_wants_you_to_get_married__settle_down_should_watch_1552380877_800x420.jpg"}