{"text": "Made In Heaven Actor Jim Sarbh Feels The Best Way To Deal With Failure Is To ‘Suffer’\nMade In Heaven Actor Jim Sarbh Feels The Best Way To Deal With Failure Is To ‘Suffer’\nJim Sarbh is the current heartthrob of the internet, thanks to Made In Heaven. His performance has made him won accolades and he totally deserves it.\nInstagram\nIndiatimes had a chat with the actor where we first asked him if he ever thought Made in Heaven would be so successful, to which he had a straightforward answer and that is, ‘ YES’. That’s Jim Sarbh for you.\nMoving on he said, the writing, the directors, the cast attracted him to do the show and he was totally right.\nTalking about the best compliment he received for Made In Heaven, Jim says, “People seem to like the show, the dichotomies the show explores, and the richly expressed characters that are all trying their best in this strange tough world.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nJim has smartly taken decision in his career, from making a debut with Neerja to Made In Heaven, his choices are damn impressive, we asked if he has taken a conscious decision to do such different characters every time to stay relevant, he says, “ I don’t really believe any decision is conscious: the way you mean it.”\nTwitter\nMade In Heaven was groundbreaking in every way, especially the gay consensual scenes, those were liberating and welcoming, but Jim feels otherwise, “ I guess we just have different standards. I consider the depiction, the norm, based on international literature, art, and cinema. The fact that it is groundbreaking is very confusing and strange for me.”\nTwitter\nJim who is riding high on success, when asked if he fears losing it, he had the most cheeky reply to it, “ I am too overwhelmed with my fear of dying and/or peanut butter getting stuck to the roof of my mouth to give this much thought.”\nTwitter\nDefining what’s success for him Jim says, “Just now I’m sitting by the pool in a hotel in Delhi with the afternoon off from shooting a film, answering an interview about a web series I shot while staying in the exact same hotel; I am reading a book who’s author wants to cast me as the protagonist, and I just landed this morning from Calcutta where I performed a play to a houseful audience.”\nWhen we asked him how he deals with failures, pat came the reply,” Suffer”. No other actor has been blunt in accepting failure like Jim.\nWhen asked would he say yes to a film without liking the script because his favourite director is filming it, he said, “If I didn’t like the script, but I loved the director, I would wonder why this director is making this particular film, and then I would try to see it from his or her perspective. If perhaps, he/she sees something I don’t, I would try to understand it and work with her/him. If perhaps, I see something she/he doesn’t, I would try to explain it to her/him and work to change the script.”\nTwitter\nLastly, we concluded by asking what’s his dream role, to which he said, “If I knew, I’d make it.”\nTwitter\nJim is the one actor who believes in talking less and expressing more.", "title": "Made In Heaven Actor Jim Sarbh Feels The Best Way To Deal With Failure Is To ‘Suffer’", "date_publish": "15/04/2019, 18:28:19", "description": "Jim Sarbh is the current favourite on the internet thanks to Made In Heaven. His performance has made him won accolades and he totally deserves it. Indiatimes at an exclusive chat with the actor where we first asked him if he ever thought Made in Heaven would be so successful, to which he had a straightforward answer and that is, ‘ YES’. That’s Jim Sarbh for you. Moving on he said, the writing", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/made-in-heaven-actor-jim-sarbh-feels-the-best-way-to-deal-with-failure-is-to-suffer-365500.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/jim_sarbh_1555332920_800x420.jpg"}