{"text": "Finally, India can boast of a show on weddings that shows much more than what we usually see in Bollywood films and TV shows. 'Made in heaven' revolves around four main characters: Karan, Taara, Faiza and Aadil- all trying to break free from various shackles of the society that exhaust them mentally.\nAmazon Prime\nThe show is supported by a strong ensemble cast that includes Shashank Arora and Shivani Raghuvanshi and other pivotal guest appearances that includes Deepti Naval, Shweta Tripathi, Vinay Pathak, Ayesha Raza, Rasika Duggal among others.\nAmazon\nThe show doesn’t just expose our hypocrisy but also revolves around the challenges that a lot of us face but never speak about.\nTiger baby productions\nWe have seen several shows and films that are around weddings including Bang Baaja Bride or the evergreen classic Monsoon wedding but Made In Heaven is a show that has a lot more to offer.\nTiger Baby and Excel\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn case you are wondering whether to binge-watch the series, we give you legit reasons and an overview on why the show is by far the best take on what lies behind the ugly truth of India’s obsession with the idea of lavish weddings.\n1. Gender Neutrality and an unbiased narrative:\nExcel and Tiger Baby Productions\nEven though the show is made and written by a team of strong and powerful women, the narrative of the show nowhere gets bogged down with the biases of a woman’s point of view. The show is gender-neutral and it narrates the pain of women as powerfully as much as it shows the challenges that men face, but hardly talk about. It’s delightful to see a story that throws spotlight on the fact that it’s not only women who are the victims of patriarchy but men too are a soft target.\n2. \"Hum kya ab ek aurat ki sunenge?\"\nTiger Baby and Excel\nIn of the scenes from the show, a team of workers bring an abrupt halt to their work as they refuse to take orders from a 'woman'. The scene was short but it delivered the message with a strong sense of sexism that women face at their work-place. There are several strong messages that the characters deliver with ease and subtleness that we usually don't see in films and TV.\n3. From #MeToo to Section 377- the plot of the series manages to do justice in delivery powerful messages with utmost ease.\nThe plot takes you through the struggles of people of several strata. In some of the scenes Karan travels to and fro in the flashbacks from his childhood and how he feels today. Even after being all grown up and becoming independent, he struggles to make everyone accept his sexuality and how being gay is normal and how he too deserves to lead a life of equal respect. Even though there are parallel narratives and multiple characters, the show still manages to hold on to its various ways of imparting strong social messages. The show deserves appreciation for making each and every character stand out by giving them the spotlight they truly deserve.\n4. The ensemble cast is the biggest victory of the show\nAgencies\nSobhita Dhulipala and Arjun Mathur are both fresh talent, real and convincing as they take you on the journey of what it feels to be Tara and Karan. While one is trying to save her marriage and individuality that she somehow lost on the way to chase success, the other is trying to be brave while making his choices. And Jazz and Kabir, aka Shivani and Shashank Arora are adorable too. While their characters are contrast and Kabir is more hot-headed than Jazz, both the characters manage to leave a mark as they tell their own story.\n5. Jim Sarbh and Kalki Koechlin:\nExcel and Tiger Baby\nTwo of the most underrated and refined gems of the film industry portray two of the most interesting characters of the show. However, they have something in common: They belong to the creamy layer of the society but both are fickle, fragile and lonely. Their choices are driven by their selfish motives but are morally wrong at a lot of levels. Even though most of their choices are formidable, your heart still somehow goes out for them. The way Kalki and Jim have portrayed the fragility of their character is what makes them two of the most crucial characters of the show-who have a lot of tell.\n6. The show unveils the dark reality that lies behind the glitzy appeal of wedding albums:\nTiger baby and Excel\nIndia is a country that is clearly obsessed with the idea of weddings. No matter how much one earns, everyone wants to 'marry off' their daughter in the best of their capacity and in a set up that's nothing short of lavish and royal. The show uncovers the reality and tells us a lot about the fact that one could be an IAS officer but still could believe in the practice of dowry because \"yeh paisa toh hum dono ke liye hai na\". There is a lot that goes behind planning and executing the wedding and the intricate details shown in the form of nine different weddings in the show is what makes it one of its kind. Never have we seen a wedding where a bride throws a tantrum and puts across a demand of having her own music video but these things do exists. Made in heaven is a world where behind glossy wedding albums and a crore-worth pre-wedding video lies several truths that are the focus on the current sociopolitical realities of our country.\n7. Zoya Akhtar and Reema Kagti-As two creative forces, they are indeed made in heaven\nTwitter\nAlong with Alankrita Srivastava and Nitya Mehra, the Zoya and Kagti have created a web-series that takes you on a journey of broken relationships, dreams, the inner-battle to fit in and stand out and everything in between.\n8. The diversity of the characters and the complexes they battle with\nAgencies\nBe it Karan’s battle with his own family about his sexuality or Tara’s fight with her own self who is exhausted with the mask of elitism and the challenges that come with positioning oneself too hard in the posh setup, where the plastered smile on the face is an unsaid mandate- Made in heaven has to say a lot and nine episodes have been sketched beautifully to give a verdict in its own way.", "title": "Made In Heaven: Finally A Show That's Much More Than Just Crazy Rich Indians Getting Married!", "date_publish": "10/03/2019, 12:06:02", "description": "All these characters are sketched and embroidered in a narrative that takes us closer to the reality of elitism, patriarchy, sexism and several other taboos that exists in the society. The show doesn’t just expose our hypocrisy but also revolves around the challenges that a lot of us face but never speak about.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/made-in-heaven-finally-a-show-that-s-much-more-than-just-crazy-rich-indians-getting-married-363461.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/made_in_heaven_1552209252_800x420.jpg"}