{"text": "Madhuri Dixit Got Emotional When She Was Told To Fill In Sridevi's Shoes In Kalank\nMadhuri Dixit Got Emotional When She Was Told To Fill In Sridevi's Shoes In Kalank\nIt’s been a year of Sridevi’s death, but the void is still there and it will always be. She is missed every day.\nTwitter\nAfter her death, Madhuri Dixit filled in her space in Karan Johar’s Kalank and now she is hopeful she will make Sridevi proud.\nTwitter\nWhile talking to DNA, Madhuri said,\n“When I was on the sets, I looked at it as just another role. But, yes, I was extremely emotional when Karan (Johar) asked me to take up her role. I hope I make her proud”.\nTwitter\nDon't Miss 161 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nShe further added, “ We had known each other for many years and shared a warm equation. It was difficult for everyone in the industry to wrap their heads around her sudden loss. It is still hard to accept the truth. I don’t think anyone of us has still come to terms with her absence. We will always feel the void”\nTwitter\nIn fact, Janhvi too thanked Madhuri for taking up her mom’s role. She took Instagram and wrote, “Abhishek Varman's next film was very close to mom's heart ...Dad, Khushi and I are thankful to Madhuriji for now being a part of this beautiful film”.\nTwitter\nKalank is a period drama set in 1940s. The film also features Alia Bhatt, Varun Dhawan, Aditya Roy Kapur and Sanjay Dutt in pivotal roles. Interesting Kalank was originally conceptualised by Karan Johar’s father Yash Johar.", "title": "Madhuri Dixit Got Emotional When She Was Told To Fill In Sridevi's Shoes In Kalank", "date_publish": "28/02/2019, 14:31:52", "description": "It’s been a year of Sridevi’s death, but the void is still there and it will always be. She is missed every day. After her death, Madhuri Dixit filled in her space in Karan Johar’s Kalank and now she is hopeful she will Make Sridevi proud. While talking to DNA, Madhuri said, “When I was on the sets, I looked at it as just another role. But, yes, I was extremely emotional when Karan (Johar) asked", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/madhuri-dixit-got-emotional-when-she-was-told-to-fill-in-sridevi-s-shoes-in-kalank-362924.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/madhuri_dixit_1551345246_800x420.jpg"}