{"text": "Madhuri Dixit Feels The Biggest Pressure While Taking Kalank Was To Not Let Sridevi Down\nMadhuri Dixit Feels The Biggest Pressure While Taking Kalank Was To Not Let Sridevi Down\nYou surely would be living under a rock if you're unaware of the fact that Sridevi was originally roped in for the role of Bahaar Begum in Dharma's ambitious project, Kalank. But due to unfortunate and untimely demise of the veteran actress, Karan passed on the role to Madhuri Dixit.\nJust to jog your memory a little, Sridevi's daughter and actress Janhvi Kapoor even thanked Madhuri for accepting the role.\nAnd now, after the release of the first look of Bahaar Begum, Madhuri opened up about the role. Speaking to Mid-day about stepping into a role that was originally supposed to be played by Sridevi, Madhuri said, “I don’t want to let her down.”\nInstagram\nAlso, after the first look was revealed, a lot of people on social media got reminded of her character in Bhansali's Devdas as Chandramukhi. In the same interview, Madhuri close to put an end to all such comparisons. She said,\nInstagram\nDon't Miss 161 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“Bahaar Begum is poles apart from Chandramukhi or anything I have done before. It was a challenge to play her with grace and heart.”\nThe first look of several characters of Kalank were unveiled on March 8 and for Madhuri's character, KJo wrote: “Enchanting, ethereal & timeless. The true ‘Begum’ of hearts, Bahaar!”", "title": "Madhuri Dixit Feels The Biggest Pressure While Taking Kalank Was To Not Let Sridevi Down", "date_publish": "10/03/2019, 16:27:35", "description": "And now, after the release of the first look of Bahaar Begum, Madhuri opened up about the role. Speaking to Mid-day about stepping into a role that was originally supposed to be played by Sridevi, Madhuri said, “I don’t want to let her down.” Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/madhuri-dixit-feels-the-biggest-pressure-while-taking-kalank-was-to-not-let-sridevi-down-363477.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/madhuri_dixit_1552215755_800x420.jpg"}