{"text": "Madhuri Dixit is one actress you can never get your eyes off. She mesmerises you in real as well as reel life. We met Madhuri for an interaction on Kalank, the consistency in he rcareer and lots more. Wearing a beautiful peach dress and her radiant smile, Madhuri gets you all distracted.\nEnjoying a spectacular sea view with her, we started the conversation with her about her upcoming film Kalank being compared with Sanjay Leela Bhansali’s films and she said, “Every director creates his own world and Abhishek Verman has managed to create his own world, you don’t know the story and you don’t know what the film is about, but you are going by the visuals which are larger than life, even if you see Mughal E Azam, its larger than life, the visuals are big and because it’s a period drama, it starts looking kind of similar, but it’s totally different. The characters are very different, they are very beautiful, nuanced, and deep; it’s very layered, what you see is not what you actually get as there are a lot of layers to it. Every character has deeper conflicts, the way they deal with their conflicts is very different, and the characters make the film very interesting.”\nMoving on from Kalank, she was asked if working with younger actors like Alia and Varun feels different, “We were the same as them, very enthusiastic, trying to perform our best, we are still the same, today, of course, there are a lot more things you have to do apart from acting. There is social media, promotions, all these kind of things that we didn’t have when we were working, so when I see them doing all this, I find it very inspiring. And now I have started enjoying the social media; I feel it’s a great thing because it’s your direct voice you say to your fans.”\nTwitter\nDon't Miss 336 SHARES 161 SHARES 247 SHARES 699 SHARES 12.5 K SHARES\nTalking about dealing with today’s pressure in Bollywood, the actress said, “The pressure was always there, you had to live up to people’s expectations, the film had to deliver a hit, even today it’s the same thing. But I feel, whether the film is a hit or not, is not in an actor’s hand, it’s teamwork and also how the film was made and how it was marketed, how it is released, what was the completion, it depends on so many different things, for me as an actor, I used to do my job and do it well, and that’s how half the battle is won.”\nTwitter\nShe even added how today the films get very shorter time to grow unlike their days, “Everything has become now the first weekend, so you want maximum people to come and see your film on the first weekend and for that you have to grab as many eyeballs as possible, that’s because of how everything is working right now, there are so many distractions, so many things on digital. Those days the film could grow slowly, like Hum Aapke Kaun, it released on Friday but started growing Sunday onwards, and then it just blew up and didn’t stop. Today we live in a different world and have to do thing accordingly.”\nTwitter\nMadhuri was one the bankable star of her time, in fact, she was even paid higher than Salman Khan in Hum Aapke Hai Kaun, but even that time there was a struggle to get good roles and discussions about pay parity but that time the actresses weren’t vocal about it, unlike today. On not being vocal about injustice Madhuri said,\n“Even today we live in a male dominating society, even today every day a woman is struggling to make an impact. When I was doing Tezaab or even other movies, and when I used to walk on sets, the only women on the set used to be me, the actors or co-actors and the hairdressers, those were the only females we saw on the sets, but today when I walk in, there are female AD’s, they are there in different departments, there are women everywhere, in fact I have worked with female camerawoman , and it’s so wonderful to see that because women are being accepted more and more.\nTwitter\nShe further added, “Today women are portrayed differently on-screen, so women are characters and the script is written accordingly. There are no stereotypes anymore for women and that’s wonderful, it’s one positive step, today even female stars are doing that which is amazing, they are playing different characters, like Deepika is doing Chhapaak, or like how Alia is choosing her roles, it’s so good to see that, while equality is concerned even Hollywood is still struggling with it, so it will take some time, but as long as the dialogue is on we will keep inching slowly towards that goal.”\nEven after three decades into the industry, Madhuri continues to impress us with her moves on-screen and her progressive thoughts off-screen. More power to her.", "title": "Madhuri Dixit Feels We Still Live In A Male Dominated Society Where Women Are Struggling To Make An Impact", "date_publish": "09/04/2019, 16:17:02", "description": "Madhuri Dixit is one actress you can ever get enough off. She mesmerises you even in real and reel life. We met Madhuri for an interaction on Kalank and lot more, where it was difficult to let our eyes off her. She wore a beautiful peach dress and her radiant smile distracts you to the core. While enjoying a beautiful sea view with her, we asked her about Kalank being compared with Sanjay Leela B", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/madhuri-dixit-feels-we-still-live-in-a-male-dominated-society-where-women-are-struggling-to-make-an-impact-365135.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/madhuri_dixit_1554807532_800x420.jpg"}