{"text": "Bollywood actors Anil Kapoor and Madhuri Dixit have been the ideal couple of the Indian cinema. Whether it was Tezaab, Parinda, Khel, Pukaar or Ram Lakhan, it was a delight to watch them together even when they weren't paired opposite each other.\nTwitter\nTheir song, Dhak Dhak Karne Laga , from Beta is still one of the most popular dance numbers from the 90s. And now after almost a decade, the two are coming together for Indra Kumar's Total Dhamaal.\n''I am paired opposite Anil Kapoorji and there is a brilliant star cast, including Ajay Devgn, Javed Jaffrey, Arshad Warsi, and the story was so wonderful when I heard the script,\" Madhuri said during a press conference.\nDuring the promotions of the film, Anil and Madhuri realized it's been 30 years to Ram Lakhan and they decided to celebrate it in their own unique way. Take a look.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n'Today marks #30YearsOfRamLakhan and dancing on this song brings back so many beautiful memories', Madhuri tweeted. The chemistry and love they have for each other clearly has not changed in so long.\nscreengrab\nSpeaking about her equation with Anil Kapoor during the presser, Madhuri added, \"He was like this in 1998 and he is 58 now. He is just the same and it is always a pleasure working with him.\"\nMadhuri and Anil Kapoor starrer Total Dhamaal is all set to release on 22nd February, 2018.", "title": "Madhuri Dixit And Anil Kapoor Celebrate 30 Years Of Ram Lakhan By Dancing To 'Aye Ji O Ji'", "date_publish": "27/01/2019, 16:23:50", "description": "Bollywood actors Anil Kapoor and Madhuri Dixit have been the ideal couple of the Indian cinema. Whether it was Tezaab, Painda, Khel, Pukaar or Ram Lakhan, it was a delight to watch them together even if they weren't paired opposite each other.Bollywood actors Anil Kapoor and Madhuri Dixit have been the ideal couple of the Indian cinema.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/madhuri-dixit-and-anil-kapoor-celebrate-30-years-of-ram-lakhan-by-dancing-to-aye-ji-o-ji-361132.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/madhuri_1548586805_800x420.jpg"}