{"text": "Madhuri Dixit, the eternal beauty of Bollywood is more than her gorgeous looks and she has time and again proved it.\nShe is scintillating onscreen, her acting prowess often leaves you spell bound. She was one actress who managed to do justice to both commercial and artistic films. Madhuri has gained appreciation for films like Lajja, Mrityudand and Gaja Gamini.\ntwitter\nAfter a long gap Madhuri is yet again making her comeback with a Bollywood film Total Dhamaal. She was asked what made her take so long to be back onscreen, she said, \"I have many responsibilities apart from acting. I produced a movie 15 August which will release on Netflix by the end of March, then I did TV shows, then I had to look after my kids, they were growing up and they needed my attention. Scripts came to me, some I liked, some I didn't , but when Indu ji(Inder Kumar) came to me, I couldn't say no as I am working with all of them again right from Anil Kapoor to Ajay Devgn\".\ntwitter\nDon't Miss 161 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nMadhuri is elated to be back in films especially now, as she feels it's the best phase for women in the industry, \"Today there are so many good films being made, right from Badhaai Ho to Andhadhun, we have seen some very good films right from big to small scales. Also, I feel it's the best phase for women now in the industry, they all are getting such amazing roles. Tabu's role in Andhadhun was just fab.\"\nHowever Madhuri in her career has done some challenging roles and artistic films, but unlike now earlier people used to not believe in art films, Madhuri too recalls how people advised her not to do such films,\ntwitter\n\"Lot of people gave me big lectures when I did Mrityudand, saying that you are a commercial star, you should not be doing an art film, I used to say if I will not do art film or explore other genres, how will I know different style and forms of acting. Also I knew if by chance those films become successful others will follow. Like, oh she got appreciated for doing an art film, I will also do it\".\nThe actress says she is game to take up challenging roles even today, \"Absolutely, I did Dedh Ishiqiya, Gulab Gang and Bucket List, so I am doing it all.\"\ntwitter\n\"I am game for any roles which puts me in the light where I can challenge and create myself. I always wanted to play strong characters, doesn't mean that I want to do Gulaab Gang every time, strong means there should be more meat for me, I can dig my teeth into it and something that really makes me think and work.\"\nLooking back at her journey Madhuri feels she was lucky to have opportunities come her way, \"The journey was wonderful, when I was doing these small roles,\ntwitter\nI wasn't even aware that I shouldn't do this, I didn't know how industry works, I was studying and side by side i was doing these small roles but then I realised acting is my calling, also I feel one should be lucky to get good opportunities and I was\".", "title": "Madhuri Dixit Recounts She Was Criticised For Doing Art Films As She Was A Commercial Superstar", "date_publish": "09/02/2019, 17:56:20", "description": "Lot of people gave me big lectures when I did Mritiydand, saying that you are a commercial star, you should not be doing an art film says Madhuri Dixit. Madhuri Dixit the eternal beauty of Bollywood is more than her gorgeous looks and she has time and gain proved it. She is scintillating onscreen, her acting prowess often leaves you spell bound, she was one actress who equally then managed to do c", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/madhuri-dixit-recounts-she-was-criticised-for-doing-art-films-as-she-was-a-commercial-superstar-361862.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/madhuri_dixit_1549713765_800x420.jpg"}