{"text": "Madhuri Dixit Reacts On Sexual Harassment Allegations Against Alok Nath, Says It Was 'Shocking'\nMadhuri Dixit Reacts On Sexual Harassment Allegations Against Alok Nath, Says It Was 'Shocking'\nJust like entire nation, Madhuri Dixit says she was shocked to hear and read names of Alok Nath and filmmaker Soumik Sen in the #MeToo movement. She said she has known them for years. However, she wasn’t aware of this side of their personality.\nIn the #MeToo movement, which hit Bollywood in August last year, Nath was accused of rape by writer-director Vinta Nanda. Sen, who directed Madhuri in \"Gulaab Gang\", has been accused of inappropriate behaviour by three women.\nWhen asked if it was heart-breaking for her to see their names in the #MeToo movement, Madhuri told PTI, \"It is always shocking. Because you've known them and you've not known them like that.\"\n\"It is always shocking when something like that comes out. What you've known them and what you're reading is two different people. It was so shocking.\"\nThe actor is currently gearing up for her upcoming comedy, Total Dhamaal. Post which, she would be seen in Karan Johar's production Kalank, which features an ensemble cast of Varun Dhawan, Alia Bhatt, Sanjay Dutt, Sonakshi Sinha and Aditya Roy Kapur. Originally, Sridevi was meant to do the film, before she passed away in February last year. The role eventually went to Madhuri. The 51-year-old actor said she took time to \"digest\" that Sridevi was no more.\nDon't Miss 189 SHARES 161 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"What took time was to digest the whole thing that had happened. It was so shocking, I was like 'you want me to do this role?' because even they (filmmakers) were stuck. They had to go on. As a person it was hard to deal. As an actor, you know the role, the script. It's a different matter altogether. But to accept the truth was very difficult,\" she added.\nDirected by Indra Kumar, Total Dhamaal, features Anil Kapoor, Ajay Devgn, Arshad Warsi, Riteish Deshmukh, Johnny Lever, Boman Irani, Sanjay Mishra among others. It is scheduled to release on February 22.\nWith inputs from PTI", "title": "Madhuri Dixit Reacts On Sexual Harassment Allegations Against Alok Nath, Says It Was 'Shocking'", "date_publish": "07/02/2019, 18:49:54", "description": "Just like entire nation, Madhuri Dixit says she was shocked to hear the read names of Alok Nath and filmmaker Soumik Sen in the #MeToo movement. She said she has known them for years. However, she wasn’t aware of this side of their personality. When asked if it was heart-breaking for her to see their names in the #MeToo movement, Madhuri told PTI, \"It is always shocking. Because you've known them", "authors": [], "url": "https://www.indiatimes.com/entertainment/madhuri-dixit-reacts-on-sexual-harassment-allegations-against-alok-nath-says-it-was-shocking-361774.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/it_was_shocking_says_madhuri_dixit_on_sexual_harassment_allegations_against_alok_nath_1549544915_800x420.png"}