{"text": "He has directed critically acclaimed films such as Vaastav, Astitva and rose to fame with Kaante. Usually seen playing a negative role either as a gangster or a politician, he may not be a lead actor but he grabs your attention every time he walks onto the screen.\nScreengrab\nWe're talking about Mahesh Manjrekar, the man who can make bad look good.\nBut this time, he's playing the good guy and couldn't be more grateful. Mahesh Manjrekar will next be seen in a web series, Selection Day, where he plays the role of a coach to a boys' cricket team.\nScreengrab/Selection Day\nSpeaking exclusively to Indiatimes, Mahesh said, \"I was tired of playing the same roles. There were same fixed expressions I used to carry from home and I was done. So this was a great opportunity, thanks to the web show, there are now roles which are written and thought of. Selection Day and Mard Ko Dard Nahi Hota are some of the roles which are defined and I enjoyed playing an important part in the series. This was truly a blessing day in disguise.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nSince Bollywood caters to mostly masala potboilers, Mahesh feels web shows are definitely meant for the informed audience and better filmmakers.\n\"Bollywood filmmakers have a formula and they have a set list. Even if 90 percent of their 'kind of films' flop, they still believe only those masala films do well. But today, the audience is ready to see something which is done sensibly. Now thankfully corporates have ventured into the cinema, instead of individual producers.\nYou want to know what these fixed formats are?\nAccording to the actor, some movie makers think three action scenes, 1 comedy scene, 1 rape scene and 1 vamp ka song is the way to a successful film. But with web based shows, that has gone out of the window and he's glad the focus has shifted.\nMahesh Manjrekar's cricket show Selection Day premieres on November 28, 2018 on Netflix.", "title": "Tired Of Playing A Gangster, Mahesh Manjrekar Is Thankful For His Role In 'Selection Day'", "date_publish": "21/12/2018, 14:06:55", "description": "Mahesh Manjrekar Opted For The Role Of Coach Because He Was Tired Of Playing The GangsterMahesh Manjrekar Opted For The Role Of Coach Because He Was Tired Of Playing The GangsterMahesh Manjrekar Opted For The Role Of Coach Because He Was Tired Of Playing The GangsterMahesh Manjrekar Opted For The Role Of Coach Because He Was Tired Of Playing The GangsterMahesh Manjrekar Opted For The Role Of Coach", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/mahesh-manjrekar-is-thankful-for-his-role-of-a-coach-in-selection-day-as-he-was-tired-of-playing-the-gangster-358953.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/mahesh_1545377161_800x420.jpg"}