{"text": "Maisie Williams was just 11 years old when she joined the cast of Game of Thrones. Now, that the show is concluding with season 8, she is 22. We have seen her and her character grow into a formidable woman.\nBut fans had simply forgotten that she is young and has her wants and needs. So, when in the last episode fans saw her losing her virginity to Gendry, they were all taken by surprise. That was indeed quite unexpected, and some even said it was “not required”.\nAccept it or not, you must have felt a little uncomfortable as that scene played on your TV screens, right? Well, a lot of fans complained to Maisie Williams online, and she has finally responded.\nTwitter\nDon't Miss 281 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nIf anyone should be feeling awkward about that scene, it should be her. Yeah, that’s what Maisie Williams told fans in her response.\nif u feel uncomfortable just know that my mother and my step dad and my 2 sisters and my 4 brothers have all probably watched this too ahahakillmeehehe — Maisie Williams (@Maisie_Williams) April 23, 2019\nWondering how she reacted to the script when she read this scene in particular? She wasn’t ready to believe it. She was almost sure that it was prank.\nRead More: Little Girl No More! Maisie Williams Had A Hilarious Reaction To Arya Losing Her Virginity To Gendry", "title": "Maisie Williams Replies To Fans Feeling Uncomfortable Over Arya’s Sex Scene, Says She’s More Embarrassed", "date_publish": "24/04/2019, 15:50:54", "description": "In Game Of Thrones season 8 episode 2, Maisie Williams AKA Arya Stark lost her virginity to have sex with Gendry. This scene in particular left the fans in shock, feeling uncomfortable and also embarrassed. Maisie Williams has finally reacted. She says if anyone should be feeling awkward about it, then it should be her.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/maisie-williams-reacts-to-fans-feeling-uncomfortable-over-arya-s-sex-scene-says-she-s-more-embarrassed-366009.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/maisie_williams_is_embarrassed_over_arya_starks_sex_scene_with_gendry_1556092356_800x420.png"}