{"text": "Maisie Williams Shares A Disappointing News About Game Of Thrones Finale, Says No One Will Be Satisfied\nMaisie Williams Shares A Disappointing News About Game Of Thrones Finale, Says No One Will Be Satisfied\nWhen you wait for something eagerly – the longer you wait, the more you are disappointed. That often happens with all of us, right?\nFor Game of Thrones season 8, fans have been waiting for more than a year. Somewhere deep within, we know we’ll lose our beloved characters. There’s going to be lots of bloodshed. But how will it all end – that’s one question troubling all ardent fans.\nvia GIPHY\nThe show that kept us hooked for years needs to have the most amazing ending, don’t you feel? Well, according to Maisie Williams AKA Arya Stark, the ending will leave no one satisfied. Yes, that’s what she said.\n“I don't know that anyone is going to be satisfied. No one wants it to end, you know, but I'm really proud of this final season. I've always felt ashamed to say things like that, but I am. I'm really proud of all the work we've put it, for me it's the right time. I hope people like it,” she told The Sky News.\nThe 21-year-old actor said it is the \"right time\" that the show was coming to an end and she was proud of it. Game of Thrones season 8 will air on April 14.\nDon't Miss 596 SHARES 246 SHARES 3.1 K SHARES 406 SHARES", "title": "Game of Thrones season 8 ending:Maisie Williams Shares The Most Disappointing News About Game Of Thrones Finale, Says No One Will Be Satisfied", "date_publish": "26/01/2019, 18:26:46", "description": "For Game of Thrones season 8, fans have been waiting for more than year. The show that kept us hooked for years needs to have the most amazing ending, don’t you feel? Well, according to Maisie Williams AKA Arya Stark, the ending will leave no one satisfied. Yes, that’s what she said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/maisie-williams-shares-a-disappointing-news-about-game-of-thrones-finale-says-no-one-will-be-satisfied-361102.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/maisie_williams_shares_the_most_disappointing_news_about_game_of_thrones_finale_1548506308_800x420.jpg"}