{"text": "It survived revolutions and multiple wars. For about 800 years, Notre Dame Cathedral stood tall. The historical church in Paris, however, was engulfed in fire on Monday and it was heartbreaking for everyone to see it burning to the ground.\nAs the colossal fire swept through the historical monument causing a spire to collapse and threatening to destroy the entire masterpiece and its precious artworks, most of the people were in tears – some others offering prayers.\nTwitter\nThe cause of the fire is unknown as of yet but officials say it could be linked to renovation work at the heritage structure, the BBC reported. No deaths have been reported so far. However, to see the house of worship being engulfed in flames and huge clouds of grey smoke billowing into the Paris sky, it was startling and sad for the onlookers.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nBollywood celebs also expressed sadness on Notre Dame Cathedral fire!\nHeartbreaking. #NotreDame is burning. Pray there are no casualties. Hope they can stop the fire and restore the monument. What a sad day:( https://t.co/OBcVkrjezt — Siddharth (@Actor_Siddharth) April 15, 2019\nOmg . Terrible . Terrible . This is a horrible loss to history and ancient heritage. https://t.co/E2HPc6OgkO — Raveena Tandon (@TandonRaveena) April 15, 2019\nThis is a world tragedy #NorteDame -I have no words to express my sadness. To every Notre Dame lover - am so so sorry. pic.twitter.com/FcCQaN6qhI — Riteish Deshmukh (@Riteishd) April 15, 2019\nThe Notre Dame tragedy is hard to watch. The people of France must be devastated. We hope and pray that its restoration will serve to heal.#NotreDame #Fire#NotreDameCathedral — Boman Irani (@bomanirani) April 16, 2019\nMany Bollywood movies have given a tour of the beautiful Paris church. From Befikre (the scene in which Vaani Kapoor threw a challenge at Ranveer Singh) to movies like London, Paris, New York and London Dreams' song 'Mann Ko Ati Bhaave' was shot there.", "title": "Major Fire In Paris! Bollywood Celebrities Mourn Loss Of Historical Church Notre Dame Cathedral", "date_publish": "16/04/2019, 11:56:26", "description": "It survived revolutions and multiple wars and what not. For about 800 years, Notre Dame Cathedral stood tall. The historical church in Paris, however, was engulfed in fire on Monday and it was heartbreaking for everyone to see it burning to the ground.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/major-fire-in-paris-bollywood-celebrities-mourn-loss-of-historical-church-notre-dame-cathedral-365519.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/notre_dame_cathedral_fire_celebrities_mourns_loss_of_historical_church_notre_dame_cathedral_1555396023_800x420.png"}