{"text": "Make Way For Bollywood Royalty! Ranveer Singh And Deepika Padukone Look Ethereal At Their Mumbai Reception\nMake Way For Bollywood Royalty! Ranveer Singh And Deepika Padukone Look Ethereal At Their Mumbai Reception\nRanveer Singh and Deepika Padukone are just raising the bar for the all the couples and teaching them how celebrations should be done.\nFor their last wedding party thrown by Ranveer's sister Ritika, the couple was seen burning the dance floor with their epic dance moves. And now, they are ready for another round of celebrations in their own city, Mumbai.\nViral Bhayani\nAccording to reports, the couple for the very first time has invited the Indian media for their first Mumbai reception. The couple has chosen to invite their close family and friends. The couple will host another Mumbai reception for their fraternity friends on 1st December.\nViral Bhayani\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nThe reception invitation has been doing rounds on the internet for a long time and the guests have been cordially invited to arrive for the reception from 8 pm onwards at The Grand Hyatt hotel.\nThe couple redefined royalty in their latest appearance at the reception party, where like always they couldn't keep their eyes off each other. Have a look.\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani", "title": "Make Way For Bollywood Royalty! Ranveer Singh And Deepika Padukone Look Ethereal At Their Mumbai Reception", "date_publish": "28/11/2018, 17:27:58", "description": "Ranveer Singh and Deepika Padukone are just raising the bar for the all the couples and teaching them how celebrations should be done. For their last wedding party thrown by Ranveer's sister Ritika, the couple was seen burning the dance floor with their epic dance moves. And now, they are ready for another round of celebrations in their own city, Mumbai.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/make-way-for-bollywood-royalty-ranveer-singh-and-deepika-padukone-look-ethereal-at-their-mumbai-reception-357551.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1543418014_800x420.jpg"}