{"text": "Ever since the #MeToo movement has entered our nation, plenty of stories are coming out with every passing day. In the world of showbiz, many actors and directors are being called out and publicly shamed on social media.\nFrom Nana Patekar, Sajid Khan, Rajat Kapoor, Big B, Hrithik Roshan, Chetan Bhagat, A-listers hae been accused of sexual harassment. But is this making our workplaces a safer place to work in?\nActress Malaika Arora feels there is more noise than actual change at the moment.\n\"I don't see too much of a change. I hear people. I think there is more noise than change,\" Malaika told IANS over the phone from Mumbai when asked about the change coming with the discussions around the #MeToo movement in India.\nAfter making quite an impact in the West, the #MeToo wave has swept into Bollywood and beyond, following Tanushree Dutta recounting an unpleasant episode with veteran actor Nana Patekar on the sets of \"Horn 'OK' Pleassss\" in 2008.\nAFP\nDon't Miss 862 SHARES 346 SHARES 357 SHARES\nMalaika says there is still a long way to go.\n\"If we are talking about this industry, one is seeing a lot (of things) happening. People are talking about it. But for actual change to happen or for people to actually sit up and do something about it and actually make movement out of it, mindset has to change and people's mindset cannot change overnight,\" added the mother of one.\nAt the moment, Malaika is seen judging and mentoring in \"India's Next Top Model 4\". The show is back with a new transformative and progressive theme of \"More than a Face\". It is aired on MTV.\nTwitter\n\"This year we are very clear that it will not only be about the face. We want a girl who is not just beautiful. She has to be more than just a beautiful face.\"\nWhat are the parameters for it?\n\"You have to keep a lot of things in mind because at the end of the day it is 'India's Next Top'. We are looking for a top model qualities which means ideally and hopefully a tall girl. She needs to look a certain way, be a certain way, she has to walk in a right way.\n\"We don't expect them to come fully prepared on day one. And that's the whole idea of getting them and making sure you transform them into being a top model and we have been successful in that. We have really managed to transform some of the girls and change them. The transformation of a girl is the most important.\"\nMalaika, who is making headlines for her rumoured relationship with actor Arjun Kapoor, also stressed on how the modelling industry is shunning many \"stereotypes\".\n\"When you think of a model, she's got to be tall, have certain measurements. But in today's day and age, those stereotypes are no more. People are more accepting about women in general. All those typical stereotypes are finally changing which is good.\"\nInputs from IANS", "title": "Malaika Arora Reacts On #MeToo Movement, Calls It 'More Noise Than Change'", "date_publish": "30/10/2018, 11:20:32", "description": "The #MeToo movement has entered India, starting a conversation around making the workplace safe for all. But actress Malaika Arora feels there is more noise than actual change at the moment. \"I don't see too much of a change. I hear people. I think there is more noise than change,\" Malaika told IANS over the phone from Mumbai when asked about the change coming.", "authors": [], "url": "https://www.indiatimes.com/entertainment/malaika-arora-reacts-on-metoo-movement-calls-it-more-noise-than-change-355691.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/malaika_1540880047_800x420.jpg"}