{"text": "Malaika Arora Sweating It Out In Her Gym Along With Sister Amrita Will Give You Major Fitness Goals\nMalaika Arora Sweating It Out In Her Gym Along With Sister Amrita Will Give You Major Fitness Goals\nIsn’t she the sexiest woman alive?Well that’s the question that often pops up in your mind when you see her sweating in the gym or doing any workout. We are talking about none other than the fittest diva in Bollywood, Malaika Arora. She gives us major fitness goals and how.\nTwitter\nOf late, Malaika has been in news constantly due to her rumoured relationship with Bollywood actor Arjun Kapoor, moreso her marriage rumours with the actor is at its peak too. But giving a damn to all these conjectures, Malaika is living her life like just the way she likes it.\nTwitter\nAnd now, she is grabbing eyeballs due to her workout in the gym along with sister Amrita. The sisters sweating together in gym will definitely give you sibling goals. Only Malaika can look so hot while doing a workout, you and me can only dream of reaching this level, unless you are a fitness enthusiast too like her.\nDon't Miss 173 SHARES 2.2 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nShe shared the video of her on Instagram and wrote, “#malaikasmondaymotivation with @amuaroraofficial curtsying away into the week”.\nThis video has everything that a midweek motivation video needs. Just looking at Malaika's age and outlook towards health will make you want to renew that gym membership. And if it still doesn't, then stress not, enjoy that pizza while scrolling through her pictures.\nThe social media influencer also recently launched her Yoga fitness studio and has been getting all the A-listers to be a part of it. More power to you, woman!", "title": "Malaika Arora Sweating It Out In Her Gym Along With Sister Amrita Will Give You Major Fitness Goals", "date_publish": "16/04/2019, 15:15:35", "description": "Isn’t she the sexiest women alive?Well that’s this question often pops in your mind when you see her sweating in the gym or doing any workout. We are talking about none other the fittest diva in B Town Malaika Arora. She gives us m major fitness goals and how.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/malaika-arora-sweating-it-out-in-her-gym-along-with-sister-amrita-will-give-you-major-fitness-goals-365556.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/malaika_arora_1555410405_800x420.jpg"}