{"text": "Malaika Arora's Exotic Maldives Vacation Will Make You Want To Pack Your Bags And Leave NOW!\nMalaika Arora's Exotic Maldives Vacation Will Make You Want To Pack Your Bags And Leave NOW!\nAmidst wedding rumours, Malaika Arora is currently in Maldives have the time of her life. What people are claiming as a Bachelorette looks like a vacation that all of us could kill for (especially on a Monday, right?)\nFrom soaking up some sun to taking a dip at the beach, Malaika is seizing every moment of her vacation. Several reports have claimed that Arjun too has gatecrashed the rumoured 'Bachelorette' to be with Malaika.\nNo matter what the vacation is about, the pictures that Malaika has been posting on social media is proof that even at 45, she is embracing life, love, and happiness with an open heart!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMalaika and Arjun have been in a steady relationship for over a year and if rumors are to be believed, the couple is all set to take the plunge and tie the knot on 19th April amidst close friends and family. The wedding will be attended by Kareena Kapoor, Karisma Kapoor, and Ranveer Singh, who are close friends of the couple. Neither Malaika nor Arjun have confirmed any reports.", "title": "Malaika Arora's Exotic Maldives Vacation Will Make You Want To Pack Your Bags And Leave NOW!", "date_publish": "01/04/2019, 11:22:51", "description": "Malaika and Arjun have been in a steady relationship for over a year and if rumors are to be believed, the couple is all set to take the plunge and tie the knot on 19th April amidst close friends and family. The wedding will be attended by Kareena Kapoor, Karisma Kapoor, and Ranveer Singh, who are close friends of the couple. Neither Malaika nor Arjun have confirmed any reports.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/malaika-arora-s-exotic-maldives-vacation-will-make-you-want-to-pack-your-bags-and-leave-now-364649.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/malaika_1554098162_800x420.jpg"}