{"text": "Malaika Arora Felt Free After Divorce With Arbaaz Khan, Says She Is Happy To Make New Choices\nMalaika Arora Felt Free After Divorce With Arbaaz Khan, Says She Is Happy To Make New Choices\nDivorce is not an easy step. After 18 years of marriage, Maliaka Arora and Arbaaz Khan divorced each other in 2017. If rumours are to be believed both of them have moved on. Arbaaz Khan is dating Italian model Giorgia Andriani. On the other hand, grapevine suggests Malaika Arora is dating Arjun Kapoor and have the plan to marry him soon.\nquoracdn.net\nFor the first time baring her heart our on divorce with Arbaaz Khan, Malaika Arora said she got freedom to move and make new choices.\n“Divorce is a huge step. It gave me freedom in the sense that I could make a choice that I stand by. It is a choice that is not applauded by many but it gives you the freedom to move on, to make new choices, to go ahead in the world with your head held high and without feeling the past baggage,” she was quoted as saying by Film Companion.\nTwitter\nDon't Miss 623 SHARES 233 SHARES 232 SHARES 870 SHARES 1 K SHARES\nFurthermore, she said that she is glad to have taken this decision on her own.\n“Everyone wants to be in love again, to be in a relationship. Nobody wants to be alone and single for the rest of their life. Irrespective of what everyone said around me, I am glad that I made this choice on my own.”\nTwitter\nWhen asked about the possibility of her getting married in future, she said, “Everyone wants to move on, find love and companionship and meet people they relate to. And the ones who can are really lucky.”\nAll that ends well is well after all!", "title": "Malaika Arora Felt Free After Divorce With Arbaaz Khan, Says She Is Happy To Make New Choices", "date_publish": "12/03/2019, 11:44:31", "description": "For the first time baring her heart our on divorce with Arbaaz Khan, Malaika Arora said she got freedom to move and make new choices. After 18 years of marriage, Maliaka Arora and Arbaaz Khan divorced each other in 2017. If rumours are to be believed both of them have moved on. Arbaaz Khan is dating Italian model Giorgia Andriani. On the other hand, grapevine suggests Malaika Arora is dating Arjun", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/malaika-arora-felt-freed-after-divorce-with-arbaaz-khan-says-she-is-happy-to-make-new-choices-363554.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/malaika_arora_felt_freed_after_divorce_with_arbaaz_khan_says_she_is_happy_to_make_new_choices_1552371644_800x420.jpg"}