{"text": "Malayalam Superstar Mohanlal Gives #MeToo Movement His Own Definition, Calls It A 'Fad'\nMalayalam Superstar Mohanlal Gives #MeToo Movement His Own Definition, Calls It A 'Fad'\nThe #MeToo movement rose from Hollywood last year and shook everyone up after Harvey Weinstein was embroiled into controversies and women came out alleging sexual harassment by him. Soon after, the wave spread over in India.\nFormer actress Tanushree Dutta put allegations on Nana Patekar on sexual harassment grounds and since then, there has been no looking back. Whether it's A-listers, regional cinema stars, TV stars or regular people like us, everyone came out to share their stories.\nAfter months of creating an uproar in the film fraternity, south Indian superstar feels the movement all this while was a fad. Speaking at press conference in Dubai, the actor said,\nTwitter\nDon't Miss 106 SHARES 282 SHARES 862 SHARES\n“There’s no big problem in the Malayalam industry. You shouldn’t think of the #MeToo as a movement actually. It’s a fad and it’s turning into something of a fashion. Anything like that will have a lifespan for a bit,” the actor said at a press conference in Dubai on Monday.\n“It (sexual harassment) can happen anywhere in life, not just in films,” he added.\nSoon enough, in an exclusive with Gulf News, he tried to neutralise the issue and further said,\n\"We (men) can also come out with a #MeToo, gender-wise. I cannot make a comment on that. Only when you experience something like that, you can make a comment on it. Just giving a comment on it isn’t the right thing. I don’t know much about it (#MeToo).”", "title": "Malayalam Superstar Mohanlal Gives #MeToo Movement His Own Definition, Calls It A 'Fad'", "date_publish": "21/11/2018, 16:31:42", "description": "“There’s no big problem in the Malayalam industry. You shouldn’t think of the #MeToo as a movement actually. It’s a fad and it’s turning into something of a fashion. Anything like that will have a lifespan for a bit,” the actor said at a press conference in Dubai on Monday. “It (sexual harassment) can happen anywhere in life, not just in films,” he added.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/malayalam-superstar-mohanlal-gives-metoo-movement-his-own-definition-calls-it-a-fad-357108.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/mohanlal_1542796954_800x420.jpg"}