{"text": "Malaika Arora Disagrees With The Term Item Songs, Says She Never Felt Objectified In Special Numbers\nMalaika Arora Disagrees With The Term Item Songs, Says She Never Felt Objectified In Special Numbers\nIt wasn’t long ago that Karan Johar had aplogised for item numbers in his films and promised that he would never do it again. It’s setting a wrong example, he had said. Katrina Kaif, on the other hand, had cited Beyonce and Madhuri Dixit’s example to say that she doesn’t feel they are objectifying themselves.\nActress-model Malaika Arora has recently said that she never felt objectified while doing special numbers in Bollywood.\nFrom Chaiyya chaiyya, Maahi ve, Kaal dhamaal, Munni badnaam hui to Anarkali disco chali, Malaika has done several special numbers for Bollywood projects.\nAFP\n\"I have always said that we shouldn't tag them or label them as item songs. I have done so many songs and one thing that I would like to share is that I never felt objectified in any of the songs,\" Malaika said.\n\"I have done all the songs willingly. I have done the songs knowing what the situation is. But if anybody does feel objectified with the songs then it is important for them to come forward and speak. But personally speaking, I loved the experience of doing all the songs,\" she added.\nBCCL\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMalaika expressed her views while interacting with the media at the launch of Sophie Choudry's new single Ajj naiyo sawna on Tuesday here.\nAdding to Malaika's statement, Sophie said, \"I also don't want to call them 'item numbers' because it reduces their importance... The special song is made on grand scale and it is there to promote the film... Great music and dancing is a huge part of Bollywood culture, so we should consider it as a special song and celebrate it.\"\nWith inputs from IANS", "title": "Malaika Arora Disagrees With The Term Item Songs, Says She Never Felt Objectified In Special Numbers", "date_publish": "06/02/2019, 17:40:30", "description": "Actress-model Malaika Arora says she never felt objectified while doing special numbers in Bollywood. From \"Chaiyya chaiyya\", \"Maahi ve\", \"Kaal dhamaal\", \"Munni badnaam hui\" to \"Anarkali disco chali\", Malaika has done several special numbers for Bollywood projects.", "authors": [], "url": "https://www.indiatimes.com/entertainment/malaika-arora-disagrees-with-the-term-item-songs-says-she-never-felt-objectified-in-special-numbers-361701.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/malaika_arora_disagrees_with_the_term_item_songs_says_she_never_felt_objectified_in_any_of_her_song_1549458082_800x420.png"}