{"text": "Man Calls Kartik Aaryan’s Mom & Says ‘Meri Behen Se Shaadi Karwa Do’. His Reaction Is Spot On!\nMan Calls Kartik Aaryan’s Mom & Says ‘Meri Behen Se Shaadi Karwa Do’. His Reaction Is Spot On!\nWould it be wrong to say that Kartik Aaryan is a national crush? Most of the women have been obsessing over him since his Punchnama days. Dil chori sada ho gaya, ki kariye, right?\nTwitter\nHis charming smile and out-of-bed hairstyle have left women weak in the knees. So much so, his magnetism even made Sara Ali Khan confess her liking towards him. I want to date Kartik Aaryan, she said in front of her dad Saif Ali Khan on Koffee With Karan.\nThis is one of the reasons why Katrik Aaryan is surrounded by so many link-up rumours. And if you thought that was all, it isn’t. He is flooded with marriage proposals. And not only him, but his family is also getting Shaadi proposals.\nInstagram\n“Rishtey aate rehte hain shaadi ke liye. Mummy ko phone aate hain kabhi toh,” he said as quoted by Pinkvilla.\ncdninstagram.com\nHe also revealed that once a man called his mom and saying 'meri behen ki shaadi karwa do'. The incident left him embarrassed, here’s why.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“Just a little while ago, there was this guy who called my mom directly. We didn’t know him and I don’t know how he got my mom’s number but he called her directly, saying Kartik ki shaadi karani hai meri behen se.\nmagzter.com\n“My mother just said that Kartik isn’t interested in marrying right now. He is very much focussed on his career and on top of that, I don’t know who you are. But that man wouldn’t take no for an answer. He said agar abhi nahi kar raha hai, toh bhi chalega, chaar saal baad bhi ho chahe, aap abhi se block kar lo, as if koi advance booking ho.”\nInstagram\nKatrik Aaryan, you make our hearts flutter!\nAlso Read: Kartik Aaryan Dances With His Mom On Sonu Ke Titu Ki Sweety Song ‘Dil Chori’ & Their Love Is Warming Our Hearts", "title": "Man Calls Kartik Aaryan’s Mom & Says ‘Meri Behen Se Shaadi Karwa Do’. His Reaction Is Spot On!", "date_publish": "27/03/2019, 17:41:18", "description": "Kartik Aaryan is flooded with marriage proposals. And not only him, his family is also getting many calls for his shaadi. He also revealed that once a man called his mom and saying “meri behen ki shaadi karwa do.” The incident left him embarrassed, here", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/man-calls-kartik-aaryan-s-mom-says-meri-behen-se-shaadi-karwa-do-his-reaction-is-spot-on-364411.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kartik_aaryan_is_flooded_with_marriage_proposals_1553688579_800x420.jpg"}