{"text": "In the first episode of Koffee With Karan, we got a major hint on Deepika Padukone's love for flowers. Even her Instagram account is full of random pictures of flowers, proving that the actress loves flowers.\nAnd this love for flowers is well-evident in all the special preparations that have been done for the #DeepVeer wedding.\nImage for representational purpose only.\nThe date 15th November is very special for the couple and not just because they're tying the knot, but also because their first film together Goliyon Ki Raasleela-Ramleela too released on 15th November 2013. And after five years of the film and six years of officially being together, this blockbuster love-story found its happy ending in the romantic city of Italy.\nViral Bhayani\nPadukone and Singh are all set for a traditional Sindhi wedding ceremony to be held today. The lovebirds tied the knot in a Konkani ceremony on Wednesday which stretched for over five hours.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nPinterest\nToday’s ceremony will take place in the lower terrace of the Villa del Balbianello in northern Italy, the same place where the couple was announced man and wife yesterday.\n(Also read: From Ring Ceremony To Sangeet, Here’s How Deepika & Ranveer Celebrated Day 1 Of Wedding Festivities In Italy)\nAccording to ANI reports, the lower terrace and the mandap of today’s venue are decorated with red roses. According to local sources, a fleet of large boats have already left for the luxury Casta Diva resort to pick up the wedding guests and the couple.\nJust to jog your memory a little, even for yesterday's Konkani ceremony the world famous upper patio was decorated with hundreds of white roses. The couple was surrounded by friends and family members dressed in white attires on the villa’s famous patio overlooking the scenic Lake Como.\nThe report further claims that a number of large boats were present at the villa's main peer in preparation to take the guests back to the luxurious CastaDiva resort across the lake from the Villa del Balbianello.\nAgencies\nWell, this is a wedding that we all are going to remember for years to come.\n(With ANI inputs)", "title": "Mandap Decked Up In Roses, Guests Arrive For Ranveer-Deepika's Sindhi Wedding Ceremony In Italy", "date_publish": "15/11/2018, 15:35:50", "description": "The couple was surrounded by friends and family members dressed in white attires on the villa’s famous patio overlooking the scenic Lake Como. The report further claims that a number of large boats were present at the villas main peer in preparation to take the guests back to the luxurious CastaDiva resort across the lake from the Villa del Balbianello.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/mandap-decked-up-in-roses-guests-arrive-for-ranveer-deepika-s-sindhi-wedding-ceremony-in-italy-356735.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542273697_800x420.jpg"}