{"text": "Manikarnika Director Lashes Out At Kangana After Screenshots Of Their Whatsapp Chats Go Viral\nManikarnika Director Lashes Out At Kangana After Screenshots Of Their Whatsapp Chats Go Viral\nBollywood actress Kangana Ranaut is making heads turn with her spectacular performance in Manikarnika. The actress who got involved in multiple controversies during the filming has come out stronger and better than never before.\n#Manikarnika shows solid trending on weekdays... ₹ 60 cr [+/-] total [Week 1] is excellent... #RepublicDay holiday contributed majorly... Fri 8.75 cr, Sat 18.10 cr, Sun 15.70 cr, Mon 5.10 cr, Tue 4.75 cr, Wed 4.50 cr. Total: ₹ 56.90 cr. India biz. #Hindi #Tamil #Telugu — taran adarsh (@taran_adarsh) January 31, 2019\nYes, the movie that had the director Krish and Sonu Sood leave midway has proved that content is ruling the box office. Kangana also fearlessly spoke about the director, sharing screenshots of how she invited Krish to the press screening but he turned down.\nRangoli, Kangana's sister, took to Twitter to share the chats between the two artists.\nHowever, Krish chose to lash back at the sister duo. Sharing his set of screenshots, the filmmaker proved how people who were behind the making the film realised he was a better person to handle the project.\nDon't Miss 862 SHARES 126 SHARES 346 SHARES\nI never thought I've to defend my ability of film making based on the manipulations and lies of one person. @Rangoli_A these messages were ur sister's words about me ehen I've questioned her about the credit and the damage she is doing to the movie. — Krish Jagarlamudi (@DirKrish) January 30, 2019\nI never thought I've to defend my ability of film making based on the manipulations and lies of one person. @Rangoli_A these messages were ur sister's words about me ehen I've questioned her about the credit and the damage she is doing to the movie. — Krish Jagarlamudi (@DirKrish) January 30, 2019\nThe person who saw both d versions mentioned that Ive done 85% n now the techinican who worked on ground told this. pic.twitter.com/vkM6mOiHSM — Krish Jagarlamudi (@DirKrish) January 30, 2019\nI'm confidently saying that everything Kangana has written on those whats app messages when I've questioned her, are complete lies and pre prepared, as she has foreseen that this day will come. — Krish Jagarlamudi (@DirKrish) January 30, 2019\nThis is from the editor who edited n later replaced.. the question is not about who shot how much., but its about proceess which everything has been done with ulterior motive n with a poor taste. Pls realise ur lies r making things worse pic.twitter.com/QeA5aCDWtS — Krish Jagarlamudi (@DirKrish) January 30, 2019\nThese r the future film makers I came out n spoke for, so that they wont face these humiliations.. pic.twitter.com/YV4YoAmrYm — Krish Jagarlamudi (@DirKrish) January 30, 2019\nRangoli took back to Twitter to give a final reply to this banter\nJealous people can take a seat Queen is slaying like only she can ... 😁🥰 pic.twitter.com/PnPfjcQkFE — Rangoli Chandel (@Rangoli_A) January 30, 2019", "title": "Manikarnika Director Lashes Out At Kangana After Screenshots Of Their Whatsapp Chats Go Viral", "date_publish": "31/01/2019, 18:12:10", "description": "Manikarnika director Krish blasts Kangana, posts screenshots of WhatsApp chatsManikarnika director Krish blasts Kangana, posts screenshots of WhatsApp chatsManikarnika director Krish blasts Kangana, posts screenshots of WhatsApp chatsManikarnika director Krish blasts Kangana, posts screenshots of WhatsApp chatsManikarnika director Krish blasts Kangana, posts screenshots of WhatsApp chatsManikarnik", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/manikarnika-director-lashes-out-at-kangana-after-screenshots-of-their-whatsapp-chats-go-viral-361390.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kangana_1548936249_800x420.jpeg"}