{"text": "Manisha Koirala Shares The Biggest Takeaway From Her Cancer Battle, Reveals How It All Began\nManisha Koirala Shares The Biggest Takeaway From Her Cancer Battle, Reveals How It All Began\nWhen the doctor says “you have cancer”, the world immediately turns upside down, and death seems inevitable.\nBut to survive cancer, is like being greeted a new life. It’s the beginning of a new chapter. Life doesn’t remain the same anymore. Surviving the deadly disease changes one’s perspective towards life completely.\nBollywood actress Manisha Koirala has battled cancer. She was diagnosed with ovarian cancer in 2012. She fought, and she survived. Revealing how she healed and how that phase was a lesson in self-discovery, Manisha Koirala has penned a book titled Healed: How cancer gave me a new life.\nIn one of the excerpts, she speaks about her tryst with alcoholism and how the world of showbiz took a toll on her.\n“To take my mind off shoots, to numb myself, I started drinking. If I was on a diet, it would be vodka. I remember my ex-boyfriend once telling me that I had no sense of balance. He said, ‘You are a workaholic. You either work hard or party hard. Where is your sense of balance?’ Of course I was aware that I had a tendency to go overboard. Many people around me had tried to tell me that.\"\nDon't Miss 322 SHARES 237 SHARES 197 SHARES 2.5 K SHARES 17.1 K SHARES\n“But the truth is that I wasn’t enjoying it. I didn’t appreciate my work. I simply didn’t like it. Somewhere, in a contorted way, I began willfullydoing the wrong things. To spite myself, I chose the wrong films. I began feeding my ego. I insisted on being the central character, even if it was in a B-grade film. At that point, I did not even care who the director was. Getting a central role mattered more than anything else.\"\n“My state of mind was toxic, my approach to life complacent and my attitude ungrateful,” she wrote.\nOn the acting front, Manisha Koirala was last seen in Rajkumar Hirani's Sanju, based on actor Sanjay Dutt's life.", "title": "Manisha Koirala Shares The Biggest Takeaway From Her Cancer Battle, Reveals How It All Began", "date_publish": "26/12/2018, 11:20:43", "description": "Bollywood actress Manisha Koirala has battled cancer. She was diagnosed with ovarian cancer in 2012. She fought, and she survived. Revealing how she healed and how that phase was a lesson in self-discovery, Manisha Koirala has penned a book titled Healed: How cancer gave me a new life.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/manisha-koirala-shares-the-biggest-takeaway-from-her-cancer-battle-reveals-how-it-all-began-359269.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/manisha_koirala_shares_her_biggest_takeaway_from_battle_with_cancer_reveals_how_it_all_began_1545803989_800x420.jpg"}