{"text": "1. Manoj Bajpayee Gets Honoured With Padma Shri Award & The Internet Is Cheering For Him Nonstop!\nIt was an honour and a privilege sir @rashtrapatibhvn https://t.co/f43Ny309yR — manoj bajpayee (@BajpayeeManoj) March 16, 2019\nOne of the finest actors in Bollywood currently, Manoj Bajpayee was conferred the prestigious Padma Shri by President Ramnath Kovind in a in a ceremony held in New Delhi on Saturday.\n2. Aamir Khan Is Looking Forward To Become Full-Time Director, Will Quit Acting Once He Does That!\n“I am inclined towards filmmaking and I coincidentally directed Taare Zameen Par. I have been in love with filmmaking and acting and I can't alienate the two but what I can say right now is that I began my career as an actor and it excites me. The moment I become a full-fledged filmmaker I will stop acting. Right now, I don't want to stop acting, that's why I am holding back the director inside me,\" Aamir was quoted as saying by PTI.\n3. Kapil Sharma Gets Candid About His Failures, Admits That He Talks Nonsense & Needs To Mature\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBut Kapil Sharma says he has learnt a lot from his failures. “I talk straight from my heart. I am bit cautious now. There is a responsibility as a celebrity and I feel I need to mature and not talk nonsense (faltu)”.\n“I'm for women, but I really think James Bond should remain a man. It doesn't make sense for him to be a woman. Women can play different types of characters, be in action movies, and be superheroes, but James Bond should always be a man and not be Jane Bond. There is history with the character that should continue. He should be played by a man,” Green told Vanity Fair on the Dumbo red carpet.\n5. Hrithik Roshan Opens Up About Stammering, Says He Practices Everyday To Overcome Speech Issue\n“I’d practice every day to overcome the speech issue, I still do for an hour at least so that I can control the secondary actions like twitching and all. The unacceptability to stammering was not only bothersome in my childhood but also prevailed till 2012, long after I had become a film star,” he was quoted as saying by Deccan Chronicle.", "title": "Manoj Bajpayee Honoured With Padma Shri, Aamir Khan Wants To Become Full-Time Director & More From Ent", "date_publish": "16/03/2019, 18:19:25", "description": "From Manoj Bajpayee to Aamir Khan, here's all that rocked the world of entertainment today. One of the finest actors in Bollywood currently, Manoj Bajpayee was conferred the prestigious Padma Shri by President Ramnath Kovind in a in a ceremony held in New Delhi on Saturday.", "authors": [], "url": "https://www.indiatimes.com/entertainment/manoj-bajpayee-honoured-with-padma-shri-aamir-khan-wants-to-become-full-time-director-more-from-ent-363835.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/manoj_bajpayee_honoured_with_padma_shri_aamir_khan_wants_to_become_fulltime_director__more_from_e_1552738956_800x420.png"}