{"text": "Manoj Bajpayee Is Happy No One Abused Him On Being Announced As One Of The Padma Shri Awardees\nManoj Bajpayee Is Happy No One Abused Him On Being Announced As One Of The Padma Shri Awardees\nIt was in 2017, when Akshay Kumar had received the national award for his work in Airlift and Rustom and a lot of people expressed their disappointment. Many argued that Manoj Bajpayee was more deserving for he played the role of Professor Ramchandra Siras brilliantly in Hansal Mehta’s Aligarh. It happens almost every time that announcement of these awards end up becoming controversies.\nThis year, when Manoj Bajpayee was named as one of the recipients of Padma Shri award for his contribution in the fields of arts, he said that he was happy that nobody abused him on social media.\nTwitter\nIn the past as well, a lot of people have been criticised after the announcement of Padma awards. However, Manoj Bajpayee is an exception to that.\nAlso Read: 9 Movies That Prove Manoj Bajpayee Is An Underutilised Gem Of The Hindi Film Industry!\nmagnamags.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“My friends, relatives and followers are very happy with it. I have observed that till now, no one has abused me on social media and no one has created controversy when my name was announced. As one of the awardees of Padma Shri Award so, I am really happy and it's a good thing that when you get an honour nobody has raised objections against it,” Manoj Bajpayee was quoted as saying by IANS.\nHe says the news was unexpected. “I didn't know how to react on this news because I wasn't expecting that something like this is going to happen. Suddenly before sleeping in the night, when Anupam Kher sir told me about it that time, I froze. He (Kher) must be wondering why I didn't respond in joyful manner because honestly, I didn't understand how to react to it,” he added.\nManoj Bajpayee will be next seen in SonChiriya. Talking about the movie, he said, “I think we have made really good film in form of SonChiriya. I have been a huge admirer of Abhishek Chaubey's (director) work and I feel fortunate to work with him. I have played small role in the film but it's really good role which he has offered to me. I hope people will appreciate my role in the film.”\nSonChiriya, which also stars Sushant Singh Rajput and Bhumi Pednekar, is all set to release on March 1.\nWith inputs from IANS", "title": "Manoj Bajpayee Is Happy No One Abused Him On Being Announced As One Of The Padma Shri Awardees", "date_publish": "29/01/2019, 12:02:10", "description": "This year, when Manoj Bajpayee was named as one of the recipients of Padma Shri award for his contribution in the fields of arts, he said that he was happy that nobody abused him on social media. In the past as well, a lot of people have been criticised after the announcement of Padma awards. However, Manoj Bajpayee is an exception to that.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/manoj-bajpayee-is-happy-no-one-abused-him-on-being-announced-as-one-of-the-padma-shri-awardees-361206.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/manoj_bajpayee_is_happy_that_no_one_abused_him_on_being_announced_as_one_of_the_padma_shri_awardees_1548743922_800x420.jpg"}