{"text": "Manoj Bajpayee Gets Honoured With Padma Shri Award & The Internet Is Cheering For Him Nonstop!\nManoj Bajpayee Gets Honoured With Padma Shri Award & The Internet Is Cheering For Him Nonstop!\nOne of the finest actors in Bollywood currently, Manoj Bajpayee was conferred the prestigious Padma Shri by President Ramnath Kovind in a in a ceremony held in New Delhi on Saturday.\nIt was an honour and a privilege sir @rashtrapatibhvn https://t.co/f43Ny309yR — manoj bajpayee (@BajpayeeManoj) March 16, 2019\nThe nominations were announced in January. At that time, Manoj Bajpayee had said that he is happy that no one abused him on social media after his name was announced.\n“My friends, relatives and followers are very happy with it. I have observed that till now, no one has abused me on social media and no one has created controversy when my name was announced. As one of the awardees of Padma Shri Award so, I am really happy and it's a good thing that when you get an honour nobody has raised objections against it,” Manoj Bajpayee was quoted as saying by IANS.\nHis fans couldn't stop cheering for him.\n👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼🤗 Mubarak ho sir !!! — taapsee pannu (@taapsee) March 16, 2019\nDon't Miss 620 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nJawani aa gayi hai kaafi.. mubarak ho bhaisahab — Anurag Kashyap (@anuragkashyap72) March 16, 2019\nKudos Kudos Kudos my friend!!! 👏👏👏👏👏 — KayKay Menon (@kaykaymenon02) March 16, 2019\nWow! Congratulations sir! This was very well-deserved and long overdue! — Mihir Bijur (@MihirBijur) March 16, 2019\nCongrats!\nSir u increased the glory of champaran.\nThanx for ur being a champarani. — चौकीदार Sanjeet Parasar (@ParasarSanjeet) March 16, 2019\nLove that dialogue.....\n.\n.\n.\n\" Hum CBI se hain asli wale \" — Himanshu kaushik (@Hkaushik56) March 16, 2019\nMumbai ka DON kaun?\nBhiku Mhatre, Bhiku Mhatre, Bhiku Mhatre Echoeing 👍👍👍 Congratulations — EF Sandeep Arora ♥️🆎️ (@SandeeparoraEF) March 16, 2019\nWell deserved .... congratulations sir ...👏👏 — Arun Pandey (@arun06_pandey) March 16, 2019\nBadhai ho bhai saab — Sarojpkr (@sarojpkr) March 16, 2019\nThis year, 112 personalities were shortlisted for the honour. The first set of Padma awards was presented on March 11, in which President Kovind had presented awards to 56 personalities. The remaining 56 were honoured today.\nThe Padma awards are conferred in three categories, namely, Padma Vibhushan, Padma Bhushan and Padma Shri, the second, third and fourth highest civilian awards of the country respectively, only after Bharat Ratna.\nBajpayee, who is known for his outstanding performance in films like Aligarh, Zubeidaa, Gangs of Wasseypur and Aiyaary, was honoured with Padma Shri award.\nWith inputs from ANI", "title": "Manoj Bajpayee Gets Honoured With Padma Shri Award & The Internet Is Cheering For Him Nonstop!", "date_publish": "16/03/2019, 18:04:38", "description": "One of the finest actors in Bollywood currently, Manoj Bajpayee was conferred the prestigious Padma Shri by President Ramnath Kovind in a in a ceremony held in New Delhi on Saturday. The nominations were announced in January. At that time, Manoj Bajpayee had said that he is happy that no one abused him on social media after his name was announced.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/manoj-bajpayee-gets-honoured-with-padma-shri-award-the-internet-is-cheering-for-him-nonstop-363834.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/as_manoj_bajpayee_gets_honoured_with_the_padma_shri_award_everyone_is_cheering_for_him_1552738616_800x420.png"}