{"text": "Manoj Bajpayee Has An Epic Reaction On Padma Win, Jokingly Says He's Glad No One 'Abused' Him!\nManoj Bajpayee Has An Epic Reaction On Padma Win, Jokingly Says He's Glad No One 'Abused' Him!\nPresident Ram Nath Kovind on Saturday conferred the Padma awards upon prominent personalities in the field of art, including actor Manoj Bajpayee at a civil investiture ceremony in Rashtrapati Bhawan.\nAgencies\nManoj Bajpayee is one of the most credible actors and some of his outstanding performances remain in films like Satya, Shool, Aligarh,Zubeidaa,Gangs of Wasseypur and Aiyaary.\nTwitter\nSoon after the nominations were announced in January, Manoj Bajpayee had said that he is really happy that no one has abused him on social media platforms after his name was announced. He said,\nDon't Miss 620 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nTwitter\n\"My friends, relatives and followers are very happy with it. I have observed that till now, no one has abused me on social media and no controversy has been created when my name was announced.\"\nThis year's awardees comprised four Padma Vibhushan, 14 Padma Bhushan and 94 Padma Shri recipients. The Padma awards, which were announced on the eve of Republic Day, include 21 women and 11 persons from the category of foreigners, NRI, PIO, OCI and one transgender person. The government had received nearly 50,000 nominations for this year's Padma awards.", "title": "Manoj Bajpayee Has An Epic Reaction On Padma Win, Jokingly Says He's Glad No One 'Abused' Him!", "date_publish": "17/03/2019, 11:45:12", "description": "The Padma awards, which were announced on the eve of Republic Day, include 21 women and 11 persons from the category of foreigners, NRI, PIO, OCI and one transgender person. The government had received nearly 50,000 nominations for this year's Padma awards.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/manoj-bajpayee-has-an-epic-reaction-on-padma-win-jokingly-says-he-s-glad-no-one-abused-him-363845.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/padma_shri_1552803438_800x420.jpg"}