{"text": "2013 musical Begin Again featuring Keira Knightley and Mark Ruffalo is getting a Desi spin as Bollywood is all set to make an official remake.\nJust to jog your memory a little, the story revolved around the life of a singer-songwriter who is discovered by a struggling record label executive and collaborates with him to produce an album recorded in public locations all over New York City.\nBhushan Kumar’s T-Series and Vikram Malhotra-led Abundantia Entertainment are teaming up to develop the Hindi adaptation of Hollywood film Begin Again.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nPinterest\nThe Hindi adaptation will be helmed by Veere Di Wedding director Shashanka Ghosh, T-Series said in a statement. The script is being developed by Arshad Syed keeping in mind the interests of “Indian audience, while retaining the essence of the original”.\nIn a statement, Shashanka said,\nPinterest\n“We want to tell a story about the world of music and fresh voices in sound on the Indian scene. And through that, a take on urban relationships that don’t necessarily mean love and marriage and happily ever after. The worlds explored here are deeper than surface level - heart, hurt, passion, and above all - music.\"\nThe makers are taking the film Begin Again as an opportunity to create music that is the most important element of the film.\n(With agency inputs)", "title": "Mark Ruffalo And Keira Knightley Starrer 'Begin Again' To Get A Bollywood Spin", "date_publish": "20/01/2019, 11:17:16", "description": "Shashank Ghosh of Veere Di Wedding fame to direct Bollywood remake of Mark Rufallo, Keira Knightley’s Begin Again The Hindi adaptation of Begin Again will be helmed by Veere Di Wedding director Shashanka Ghosh. The Hindi adaptation will be helmed by Veere Di Wedding director Shashanka Ghosh, T-Series said in a statement.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/mark-ruffalo-and-keira-knightley-starrer-begin-again-to-get-a-bollywood-spin-360727.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/begin_again_1547963442_800x420.jpg"}