{"text": "Mark Ruffalo AKA Hulk’s B’Day Wish For Thanos Has A Snap Joke & We Don’t Know Whether To Laugh Or Cry\nMark Ruffalo AKA Hulk’s B’Day Wish For Thanos Has A Snap Joke & We Don’t Know Whether To Laugh Or Cry\nWhat is the saddest thing you could ever watch in a movie? For some people, especially the ardent Marvel fans, it would be to see their favourite superheroes dying. After the sad end to Avengers: Infinity War, which kept fans sobbing for days, the wait for the epic conclusion – Avengers: Endgame – is making fans even more eager.\nIn less than three months, Avengers: Endgame will hit the screens. But are you ready to watch the tumultuous end to the Marvel Cinematic Universe?\nTwitter\nIt’s Josh Brolin AKA Thanos’ birthday today. Of course, the Avengers cast took to social media to wish him. Mark Ruffalo AKA Hulk wished him in a rather unique way. He cracked a snap joke that left fans cringing and wondering whether to laugh or to cry.\nHappy Birthday to my Brother, Josh Brolin. Keep living the Dream. In a snap, it will be over. — Mark Ruffalo (@MarkRuffalo) February 12, 2019\nYou really did that omg — kat|83 (@valkyrieholland) February 12, 2019\nDon't Miss 264 SHARES 583 SHARES\nOmg Mark, that’s such a downer! Movie references aside, you are no longer allowed to give out birthday greeting unless you change that attitude. 😄😊 — Jill K (@Jedi_Jill) February 12, 2019\ntoo soon mark. tOO SOON — shaye (@shaye_beardsley) February 12, 2019\nTHAT JOKE WAS UNCALLED FOR!! — bailey (@sweetenerbailey) February 12, 2019\nsir. pic.twitter.com/DChC2Q8Nmk — The Fantabulous Emancipation of One Nikki Nicole (@ActressNik) February 13, 2019\nAvengers: Endgame is slated to release on April 26.", "title": "Mark Ruffalo AKA Hulk’s B’Day Wish For Thanos Has A Snap Joke & We Don’t Know Whether To Laugh Or Cry", "date_publish": "13/02/2019, 17:46:39", "description": "It’s Josh Brolin AKA Thanos’ birthday today. Of course, the Avengers cast took to social media to wish him. Mark Ruffalo AKA Hulk wished him in a rather unique way. He cracked a snap joke that left fans wondering whether to laugh or to cry. Avengers: Endgame is slated to release on April 26.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/mark-ruffalo-aka-hulk-s-b-day-wish-for-thanos-has-a-snap-joke-we-don-t-know-whether-to-laugh-or-cry-362112.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/mark_ruffalo_aka_hulk_makes_a_snap_joke_to_wish_josh_brolin_aka_thanos_on_his_birthday_1550059308_800x420.png"}