{"text": "A lot of us are rejoicing for couples like Ranveer-Deepika, PC-Nick, who are all set to get married and a few others are happy that love is blossoming for some other celebs as well. After keeping their alleged romance a secret for years, Malaika Arora and Arjun Kapoor are okay with displaying their affection in public.\nThey have been clicked together a lot of times and recently, the couple also flew down to Italy for Malaika's birthday. A video of them holding hands and walking made way on the internet, that subtly confirmed their alleged relationship.\nInstagram\nA lot of times, we have also seen Karan Johar teasing his India's got talent co-judge and friend 'Malla' and the way she blushes have said it all. In fact, recently, Malaika also appeared on KJo's chat show Koffee With Karan, where he jokingly said,\nStar India\n\"We are walking down the aisle.. that will also happen in your life soon enough\". To which Malaika replied, \"Stop it now... stop now...\"\nAnd now, according to fresh media reports, the couple is planning to take the next time and might plan to get hitched by April 2019.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nInstagram\nWhile neither of the two has ever confirmed their status, all the things that have been happening lately have definitely 'confirmed' it all.\n(Indiatimes could not verify the reports independently.)", "title": "Marriage Might Be On The Cards For Rumoured Couple Malaika Arora-Arjun Kapoor, Claim Reports", "date_publish": "06/11/2018, 17:48:25", "description": "They have been clicked together a lot of times and recently, the couple also flew down to Italy for Malaika's birthday. A video of them holding hands and walking made way on the internet, that subtly confirmed their alleged relationship. A lot of times, we have also seen KJo teasing his India's got talent co-judge and friend 'Malla' and the way she blushes have said it all.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/marriage-might-be-on-the-cards-for-rumoured-couple-malaika-arora-arjun-kapoor-claim-reports-356191.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/malaika_and_arjun_1541506940_800x420.jpg"}