{"text": "Avengers: Endgame\" co-director Joe Russo on Monday revealed that he is in talks with Indian star Priyanka Chopra for a project. The 47-year-old filmmaker, who is known for giving Marvel Cinematic Universe (MCU) a grounded tone along with his brother Anthony Russo, finds Priyanka 'fantastic' and would love to work with her. Confirming the news, he said,\n\"Priyanka is transitioning into global status now. She is fantastic... (I would) Love to work with her... I am potentially talking to Priyanka for something. I am not going to say what it is.\"\nLast year, Marvel Studios chief Kevin Feige had said that they are planning to make a standalone on superhero Ms Marvel aka Kamala Khan. After the news broke, many fans on social media expressed their desire to see Priyanka playing the character of Marvel's first Muslim superhero.\nRusso is currently in India to promote the MCU's much-awaited superhero ensemble, \"Endgame\", which will hit the theatres on April 26. The filmmaker said as an action director Indian films like Dabangg series were an interesting watch for him.\n\"I'm an action director so I saw 'Dabangg' many years ago and then 'Dabangg 2'. I thought the camera work was great in these films. The tone and energy is also great. So, I certainly know Salman Khan,\" he added.\nRusso also revealed that the climax of Marvel's 2015 film \"Avengers: Age of Ultron\" almost had a scene inspired by Rajinikanth's 2010 blockbuster \"Robot\" (\"Enthiran\").\nDon't Miss 264 SHARES 159 SHARES 12.5 K SHARES 186 SHARES 974 SHARES\n'Robot' almost influenced the climatic moments in 'Avengers: Age of Ultron'... In one of the final scenes, all the Ultrons were supposed to form a large Ultron and Avengers were set to fight that but the sequence got cut for time. It was this close. I was inspired directly by 'Robot',\" he added.\nAvengers: Endgame marks the final film within the Marvel Cinematic Universe's current generation. It comprises 22 films, including Spider-Man: Homecoming and recently released Captain Marvel.\nInstagram\nThe movie features an ensemble cast of Robert Downey Jr, Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Bradley Cooper, Tessa Thompson, and Josh Brolin. The film will release in India in English, Hindi, Tamil, and Telugu, with a special theme song composed by music maestro AR Rahman.\n(With PTI inputs)", "title": "Marvel In Talks With Priyanka Chopra About A Project, Confirms Avengers: Endgame Director", "date_publish": "01/04/2019, 17:29:54", "description": "'Robot' almost influenced the climatic moments in 'Avengers: Age of Ultron'... In one of the final scenes, all the Ultrons were supposed to form a large Ultron and Avengers were set to fight that but the sequence got cut for time. It was this close. I was inspired directly by 'Robot',", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/marvel-in-talks-with-priyanka-chopra-about-a-project-confirms-avengers-endgame-director-364689.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/priyanka_chopra_1554120442_800x420.jpg"}