{"text": "Marvel Actor Shares Dope On Chris Evans’ Exit From Captain America, Gives A Hint About Next One\nMarvel Actor Shares Dope On Chris Evans’ Exit From Captain America, Gives A Hint About Next One\nChris Evans is finally hanging up his Captain America shield after wrapping up Avengers 4. The actor announced his departure from the Marvel Universe on Twitter and thanked his fans for all the love.\n“It was an emotional day to say the least,” Evans wrote. “Playing this role over the last 8 years has been an honor. To everyone in front of the camera, behind the camera, and in the audience, thank you for the memories! Eternally grateful.”\nThe actor first featured as Steve Rogers in 2011 as Captain America.\nWith him now moving on, fans on social media are discussing about the possible replacements to Chris Evans. Putting some rumours to rest, Chris Evans Co-star' Frank Grillo dishes on his departure from playing Captain America.\nIn an interview with Larry King, he says the Marvel Studios are looking for someone who could either be an Afro-American or a woman as the successor to his character.\nDon't Miss 1.1 K SHARES 193 SHARES 8.1 K SHARES 642 SHARES\nFans are divided between Bucky Barnes played by Sebastian Stan and Sam Wilson by Anthony Mackie.\nRUMOR: @AnthonyMackie's Sam Wilson may be the one to take over the mantle of Captain America post-AVENGERS 4. https://t.co/In50UYWnnl pic.twitter.com/pndBgRtNT7 — MCU News & Tweets (@MCU_Tweets) October 24, 2018\nWhat if they make Sam Wilson Cap, and give him a movie with Bucky/White Wolf, so we finally get that Captain America's Best Friends buddy movie we all really want? pic.twitter.com/jr43un8RT4 — Jeremy Conrad (@ManaByte) October 24, 2018\n[captain america: the winter soldier]\nbucky: you’re my mission\nsteve: ok kill me then\nbucky:\nsteve: yeah that’s what i fucking thought — bucko (@incorrectbucko) October 23, 2018\ncaptain america sam might actually be happening pic.twitter.com/UsIbPnfOKH — jake as mysterio love bot (@filmsrogers) October 25, 2018\nguys bucky doesn’t even like to fight and you guys are salty he ain’t captain america ???? lol steve is disappointed in you. — georgina (@tonyrogerstark) October 25, 2018\nBUCKY BARNES AS CAPTAIN AMERICA\nThere. I said it. pic.twitter.com/pd1iCkmwOQ — One Sandwich Away From Fat But Scary. (@NotAManButADude) October 24, 2018\nSam Wilson is fine, but it should be Bucky first due to chronological order. Also, Peggy is dead in the MCU so she can't be Cap. Also don't need a female Captain America when we're going to have Captain Marvel running around — Joshua Carpenter (@gambit458) October 24, 2018\nWe're yet to see who grabs the throne. Meanwhile, Avengers 4 will hit the screens on May 3,2019.", "title": "Marvel Actor Shares Dope On Chris Evans’ Exit From Captain America, Gives A Hint About Next One", "date_publish": "25/10/2018, 15:48:01", "description": "With him now moving on, fans on social media are discussing about the possible replacements to Chris Evans. Putting some rumours to rest, Chris Evans Co-star' Frank Grillo dishes on his departure from playing Captain America. In an interviw with Larry King, he says the Marvel Studios are looking for someone who could either be an Afro-american or a woman as the successor to his character.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/marvel-actor-shares-dope-on-chris-evans-exit-from-captain-america-gives-a-hint-about-next-one-355438.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/chris_1540459894_800x420.jpg"}