{"text": "Unless you have been living under a rock, you must have heard about the crazy fandom for Marvel’s Avengers: Endgame, the movie which will conclude about 20 movies of Marvel Cinematic Universe. It’s hard and stupid to miss this one, to be honest.\nAP\nThe frenzy of the Avengers: Endgame is such that the pre-ticket sales have set a record already. People are re-selling the tickets on eBay for almost Rs 6,35,260. Don’t believe us? Read this.\nAFP\nWhat will happen in the movie, everyone is wondering, but some of the people have already watched it. Not entirely, of course, but just 10 minutes of it. No, it hasn’t been leaked. Ten minutes of Avengers: Endgame was screened for the press head of the film’s Los Angeles press junket on Friday.\nBCCL\nThe reactions are ecstatic. People have given it an 'A plus' rating. What’s more? The spoilers are all over the internet.\nI am f r e a k i n g o u t and I can’t even tell you why... 🥺🤯😲😅 #AvengersEndgame pic.twitter.com/NBeDVfh1qf — Tiffany Mink (@minkus) April 6, 2019\nOk. Ok ok. So I saw two (mind you short) scenes from @Avengers on the Lot today for an event for @Attractions. Couldn’t have been more than 8 minutes of footage. And I HAVE MORE QUESTIONS THAN I EVEN DID BEFORE. — Tiffany Mink (@minkus) April 6, 2019\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\nIf this opening scene is playing out how it LOOKS like it’s playing out. Yo. I can at least say this- in the span of less than that 8 minutes, I went from actual crying to cheering. This thing is going to be W I L D. #avengersendgame — Tiffany Mink (@minkus) April 6, 2019\nY’ALL REALLY TRYING TO START OFF THE MOVIE LIKE THAT?!?!?!?!?!\n*insert character related gif that I can’t spoil* #avengersendgame — Tiffany Mink (@minkus) April 6, 2019\nI have now screened #AvengersEndgame footage and all I can say is that you are not prepared for what's coming. Endgame is going to be craaazzzyyyyy! pic.twitter.com/WR99AafXik — Yolanda Machado (@SassyMamainLA) April 6, 2019\nJust saw about 10 minutes of #avengersendgame at @DisneyStudios. The first 5 minutes was what appeared to be the beginning of the movie and the second 5 minutes was what I had previously seen at #CinemaCon. Not allowed to say anything specific but if I had to grade the footage A+ pic.twitter.com/tgSYMU1kKy — Steven Weintraub (@colliderfrosty) April 6, 2019\nWe saw about 6-7 minute of Avengers Endgame. One part was the CinemaCon footage, another wasn’t, both left my dying to see more and with a million more questions. Some of which I can ask this weekend. — Germain Lussier (@GermainLussier) April 6, 2019\nJust finished screening some of the footage from #AvengersEndgame!The Russo’s showed us 2 clips. Loved what I saw. I’m 10x times more excited for the movie now pic.twitter.com/YXKlDOqw6x — Dorian Parks (@DorianParksnRec) April 6, 2019\nI saw some #AvengersEndgame footage tonight. I’d rather let you see it for yourself than describe it in detail. It was simultaneously tragic and sweet. I’m beyond impressed and I’ve got even more questions now than I had going in. Can’t wait to see the rest! pic.twitter.com/aOQRBfZLBO — Sean Gerber (@MrSeanGerber) April 6, 2019\nOf course, Marvel is not screening the entire film ahead of the release, just like they didn’t screen Avengers: Infinity War. During his visit to India, director Joe Russo appealed to the audiences to not reveal the spoilers after they have watched the movie. He said that keeping the plot of the film under wraps is very important, and hence, he didn’t even answer any questions related to the plot.\nHowever, GameSpot has offered some concrete details after having watched 10 minutes of the movie. Of course, we are not going to spoil it for you. But discussions on Twitter are on!\nYou are not prepared for what’s coming, are you? Avengers: Endgame is hitting the screens in India on April 26.", "title": "Marvel Officially Screened 10 Minutes Of Avengers: Endgame & Internet Is Brimming With Spoilers", "date_publish": "07/04/2019, 12:37:18", "description": "10 minutes of Avengers Endgame was screening for press and now spoiler filled details have leaked. The reactions are ecstatic. People have given it an A plus rating. What’s more? The spoilers are all over the internet. However, GameSpot has offered some concrete details after having watched 10 minutes of the movie. Of course, we are not going to spoil it for you. But discussions on Twitter are on!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/marvel-officially-screened-10-minutes-of-avengers-endgame-internet-is-brimming-with-spoilers-365021.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/10_minutes_of_avengers_endgame_was_screening_for_press_and_now_spoiler_filled_details_have_leaked_1554619734_800x420.png"}