{"text": "She sat on the ringside steps, huddled with her coaches and shed down tears of joy. The crowd cheered louder and more tears flowed out of champion’s eyes. That’s how Mary Kom celebrated her historic victory at the World Championships yesterday.\n“We tried telling her, it’s okay. Calm down. Take deep breaths,” said coach Chhote Lal Yadav. “But she couldn’t. She said ‘Mujhse control nahi ho pa raha hai (I am not able to control it).”\nAP\nBagging a gold medal for the sixth time, Mary Kom has become the first woman boxer to win six gold medals at the World Championships.\nAnd everyone, including Bollywood celebrities, was proud of her.\n#1\n#MaryKom you rule! First woman boxer to win 6 world championships. pic.twitter.com/InIzMR0saz — Ayushmann Khurrana (@ayushmannk) November 24, 2018\n#2\nCongratulations Champ!! So proud to see you creating history 👏🏻👏🏻👏🏻 @MangteC you are a wonderwoman !#MaryKom — Anushka Sharma (@AnushkaSharma) November 24, 2018\n#3\nA commendable achievement #MaryKom! 🥊 The country is proud. @MangteC — Ajay Devgn (@ajaydevgn) November 24, 2018\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n#4\n#MaryKom you have created history!! The first woman boxer to win six championship golds. You are truly a living legend and India is so proud of you! pic.twitter.com/wK03v6gVyO — Shreya Ghoshal (@shreyaghoshal) November 24, 2018\n#5\nAlready up to 6, and she’s just begun! More and more power to you, Mary Kom! https://t.co/gThfgAmyR3 — Hrithik Roshan (@iHrithik) November 24, 2018\n#6\nT 3005 - MARY KOM .. what a huge honour you bring to the Country .. 6 times Gold medalist World Championship !! CONGRATULATIONS !\nI ever value your BOXING GLOVES that you gifted me ! they are MY gold medals !!🙏🙏🇮🇳🇮🇳👏👏👏👏👏 pic.twitter.com/alTP5ZOFVW — Amitabh Bachchan (@SrBachchan) November 24, 2018\n#7\nSuperwoman. Or superhuman? At 35 mother of 3 #marykom has consistently beaten incredible odds to win 6th consecutive world boxing championships. Becoming one of the worlds most successful boxers. Man or woman. Her opponent was just 3 years old when Mary won her first championship — Shekhar Kapur (@shekharkapur) November 25, 2018\nIn a nation confused on the position of women in Society, #MaryKom becomes India's all-time great Athlete. Man or Woman. — Shekhar Kapur (@shekharkapur) November 24, 2018\n#8\n\"Dil yeh ziddi hai!\"\nGo #MaryKom ! India thanks you, yet again! https://t.co/vKMiVCKSEm — VISHAL DADLANI (@VishalDadlani) November 24, 2018\n#9\nA proud moment for Indian sports.\nCongratulations to Mary Kom for winning a Gold in the Women’s World Boxing Championships. The diligence with which she’s pursued sports and excelled at the world stage is extremely inspiring. Her win is truly special. @MangteC — Narendra Modi (@narendramodi) November 24, 2018\n#10\nMC Mary Kom has made the country proud by creating history with her sixth gold medal at the Women's World Boxing championship.\nHeartiest congratulations to the champion — Arvind Kejriwal (@ArvindKejriwal) November 24, 2018\n#11\nA stellar achievement for #MaryKom , becoming the first woman boxer to win six world championship Gold. One of India's greatest ever sportsperson. Super happy and super proud ! pic.twitter.com/jw2V4QBulo — Virender Sehwag (@virendersehwag) November 24, 2018\n#12\nWorld’s best woman boxer and now it’s official. @MangteC, you have been fabulous. Congratulations on winning your record 6th Gold medal at the World Women’s Boxing Championships. You’re an inspiration for every young athlete. #WWCHs2018 #MaryKom pic.twitter.com/ebj6LWY9K7 — Sachin Tendulkar (@sachin_rt) November 24, 2018\n#13\nMary Kom - Congratulations. You have done us proud. @MangteC pic.twitter.com/5vJT8KLjfy — Sushma Swaraj (@SushmaSwaraj) November 24, 2018\n#14\nSo awestruck by @MangteC (Mary Kom)'s accomplishment. The most successful boxer in World Championships History. Six golds. And an Indian! Can't wait for the Olympics.... https://t.co/A5P59JI2W7 — Shashi Tharoor (@ShashiTharoor) November 24, 2018\n#15\nWow! Only you could do it!! What an achievement... the first female boxer to win the #WorldChampionship for an unprecedented 6th time! Congratulations @MangteC... It’s a proud moment for the nation & you are and always will be my inspiration.. Here’s to #MagnificentMary 💪🏼 — PRIYANKA (@priyankachopra) November 24, 2018\nCongratulations, Mary Kom!", "title": "Mary Kom’s 6th World Title Win Leaves Everyone Beaming With Pride Including B-Town Celebs", "date_publish": "25/11/2018, 12:36:56", "description": "Bagging a gold medal for the sixth time, Mary Kom has become the first woman boxer to win six gold medals at the World Championships. And everyone, including Bollywood celebrities, was proud of her. She sat on the ringside steps, huddled with her coaches and shed down tears of joy. The crowd cheered louder and more tears flowed out of champion’s eyes. That’s how Mary Kom celebrated her historic v", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/mary-kom-s-6th-world-title-win-leaves-everyone-beaming-with-pride-including-b-town-celebs-357336.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/mary_kom_has_become_the_first_woman_boxer_to_win_six_gold_medals_at_the_world_championships_1543129755_800x420.png"}