{"text": "We will be celebrating Women Day’s this week but we are still fighting for the basic rights of a woman. Things are still better in metropolitan cities, but small towns still have a long way to go. On the occasion of Women’s Day, we managed to talk to ace designer Masaba Gupta, daughter of Neena Gupta who fought all the social norms and raised her daughter with a phenomenal upbringing. Today Masaba is an ace fashion designer and every Bollywood celebrity loves her designs and endorses it. Kudos to both these women!\nInstagram\nIndiatimes met Masaba at an event of ‘Face Anything’ where she looked nothing but gorgeous in white. Looking drop dead gorgeous she bared all her heart and answered some hard-hitting questions.\nTwitter\nFirstly, we asked her what it is to be a woman in India, she answered, “I just feel like for me to be a woman in today’s time is about to be able to make your own choice. Today, for women in India, things have gotten much better, however, I feel I speak with only very limited experience from the people I know. I feel like I don’t really have the opportunity to go down and see the real society that exists and see what their challenges and shortcomings are. It’s very important for me to talk from the place of what I know and not really judge things that I don’t know. But all I can say is women are going through much more than we even know.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nMasaba says she was really surprised to see one woman treating another woman badly. Well we all have faced that, haven't we?\n“A woman treating another woman badly was something I was very surprised about. If a woman has been treated badly and she has a daughter and even she is going through something similar, why wouldn’t you empower them? Why wouldn’t you help them make a choice? I was very surprised they would not rather have them go through it because of this sick society norms rather than teach them to break away from it, because then what would people say, so that is something very surprising for me, because to me it always looked like no matter what else women will always help women, or women will never let other women go through what they have gone through. Especially in India, we are such close knit families, sisters treat sisters-in-law badly, all these things happen, and I felt like wait, this is not what I have seen and thought.”\nTwitter\nWe live in a society where a happy woman is a myth, but you know what a woman can be happy only when you let her live on her own terms and conditions, Masaba too endorses that, “The idea of a woman living her life on her own terms and living alone without any mental problem is a large problem for the society. A stable woman is a disturbing fact to society, it’s an unsettling reality.”\nShe even said nothing has changed; even today a girl is judged by her skin colour and ranked if she is beautiful or not, “What has changed? Nothing has changed; we have highly educated people still saying this, also there is a problem here too, when you are praised for dark skin also, they tell you ‘arey who toh sirf gori hai, fika chehra hai, feature nahi,’ so I always thought why do you need to shame one and praise other, why can’t we all be beautiful, I have faced a lot of people who tell me they don’t want to become dark because they will be rejected. And all these stupid ads online, where you get a job when you are fair and radiant and what not rubbish, that’s nothing to do with your beauty, and we don’t realise we live in Bombay so we know this holds no importance, but the small town people will actually think, this is the reality, you have to be pretty to get job, they feel if they come in a big town, put on the fairness cream and they will be fine, that’s a big one, it’s something that’s going to take a long time to change, firstly it should come from parents and we have to pass it on to many generations and then I think it can be eradicated. \"\nTwitter\nWe asked Masaba if she ever faced rejection for being dark, she smiled and said,\n“Have never faced rejection, but I have been told things in a funny a way, 'ki kaali hai and what not rubbish,' I don’t pay any heave to it.”\nTwitter\nMasaba even highlighted the fact that how today’s homemaker shame a working woman and vice versa, “People don’t understand that even being a housewife means, she is doing a full-time job, taking care of a child is a full-time job, and sometimes I hear women who are homemakers shame the working women on the public platform and vice versa. Why should you do that? In order to make yourself good why do you need to show the other women in a bad light, you want to be a homemaker be one, if you want to do both, do it, it’s very important that you start practicing to not shame another woman.”\nTwitter\nWe asked Masaba what’s her expectation from Women Day 2019, she said, “Firstly, a women should not feel empowered only on one particular day, she should be empowered every day and I think it comes from knowing that self-love is the first step to empowerment, and then people from your family encouraging you is the second step towards empowerment and the third step is to go out there and be compassionate to people who are not empowered and help them”.\nWe hope one day we as women start empowering another woman.", "title": "Masaba Gupta Believes The Biggest Problem In India Is One Woman Shaming Another & We Agree", "date_publish": "07/03/2019, 12:20:43", "description": "We will be celebrating Women Day’s in just a few days but we are still fighting for the basic rights of a woman. Things are still much better in metropolitan cities, but the small town city still has a long way to come. On Women’s Day celebration we managed to talk to Masaba Gupta, daughter of Neena Gupta who fought all the social norms and brought up her daughter and what an upbringing. Kudos to", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/masaba-gupta-believes-the-biggest-problem-in-india-is-one-woman-shaming-another-we-agree-363254.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/masaba_gupta_1551861010_800x420.jpg"}