{"text": "Love stories and Bollywood films seems inseparable. No matter what the genre of the movie is -- horror or thriller -- Bollywood films have always managed to feature a romantic plotline in almost every genre. However, if there’s one filmmaker who perhaps has a unique understanding of a feeling called love, then it is Imtiaz Ali.\nTwitter\nImtiaz Ali films are more or less the same. They follow a known trajectory of a boy meeting a girl, who separates from her only to meet her again and fall in love. Yet, all his films are thought-provoking that leave the audiences mesmerized.\npeepingmoon.com\nAfter giving us masterpieces like Jab We Met, Highway, Rockstar and Laila Majnu, now Imtiaz Ali is gearing up to make a movie on the eternal love story of Radha and Krishna. It’ll be on a huge scale, he says.\ncollegers.net\n\"It was last year on the occasion of Janmashtami that Imtiaz Ali had announced the movie on Radha and Krishna. “I am definitely going to make it, but I want to make it on a huge scale and that's what I am thinking. I think it will take time to make it properly. It's a big film but at the same time, I feel that the purity also should come so, it will take time to go on and actually make Radha Krishna,” he said.\nAfter Jab We Met, fans have been looking forward to seeing Shahid Kapoor in an Imtiaz Ali film. Some time ago, reports were doing the rounds that the two of them are collaborating for a project. However, Shahid Kapoor later made a statement that the project has taken a back seat.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nTalking about collaboration with Shahid Kapoor, Imtiaz Ali said, “There are lots of stories with me. This time around, I wrote many stories. There were lots of things in my mind but I wasn't really able to do that.”\n1.bp.blogspot.com\nAlso, reports were doing the rounds that Imtiaz Ali is making a film with Sonu Ke Titu Ki Sweety star Kartik Aryan and Sara Ali Khan. About that, the filmmaker said that “nothing is confirmed” as of now.\nTwitter\n“I can't talk about it because we haven't announced anything regarding it. Now, we are at drawing board and trying to work out things. As of now, nothing is confirmed, but we are working towards a film but right now, I can't say anything about it.”\nThe film on the eternal love story of Radha Krishna is one of the long-cherished projects and close to his heart, said Imtiaz Ali. It will be produced by Reliance Entertainment and Imtiaz Ali's Window Seat Films LLP.\nWith inputs from IANS", "title": "Master Storyteller Of B-Town, Imtiaz Ali To Make A Film On The Love Story Of Radha & Krishna", "date_publish": "18/01/2019, 13:52:14", "description": "After giving us masterpieces like Jab We Met, Highway, Rockstar and Laila Majnu, now Imtiaz Ali is gearing up to make a movie on the eternal love story of Radha and Krishna. It’ll be on a huge scale, he says. It is one of the long-cherished projects and close to his heart, said Imtiaz Ali. It will be produced by Reliance Entertainment and Imtiaz Ali's Window Seat Films LLP.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/master-storyteller-of-b-town-imtiaz-ali-to-make-a-film-on-the-love-story-of-radha-krishna-360631.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/imtiaz_ali_is_making_a_film_on_the_eternal_love_story_of_radha_and_krishna_its_gioing_to_be_huge_1547798372_800x420.jpg"}