{"text": "“Tu nanga hi toh aaya hai, kya ghanta lekar jaega?” – That’s the rap everyone has been singing these days. It’s playing on loop in our heads too. The vibe is so energetic and crazy – just like the man himself, Ranveer Singh!\nGully Boy, the movie has been making quite a look of buzz since the time its trailer is out. Within just minutes, it became the talk of the town because everyone’s raving about it already.\nScreengrab\nThe trailer of the show showcased the story of Ranveer Singh’s character, a rapper who lives in Mumbai slums but has a dream of making it big one day as a rapper.\nSoon people started to draw comparisons with Eminem’s 8 Mile, a movie that was released in 2002 and was also a story about a rapper belonging to a poor family who wins against the odds making it big in the world of hip-hop. The story of 8 miles, it is said, is inspired from the real life story of Eminem.\nAlso Read: This Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nI totally appreciate the fact that they are making movie on some real artists life, but can you please stop copying ? Many scenes are rip off from Eminem's movie 8-mile 🙄#GullyBoy #GullyBoyTrailer #GullyBoyTeaser https://t.co/K8cIaC4XKc — Kartikay (@RavanPrideMax) January 4, 2019\nAnd Gully Boy, it is said, is roughly inspired by the real-life stories of rappers Divine and Naezy. It’s not a biopic, it is a fictional story, Zoya Akhtar recently revealed adding that the movie is inspired by underground rappers Divine and Naezy.\nTwitter\nDid you know the rap culture in India also known as desi hip hop is quite big? A lot of gully-wanderers including Divine and Naezy, are adding desi twist to the genre. The young rappers are bold and fearless and they’re using this platform to highlight issues and causes that they believe in.\nytimg.com\nWe have surely heard of Badshah, Honey Singh and Raftaar among other rappers who have finally got their dues, making their way into the world of Bollywood. However, there are many more young, desi hip-hop artistes waiting to be applauded. Some of these belonging to the slums are fighting underground rap battles, producing raw organic music, mixing beats you’ve never heard before.\nHere’s the story of Vivian Fernandes AKA Divine and Naved Sheikh AKA Naezy. In the age of Eminem and Yo Yo Honey Singh, here’s how these rappers struck a chord with the youth of India.\n#1 Vivian Fernandes AKA Divine\nplatform-mag.com\nVivek Fernandes or Divine, which is his stage name, grew up in the slums of Andheri, where he lived with his maternal grandmother. He started rapping for fun but was inspired by a Lecrae’s song, which was a gospel rap. Understanding the importance of how this medium can be used for writing about different issues, he channeled all his anger into the song he rapped and wrote majorly about alcohol, drugs, and girls.\nytimg.com\nHe rose to fame after his single Yeh Mera Bombay gained popularity in 2011. So much so, that it received the best video of the year award by Rolling Stone India in 2014.\nThis was just the beginning for Divine. He, who started rapping in English, soon switched to Hindi, because that’s what resonated with the young, energetic youth of India, especially the rickshaw pullers and street hawkers, which was his target audience.\n“The main reason I am what I am is because I practically lived alone; my mother and brother both worked abroad ever since my dad left. I would write every day for five hours at a time, and I’d spend days trying to perfect one verse, which I can do in minutes now,” he had said in an interview to Verve.\nSoon, Sony Music India took notice of his talent and collaborating with the company, he released his song Mere Gully Main in April 2015. His popularity grew with the song, which also featured Naezy. So much so, that the song was shared by many Bollywood celebs as well. From here, there was no looking back.\nHe then collaborated with many more underground rappers. Not only that he also collaborated with Nucleya for track Jungle Raja, which won Best EDM track of the year in the GIMA Awards in 2015. He has done another song titled Scene Kya Hai with the Indian DJ.\nHe also composed a song titled Paintra for Anurag Kashyap’s Mukkabaaz. What’s more? He has also created Kaam 25 for Netflix India’s Original series Sacred Games. He is the first Indian artist who has had an Apple Music release.\nLast year, he also did a song titled Badla for Irrfan Khan starrer Blackmail.\n“There’s an audience for everybody and that’s what I love about the game right now. Bollywood rappers play their own role that is different from ours, but neither is less or more than the other. Certain formats are easier to digest than others — after a long day someone may not want to listen to Jungli Sher, so they turn on DJ Wale Babu or Chaar Bottle Vodka,” he had said.\n#2 Naved Sheikh AKA Naezy\nwikifeed.in\nRemember the On Air With AIB song Tragedy mein comedy hai? The guy who hear in the song is Naezy.\nNaved Shaikh AKA Naezy grew up in the slums of Kurla. At the age of 13, he knew what he wanted to do. Thanks to Sean Paul's Temperature. He says he was in bad phase of life and just wanted to escape. That’s when he started writing. He generally tells his own story through the songs he writes. His story-telling skills are good that they keeps his audiences hooked.\nHis first project was a DIY, which he shot himself, wrote himself, sang himself and also edited himself on an I-pad. Aafat, in which he talks about Bombay in ‘70s, when his parents were struggling to make a living, brought him to the limelight.\nHe then started rapping with hip-hop collective, The Schizophrenics, which was founded by his friends in Khalsa College.\nIn yet another catchy rap titled Raaste Kathin, he talks about the corruption in the country.\n“Hip-hop ek aisa zariya hai jo hamare desh main bhi badlav la sakta hai (hip-hop is a way to bring about a change in our country). The masses think that hip-hop is about daaru, nasha, bling and swag but if you really look at hip-hop's antecedents, it was used to bring about a revolution. I want to remove people's misconceptions and rewrite the history of Indian hip-hop,” he was quoted as saying by TOI.\nTwitter\n“I have been working on this project for the past 18 months. Zoya first heard of me while she was editing Dil Dhadakne Do (2015) and saw the video of my song, Aafat. She was surprised that Mumbai slums have so much talent. Our first meeting was at Blue Frog in Lower Parel (shut since last August) where we were performing for MTV Indies (off air since last September). A common friend, Ankur Tiwari, arranged a few more meetings,” he told Mid-day.\nWhat’s more? A documentary has also been made on the life story of Naezy. Titled Bombay 70, the film won Best Short Film in the Dimensions section of MAMI 2014.\nStarring Ranveer Singh, Alia Bhatt and Kalki Koechlin in prominent roles, Zoya Akhtar’s Gully Boy is slated to release on Feb 14.", "title": "Meet Real Life Gully Boys Divine & Naezy Who Went From Raps To Riches & Inspired Ranveer’s Film", "date_publish": "15/01/2019, 13:29:50", "description": "Gully Boy, it is said, is roughly inspired by the real-life stories of rappers Divine and Naezy. It’s not a biopic, it is a fictional story, Zoya Akhtar recently revealed adding that the movie is inspired by underground rappers Divine and Naezy. Here’s the story of Vivian Fernandes AKA Divine and Naved Sheikh AKA Naezy aj. In the age of Eminem and Yo Yo Honey Singh, here’s how these rappers struc", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/meet-real-life-gully-boys-divine-naezy-who-went-from-raps-to-riches-inspired-ranveer-s-film-360434.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/meet_real_life_gully_boys_divine__naezy_who_went_from_raps_to_riches__inspired_ranveers_film_1547539277_800x420.png"}