{"text": "The film is much more than the musical journey of Murad, each and every character in the film have added value to Gully Boy. Let's make you meet the stars of Gully Boy who prove that ensemble cast definitely plays a major part in making a film complete.\nMany have also extended monetary help in favor of these grieving families. And after Big B, the team of Uri: The Surgical Strike, too, in collaboration with their production house RSVP, have donated to the families of Uri attack/Army Welfare Fund.\nDon't Miss 10.9 K SHARES\nReacting to these compliments, an elated Ranveer Singh took to his social media accounts to thank him in his own way! Sharing Smith's videos, he wrote, “Shoutout from the original rapper slash actor - BIG WILLY! RESPECT,” he wrote in the first and in the second one, he wrote,“SALAAM TUMKO BADE BHAI! BOHT HARD.”\nWell, Singh definitely deserves all the appreciation coming his way because as Murad, he was indeed 'Bahot hard'!\nWhile Ayushmann's poetic tribute to our soldiers is commendable, Ranveer Singh dedicated his speech at an award function in Dubai to the soldiers and observed a minute of silence. Here's how Bollywood celebrities are paying respect to the soldiers who lost their life in the ghastly Pulwama attack.\nNeena, 59, is the mother of celebrated fashion designer Masaba Gupta who is the lovechild of Neena and the iconic West Indian cricketer Vivian Richards. She opened up about the struggles she had to go through because of being a single-mother.", "title": "Meet The Team Of Gully Boy, Uri Makers Donate Rs 1 Crore And More From Ent World", "date_publish": "17/02/2019, 17:38:30", "description": "From Amruta Subhash, Siddhant Chaturvedi To Vijay Verma: Meet The Real Stars Of Gully Boy The film is much more than the musical journey of Murad, each and every character in the film have added value to Gully Boy. Let's make you meet the stars of Gully Boy who prove that ensemble cast definitely plays a major part in making a film complete.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/meet-the-team-of-gully-boy-uri-makers-donate-rs-1-crore-and-more-from-ent-world-362323.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/top_entertainment_news_1550405908_800x420.jpg"}