{"text": "Deepika Padukone is a woman of substance. She is known for performing powerful characters right from Mastani to Rani Padmavati, her grace is something everyone admires. After her marriage with Ranveer Singh, DP has a signed Meghna Gulzar’s next Chaapak, where she will be seen playing the role of an acid survivor Laxmi Agarwal.\nTwitter\nHowever, initially, Meghna was in a dilemma that Deepika might not accept this film. But things went well and now the actress will start shooting for it. An emotional Meghna penned down a heartfelt note for her actress where she spoke about the moment when she met Deepika.\nTwitter\nMeghna writes,\n“It was a moment of serendipity when I asked for a meeting with Deepika. I had had many conversations with myself that she just may not be interested in doing the kind of film that I was taking to her. And she wasn’t. She was looking to do something lighter after three intense films. But I didn’t have a light, romantic script for her. My film was based on acid violence. Of a woman who epitomized immense courage and strength, in the face of crippling adversity.”\n#Chhapaak director Meghna Gulzar about Deepika Padukone ❤ pic.twitter.com/13867zS05R — Deepika Padukone FC (@DeepikaPFC) March 1, 2019\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nLater she adds, Deepika agreed to do the film in a heartbeat. She even mentioned how DP jokes with her and that she also said yes to the film because she will get to eat kairi(raw mangoes)with salt and chili powder. Well, the character in the film loves to eat this.\nInstagram\nWell, the film will definitely bring a strong message and it is the first time any leading lady will play the role of an acid survivor, we hope this film will bring a minor change in the mentality of those who attack women with acid for their personal grudge or out of anger.", "title": "Meghna Gulzar Writes A Heartfelt Note For Deepika Padukone After She Agreed Playing Acid Survivor In Chaapak", "date_publish": "02/03/2019, 18:33:02", "description": "Deepika Padukone is a woman of substance. She is known for performing powerful characters right from Mastani to Rani Padmavati, her grace is something everyone admires. After her marriage with Ranveer Singh, DP has a signed Meghna Gulzar’s next Chaapak, where she will be seen playing the role of an acid survivor Laxmi Agarwal. However, initially, Meghna was in a dilemma that Deepika might not a", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/meghna-gulzar-pens-a-heartfelt-note-for-deepika-padukone-says-she-took-on-the-film-in-a-heartbeat-363056.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/deepika_padukone_1551529559_800x420.jpg"}