{"text": "Meghan Markle Holds An Umbrella For Prince Harry During His Speech And Internet Can't Handle It!\nMeghan Markle Holds An Umbrella For Prince Harry During His Speech And Internet Can't Handle It!\nThey might be the Duke and Duchess of Sussex but when it comes to giving us some of the most aww-dorable moments to gush over, they definitely are the best. Their pictures that start floating on the internet make us gush and swoon and it's difficult to get over their chemistry and love.\nAgencies\nThe couple was recently in New South Wales, Australia at an event where Prince Harry gave an inspiring speech. In his speech, he said,\n\"'You are the salt of the earth – honest, hardworking and as tough as they come. And that resilience, sense of humor and commitment to the land are the qualities that make you unique. You are the backbone of this country.' — Thank you to everyone that came out in the rain in Dubbo to meet The Duke and Duchess of Sussex!\"\nBut the speech wasn't the highlight of this event but it was how Meghan held an umbrella in the cold windy rain for Prince Harry that made everyone gush. The pictures that are floating on the internet are breaking all records of cuteness.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAgencies\nThe internet is not being to handle these cute PDA moments and everyone had a collective meltdown.\nAgencies\nHere is how people reacted to this 'filmy' scene.\nThis photo of Meghan Markle holding an umbrella for Prince Harry as he gives a speech in the rain is going to be the cutest thing you’ll see all day. pic.twitter.com/bbA3SU2Jpe — Mike Sington (@MikeSington) October 17, 2018\nShe carries her own coat, she bakes banana bread, she holds the umbrella for her man... Meghan Markle we are not worthy #australiaroyaltour #dubbo pic.twitter.com/z6KTH6Zwt9 — Julia Naughton (@JuliaNaughton) October 17, 2018\nMeghan Markle and Prince Harry sharing an umbrella and looking at each other like this is too much for my hormones to handle 😩😍 pic.twitter.com/rai3MuywqU — The Beauty Kingdom (@BeautyKingdomUK) October 17, 2018\nHow can Meghan Markle make such a mundane task of holding an umbrella look so effortlessly glorious and inspiring? I can't #RoyalVisitAustralia pic.twitter.com/RnrRYiDaMO — Denise Evans (@DeniseKEvans) October 17, 2018\nPrince Harry and Meghan Markle = I love everything about these two. The way she’s holding the umbrella for him. Yep, that’s love! ❤️💯✨ pic.twitter.com/b4QU5FLilo — Nefertiti Jáquez (@NefertitiWSB) October 18, 2018 How sweet😭😭😭Meghan is holding the umbrella for Harry💗My heart pic.twitter.com/knDapTKLfF — look_of_love (@E190518) October 17, 2018 Just to jog your memory, Meghan Markle and Prince Harry married this year in May and the couple is expecting their first baby. The news was announced in an official statement that read, Agencies\n\"Their Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the Spring of 2019. Their Royal Highnesses have appreciated all of the support they have received from people around the world since their wedding in May and are delighted to be able to share this happy news with the public. \"", "title": "Meghan Markle Holds An Umbrella For Prince Harry During His Speech And Internet Can't Handle It!", "date_publish": "19/10/2018, 12:43:02", "description": "But the speech wasn't the highlight of this event but it was how Meghan held an umbrella for him the cold windy rain for Prince Harry that made everyone gush. The pictures that are floating on the internet are breaking all records of cuteness. The internet is not being to handle these cute PDA moments and everyone had a collective meltdown.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/meghan-markle-holds-an-umbrella-for-prince-harry-during-his-speech-and-internet-can-t-handle-it-355071.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/meghan_markle_1539934478_800x420.jpg"}