{"text": "Deepika Padukone’s former manger Anirban Blah, who is the co-founder of celebrity management company called Kwan Entertainment, was the latest addition to the list of sexual predators in the world of showbiz. Accused of sexual harassment by several women, Anirban was sacked from the company. Following this, he also attempted suicide at a bridge at Vashi. Police reached the location on time and rescued him.\nimages.in.com\nIn his suicide note discovered by a TOI employee, he wrote that he failed in separating sex from power and became a monster.\nAdding to the allegations against him, aspiring actress Meira Omar, who had a brief role in 2016 film Wajah Tum Ho, has revealed horrifying details of her #MeToo story.\nMeira Omar says that to accomplish her dream of becoming an actress, she had approached Kwan Entertainment, when she first came to Mumbai in 2016. She contacted Anirban and enabled a meeting with the talent agency, post which she met Anirban in person at his apartment in Juhu, after he insisted. Meira Omar says he first made comments on her looks and asked her to let her hair down.\nDon't Miss 193 SHARES 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES\n“He stressed that all this makes one a star. He even went ahead and told me about a specific case where a a girl reached out to him and she was gorgeous, but too timid and shy. So he locked her in his balcony in that same Juhu apartment, where we were sitting and forced her to masturbate. He narrated the story to me with a sense of pride. He showed me pictures of the girl he was currently working on, pointing out the difference between before he discovered her, and after he did.”\nAfter this meeting, he gave her an assignment. “He said that I should imagine I was doing a cover shoot for an international fashion magazine and for that, I should pick out these sexy looks. He told me to really think about these looks, why I chose them and how they represented my sex appeal. He told me to \"bring these looks to work\" where he would photograph me and we would dissect the looks together.”\nMeira was uncomfortable after this. She met him but without the looks he had requested for. She then sensed a change in his attitude and soon he asked her to leave. When she was waiting for her cab, he leaned over to her and said, “Fuck, you are really sexy” and tried to kiss her.\nAfter this, he told her that she’ll have do some things with the men if she wants a career in Bollywood, and if she cannot do them, she must leave. “He said something like 'Bollywood won't change for you, no matter how well-read or how much of a feminist you are. You don't necessarily have to sleep with everyone, but you have to touch, kiss or tease them. Kissing is always okay,” she told TOI.\nMeira said that after this incident, she gave up on her dream to became an actor returned to Sweden with her family in order to heal.", "title": "Meira Omar Accuses Deepika Padukone’s Ex-Manager Anirban Blah Of Sexual Harassment, Shares Horrifying Details", "date_publish": "21/10/2018, 18:03:32", "description": "Deepika Padukone’s former manger Anirban Blah, who is the co-founder of celebrity management company called Kwan Entertainment, was the latest addition to the list of sexual predators in the world of showbiz. Accused of sexual harassment by several women, Anirban was sacked from the company. Adding to the allegations against him, aspiring actress Meira Omar, who has brief role in 2016 film Wajah T", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/meira-omar-accuses-deepika-padukone-s-ex-manager-anirban-blah-of-sexual-harassment-shares-horrifying-details-355175.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/meira_omar_shares_horrifying_details_as_she_accuses_deepika_padukones_exmanager_anirban_blah_of_se_1540122283_800x420.png"}