{"text": "In all these years, you might have forgotten that Aamir Khan has a brother too. Remember the Mela actor Faissal Khan, who played the role of Shankar Shane? Unlike Aamir Khan, Faissal’s Bollywood career wasn’t a smooth ride.\nbollywoodkhabrein.com\nFaissal Khan who did cameos in movies like Jo Jeeta Wohi Sikandar and Qayamat Se Qayamat Tak. Failures apparently took a toll on his mental health. So much so, that he had earlier accused his brother Aamir Khan of keeping him confined to his home because he was mentally ill. He ran away to Pune but was brought back to Mumbai, where eventually he was diagnosed with a mental disorder. Aamir and his father fought his custody battle, too, which made headlines.\nTwitter\nBut seems like things are better now. Faissal Khan is all set to make his Bollywood comeback. He will be seen in a film called Factor. It is said that he will be lending his voice to a romantic song titled Ishq Tera as well.\nTwitter\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHis latest pictures doing the rounds have left people stunned. Faissal Khan looks like a carbon copy of his brother Aamir Khan. Don’t believe us? Take a look!\nFaissal Khan looks like Aamir Khan’s twin, right? But he's not. Aamir is one year older to him. We wish Faissal good luck with his second stint.", "title": "Mela Actor Faissal Khan Looks Like A Carbon Copy Of His Brother Aamir Khan & Everyone’s Stunned", "date_publish": "16/01/2019, 11:28:33", "description": "Faissal Khan who did cameos in movies like Jo Jeeta Wohi Sikandar and Qayamat Se Qayamat Tak. Failures apparently took a toll on his mental health. So much so, that he had earlier accused his brother Aamir Khan of keeping him confined to his home because he was mentally ill. He ran away to Pune but was brought back to Mumbai, where eventually he was diagnosed with a mental disorder. Aamir and his", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/mela-actor-faissal-khan-looks-like-a-carbon-copy-of-his-brother-aamir-khan-everyone-s-stunned-360480.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/mela_actor_faissal_khan_looks_like_a_carbon_copy_of_his_brother_aamir_khan__everyones_stunned_1547618361_800x420.png"}