{"text": "Just a few days ago, Ekta Kapoor’s Balaji Motion Pictures released a motion poster for Mental Hai Kya, a film starring Kangana Ranaut and Rajkummar Rao. While people are pumped up with excitement to watch Rajkummar Rao and Kangana share the screen-space again after Queen, Mental Health Experts in India are not very happy.\nConsidering that the film has 'mental' in its name, it has irked a few mental health experts and they started reacting on social media. Triggered by the whole thing, several doctors including mental health experts pointed out all the problems that could arise with the poster imagery and the name of the film.\nBalaji Telefilms\nWhile no one knows what the film is going to put in forefront, these experts began a healthy discussion on social media and are urging the makers to change the name of the movie.\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\nHere are some reactions from Twitter and they are not positive.\nPeople with real mental health issues are struggling to get treatment, because of the stigma with words like ‘MENTAL’, ‘PSYCHO’. It is highly insensitive to have title like #MentalHaiKya I humbly request to change the title @RajkummarRao #KanganaRanaut — Dr. Pavan Sonar 🇮🇳 (@PavanSonar) April 17, 2019\n>@SmritiSawhney Precisely the gripe I had even with the title #MentalHaiKya. The poster does not help the cause either. The layperson would not be able to differentiate between 'mentally ill' and 'Mental'. Those with #mentalillness are often called 'mental' in a derogatory way. https://t.co/SWhdqdNB0P — Vijay Nallawala (@VijayNallawala) April 17, 2019\nThe film also stars Amyra Dastur, Amrita Puri, Jimmy Shergill and it also has an extended cameo by Shah Rukh Khan.", "title": "Mental Health Experts Urge 'Mental Hai Kya' Team To Change The Name Of Their Film", "date_publish": "19/04/2019, 16:18:27", "description": "Just a few days ago, Ekta Kapoor’s Balaji Motion Pictures released a motion poster for Mental Hai Kya, a film starring Kangana Ranaut and Rajkummar Rao. While people are pumped up with excitement to watch Rajkummar Rao and Kangana share the screen-space again after Queen, Mental Health Experts in India are not very happy.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/mental-health-experts-urge-mental-hai-kya-team-to-change-the-name-of-their-film-365764.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/mental_hai_kya_1555672172_800x420.jpg"}