{"text": "The #MeToo allegations on Rajkumar Hirani have evoked contrasting opinions. A few people are defending the filmmaker and others are still silent.\n\"Raj Kumar Hirani is too good a man to do something like this,\" said Indian film producer Boney Kapoor while reacting on recent sexual harassment allegations leveled against the Bollywood director.\nTwitter\n\"I don't believe this allegation. He can never do something like this,\" Kapoor asserted.\nJust to join the dots for you, a HuffPost India article reported that a woman (Who was assisting Hirani on Sanju) said that on April 9, 2018, the director first passed a sexually suggestive remark to her and later sexually assaulted her at his home office.\n(Also read: Arshad Warsi & Sharman Joshi React To Sexual Harassment Charges Pressed Against Rajkumar Hirani)\nCommenting on the same, Emraan Hashmi stated that it's just an allegation and till the time it is proved correct, he thinks it would not be right to comment on the matter.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I don't want to comment on this. It's just an allegation. Nothing has been proved as of yet. The director has already dismissed the allegations. Till the time something is not proven, I don't think it right to comment on this,\" Hashmi said.\nWhile a few of the Bollywood actors who have worked with Hirani have expressed their opinion, a few others are still waiting for the impending legal procedure to prove something.\n(Also read: Twitter Stands Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!)\n(With agency inputs)", "title": "#MeToo Allegations On Filmmaker Rajkumar Hirani Have Evoked Contrasting Opinions", "date_publish": "15/01/2019, 15:14:02", "description": "Boney Kapoor comes out in support of Rajkumar Hirani, says he is too good to do something like thisBoney Kapoor comes out in support of Rajkumar Hirani, says he is too good to do something like thisBoney Kapoor comes out in support of Rajkumar Hirani, says he is too good to do something like this", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/metoo-allegations-on-filmmaker-rajkumar-hirani-have-evoked-contrasting-opinions-360448.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hirani_1547546441_800x420.jpg"}