{"text": "Sexual harassment is not restricted to film industry or Bollywood. Women face abuse, assault and misconduct countrywide and worldwide, at workplace and sometimes at home as well.\nAfter a flurry of allegations against big names from Bollywood that included Vikas Bahl, Sajid Khan and Alok Nath, #MeToo has now hit the small screen industry as well.\nAlso Read: Shatrughan Sinha Feels #MeToo Movement Is Becoming ‘Free For All’ & Being Blown Out Of Proportion\nindia.com\nFormer Roadies and Bigg Boss contestant, Renee Dhyani has shared #MeToo story recently. Currently working in Zee TV's Yeh Teri Galiyan, Renee revealed about the time when his co-star asked her to “suck his di**” in front of his sister-in-law and girlfriend.\nfacebook/reneedhyanz\n“We all got drunk and were dancing. This guy [a leading male TV actor whose name Renee does not wish to disclose in print] was so high, he started posing and yelling in front of my face saying 'choos choos' (suck). For one second, I was like 'what the h**l he is doing, pointing at his crotch'. The director of the show said 'Renee don't react'. I said I will not leave him like this. How dare he say a word like this in front of his girlfriend. Even his bhabhi (sister-in-law) was present. Everybody asked me to shut up. I was so hyper, and told him, 'Ask your girlfriend (to do this)',\" she told Hindustan Times.\nDon't Miss 193 SHARES 862 SHARES 346 SHARES\nytimg.com\nFurthermore, Renee Dhyani said that the actor is known for his misbehaviour. Because of his abusive and aggressive nature, the TV actress said, his then girlfriend also broke up with him. Renee Dhyani, on the other side, had cut off ties with him post this incident.\nAlso Read: To Ensure #MeToo Isn’t Misused, Kriti Sanon Urges Women To Reveal Their Identity Or File A Case", "title": "#MeToo Hits Small Screen Industry, TV Actress Renee Dhyani Accuses Co-Star Of Sexual Misconduct", "date_publish": "30/10/2018, 11:25:58", "description": "Former Roadies and Bigg Boss contestant and TV actress Renee Dhyani has shared #MeToo story recently. Currently working in Zee TV's Yeh Teri Galiyan, Renee revealed about the time when his co-star asked her to “suck his di**” in front of his sister-in-law and girlfriend.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/metoo-hits-small-screen-industry-tv-actress-renee-dhyani-accuses-co-star-of-sexual-misconduct-355695.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/metoo_hits_small_screen_industry_tv_actress_renee_dhyani_accuses_costar_of_sexual_misconduct_1540880180_800x420.jpg"}