{"text": "“Listen up - there's no war that will end all wars.”\nWell, every side of the war is ugly and now, in a rather disappointing turn of events, an online petition seeking the removal of actor Priyanka Chopra as the UNICEF Goodwill Ambassador, has been filed in Pakistan. The report has been confirmed by The News International and the petition tags both UN and UNICEF.\nBackgrounder: Why the angst?\nAgencies\nThe petition is a result of angst that people had after she congratulated the Indian Air Force after air strikes across the Line of Control. Her tweet read:\nPC's congratulatory tweet came a day after the Indian Air Force conducted multiple air strikes in Pakistan's Balakot.\nTWITTER\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nIn the petition, people have argued that PC indirectly ‘cheered for war’, even though she is a UNICEF Goodwill Ambassador.\nAgencies\nJust to jog your memory a little, Priyanka Chopra was made the UNICEF Goodwill Ambassador in December 2016.\n“War between two nuclear powers can only lead to destruction & death. As goodwill ambassador of UNICEF, Priyanka Chopra was supposed to stay neutral & peaceful but her tweet in favour of Indian arm forces after they invaded Pakistan airspace shows otherwise. She doesn’t deserve this title anymore,” the petition reads on website Avaaz.org.\nPriyanka Chopra is yet to respond to the criticism.", "title": "Miffed With PC's Tweets, Pakistan Files A Petition To Remove Her As UNICEF Goodwill Ambassador", "date_publish": "03/03/2019, 11:35:16", "description": "In a rather disappointing turn of events, an online petition seeking the removal of actor Priyanka Chopra as the UNICEF Goodwill Ambassador, has been filed in Pakistan. The report has been confirmed by The News International and the petition tags both UN and UNICEF.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/miffed-with-pc-s-tweets-pakistan-files-a-petition-to-remove-her-as-unicef-goodwill-ambassador-363066.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/priyanka_chopra_1551593260_800x420.jpg"}