{"text": "It was heart-breaking to just read Savi Sadhu’s story that went viral sometime ago. The actor who has worked in movies such as Gulaal, Black Friday, Patiala House and Bewakoofiyaan was still struggling to find work for himself in the industry. Failing to do so, he was forced to take up a job as a security guard.\nMumbai is called the city of dreams. A lot of people come here in aspirations to become an actor. They struggle for a lot of years - -sometimes they fulfill their dreams just like how Nawazuddin Siddiqui among others did, and other time they have to give up on their dreams.\nThe story of Savi Sadhu was a little different. He got role initially but later on, he was finding it tough to survive in the industry. To support his family financially, the man had to take up a job of a security guard.\n“Mere pas bus ke paise nahi hain apne director producers ko milne ke aise halat hain. Ja ke film dekhna toh mere liye dream hai abhi. Bohot filme miss kar raha hoon... dekhne ka mann karta hai par meri financial position aisi hai,” he was quoted as saying.\nAlso Read: 'Gulaal' Actor Savi Sadhu, Who Has Worked With Akshay Kumar-Anurag Kashyap, Takes Up Job As A Security Guard\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBCCL\nMika Singh has now extended some help to Savi Sadhu. He had first sent a car to his place to take him to his house. He gave him food as well as clothes. And with that, he confirmed that he will start working with him in next 10 ten days.\nI don’t know him personally, but I’d really love to help. https://t.co/J2WLpLJMSO — King Mika Singh (@MikaSingh) March 20, 2019\nIn his upcoming production titled Aadat, which stars Karan Singh Grover and Bipasha Basu in lead roles, he has offered him a role. Not only that, he has asked him to quit his job as security guard and instead join his team.\nKudos, Mika Singh!\nAlso Read: Anurag Kashyap Extends Support To Actor Savi Sidhu, Who Now Works As A Guard To Make Ends Meet", "title": "Mika Singh Extends Help To Actor-Turned-Security Guard Savi Sadhu, Offers A Role In Bipasha Basu Starrer", "date_publish": "26/03/2019, 12:49:29", "description": "Mika Singh has now extended some help to actor-turned-security guard Savi Sadhu. He had first sent a car to his place to take him to his house. He gave him food as well as clothes. And with that, he confirmed that he will start working with him in next 10 ten days.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/mika-singh-extends-help-to-actor-turned-security-guard-savi-sadhu-offers-him-a-role-in-bipasha-basu-starrer-364312.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/mika_singh_extends_help_to_actorturnedsecurity_guard_savi_sadhu_offers_a_role_in_bipasha_basu_sta_1553584916_800x420.png"}