{"text": "Asked about his New Year resolution to IANS, he said: \"Four days ago, my mother told me that now this four-pack body will not be enough and she asked me ‘what is your resolution for next year' so, I told her ‘nothing' then, she told me ‘you have to achieve six-pack body' so now that means, I have to be disciplined and I am doing that.\nSoon after the release of the trailer, CBFC raised objections to four dialogues and two scenes in the movie, and asked the makers to make necessary changes. Furthermore, actor Siddharth also called out the movie trailer for being “anti-South Indian”.\nDon't Miss 862 SHARES 346 SHARES\nAccording to court filings obtained by AFP, the young man, identified as William Little and aged 18 at the time of the alleged assault in July 2016, told police he had sent messages, including a video, to his girlfriend via the Snapchat app from the \"Club Car\" restaurant in Nantucket, where he was working as a bus boy for the summer.\nPosting black and white pictures with her new husband Liam, the couple got married on 23rd December of this month. The 26-year-old posted a series of snaps with now husband from their intimate ceremony.\nSweetie, played by Sonam Kapoor has to deal with her over-enthusiastic family that wants to get her married, a young writer who is completely smitten by her and a secret which might not find acceptance in her family and society.\nWatch the trailer. The movie is all set to release on 1st February, 2019.", "title": "Miley Cyrus Marries Liam Hemsworth, Salman Khan Celebrates His 53rd Birthday & More From Ent", "date_publish": "27/12/2018, 18:33:20", "description": "Posting black and white pictures with her new husband Liam, the couple got married on 23rd December of this month. The 26-year-old posted a series of snaps with now husband from their intimate ceremony. Asked about his New Year resolution to IANS, he said: \"Four days ago, my mother told me that now this four-pack body will not be enough and she asked me ‘what is your resolution for next year'", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/miley-cyrus-marries-liam-hemsworth-salman-khan-celebrates-his-53rd-birthday-more-from-ent-359382.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wrap_1545913568_800x420.jpg"}