{"text": "Milind Soman Urges Men In The Fashion Industry To Come Out And Share Their #MeToo Stories\nMilind Soman Urges Men In The Fashion Industry To Come Out And Share Their #MeToo Stories\nThe #MeToo movement has spread like wildfire in India. The movement might have been delayed in India but the impact it has managed to create is deep. Hindi Cinema as an industry stood up against sexual predators and several shocking names came out in this process.\nFrom being expelled from their own projects to their films being dropped from various film screenings, it was a unanimous decision of coe celebs to stand up against these people.\nBut do you think this exists only in Bollywood? Well, the answer sadly is no. In a recent interview with Republic TV, model-actor and fitness enthusiast Milind Soman was asked if he ever came across such incidents as a model. Talking about the same, he said,\n“Not really because when I started modeling, of course, everybody today talks about casting couch concept in films and fashion as well but when I started, fashion was such a new industry that all of us were starting out together so there was no position of power or something like that could encourage this kind of an incident. For me, I was never subjected to this but I know it exists because people talk to me about it.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nMilind also added how satisfied he is to see people full of courage, coming out and telling their stories. He also feels that it should give courage to men in the fashion industry to come out in the open and talk about their sexual harassment stories. He added,\n“I think it's very good. It is definitely something which is needed. Women and even men, in the fashion industry I would say that even men need to come out and talk about it because when we talk about the predatory aspect of the people in power, it is something that needs more awareness.”\nCurrently, Milind Soman is busy with his television projects. Apart from judging MTV India's next top model, he is also producing other TV shows.", "title": "Milind Soman Urges Men In The Fashion Industry To Come Out And Share Their #MeToo Stories", "date_publish": "26/10/2018, 11:53:35", "description": "From being expelled from their own projects to their films being dropped from various film screenings, it was a unanimous decision of the people to stand up against these people. Milind Soman feels that stories of sexual exploitation are prevalent in the fashion and modelling industry too.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/milind-soman-urges-men-in-the-fashion-industry-to-come-out-and-share-their-metoo-stories-355483.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/milind_soman_1540536865_800x420.jpg"}