{"text": "Right now everyone is going gaga over Vicky Kaushal’s Uri. The film has earned Rs 150 crore and surpassed all the records at the box-office. Vicky was outstanding in the film and there is no doubt about it.\nTwitter\nBut one man who managed to shine even with a small screen space is Mohit Raina aka Mahadev of Television. This drool-worthy actor showed his versatility by playing the role of Captain Karan Kashyap in the film.\nInstagram\nAfter the super success of Uri, we managed to have a conversation with him and spoke to him on length about Uri's success, why he preferred to play a supporting role, nepotism, and favoritism in Bollywood among other things.\nDon't Miss 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nTo begin with, he said, he was damn confident, Uri will hit the right chords with the audience and the film will be a super hit, “I was in Gujarat when I read in papers that Uri is being made and fortunately after a month I got a call to be a part of the film. And when I met them, I realised that this film is being made on a large scale in terms of research and people who were involved. I was very sure that Uri will be accepted beautifully. We all have that patriotic chord in us but aren’t aware of. We love our nation so much but we are not in a capacity to show it in a certain manner.”\nInstagram\nMohit is a huge star on television thanks to Devon Ke Dev Mahadev, he could have easily got to play a lead role in movies, but what made him play a supportive actor, to which he said, “\nIf you would have asked me this question just two years ago, my answer would be I am not getting the right script. But you are asking me this in 2019, then let me tell you we have realised that audiences have changed in the last two years, their taste has completely changed over the time. Content and story is their first priority, so I thought I cannot deliver them something they don’t want, rather I would mould myself and give them something they want at this point of time. If I would have double the screen space in any other film and not Uri and what if it wouldn’t have created the same impact then what’s the use?”.\nInstagram\nHe further convinces, “ I was reading a lot of scripts earlier, but honestly I wasn’t getting the right script which would do justice to the talent that I have, people love me for a reason and if would have done any other film they would stop loving me as they do now. So I didn’t want to do anything just for the sake of it.”\nInstagram\nActors get easily stereotyped in the industry, if certain things work for them then they are given the repetitive kind of films, said Emraan Hashmi in our interview earlier, we asked Mohit how will he manage to not get stereotyped, and he replied, “ It’s very simple; you just have to say NO.”\nInstagram\nFurther adding to it, he continued, “If a director who has lots of experience gives me a part that will stand out, I will do it. It’s not about a single-centric time that is going on right now. it’s not that people are going to watch any A or B particular person, today they go to see the versatility of the actors.\nIn fact, Vicky is the best example of that, if you see his graph, it’s incredible. From Masaan to Sanju, his choice of script is different. Sanju was Ranbir Kapoor’s film, but his talent stood him out, even in Raazi, he made his mark. Today, the time has really changed and you have to mould yourself accordingly. It’s a beautiful phase going on in Bollywood right now.”\nWhen asked how secure he isas an artist when he does a multi starrer film, he replies,\n“I am very secure as an actor; I don’t think I have anything to worry. The story is a real king if I am going to make an impact with my presence that can be done even in 2 minutes or one hour. I know that nobody is going to take that two minutes from me. You can do a multi starrer film, but you have to hold your ground because it’s time for talent only.”\nNepotism often make talented actors lose their films, how prepared is Mohit for it, he answers, “ I haven’t faced it yet, but when it comes, I will face it, you can’t do anything about it. If the person is talented he or she will reach places. Also earlier there was a time when producers wanted to work with certain actors but today even they look for talent and that’s the best part. Today things have become very competitive, so they have to think about the project and not that A person.”\nInstagram\nMohit is thankful to television that it gave him Mahadev which will help him for life, “Being Mahadev on TV is obviously benefiting me because if the person recognizes me I am Mahadev, that person will hold his or her eyes on me throughout the film. It’s gratifying that in such a small span of time you are being liked, it takes ages to even get noticed. It’s the best phase of my life and I am enjoying it.”\nWay to go Mohit! We are looking for some more amazing performance from you.", "title": "Mohit Raina Explains Why He Chose To Play A Supporting Role In Uri Despite Being So Popular", "date_publish": "28/01/2019, 15:47:53", "description": "Right now everyone is going gaga over Vicky Kaushal’s Uri. The film has earned 150 crore and surpassed all the records at the box-office. Vicky was outstanding in the film and there is no doubt about it. But one man who managed to shine even with a small screen space of time is Mohit Raina aka Mahadev of television. This drool-worthy actor showed his versatility by playing the role of Captain Arju", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/mohit-raina-explains-why-he-chose-to-play-a-supporting-role-in-uri-despite-being-so-popular-361175.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/mohit_raina_1548671593_800x420.jpg"}