{"text": "Monica And Phoebe Reunite For Ellen Show, Hera Pheri 3 To Go On The Floors And More From Ent\nMonica And Phoebe Reunite For Ellen Show, Hera Pheri 3 To Go On The Floors And More From Ent\n\"I wish Lisa Kudrow was here, because that would be fun,\" Ellen DeGeneres casually commented while sipping her coffee and that's when Lisa Kudrow AKA Phoebe walked in.\nIt has been 19 years since the first instalment of the movie made its way to the cinema halls. The second one was released in 2006. So, almost after 13 years, Hera Pheri 3 is in the works, reports Mumbai Mirror. The movie will bring back the trio – Akshay Kumar, Sunil Shetty and Paresh Rawal.\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nThe pictures were posted from VP’s official Twitter handle. The pictures were posted with a caption: \"Happy to have watched the movie ‘Uri-Surgical Strikes’ today along with Indo-Tibetan Border Police Personnel who guard the Vice President’s Residence in New Delhi. It was an inspiring movie. I congratulate the cast & crew of #Urimovie for showcasing the valour of #IndianArmy.”\nHe tweeted, “I miss having a real connection w/ real people. My Community. From now on you can just text me. I won’t be able to respond to everyone but at least we can be real w/ each other & I can share the unedited latest & greatest in my world.”\nIn the video, he says, “Pakistan mein meri filmein sabse zaada business karti hai. Jitna pyaar wahan se milta hai, shayad hi kahin se milta hai! (My films work best in Pakistan. The love I get from this country is more than any other place!).” After the video went viral on the internet, people quickly reacted to it and wrote that had any of the Khans including Shah Rukh Khan, Aamir Khan, Salman Khan would have uttered similar words, they would have been massively trolled.", "title": "Monica And Phoebe Reunite For Ellen Show, Hera Pheri 3 To Go On The Floors And More From Ent", "date_publish": "30/01/2019, 18:45:46", "description": "1. After A Lunch Date, Courteney-Lisa Went On Ellen’s Show & It's FRIENDS Season All Over Again! \"I wish Lisa Kudrow was here, because that would be fun,\" Ellen DeGeneres casually commented while sipping her coffee and that's when Lisa Kudrow AKA Phoebe walked in.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/monica-and-phoebe-reunite-for-ellen-show-hera-pheri-3-to-go-on-the-floors-and-more-from-ent-361321.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/top_trending_1548847950_800x420.jpg"}