{"text": "Most-Loved Star Of The Nation, Shah Rukh Khan Says He Feels Like A Loser Sometimes!\nMost-Loved Star Of The Nation, Shah Rukh Khan Says He Feels Like A Loser Sometimes!\nFondly called the Badshah of Bollywood, the King of Romance Shah Rukh Khan is one of the most loved personalities of the nation. He has a massive ardent fan following that can go to any extent to just catch a glimpse of him. Not only in his home country but people abroad go bonkers every time his movies hit the theatres.\nHe is humble, generous and almost always witty. But did you know that your favourite star Shah Rukh Khan feels like a loser sometimes? Well, that’s what he said recently at the launch event of his forthcoming film Zero’s trailer.\n“I feel like a loser all the time. I met Aamir Khan a few days back and he asked me why I keep thinking like that. After conversing (with him), I realised he thinks in the same way.”\nTwitter\nAt the same time, the superstar says that is important to have lack of overconfidence.\n“Over confidence is worse than feeling like a loser. I feel I work harder when I think I am not good enough. I always feel I'm not good enough. I sometimes joke that I don't know how to dance, I've five expressions but I genuinely believe them, that I'm not good at everything, so I've to work harder,” he told PTI.\nPTI\nDon't Miss 5.1 K SHARES 812 SHARES 153 SHARES 343 SHARES 2.4 K SHARES\nRecently, Shah Rukh Khan answered a lot of questions of the fan in an #AskSRK session on Twitter. When a user asked him to describe Salman Khan in one word, Shah Rukh Khan’s reply to that won many people’s hearts. Here’s what he wrote:\n‘Bhai’ se badhkar kya ho sakta hai for someone like me who lost his parents so early in life. Best way to describe Salman is Bhai... https://t.co/CaQT780LRG — Shah Rukh Khan (@iamsrk) November 3, 2018\nHe is called King Khan for nothing. He has heart of gold, don’t you agree?", "title": "Most-Loved Star Of The Nation, Shah Rukh Khan Says He Feels Like A Loser Sometimes!", "date_publish": "04/11/2018, 14:38:08", "description": "Fondly called the Badshah of Bollywood, the King of Romance Shah Rukh Khan is one of the most love personalities of the nation. He has a massive ardent fan following that can go to any extent to just catch a glimpse of him. Not only in his home country, but people abroad also go bonkers over his movie in abroad as well.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/most-loved-star-of-the-nation-shah-rukh-khan-says-he-feels-like-a-loser-sometimes-356025.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/most_loved_star_of_the_nation_shah_rukh_khan_says_he_sometimes_feels_like_a_loser_1541324881_800x420.jpg"}