{"text": "In 2017, Akshay Kumar had launched an insurance scheme for stunt choreographers. His decision came in the wake of the unfortunate death of stuntman Abdul Sattar Munna, who had passed away in a road accident two years ago.\nThe stuntman succumbed to his injuries after he met with an accident fatal accident while traveling to the set of a Malayalam film. But thanks to Akshay's initiative, his family received a monetary compensation of 20 Lakhs.\nTwitter\nAnd now, according to a Mid-Day report, Movie Stunt Artistes Association general secretary, Aejaz Gulab is urging Akshay Kumar again and seeking his assistance to secure insurance for senior stuntmen.\nThe report quotes Gulab saying,\n\"Two years ago, getting compensation of Rs 20 lakh for a stuntman's family was impossible. But Akshay sir stepped in and procured accident insurance policies and mediclaim insurance for the 550 stuntmen registered with us. He even pays our premium. Insurance companies only cover those between 18 to 55 years of age. The benefit is not extended to those above the age bracket.\"\nDon't Miss 7.9 K SHARES 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES\nHe further explained that the insurance is more than important for senior stuntmen as over 50 action choreographers are older than 55 years of age. He added,\n\"If something were to happen to any of them at work, we wouldn't be able to raise enough money via donations to support their families. In most cases, they are the sole breadwinners in the family. It's a double whammy for them — while the younger stuntmen are receiving cashless treatment, the senior ones are either letting go of good work since they don't have medical cover or going to work with risk looming large over them.\"\nHe confirmed that he met Akshay Kumar and expressed the issues and is hopeful that Khiladi Kumar will once again come to the rescue of his fellowmen from the industry.\nOn the professional front, Akshay has his kitty full with some interesting projects that include Mission Mangal, Good News, Housefull 4 and Sooryavanshi.", "title": "Movie Stunt Artistes Association Approach Akshay Kumar To Secure Insurance For Senior Stuntmen", "date_publish": "01/04/2019, 11:40:43", "description": "He confirmed that he met Akshay Kumar and expressed the issues and is hopeful that Khiladi Kumar will once again come to the rescue of his fellowmen from the industry. On the professional front, Akshay has his kitty full with some interesting projects that include Mission Mangal, Good News, Housefull 4 and Sooryavanshi.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/movie-stunt-artistes-association-approach-akshay-kumar-to-secure-insurance-for-senior-stuntmen-364651.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/akshay_kumar_1554099118_800x420.jpg"}