{"text": "Movie On Lal Bahadur Shastri's Mysterious Death 'The Tashkent Files' Is All Set For Release\nMovie On Lal Bahadur Shastri's Mysterious Death 'The Tashkent Files' Is All Set For Release\nGenerations have passed but the conspiracy theories surrounding the the mysterious death of former Prime Minister Lal Bahadur Shastri haven’t died.\nHailed as the modern India’s icon, Lal Bahadur Shastri, who led the country during the Indo-Pak war of 1965 – the man whose slogan ‘Jai Jawan Jai Kisan’ became popular during that time – was in Tashkent when the incident took place.\nCulturalIndia.net\nAt around 4pm on Jan 10, it is said, that he signed the Tashkent accord and returned to his villa provided by his Russian hosts. Thereafter in the evening, he ate a light meal prepared by Jan Mohammad, the personal cook of TN Kaul, who was the Indian ambassador to Moscow.\nassettype.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAt 11:30, he had a glass of milk prepared by Jan Mohammad. He was fine when his staff left his room. There were Russian butlers in the villa too.\nTwitter\nAt around 1:25, he woke up coughing severely. It was supposedly a heart attack. By the time his personal doctor RN Chugh arrived, he had breathed his last taking Lord Ram’s name.\nTwitter\nFrom doubts of poisoning to the fact that no post mortem was later carried out on his body, a lot of theories about Lal Bahadur Shastri’s mysterious death have been doing the rounds.\nNow, a film helmed by filmmaker Vivek Agnihotri, who is known for his right-wing leanings and controversial statements, will reportedly unravel the real reason behind Lal Bahadur Shastri’s death.\nin.com\nTitled The Tashkent Files, the movie will hit the screens on April 12. “The man you know, The mystery you don't,” the makers wrote in the caption as they released the poster of the movie.\nIt is said that the filmmaker and his team researched on the subject for about three years for this film. In 2018, Vivek Agnihotri had asked people on Twitter to share whatever information they have about Shastri’s mysterious death. Because there are no documents left in the government records, it is said that Vivek has crowd-sourced the movie.\nTOI\nThe movie stars Naseeruddin Shah, Mithun Chakraborty, Shweta Basu, Pankaj Tripathi, Vinay Pathak, Mandira Bedi, Pallavi Joshi, Ankur Rathee and Prakash Belawadi among others.\nHow will the truth unfold? Only time will tell. The movie is releasing on April 12.", "title": "Movie On Mysterious Death Of Lal Bahadur Shastri Is All Set For Its Release", "date_publish": "20/03/2019, 13:03:13", "description": "Titled The Tashkent Files, a film helmed by filmmaker Vivek Agnihotri will reportedly unravel the real reason behind Lal Bahadur Shastri’s death. The movie stars Naseeruddin Shah, Mithun Chakraborty, Shweta Basu, Pankaj Tripathi, Vinay Pathak, Mandira Bedi, Pallavi Joshi, Ankur Rathee and Prakash Belawadi among others.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/movie-on-lal-bahadur-shastri-s-mysterious-death-the-tashkent-files-is-all-set-for-release-364006.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/vivek_agnihotri_is_making_a_film_based_on_the_mysterious_death_of_lal_bahadur_shastri_1553065312_800x420.png"}