{"text": "Mumbai Police Wins The Internet With An Epic Comeback To Sonam & Dulquer. Here's What Happened!\nMumbai Police Wins The Internet With An Epic Comeback To Sonam & Dulquer. Here's What Happened!\nMumbai Police is known for their fantastic team of officers who give their blood and sweat for the safety of the nation. But that's not the only thing they're good at. The social media of Mumbai Police is equally cool.\nSonam Kapoor recently posted a video of Dulquer Salmaan using a mobile phone while driving, and it seems like Mumbai Police did not take it lightly.\nDulquer Salmaan, an established actor of the Malayalam Cinema, will be next seen opposite Sonam in the film 'Zoya Factor'. Taking to her Instagram stories, Sonam Kapoor posted a video in which her co-actor can be seen driving a car with both his hands busy on his phone, instead of the steering wheel.\nSitting next to him, Sonam can be heard saying \"Weirdo.\" Shortly after the clip was posted, Mumbai Police took to their twitter handle to give a piece of advice to the two.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWe agree with you @sonamakapoor ! Quite a ‘weirdo’ to try such stunts while driving and putting the lives of fellow drivers at risk too! We don’t quite approve of these even in ‘reel’ life. #NotDone pic.twitter.com/WWoDz16hKj — Mumbai Police (@MumbaiPolice) December 14, 2018\n\"We agree with you @sonamakapoor! Quite a 'weirdo' to try such stunts while driving and putting the lives of fellow drivers at risk too! We don't quite approve of these even in 'reel' life. #NotDone,\" the tweet read.\nHowever, Sonam quickly came to Dulquer's rescue and clarified that contrary to what the Mumbai police interpreted, that the actor was not driving the car, in fact, they were \"rigged on a truck\".\n\"We weren't driving we were rigged on a truck.. but I'm glad you guys are concerned.. I hope and I know you show the same interest in regular folk as well! Thanks for taking care!\" she tweeted.\nDulquer Salmaan also responded saying he's not a weirdo.\nWould appreciate it if you had checked some facts before tweeting this. In fact @MumbaiPolice helped us with permissions and traffic management during the shoot and were present the whole time. In my next tweet attaching the video I was shooting. #notawierdo https://t.co/WnKSnSDmjZ — dulquer salmaan (@dulQuer) December 14, 2018\nBut Mumbai Police did not stop there. They had a reply for Sonam Kapoor who called out to the regular folks.\nFor us, No Mumbaikar is ‘regular’ they are all ‘special’! And we are equally concerned about them all. Glad to know your safety wasn’t ‘rigged’. @sonamakapoor https://t.co/PyYbB23OZs — Mumbai Police (@MumbaiPolice) December 14, 2018\nDespite wrongly schooling Sonam Kapoor and Dulquer Salmaan, Mumbai Police still knows how to win the internet with their coolest comebacks.\nI like the people / person behind the sarcasm and the wit of the @MumbaiPolice twitter handle. Thank You for the safety. — Kubbra Sait (@KubbraSait) December 14, 2018\nProud of mumbai police ❤️🌹🌹❤️ — Wacky (@khanwacky) December 14, 2018\nOops!!! It hurts, doesn’t it @sonamakapoor , perfect reply 👍🏻 — imKunwar (@BryanKunwar) December 14, 2018\nWhat a befitting reply.👏👏😂 — Praveen Sivam (@sivampraveen) December 14, 2018\nTrolling level - Infinity. 😂😂 — Rohan. (@Bakarrchod) December 14, 2018\nBrilliant answer ! Awesome !\nWould love to see person(s) handling Mumbai police twitter handle ! — Parag (@Paragshah1972) December 14, 2018", "title": "Mumbai Police Wins The Internet With An Epic Comeback To Sonam & Dulquer. Here's What Happened!", "date_publish": "14/12/2018, 18:30:18", "description": "Sonam Kapoor recently posted a video of Dulquer Salmaan using a mobile phone while driving, and it seems like Mumbai Police did not take it lightly. Dulquer Salmaan, an established actor of the Malayalam Cinema, will be next seen opposite Sonam in the film 'Zoya Factor'.", "authors": [], "url": "https://www.indiatimes.com/entertainment/mumbai-police-wins-the-internet-with-an-epic-comeback-to-sonam-dulquer-here-s-what-happened-358628.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonam_1544795225_800x420.jpg"}