{"text": "Munna Bhai is one of the most iconic films made in the history of Indian cinema. The movie was not only a game-changer for debutant director Rajkumar Hirani but also for many others who were a part of the film like Sanjay Dutt and Arshad Warsi - their careers were revived because of this classic movie.\nArshad Warsi has finally confirmed that the third instalment is in the works. The script is ready and the shooting will begin this year, he said, confirming that Sanjay Dutt will definitely be a part of the movie as well.\nWhile the talks of Munna Bhai 3 are on, actor Vishal Thakkar’s intractability is still haunting his family.\nKnown for his roles in films such as Munnabhai MBBS, Chandni Bar and TV show Taarak Mehta Ka Ooltah Chashma, Vishal Thakkar has been missing for three years and cops are still clueless about his whereabouts.\nTwitter\nIt was in December 2015, at around 10:30 pm, when he borrowed Rs 500 from his mother after she refused to go watch a movie with him and left his Mulund flat. Little did his family know that it was the last time they were seeing him.\nYouTube\nIt is said that on the same night at around 1 am, he texted his father that he was going to a party and will see them in the morning. However, the morning after that, he went missing. It has been three years and he remains untraceable.\nytimg.com\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nVishal Thakkar’s 60-year-old mother Durga is worried that the case hasn’t progressed even a bit, reports Spotboye.com. There is no hospital record for a man matching his description, and his bank account, too, hasn’t shown any activity since then.\nTwitter\nThe incident took place after the actor was booked for allegedly raping a 25-year-old model in 2015. It is said that the girl withdrew her complaint after they both resolved their differences. However, the incident left a deep impact on Vishal Thakkar. He couldn't bear his family's insult.", "title": "Munna Bhai MBBS Actor Vishal Thakkar Has Been Missing For 3 Years, Cops Are Still Clueless", "date_publish": "12/01/2019, 11:52:36", "description": "Known for his roles in films such as Munnabhai MBBS, Chandni Bar and TV show Taarak Mehta Ka Ooltah Chashma, Vishal Thakkar has been missing since three years and cops are still clueless about his whereabouts. It was in December 2015, at around 10:30 pm when he borrowed 500 bucks from his mother after she refused to go watch a movie with him, and left his Mulund flat.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/munna-bhai-mbbs-actor-vishal-thakkar-has-been-missing-for-3-years-cops-are-still-clueless-360278.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/munna_bhai_mbbs_actor_vishal_thakkar_remains_missing_since_3_years_cops_are_still_clueless_1547274304_800x420.png"}