{"text": "My Kids Are Not Products, Says Akshay Kumar On Why He Keeps His Kids Away From The Spotlight\nMy Kids Are Not Products, Says Akshay Kumar On Why He Keeps His Kids Away From The Spotlight\nHe is a bankable actor, a phenomenal star, a generous human being and someone who has some strict rules for himself. If you ask his co-stars, Akshay Kumar will definitely win the trophy of the 'Most disciplined' actor. Why?\nBecause, he's never late, his eating habits are healthy and he goes to bed at 10 pm. These are not the only reasons why India loves Akshay Kumar. While we have time and again specified innumerable reasons for his stardom, the way he functions is also what deserves a lot of respect. He's a true-blue family man and a doting Daddy.\nAgencies\nIf we talk about his kids, they are far from the being 'Internet's most viral star kids' and he's more than happy with this.\n(also read: Akshay Kumar Doesn't Want To Pressurise His Son Into Entering Films Like Other Star Kids)\nViral bhayani\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nOn one hand, with we have fan-pages and posts related to a few star-kids flooding our timeline, Aarav Bhatia and Nitara Bhatia are seen very rarely, that too when they're accompanied by their parents.\nTalking about the whole phenomenon of clicking star-kids, Akshay Kumar bared his heart out on why he is still an apprehensive father who likes to protect his kids from the paps. Talking about how there are very few pictures of his kids in the media, Akshay said,\n\"Mere bachchon ke bahut kam (paparazzi) photos aatein hai, but honestly speaking, I don't like it [kids getting photographed] at all. That's why I try and hide my children as much as possible.\"\nHe added that even though he is okay with paps clicking him or his kids, it's not something he would ever do deliberately. He adds,\nTwitter\n\"So, I will never bring my kids in front of the camera on purpose. I don’t want to turn them into products of sorts. But if we go out and photographers happen to spot us, they can click pictures. They click star kids' pictures because they sell and newspapers/magazines print them. I am sure they aren't doing it just for fun but because they get money for it.\"\nKhiladi Kumar further added that he also understands that the team behind these pictures does it for money and because it's their job. He adds,\nTwitter\n\"I won't say that they are 'troubling' anyone because they have their own reasons for clicking such pictures. And I can totally understand because they get paid for those pictures. As far as I am concerned, I am personally all for it. In fact, I always readily pose for photographers and tell them to take good pictures. If lens-men are making money, I am fine with it. I don’t know how much money they get (for pictures), but they work really hard and keep at it, even if it means standing (outside airports, restaurants or theatres) and waiting for a really long time.\"\nCurrently Akshay is focusing on his upcoming Project Kesari, which happens to be one the most challenging films of his career.", "title": "My Kids Are Not Products, Says Akshay Kumar On Why He Keeps His Kids Away From The Spotlight", "date_publish": "08/12/2018, 12:09:46", "description": "He is a bankable actor, a phenomenal star, a generous human being and someone who has some strict rules for himself. If you ask his co-stars, Akshay Kumar will definitely win the trophy of the 'Most disciplined' actor. Why? Because, he's never late, his eating habits are healthy and he goes to bed at 10 pm. These are not the only reasons why India loves Akshay Kumar. While we have time and again", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/my-kids-are-not-products-says-akshay-kumar-on-why-he-keeps-his-kids-away-from-the-spotlight-358177.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/akshay_1544255688_800x420.jpg"}