{"text": "My Son Did A Happy Dance, Says Emraan Hashmi On His Son Being Declared Cancer-Free\nMy Son Did A Happy Dance, Says Emraan Hashmi On His Son Being Declared Cancer-Free\n2019 has proved to be a year of happy beginnings for Emraan Hashmi and his entire family. Yesterday, the actor took to his social media platforms to declare that his son has finally been declared cancer-free.\nEmraan's nine-year-old son Ayaan was battling cancer since last five years and it was a tough journey for the entire family.\nYesterday, he shared pictures with Ayaan, where he wrote an emotional note and thanked everyone for their support. He wrote,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Today, 5 years after his diagnosis, Ayaan has been declared cancer free. It has been quite a journey. Thank you for all your prayers and wishes. Love and prayers for all the cancer fighters out there, hope and belief go a long way. You can WIN this battle !!! #thekissoflife\"\nEmraan, who is busy promoting his upcoming film Why Cheat India was interacting with the media when he expressed his joy as a father.\nTalking to Bollywoodlife, he said how his son did a happy dance before leaving for school. He added,\n\"He did a happy dance when he left for school in the morning. Would want to take off for a brief holiday after the release of my film Why Cheat India. It was great and it was a milestone for him and all of us. It was a long fight and he fought it bravely and it is entirely his win.\"\n(Also read: After A Book On Son’s Cancer, Emraan Hashmi Now Inaugurates India's 1st Cashless Cancer Hospital)\n(Pictures: Emraan's social media accounts and Twitter)", "title": "My Son Did A Happy Dance, Says Emraan Hashmi On His Son Being Declared Cancer-Free", "date_publish": "15/01/2019, 16:54:39", "description": "2019 has proved to be a year of happy beginnings for Emraan Hashmi and his entire family. Yesterday, the actor took to his social media platforms to declare that his son has finally been declared cancer-free.2019 has proved to be a year of happy beginnings for Emraan Hashmi and his entire family.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/my-son-did-a-happy-dance-says-emraan-hashmi-on-his-son-being-declared-cancer-free-360460.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/emraan_hashmi_1547552533_800x420.jpg"}