{"text": "Mukesh Ambani’s daughter Isha Ambani tied the knot to Anand Piramal on Dec 12, and since then a lot of inside videos and pictures have been making the rounds on social media.\nA lot of Bollywood stars were also present at the wedding, which took place in Mumbai at their residence Antilla. The fresh photos and videos in which stars including Amitabh Bachchan, Aamir Khan, Aishwarya Rai Bachchan, Shah Rukh Khan and Abhishek Bachchan among others can be seen serving food to guests caught the fancy of a lot of people.\nThese pictures and videos have become the talk of the town. While a lot of people trolled the celebrities, there were others who praised their down-to-earth gesture.\nTwitter\nFinally, Abhishek Bachchan has revealed the reason as to why these celebs were seen serving food to the guests on the dining table.\nDon't Miss 1.1 K SHARES 161 SHARES 2.4 K SHARES 12.5 K SHARES\nReplying to a fan, Abhishek Bachchan revealed it is a part of a tradition called “sajjan ghot\" where the bride’s family feeds groom’s family.\nIt is a tradition called \"sajjan ghot\". The brides family feeds the grooms family. — Abhishek Bachchan (@juniorbachchan) December 16, 2018\nThe mystery has been solved finally!", "title": "Mystery Solved! Abhishek Bachchan Explains Why Celebs Served Food At Isha Ambani’s Wedding", "date_publish": "16/12/2018, 16:10:48", "description": "Finally, Abhishek Bachchan has revealed the reason as to why these celeb brigade were seen serving food to the guests on the dining table at Isha Ambani-Anand Parimal's wedding. The fresh photos and videos in which stars including Amitabh Bachchan, Aamir Khan, Aishwarya Rai Bachchan, Shah Rukh Khan and Abhishek Bachchan among others can be seen serving food to guests caught the fancy of a lot of p", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/mystery-solved-abhishek-bachchan-explains-why-celebs-served-food-at-isha-ambani-s-wedding-358714.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/abhishek_bachchan_explains_why_celebs_served_food_at_isha_ambanianand_parimals_wedding_1544955369_800x420.png"}