{"text": "Nadja Regin, Bond Girl In 'From Russia With Love' And 'Goldfinger' Passes Away At 87\nNadja Regin, Bond Girl In 'From Russia With Love' And 'Goldfinger' Passes Away At 87\nIn a shocking but true news, Bond girl and Serbia-born actor Nadja Regin, best known for starring in \"From Russia With Love\" and \"Goldfinger\", passed away on Monday at the age of 87. The news of Regin's death comes a week after her \"Goldfinger\" co-star Tania Mallet, 77, passed away.\nThe official James Bond Twitter account shared the news on the microblogging site.\n\"We are very sorry to learn that Nadja Regin has passed away at the age of 87. Nadja appeared in two Bond films, 'FROM RUSSIA WITH LOVE' and 'GOLDFINGER'. Our thoughts are with her family and friends at this sad time (sic),\" the tweet read.\nShe was best known for her role as the mistress of Kerim Bey in \"From Russia with Love\" and had a smaller appearance as Bonita in the pre-credit sequence of \"Goldfinger\", which featured Sean Connery as the iconic British spy.\nRegin also worked for the small screen and her TV roles included shows such as \"The Avengers\", \"Danger Man\", \"The Saint\" and \"Dixon of Dock Green\". The actor appeared in several British TV programmes in the 1960s and also appeared in the 1964 New Zealand film \"Runaway\".\nIn the 1970s, she worked in select scripts for film companies including Rank Films and Hammer Films.\nAfter a decade, the actor moved away from the limelight to set up a small publishing company alongside her sister Jelena, which specialised in history and philosophy. The also wrote a novel, titled \"The Victims and the Fools\", which she published under her full name Nadja Poderegin.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nInputs From PTI", "title": "Nadja Regin, Bond Girl In 'From Russia With Love' And 'Goldfinger' Passes Away At 87", "date_publish": "09/04/2019, 15:36:16", "description": "Serbia-born actor Nadja Regin, best known for starring in Bond films \"From Russia With Love\" and \"Goldfinger\", died Monday at the age of 87. The official James Bond Twitter account shared the news on the microblogging site. Serbia-born actor Nadja Regin, best known for starring in Bond films \"From Russia With Love\" and \"Goldfinger\", died Monday at the age of 87. The official James Bond Twitter ac", "authors": [], "url": "https://www.indiatimes.com/entertainment/nadja-regin-bond-girl-in-from-russia-with-love-and-goldfinger-passes-away-at-87_-365127.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/nadja_regin_dies_at_87_1554804479_800x420.jpg"}