{"text": "Nafisa Ali Is Internet's Latest Hero, Asks Grandchildren To Cut Her Hair Amidst Chemotherapy\nNafisa Ali Is Internet's Latest Hero, Asks Grandchildren To Cut Her Hair Amidst Chemotherapy\nWe as millennials rant and cry over even a slight inconvenience that happens in our life.\nWe channelize this anger on social media or end up doing things that we aren't supposed to. And what we really need is to draw inspiration and take some lessons from people who are dealing with 'real' problems in life.\nCut to, Bollywood actor Nafisa Ali.\nAgencies\nNafisa was diagnosed with stage 3 peritoneal cancer and she has begun her chemotherapy. It was after her hair started falling from the treatment that decided to chop off her hair and she assigned this job to the most adorable set of people in her life.\nAli asked grandkids to cut her hair and she shared a video of the same on Instagram. She captioned the video as,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“Asked my grandchildren to cut my hair as then they will not realize that I am going through Chemo.We had fun!,”\nWhen life hits rock bottom, the way you deal with it is what eventually ends up shaping your life. There is a lot to learn from Nafisa's way of dealing with the disease.\nJust a few days ago, she had written,\n“My hair has started falling out in heaps ... it made me cry ... not for vanity but the reality that I have cancer and that Chemotherapy is working finally sank in . I will shave my hair off tomorrow.\"\nIn November, Nafisa took to Instagram to share the news with the world. She posted a picture with Congress party leader Sonia Gandhi and she had written,\n“Just met my precious friend who wished me luck & to get well from my just diagnosed stage 3 cancer.\"\nWhen life hands you lemons, it's always up to you what you do and Nafisa Ali is surely trying to make the sweetest possible lemonade with them! More power to you, Ma'am!", "title": "Nafisa Ali Is Internet's Latest Hero, Asks Grandchildren To Cut Her Hair Amidst Chemotherapy", "date_publish": "15/12/2018, 15:46:12", "description": "Nafisa was diagnosed with stage 3 peritoneal cancer and she has begun her chemotherapy. It was after her hair started falling from the treatment that decided to chop off her hair and she assigned this job to the most adorable set of people in her life.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nafisa-ali-is-internet-s-latest-hero-asks-grandchildren-to-cut-her-hair-amidst-chemotherapy-358657.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nafisa_ali_1544870673_800x420.jpg"}