{"text": "Namrata Shirodkar Gives An Update On Sonali Bendre, Says She's Ready To Get Back To Normal Life\nNamrata Shirodkar Gives An Update On Sonali Bendre, Says She's Ready To Get Back To Normal Life\nWe all know how Sonali is battling with cancer. She left everyone impressed with her courage on fighting cancer. The gorgeous actress is in USA right now for the treatment of the dreaded disease, but the way she is dealing with it has left everyone amazed.\nDespite being away from home for the treatment, she feels homely there thanks to her friends who have been visiting her to show support and making her feel loved. The actress herself has been posting pictures of the actresses coming and warmly meeting her. Right from Priyanka Chopra, Neetu Kapoor, Sussanne Khan to Anupam Kher, a lot of her celebrity friends have visited the actress in USA.\nThe latest one to meet her is former actress and her friend Namrata Shirodkar who is spellbound by her courage. Talking about Sonali’s spirit to Deccan Chronicle, Namrata said,\nDon't Miss 322 SHARES 237 SHARES 197 SHARES 2.5 K SHARES 17.1 K SHARES\nTwitter\n“ She is a strong girl. She looks amazingly fit and ready to get back to normal life. I had such a lovely time with her. We discussed so many things. She told me the entire story of her illness and what gives her the strength, and I told her that she’s always in my prayers.”\nThis is the best news so far for Sonali Bendre’s well-wishers\nSonali even made it to Priyanka Chopra’s bridal shower in Tiffany’s where she looked amazingly beautiful.", "title": "Namrata Shirodkar Gives An Update On Sonali Bendre, Says She's Ready To Get Back To Normal Life", "date_publish": "31/10/2018, 13:48:28", "description": "We all know how Sonali is battling with cancer in USA. She left everyone impressed with her courage on fighting cancer. The gorgeous actress is in USA right now for the treatment of the dreaded disease, but the way she is dealing with it has left everyone amazed.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/namrata-shirodkar-gives-an-update-on-sonali-bendre-says-she-s-ready-to-get-back-to-normal-life-355778.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sonali_bendre_1540972146_800x420.jpg"}