{"text": "Nana Patekar Is Indecent But He Can’t Do Such A Thing, Says Raj Thackeray On Tanushree Dutta’s Allegations\nNana Patekar Is Indecent But He Can’t Do Such A Thing, Says Raj Thackeray On Tanushree Dutta’s Allegations\nWhen Tanushree Dutta had accused Nana Patekar of sexual harassment on the sets of 2008 film Horn Ok Pleassss, she said that everyone knew about it but nobody took a stand for her.\nShe also said that her car was attacked while she was inside it. The tyres of the car were punctured and man banged the windshield. This old video below is a proof. Take a look:\nMoreover, Tanushree Dutta said that MNS part members were called the sets by Nana Patekar who tried attacking he parents.\nIn the wake of the same, Maharashtra Navnirman Sena (MNS) chief Raj Thackeray has finally reacted to the entire controversy. Saying that Nana Patekar is indecent and crazy, he said, he cannot do such a thing.\nDon't Miss 193 SHARES 974 SHARES 4.4 K SHARES 411 SHARES\nBCCL\n“I know Nana Patekar; he is indecent. He does crazy things but I don't think he can do such a thing. Court will look into it. What is the media to do with it? #MeToo is a serious matter, the debate over it on Twitter isn't right,” he said.\nHe added that the court will look into the matter and that people on social media should stop discussing it arriving at a conclusion.\nreuters\nFurthermore, he said that women should raise their voice about such incidents but not after 10 years.\n“It seems it is being done to divert attention from petrol price, rupee value, and unemployment. If anything like #MeToo happens, women can come to MNS. We will teach a lesson to accused. Women must raise the voice when they face oppression, not after 10 years.”\nAlso Read: Tanushree Feels People’s Mindset Needs To Change, Says Today's Eve-Teaser Is Tomorrow's Rapist\nWith inputs from ANI", "title": "Nana Patekar Is Indecent But He Can’t Do Such A Thing, Says Raj Thackeray On Tanushree Dutta’s Allegations", "date_publish": "18/10/2018, 14:14:17", "description": "When Tanushree Dutta had accused Nana Patekar of sexual harassment on the sets of 2008 film Horn Ok Pleasss, she said that everyone knew about it but nobody took a stand for her. She also said that her car was attacked while she was inside it. The tyres of the car were punctured and man banged the windshield. This old video below is a proof. Take a look:", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nana-patekar-is-indecent-but-he-can-t-do-such-a-thing-says-raj-thackeray-on-tanushree-dutta-s-allegations-355020.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/nana_patekar_is_indecent_but_he_cant_do_such_a_thing_says_raj_thackeray_on_tanushree_duttas_alleg_1539855109_800x420.jpg"}