{"text": "Sussanne said that people should use social media platforms in the correct manner. “I honestly don’t want to comment on this issue much but I definitely feel that there is a lot of pretences, false allegations and sort of crazy behaviour. They are using the platform badly and it’s not a good thing. If they use the platform correctly then, it’s supposed to be a good thing. They shouldn’t make allegation on an individual without any legal evidence,” she added.\nThe 'Welcome Back' star has been accused by Tanushree Dutta of harassing her on the sets of 'Horn Ok Pleasss'. Earlier this week, a First Information Report (FIR) was filed against Patekar at the Oshiwara Police Station over the sexual harassment allegations made by Tanushree.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nYes, now, who would have thought that a couple on a live TV show would actually come out, date, be together, get engaged and finally get married. Prince Narula and Yuvika proved that true love exists.\nOn Friday, celebrity hairstylist Sapna Bhavnani took to Twitter to attack Amitabh Bachchan. Replying to a Twitter user sharing Bachchan’s post on the ‘Me Too’ movement, she wrote, “This has to be the biggest lie ever. Sir, the film Pink has released and gone and your image of being an activist will soon too. Your truth will come out very soon. Hope you are biting your hands cuz nails will not be enough. @SrBachchan #Metoo #MeTooIndia #comeoutwomen.\"\nOverwhelmed by sister's struggles and success, Alia Bhatt posted a heartwarming video for her elder sister Shaheen, after reading her book. The book targets people who are struggling with mental issues and depression as Shaheen's book is an account of her struggles with depression.", "title": "Nana Patekar Leaves Housefull 4, Sapna Bhavnani Attacks Big B On #Metoo & More From Ent.", "date_publish": "13/10/2018, 17:54:15", "description": "Sussanne said that people should use social media platforms in the correct manner. “I honestly don’t want to comment on this issue much but I definitely feel that there is a lot of pretences, false allegations and sort of crazy behaviour. They are using the platform badly and it’s not a good thing. If they use the platform correctly then, it’s supposed to be a good thing.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/nana-patekar-leaves-housefull-4-sapna-bhavnani-attacks-big-b-on-metoo-more-from-ent-354734.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/bollywood_1539433839_800x420.jpg"}