{"text": "'Narcos' Star Diego Luna Has A Personal Connect With India, Says His Grandmother Was Born Here\n'Narcos' Star Diego Luna Has A Personal Connect With India, Says His Grandmother Was Born Here\nAhead of the release of the fourth season of Narcos titled Narcos: Mexico, Diego Luna is in India to attend the screening of the Netflix show. But did you know Diego Luna has a personal connection with India.\nHe believes that there are a lot of cultural similarities between India and Mexico. Wondering how does he know so much about India? Well, his grandmother was Indian. Diego Luna has also read parts of Bhagavad Gita, it was revealed recently.\nrackcdn.coma\n“I find so many similarities between the Indian culture and the Mexican culture... There is so much in common. The contrast you live when you go out and the richness in terms of cultural diversity is amazing. It feels like you are from here. I think this is why you would love 'Narcos: Mexico,” he said in Mumbai where he and his co-star Michael Pena and showrunner Eric Newman joined Bollywood actor Alia Bhatt and director Shakun Batra to talk on the show.\nTwitter\nHe was hesitant to talk about his spiritual connection with India. “I told you this because I had four vodkas inside me... the spiritual connection is different... It is personal. I don't see how it connects with 'Narcos',” he said, after which, Shakun Batra shared that Luna's grandmother was born in India and he had read parts of Bhagavad Gita as well.\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\nDiego Luna says it is a blessing to be a part of the show. The team of Narcos: Mexico including Michael Peña also met with the star cast of Sacred Games during their tour to Mumbai. They posed with Saif Ali Khan, Nawazuddin Siddiqui, Anurag Kashyap and Vikramaditya Motwane.\nTalking about the show, showrunner Eric Newman said that the cast of Narcos: Mexico is cocaine.\nWith inputs from agencies", "title": "'Narcos' Star Diego Luna Has A Personal Connect With India, Says His Grandmother Was Born Here", "date_publish": "13/11/2018, 15:35:56", "description": "Did you know Diego Luna has a personal connection with India? He believes that there are a lot of cultural similarities between India and Mexico. Wondering how does he know so much about India? His grandmother was apparently Indian. Diego Luna has also read parts of Bhagavad Gita, it was revealed recently.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/narcos-star-diego-luna-has-a-personal-connect-with-india-says-his-grandmother-was-born-here-356586.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/narcos_mexico_star_diego_luna_has_a_personal_india_connect_has_read_parts_of_bhagavad_gita_1542105045_800x420.png"}