{"text": "Nargis Fakhri Shares A Moving Post On Her Weight Loss Journey And It's A Must-Read For Everyone!\nNargis Fakhri Shares A Moving Post On Her Weight Loss Journey And It's A Must-Read For Everyone!\nAfter losing 20 kgs in a year, Nargis Fakhri took to her social media account to share the news with a very important message. Fakhri went through a massive body transformation and her post makes a sense because of the nature of the message which is highly empowering.\nThe actor claims to have lost around 20 kgs and shared the news on Facebook with a collage of her ‘then and now’ pictures. She captioned the picture as:\n“Living life in the public eye can be very difficult sometimes. As much as it is a blessing, it also comes with its downside. Over the last 2 years, I’ve gained weight. On the left, I weighed 178 lbs and on the right, I was 129. I have since lost 20 lbs by making lifestyle changes. If I can do it, so can you. Nurture your mind, body, and soul with positive thoughts and healthy choices. I’m going to bring you on this journey of becoming the best version of myself again, and I want you to join me on this journey too.”\nFor all those who follow her, her body positivity posts are indeed very empowering.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nA few days ago, she shared a post with the caption, “Every day is an opportunity to work toward the life you want! It took countless hours, disappointments and stress to get to where I am, but I want you to know that working hard for what you want pays off! What are you working toward today? ... #bigdreams #keepdreaming #dreambig #workhard #liveharder #hustlehard #entreprenuer #feelempowered #bossbabe #powerofshe.”\nOn the professional front, her last few films include Housefull 3 in 2016, Banjo, 5 Weddings, and Amavas.", "title": "Nargis Fakhri Shares A Moving Post On Her Weight Loss Journey And It's A Must-Read For Everyone!", "date_publish": "01/04/2019, 16:28:46", "description": "After losing 20 kgs in a year, Nargis Fakhri took to her social media account to share the news with a very important message. Fakhri went through a massive body transformation and her post makes a sense because of the nature of the message which is highly empowering.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nargis-fakhri-shares-a-moving-post-on-her-weight-loss-journey-and-it-s-a-must-read-for-everyone-364682.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/nargis_fakhri_1554117524_800x420.jpg"}