{"text": "Avengers: Endgame, that’s the official title of Avengers 4 – a revelation that came along with the trailer of the much-anticipated Marvel movie.\nThe last installment sent a lot of fans into a tizzy. It took days for many to process the ending of Infinity War, and now that the first trailer of Avengers: Endgame is out, they know the glorious movie series by MCU is coming to an end. It’s going to be the end of an era!\nThe trailer left Marvel fans shattered and in shock. To see Thor, Steve, Bruce, Natasha and Clint Barton emotionally devastated was still okay. But knowing about the emotional and physical status of Tony Stark, people went berserk.\n“Dear Miss Potts, if you find this recording don’t feel bad about this, part of the journey is the end. Just for the record being adrift in space with zero promise of rescue is more fun than it sounds. Food and water ran out four days ago, oxygen will run out tomorrow morning and I mean it, when I drift off I will dream about you, it’s always you,” he says in the trailer.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES\nHe has been going without food and water for days and now his oxygen is also about to deplete. Fans were so angry at that, that they rang NASA for help. Bring him back to Earth, they exclaimed.\ndear @NASA, PLEASE please find Tony Stark that poor guy is floating somewhere up in space and is running out of oxygen. WE NEED YOUR HELP. — 𝔑𝔞𝔡𝔦𝔫𝔢 (@Nahdizzle) December 9, 2018\nNASA has finally heard their plea.\nHey @Marvel, we heard about Tony Stark. As we know, the first thing you should do is listen in mission control for “@Avengers, we have a problem.” But if he can’t communicate, then we recommend ground teams use all resources to scan the skies for your missing man pic.twitter.com/zavXrsPljq — NASA (@NASA) December 9, 2018\nAnd to fans wondering if Thor could be part of the rescue, here's what NASA has to say.\nThe THermal Operations and Resource (THOR) officer is truly one of Mission Control’s mightiest heroes. They ensure the operation of multiple @Space_Station subsystems which collect, distribute & reject heat from critical equipment and payloads for the success of the mission — NASA (@NASA) December 9, 2018\nIt couldn't get funnier, right?", "title": "NASA Responds To Fans' Plea About Saving Tony Stark From Space & It Couldn’t Get Funnier!", "date_publish": "10/12/2018, 17:22:26", "description": "Avengers: Endgame, that’s the official title of Avengers 4 – a revelation that came along with the trailer of the much-anticipated Marvel movie. The last instalment had sent a lot of fans into a tizzy. It took days for many to process the ending of Infinity War, and now that the first trailer of Avengers: Endgame is out, they know the glorious movie series by MCU is coming to an end. It’s going t", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nasa-responds-to-fans-plea-about-saving-tony-stark-from-space-it-couldn-t-get-funnier-358287.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nasa_responds_to_fans_requesting_to_save_tony_stark_from_space__it_couldnt_get_more_funny_1544437905_800x420.png"}