{"text": "1. Naseeruddin Shah Sparks Controversy Again, Says ‘Country Is Awash With Horrific Hatred & Cruelty’\nNaseeruddin Shah has apparently turned Amnesty India’s ambassador and in one of their recently released videos, he can be seen talking about “massive crackdown on freedom of expression and human rights defenders” and expressing concern over muzzling “voices of dissent”.\n2. Fans Make Deepika Padukone's 33rd Birthday Special, Express She Has Always Been An Inspiration\nOn her first birthday after marriage, B-town and fans is pouring out wishes for Deepika Padukone with all the love.\n3. Vicky Kaushal Shares How He Gained 15 Kgs Of Muscle Weight For ‘Uri’ & It’ll Make You Sweat\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nVicky Kaushal will be portraying the role of Indian commando in Uri: The Surgical Strike. Describing his character as the toughest of his career so far, Vicky Kaushal says he had to work out in the gym in order to gain 15kgs, which was very difficult for Vicky, as he has “this very beautiful problem that he doesn’t gain weight”.\n4. Bandersnatch Actor Will Poulter Quits Twitter After Facing Backlash Over The Black Mirror Movie\nAmid all the hype, actor Will Poulter who plays the role of Colin Ritman has quit Twitter over \"inevitable negatives that are best avoided\". He says he wants to focus on his mental health.\n“Dating has always been a situation at home. I don’t know why but it always has been. Mom and dad have always been very dramatic about it,” she said.", "title": "Naseeruddin Shah Sparks Controversy Again, Deepika Padukone Turns 33 & More From Ent", "date_publish": "05/01/2019, 18:28:35", "description": "From Naseeruddin Shah sparking a controversy again to fans and celebrities wishing Deepika Padukone on her 33rd birthday, here is all that rocked the world of entertainment. Naseeruddin Shah has apparently turned Amnesty India’s ambassador and in one of their recently released videos, he can be seen talking about “massive crackdown on freedom of expression and human rights defenders” and expressin", "authors": [], "url": "https://www.indiatimes.com/entertainment/naseeruddin-shah-sparks-controversy-yet-again-deepika-padukone-turns-33-more-from-ent-359916.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/naseeruddin_shah_sparks_controversy_again_deepika_padukone_turns_33__more_from_ent_1546692392_800x420.png"}