{"text": "Naseeruddin Shah has been in the news lately as he courted controversies when he voiced his opinion on mob violence in Bulandshahr district\nTalking about the mob violence prevalent in the country, he had expressed his fears for his children on imagining the situation where they might be questioned by a mob as to if he is Muslim or Hindu sparked quite a controversy.\nReacting to Naseeruddin's statement, Anupam Kher had told ANI,\n\"There’s so much freedom in the country that you can abuse the army, badmouth the air chief and pelt stones at the soldiers. How much more freedom do you need in a country? He said what he felt like, it doesn’t mean it’s the truth.\"\nAnd now, in reply to Anupam's statement, when Naseeruddin Shah was asked if he was ready to have an argument with him, he told India Today, \"Not really, because he doesn't talk reasonably.\"\nNaseeruddin Shah further added that he doesn't see any concrete connection between what he said and Anupam's comments about pelting stones and abusing the Indian Army.\nHe further added that if he wishes to tell him anything he will call him or go to his place and say,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Aao jhagda kar lete hai ya gale mil lete hein.\"", "title": "Naseeruddin Shah Responds To Anupam Kher's Argument, Calls It Unreasonable", "date_publish": "28/12/2018, 12:52:23", "description": "Naseeruddin Shah further added that he doesn't see any concrete connection between what he said and Anupam's comments about pelting stones and abusing the Indian Army. He further added that if he wishes to tell him anything he will call him or go to his place and say, \"Aao jhagda kar lete hai ya gale mil lete hein.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/naseeruddin-shah-responds-to-anupam-kher-s-argument-calls-it-unreasonable-359405.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anupam_kher_and_naseeruddin_shah_1545982159_800x420.jpg"}