{"text": "Naseeruddin Shah is one of the greatest actors that Indian cinema has. In his career spanning over three years, he has given amazing films and characters that will always be remembered. Not only is his voice, but his acting skill is also very powerful. That is one of the reasons why many of the actors, especially from the young generations, still look up to him.\nNaseeruddin Shah believes cinema serves as a record of times and he would not want the audience to look back at 2018 as the phase of only one kind of cinema, case in point \"Salman Khan films\". The veteran actor says cinema is for posterity and hence he takes it as his responsibility to do as many socially relevant films as possible.\n\"I feel that cinema can't change society or bring a revolution. I'm also not sure of cinema as a medium of education. Documentaries can be educative, not feature films. People see them and forget. The only serious function films can serve is to act as a record of their times,\" Shah told PTI.\nbccl\nThe actor says it's for this reason that he chose to work in movies like A Wednesday or his recent short film, Rogan Josh, set in the aftermath of 26/11 attacks.\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 12.5 K SHARES 5.5 K SHARES\n\"I consider it my responsibility to take part in such films. All my serious works are a representative of their times. Cinema will survive. These films would be seen 200 years later. People should know what the India of 2018 was like. They shouldn't end up seeing only Salman Khan films 200 years later. India is not like that. Cinema is for posterity,\" he adds.\nbccl\nRogan Josh by Sanjeev Vig, features Shah as a celebrated chef at The Taj Hotels who invites his family and friends home for dinner to celebrate his birthday. The dinner table conversation meanders to the shared experience of 26/11 and questions the quality of their existence after the life-changing event. Shah, 68, says he is always keen to work with young people who are struggling against odds to make what they believe in.\nbccl\n\"If there's a young man trying to make a song and dance film, I wouldn't give him a second. But here was a young man trying to make a film on a subject he believes should be made. I am totally for first timers. I always hear them seriously. I have done so many films with first timers and I've never regretted it,\" he says.\nRogan Josh, by Royal Stag Barrel Select Large Short Films, was screened at the 20th edition of Jio MAMI Mumbai Film Festival.\nbccl\nThe actor, who has worked in a couple of short films, says the medium is absolutely liberating for budding filmmakers.\n\"The great thing about short films is that there's no pressure of producers sitting on these filmmakers head and telling them who the hero should be and what kind of songs (to he used). They are having the freedom to make the kind of film they want to make without the worry of box office,\" he adds.\nInputs From PTI", "title": "Naseeruddin Shah Feels There Is More To Indian Cinema Than Just Salman Khan Films", "date_publish": "29/10/2018, 18:30:23", "description": "Naseeruddin Shah is one of the greatest actors that Indian cinema has. In his career spanning over three years, he has given amazing films and characters that will always be remembered. Not only is his voice, but his acting skill is also very powerful. That is one of the reason why many of the actors, especially from the young generations, still look up to him.", "authors": [], "url": "https://www.indiatimes.com/entertainment/naseeruddin-shah-feels-there-is-more-to-indian-cinema-than-just-salman-khan-films-355671.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/naseeruddin_shah_feels_indian_cinema_should_not_be_remembered_for_only_salman_khan_films_1540815960_800x420.jpg"}