{"text": "Naseeruddin Shah Reveals The Downside Of Stardom, Says It’s The Easiest Way For An Actor To Get Corrupted\nNaseeruddin Shah Reveals The Downside Of Stardom, Says It’s The Easiest Way For An Actor To Get Corrupted\nLike every coin has two sides, being popular also has negative as well as positive consequences. It’s not easy to handle stardom, they say, and right so. Talking about the downside of stardom, Naseeruddin Shah says it is the easiest way for an actor to get corrupted.\nNaseeruddin Shah has no qualms in accepting that he has worked for money in some films but says the more tempting way for an actor to get corrupted is by becoming a star.\n\"The easiest way for an actor to get corrupted is by becoming a star. Then you start believing your own myth. You start believing what the press writes about you. That's very dangerous,\" Naseeruddin told PTI.\nbccl\nThe actor says, no matter what position one holds in the industry, it is impossible to foresee the heights one can reach before signing a film.\n\"There's no way anyone can ensure what will be the quality of a film when you read a script. You have to go by instincts and do it. Sometimes it goes right and sometimes wrong,\" he adds.\nThe actor says in his film career of more than four decades, he has taken up films purely \"to run the kitchen\" and says one should not be ashamed of it.\nDon't Miss 357 SHARES 183 SHARES 896 SHARES 289 SHARES\n\"I've worked for money and there's no shame. I need to run my kitchen. That's what I tell younger actors. Don't be afraid to do things for money. What are we all working for? Aren't we working to feed ourselves. I've done films for money but not too many films.\"\nbccl\nThe A Wednesday! actor started his career featuring in several prominent films such as Masoom, Sparsh, Nishant among others.\nThe 68-year-old says he was fortunate to be a part of the movement where the independent cinema was thriving, and contrary to his decisions later, he worked for free \"several times.\"\n\"I was just an actor these filmmakers used. I admired the fact that the filmmakers were trying to do this and I'm honoured I became a centre of that movement. Some cynical friends used to say they want me in their films because I am ready to work for free. On many occasions I was told there would be no payment, a lot of times I was promised chicken feed amount like Rs 5,000, Rs 10,000 which I never got by these so-called serious filmmakers,\" he adds.\nbccl\nThe actor, however, continued to work with people he had faith in and cut off ties with those who took everyone for a ride.\n\"That did not embitter me because at the same time there were people like Shyam (Benegal) who was extremely generous and always very fair to everyone in his unit. I cut off relations with a lot of those filmmakers who I knew were taking everyone for a ride, not just me,\" he adds.\nInputs From PTI", "title": "Naseeruddin Shah Reveals The Downside Of Stardom, Says It’s The Easiest Way For An Actor To Get Corrupted", "date_publish": "11/11/2018, 17:08:12", "description": "Like every coin has two sides, being popular also has negative as well as positive consequences. It’s not easy to handle stardom, they say, and right so. Talking about the downside of stardom, Naseeruddin Shah says it is the easiest way for an actor to get corrupted.", "authors": [], "url": "https://www.indiatimes.com/entertainment/naseeruddin-shah-reveals-the-downside-of-stardom-says-it-s-the-easiest-way-for-an-actor-to-get-corrupted-356461.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/naseeruddin_shah_1541936557_800x420.jpg"}