{"text": "Naseeruddin Shah Hits Back At Pak PM Imran Khan, Tells Him To Take Care Of His Own Country\nNaseeruddin Shah Hits Back At Pak PM Imran Khan, Tells Him To Take Care Of His Own Country\nActor Naseeruddin Shah once again had made headlines facing the heat on his remarks on mob lynching and religion in the country. During an interview he expressed his worry for his children in today’s India and became the eye of the storm. He is facing a lot of trolls on social media, being called a traitor, and is receiving threats being asked to leave the country.\nAlso Read: After His Controversial Remarks, Naseeruddin Shah Gets Threats, Richa Chadha Extends Support\nFrom Baba Ramdev and Anupam Kher to Pakistan Prime Minister Imran Khan, Naseeruddin Shah has received a lot of flak from his peers, political leaders and public.\nAmid the controversial remark by Naseeruddin Shah, Pak PM Imran Khan had recently said that he will show Narendra Modi and his government “how to treat minorities.”\n“I read what Naseeruddin Shah had to say about the current situation of India, what he is saying now, Jinnah said the same all those years ago,” Khan added.\nHitting back at Imran Khan, Naseeruddin Shah advised him to take care of his own country as we know how to look at ourselves.\nDon't Miss 837 SHARES 2.4 K SHARES 763 SHARES 2.1 K SHARES 262 SHARES\n“I think Mr Khan should be walking the talk in his own country instead of commenting on issues that don’t concern him. We have been a democracy for 70 years and we know how to look after ourselves,” he told newspaper Sunday Express.\nAlso Read: Referring To Bulandshahr Violence, Naseeruddin Shah Says He Feels Anxious For His Children", "title": "Naseeruddin Shah Hits Back At Pak PM Imran Khan, Tells Him To Take Care Of His Own Country", "date_publish": "23/12/2018, 17:58:36", "description": "Amid the controversial remark by Naseeruddin Shah, Pak PM Imran Khan had recently said that he will show Narendra Modi and his government “how to treat minorities.” Hitting back at Imran Khan, Naseeruddin Shah advised him to take care of his own country as we know how to look at ourselves.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/naseeruddin-shah-hits-back-at-pak-pm-imran-khan-tells-him-to-take-care-of-his-own-country-359144.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/naseeruddin_shah_hits_back_at_pak_pm_imran_khan_tells_him_to_take_care_of_his_own_country_1545566325_800x420.jpg"}