{"text": "Nawazuddin Siddiqui Supports Khans, Says One Flop Film Doesn’t Mean Their Era Is Over\nNawazuddin Siddiqui Supports Khans, Says One Flop Film Doesn’t Mean Their Era Is Over\nThe year 2018 was a transitional phase for Bollywood. Content driven films finally got recognition in the industry. The fact that films like Stree, Badhai Ho and Andhadhun made waves across the nation and received applause from critics and fans alike, was totally unexpected.\nOn the other side, Khans were losing their charm. Salman Khan’s Race 3, Shah Rukh Khan’s Zero and Aamir Khan’s Thugs Of Hindostan failed miserably at the box office. Their fans were highly disappointed as well. Is the era of Khans over? A lot of people questioned.\nCommenting on the same, Nawazuddin Siddiqui recently told Times Now, “Ek picture flop ho gayi toh thodi na Khan ka zamaana chala gaya... Aisa nahi hota (Just because one film flopped, does it mean that the era of the Khans is over? It doesn’t happen like that).”\nDon't Miss 812 SHARES 468 SHARES 763 SHARES 343 SHARES\nEarlier, Rajkummar Rao had said that he feels that the era of superstardom has now come to an end.\n“You can't say they are not good just because one of their films did not work. They are superstars for some reason and we all love them. I am myself a fan of Khans. We should not compare. We are very new and we have a long way to prove ourselves. I don't think the kind of superstardom that these superstars have seen will ever come back again,” he had told PTI.\nRead More: Rajkummar Rao Feels The Era Of Superstardom That SRK, Salman & Aamir Enjoyed Isn't Coming Back", "title": "Nawazuddin Siddiqui Supports Khans, Says One Flop Film Doesn’t Mean Their Era Is Over", "date_publish": "01/03/2019, 17:26:54", "description": "Khans were losing their charm. Salman Khan’s Race 3, Shah Rukh Khan’s Zero and Aamir Khan’s Thugs Of Hindostan failed miserably at the box office. Their fans were highly disappointed as well. Is the era of Khans over? A lot of people questioned. Commenting on the same, Nawazuddin Siddiqui recently told Times Now, “Ek picture flop ho gayi toh thodi na Khan ka zamaana chala gaya... Aisa nahi hota", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nawazuddin-siddiqui-supports-khans-says-one-flop-film-doesn-t-mean-their-era-is-over-363005.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/nawazuddin_siddiqui_supports_khans_says_one_flop_film_doesnt_mean_their_era_is_over_1551441099_800x420.jpg"}