{"text": "Nawazuddin Siddiqui Looks Uncannily Similar To Bal Thackeray In This New Leaked Video & We’re Excited\nNawazuddin Siddiqui Looks Uncannily Similar To Bal Thackeray In This New Leaked Video & We’re Excited\nAfter acting in the role of Mumbai's most legendary crime lord, Ganesh Gaitonde in Sacred Games and also impressing us with his role as writer-poet Saadat Hasan Manto in Nandita Das’ masterpiece, Nawazuddin Siddiqui will next be seen donning another remarkable character of Shiv Sena’s founder Bal Keshav Thackeray.\nHis is currently busy shooting for the biopic, which is based on the hard-working leader who influenced Maharashtra politics.\nWrapped in a saffron shawl, Nawazuddin Siddiqui as Bal Thackeray can be seen walking out of an airport to sit inside his car in this new leaked video. Nawazuddin’s get up as Thackeray is indeed uncanny. Take a look!\nThe teaser of the movie, which is titled Thackeray, has already been released. If you haven’t watched it already, here it is.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWritten by Shiv Sena leader Sanjay Raut, the movie is helmed by Abhijit Panse under the banner of Viacom18 Motion Pictures. Thackeray is scheduled to release on Jan 25.", "title": "Nawazuddin Siddiqui Looks Uncannily Similar To Bal Thackeray In This New Leaked Video & We’re Excited", "date_publish": "17/12/2018, 14:54:29", "description": "Nawazuddin Siddiqui is currently busy shooting for the biopic, which is based on the hard-working leader who influenced Maharashtra politics. Wrapped in a saffron shawl, Nawazuddin Siddiqui as Bal Thackeray can be seen walking out of an airport to sit inside his car in this new leaked video. Nawazuddin’s get up as Thackeray is indeed uncanny. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nawazuddin-siddiqui-looks-uncannily-similar-to-bal-thackeray-in-this-new-leaked-video-we-re-excited-358756.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nawazuddin_siddiqui_looks_uncannily_similar_to_bal_thackrey_in_this_new_leaked_video__were_excited_1545037617_800x420.png"}