{"text": "After making all of us swoon with his stellar performance in the role of Mumbai’s crime lord Ganesh Gaitonde, Nawazuddin Siddiqui is back to enthrall his audiences. And this time, he has donned the role of Shiv Sena’s founder Bal Keshav Thackeray.\nThe trailer of the most awaited film based on the life of Bal Thackeray is finally out. And going by the looks of it, seems like Nawazuddin has aced the role. After watching this goose-bumps inducing trailer, you'll be left wanting for more.\nHours before the release, Thackeray was embroiled in a controversy. According to the makers of the movie, CBFC raised objections on four dialogues and two scenes and have asked them to make necessary changes.\n“Yes, they have raised objections on some dialogues and scenes, four dialogues and two scenes to be precise. We are legally dealing the matter with CBFC and we hope the matter will be sorted out soon,\" said Shiv Sena Parliamentarian and producer of the film Sanjay Raut.\nDirected by Abhijit Panse, Thackeray is scheduled to be released on Jan 25, two days after the birth anniversary of late Bal Thackeray.\nDon't Miss 12.5 K SHARES 186 SHARES 5.5 K SHARES 7 K SHARES", "title": "Nawazuddin Fits The Role Of Shiv Sena Supremo Bal Thackeray Like A Glove & The Trailer Is Proof", "date_publish": "26/12/2018, 17:13:04", "description": "The trailer of the most awaited film based on the life of Bal Thackeray is finally out. And going by it, it looks like Nawazuddin has aced the role. After watching this goose-bump inducing trailer, you would be left wanting for more. Hours before the release, Thackeray was embroiled in a controversy. According to the makers of the movie, CBFC has raised objections on four dialogues and two scenes", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nawazuddin-fits-the-role-of-shiv-sena-supremo-bal-thackeray-like-a-glove-the-trailer-is-proof-359322.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nawazuddin_siddiquis_convincing_performance_as_bal_thackeray_in_the_trailer_will_make_you_want_more_1545824174_800x420.png"}