{"text": "Neena Gupta Recalls Her Tough Journey As A Single Mother, Says She Had No Money Or A Husband\nNeena Gupta Recalls Her Tough Journey As A Single Mother, Says She Had No Money Or A Husband\nVeteran actress Neena Gupta is best known for her role as Priya Kapoor in popular television show Saans. She is a brilliant actress but her journey has been full of ups and downs, twists and turns. She is an inspiration for every liberal women in this world for making bold choices.\nVeteran actress Neena Gupta, who worked in TV shows like Saans, Siski, Saat Phere and Kamzor Kadii Kaun, says working on the small screen gave her money, fame and name.\n\"When I came from Delhi to become an actor there were only films and no TV. Working in films is an aspiration for all actors. When I did not get roles in films then I did TV and got a chance to play all kinds of roles. TV gave me money, fame and name,\" Neena told IANS here.\nJunglee Pictures\nThe 59-year-old says she did a lot of work on the small screen.\n\"I used to get small and useless roles in movies. Then I thought I should do just TV and today the fan following I have is because of working on television,\" added Neena, who is currently enjoying the success of her latest release \"Badhaai Ho\".\nThe actress will next be seen in Sandeep Aur Pinky Faraar, which also stars Arjun Kapoor and Parineeti Chopra.\nAsked if age is now detrimental for an actress' career in Bollywood, Neena agreed and said that after a certain age, they don't receive good offers.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"There are not many roles. I always say that, 'After a certain age, what is a woman's role? Taking care of the family and home. After that there is no role'. When the society will change, I think we would have more roles on-screen.\"\nLast year, Neena was in the spotlight after she took to social media to ask for \"good roles\". She has now been frequently seen in films.\nbccl\nShe describes her own journey as a mother \"very tough\".\n\"My journey was very tough. I had no money. Money is the most important thing, I have realised in this world. I didn't have a husband and relatives. So it was really tough, but the joy Masaba gave me... The joy of motherhood... She was a very good child she did not trouble me much. The joy she gave me was enough to go through anything,\" said Neena, who raised Masaba as a single mother.\nWith inputs from IANS", "title": "Neena Gupta Recalls Her Tough Journey As A Single Mother, Says She Had No Money Or A Husband", "date_publish": "21/10/2018, 16:39:17", "description": "Veteran actress Neena Gupta, who worked in TV shows like \"Saans\", \"Siski\", \"Saat Phere\" and \"Kamzor Kadii Kaun\", says working on the small screen gave her money, fame and name. \"When I came from Delhi to become an actor there were only films and no TV. Working in films is an aspiration for all actors. When I did not get roles in films then I did TV and got a chance to play all kinds of roles.", "authors": [], "url": "https://www.indiatimes.com/entertainment/neena-gupta-recalls-her-tough-journey-as-a-single-mother-says-she-had-no-money-or-a-husband-355171.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/neena_gupta_shares_about_her_tough_journey_as_a_single_mother_says_she_had_no_money_1540124318_800x420.jpg"}