{"text": "Neena Gupta Feels Portrayal Of Women In Films Hasn't Changed & It Won't Till Society Changes\nNeena Gupta Feels Portrayal Of Women In Films Hasn't Changed & It Won't Till Society Changes\nThere are very few women in Bollywood who speak their mind. From Swara Bhasker to Nandita Das, some women in Bollywood have had a strong character outside of films as well. One such woman who rose to power this year was none other than Neena Gupta.\nInstagram/Neena Gupta\nThe actress unapologetically took to Instagram early this year and asked for work. And since then, she is being flooded with offers.\nNeena has been getting roles in various films. Starting from Veere Di Wedding, Mulk to now a full fledged role in Badhaai Ho, Neena is garnering attention like never before.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nDespite Bollywood being kind to her, Neena feels the portrayal of women in cinema has not changed at all.\nSpeaking to IANS, the veteran actress said, \"It (portrayal of women in cinema) has not changed at all. It will not change till the time the society changes and it will take time to change the society. The girls are changing quickly but the men are not changing. That is why the girls will go through a very bad time now time now till the next generation comes.\"\nNeena will next be seen in Parineeti Chopra and Arjun Kapoor's Sandeep Aur Pinky Faraar.\nInputs from IANS", "title": "Neena Gupta Feels Portrayal Of Women In Films Hasn't Changed & It Won't Till Society Changes", "date_publish": "01/11/2018, 12:16:05", "description": "The actress unapologetically took to Instagram early this year and asked for work.And since then, all hell broke loose. Neena has been getting roles in various films. Starting from Veere Di Wedding, Mulk to now a full fledged role in Badhai Ho, Neena is garnering attention like never before.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/neena-gupta-feels-portrayal-of-women-in-films-hasn-t-changed-it-won-t-till-society-changes-355835.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/neena_1541053639_800x420.jpg"}