{"text": "The images of the entire ensemble is a reminder to all of us to start from where we left. Although these images do not dwell into too much, you might want to analyse and draw your own conclusion.\nIndiatimes met Neena Gupta at her beautiful home, where she was laid-back and her honest self with no inhibitions and sitting comfortably in her drawing room, Neena talked about the #MeToo Movement.\nAnd their bond continues to grow stronger with each passing day. Priyanka Chopra is now married to the love of her life Nick Jonas, and Sushmita Sen is happy in love with her boyfriend Rohman Shawl. Sushmita uploaded a family picture recently and Priyanka Chopra showered all the love upon her. Take a look!\nSwara Bhasker was asked about social media and its trials and how it has become a court itself. To this, the actress said that social media is meant for connecting people and not for mob trails.\nDon't Miss 862 SHARES 346 SHARES\n“I think the most important thing for a working mother is to believe in herself. Even when I leave in the morning, I am constantly worried about what Taimur would be doing at home. There is that looming guilt that is sometimes on your head,” she told Miss Malini.", "title": "Neena Gupta Take On #MeToo Movement, Sush & PC Share Instagram Love & More From Entertainment", "date_publish": "07/02/2019, 18:24:25", "description": "The images of the entire ensemble is a reminder to all of us to start from where we left. Although these images do not dwell into too much, you might want to analyse and draw your own conclusion.The images of the entire ensemble is a reminder to all of us to start from where we left. Although these images do not dwell into too much, you might want to analyse and draw your own conclusion.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/neena-gupta-take-on-metoo-movement-sush-pc-share-instagram-love-more-from-entertainment-361772.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1549543789_800x420.jpg"}