{"text": "Neha Dhupia’s marriage with Angad Bedi came as a pleasant surprise for her fans and close friends in Bollywood. And the icing on the cake was the news of her pregnancy. The gorgeous Neha is in her last trimester and is soon going to welcome her first child. Despite being in her nine months of pregnancy Neha has been up and working and we cannot help but applaud her for that.\nIndiatimes met the actress and her hubby Angad, where they spoke their heart out on parenthood.\nWe asked Neha if Angad will be a good husband or a good father, to which she immediately replied, \"It’s the tough question, he is going to ace in both the departments. He has proved himself as a rock solid husband. I feel between the two of us, the kids will go running to him, because I will be the strict one. There is always a good cop and a bad cop , I have a feeling that I will be a bad cop.”\nHowever, Angad feels she is going to be a phenomenal mother. He said, “ She is already a lovely wife. She has a great instinct as a mother, the phase that she is going through right now is very tough, everybody is saying that it’s a great phase, but the person who is going through is better to analyse if the days are good or bad, so right now some days are good, some days are bad, but she is coping the bad days so well and not making a big deal about it. It’s not easy for any pregnant woman to be working in 9 months and I really appreciate that, she will be a phenomenal mother. \"\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWe quizzed her if she is mentally prepared to be a mother, to which she said “ I am not at all prepared, sometimes when I look at my stomach I say - oh my god! I am going to be a mother. I see mothers waking up with little kids and I get a feeling that we are going to have our own very soon. You are never prepared, I and Angad have planned a lot of things in life but that never happened, be it roles in films or the idea of cinema, or whether it’s cricket for him, or me planning to become a civil service officer, so you know we plan a lot of things for us but that never happened. We have decided that as parents we are not going to prepare how to raise a kid, we will let our kids make us learn too and vice versa, everyday is going to be a learning curve, but we are sure we will figure it out.\"\nInstagram\nShe further added, “There are rough days especially in these days where I get restlessness and sleepless nights, but haven’t we faced such days earlier as well? I have said this earlier and I am going to say it again, if this is what pregnancy is than I am going to do it all over again very soon.”\nWe wish all the love to the lovely couple.", "title": "Neha Dhupia Knows She'll Be The Stricter Parent & Husband Angad Bedi Will Be Spoiling Their Kids", "date_publish": "22/10/2018, 16:46:47", "description": "Neha Dhupia’s marriage with Angad Bedi came as a pleasant surprise for her fans and close friends in Bollywood. But her pregnancy news soon after her marriage was even more surprising. The gorgeous Neha is in her last trimester and soon is going to deliver her first child. Despite being in her nine months Neha has been working and we applaud her for that.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/neha-dhupia-knows-she-ll-be-the-stricter-parent-husband-angad-bedi-will-be-spoiling-their-kids-355211.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/neha_dhupia_1540200860_800x420.jpg"}