{"text": "Neither Targaryen Nor Stark! Here’s Who The Night King Was & What He Wanted The Whole Time\nNeither Targaryen Nor Stark! Here’s Who The Night King Was & What He Wanted The Whole Time\nFor the longest time, right after the season 7, it was rumoured that Night King could be a Targaryen. After all, he could ride the ice dragon.\nSome even said that he could be a Stark. He seemingly had a connection with the Starks – especially Bran and Jon.\nSpoiler Alert: If you haven't watched GoT S8 E3, don't read any further.\nvia GIPHY\nIn the last episode, which gave fans the biggest ever battle on the show – the battle of Winterfell – the battle between the humans and the army of dead – it came to light that he was also immune to fire.\nTwitter\nWhen Daenerys Targaryen’s dragon tried killing him with the fire, he didn’t die. Rather, he emerged out with a smirk on his face, just how Daenerys Targaryen did after hatching the dragons in season 1.\nDon't Miss 284 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nSo, the Night King can fly a dragon and is also immune to fire. Why wouldn’t the fans think he is a Targaryen. And if he is, what’s his purpose?\nhearstapps.com\nIn an interview with Variety, Vladimír Furdík, the actor who plays Night King, revealed what the Night King really wanted. “He wants revenge”, he said.\nAlso Read: Not The Night King, Fans Are Convinced That Bran Stark Is The Real Villain Of Game Of Thrones. Here's Why\nbustle.com\n“Because somebody, many years ago, made some mistake and he became the Night King, and he didn’t want to be the Night King…. He was like, 'Now I have a way to go to war. Now I kill everybody because you made me the Night King and made me live seven or 10 thousand years behind the wall in a cold country.' He’s tired of living out there in the cold and the snow,” he added.\nAlso Read: 11 Instances That Prove Game Of Thrones Season 8 Has Been The Most Dramatic One Of The Lot!\nTwitter\nSo, that was all – quite simple and plain, and not so complicated.\nBy the way, do you know how Night King looks like in real life? Well, he is quite handsome and people are really crushing over him. Don’t believe us? Take a look!", "title": "Neither Targaryen Nor Stark! Here’s Who The Night King Was & What He Wanted The Whole Time", "date_publish": "02/05/2019, 15:40:58", "description": "For the longest time, right after the season 7, it was rumoured that Night King could be a Targaryen. After all, he could ride a dragon, the ice dragon. So, the Night King can fly a dragon and is also immune to fire. Why wouldn’t the fans think he is a Targaryen. And if he is, what’s his purpose?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/neither-targaryen-nor-stark-here-s-who-the-night-king-was-what-he-wanted-the-whole-time-366478.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/who_was_night_king_and_what_did_he_want_1556785961_800x420.png"}