{"text": "Neither Tyrion Nor Jon Snow, Robin Arryn Has More Chances Of Becoming The King At The End Of S8\nNeither Tyrion Nor Jon Snow, Robin Arryn Has More Chances Of Becoming The King At The End Of S8\nThe battle of Iron Throne, Game of Thrones, will soon come down to its conclusion. Who will sit upon the throne? It remains to be seen.\nTwitter\nWho are you putting your money on? Jon Snow and Daenerys Targaryen are two popular choices of fans. But when it’s Game Of Thrones, expect the unexpected. And as the makers said, not everyone is going to be happy with the ending of Game Of Thrones season 8, we are sure, it’s going to be surprising enough.\nWho else can sit on the Throne then? Cersei Lannister? It’s likely she would not live until the end. According to popular theories, Jamie might kill her before taking his own life.\nTwitter\nGendry doesn’t have the support to press his claim. Would Sansa want to return to the capital which gave her so many horrors? Will Arya Stark survive until the end?\nDon't Miss 842 SHARES\nAmid all the popular names, people completely forgot about Robin Arryn, right? According to Screen Rant’s Rose Moore, Robin Arryn, the sickly, immature son of Jon and Lysa Arryn, who died after being poisoned and pushed from the moon door respectively, has clear chances of winning the game.\nWhen we first met Robin Arryn, he was creepily breastfeeding on his mother’s lap, and since then he has turned out to be quite a brat. But we totally forgot that he is currently the Lord of the Vale. Well, if that happens, it’s going to be a big shock.\npinimg.com\nMeanwhile, do you know Lino Facioli, who plays the role of Robin Arryn is quite cool and suave in real life? Take a look!\nWhat are your thoughts on this? Tell us in the comments section below.", "title": "Neither Tyrion Nor Jon Snow, Robin Arryn Has More Chances Of Becoming The King At The End Of S8", "date_publish": "07/04/2019, 16:30:01", "description": "Amid all the popular names, people completely forgot about Robin Arryn, right? According to Screen Rant’s Rose Moore, Robin Arryn, the sickly, immature son of Jon and Lysa Arryn, who died after being poisoned and pushed out a window respectively, has clear chances of winning the game. The boy who creepily breastfeeds on his mother’s lap is currently the Lord of the Vale. Well, if that happens, it", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/neither-tyrion-nor-jon-snow-robin-arryn-has-more-chances-of-becoming-the-king-at-the-end-of-s8-365031.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/can_robin_arryn_claim_the_iron_throne_in_game_of_thrones_season_8_1554631990_800x420.png"}