{"text": "Anurag Kashyap and Vikramaditya Motwane had apologised on Facebook after a woman, an ex-employee of their company Phantom Films, complained that despite knowing of sexual predator Vikas Bahl, they didn’t act upon her sexual harassment complaint against him.\nOn the other hand, Varun Grover was accused of sexually harassing an anonymous woman. Amid the #MeToo movement and claims, rumours were doing the rounds that some of the core team members of Sacred Games 2 will be sacked by Netflix. However, the digital platform has now confirmed that it is retaining the original team.\nNetflix on Tuesday confirmed the streaming giant will continue its association with Vikramaditya Motwane, Anurag Kashyap and writer Varun Grover for the second season of Sacred Games.\nThe company in a statement said they carried out an independent investigation and are satisfied with the results.\nKashyap and Motwane, who co-directed the hit series, have been under fire for their alleged inaction in the sexual harassment allegations against former Phantom Films partner Vikas Bahl by an employee, a charge they both have denied.\nDon't Miss 193 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nndtv\nThe production house was dissolved last month after allegations resurfaced against Bahl in the wake of #MeToo movement in India. The case dates back to an incident that took place in Goa in 2015.\nWhereas, Grover was anonymously accused of sexual harassment, a claim he has categorically denied. In multiple statements, he has said that while he supports the movement, he wants to clear his name for his mental health. There has been no response from the anonymous account after he asked for closure.\nyoutube\n\"After an independent investigation, the results helped inform Netflix's decision to continue with Vikramaditya Motwane and Anurag Kashyap on season 2 of Sacred Games,\" Netflix said.\n\"Netflix will continue to work with Varun Grover on season 2 of Sacred Games,\" it further said.\nThe company said it will collaborate with its production partners \"to ensure and maintain a safe and respectful working environment\".\nInputs From PTI", "title": "Netflix Retains Varun Grover, Anurag Kashyap & Vikramaditya Motwane For Sacred Games 2 Amid #MeToo", "date_publish": "24/10/2018, 11:35:12", "description": "Netflix on Tuesday confirmed the streaming giant will continue its association with Vikramaditya Motwane, Anurag Kashyap and writer Varun Grover for the second season of \"Sacred Games\". The company in a statement said they carried out an independent investigation and are satisfied with the results. Kashyap and Motwane, who co-directed the hit series, have been under fire for their alleged inaction", "authors": [], "url": "https://www.indiatimes.com/entertainment/netflix-retains-varun-grover-anurag-kashyap-vikramaditya-motwane-for-sacred-games-2-amid-metoo-355324.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/netflix_confirms_kashyap_motwane_grover_to_return_for_sacred_games_2_1540359639_800x420.jpg"}