{"text": "Netflix Drops The First Trailer Of Stranger Things 3 And Fans Can't Wait To Binge Watch The Show This Summer\nNetflix Drops The First Trailer Of Stranger Things 3 And Fans Can't Wait To Binge Watch The Show This Summer\nThe best news that took place this week was the newest trailer of Stranger Things 3. The show which generated a lot of attraction and love in the first two seasons is back with yet another season.\nStill/Stranger Things\nAnd looking at the trailer one can say, 4th July, 2019 is going to be a long wait. Yes, this is when the show releases on the giant streaming app. The hit sci-fi series has the same cast and continues to follow the story of four friends.\nIn the trailer, Elevan is seen having the same psychic powers where he nose bleeds when she senses something. The latest show will revolve around the adventures that will take place during America's Independence day.\nDon't Miss 139 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe internet is swelling in joy and looking forward to the summers. Take a look\nThe kids from #StrangerThings in season 1 Vs. them in season 3. #StrangerThings3 pic.twitter.com/6HLWAVnBaG — Nick Poulimenakos (@NickMenakos) March 20, 2019\noh my GOD the Stranger Things 3 trailer 😭 pic.twitter.com/Is1zyS2qYn — jamp 👁 (@jampkin) March 20, 2019\ni'm sorry how fucking insane was that stranger things 3 trailer oh my god — CAMERON PHILIP (@CAM3R0NPH1L1P) March 20, 2019\nI don't know or really care what is happening in season 3, I just want to see more of this friendship. In fact, let's forget everything else, just have the show be about these two being besties. #StrangerThings pic.twitter.com/tBaGDEp9Fo — Mark (@Scuttlecliff) March 20, 2019\nWhen I see the Stranger Things 3 trailer VS when I realize it's not out till July pic.twitter.com/OwA8gUpVDY — Funny Or Die (@funnyordie) March 20, 2019\nThe show has the warmth of the 80s and the kids are all grown up on teenagers.", "title": "Netflix Drops The First Trailer Of Stranger Things 3 And Fans Can't Wait To Binge Watch The Show This Summer", "date_publish": "21/03/2019, 11:24:06", "description": "And looking at the trailer one can say, 4th July, 2019 is going to be a long wait. Yes, this is when the show releases on the giant streaming app. The hit sci-fi series has the same cast and continues to follow the story of four friends.And looking at the trailer one can say, 4th July, 2019 is going to be a long wait. Yes, this is when the show releases on the giant streaming app.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/netflix-drops-the-first-trailer-of-stranger-things-3-and-fans-can-t-wait-to-binge-watch-the-show-this-summer-364071.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/stranger_things_1553149522_800x420.jpg"}