{"text": "From books to movies, we have seen everything including dramatic performances getting censored in the nation. In the age of over-the-top media service platforms like Netflix, how can you expect censorship to not apply to the internet?\nFor some, art can be intimidating too. That’s perhaps the reason why an episode of Patriotic Act with Hasan Minhaj, is pulled from streaming in Saudi Arabia after its government complained that it showed the kingdom in a negative light.\nTwitter\nThe episode apparently focused on journalist Jamal Khashoggi’s killing inside Turkey’s Saudi consulate. It is said that during the act, host Hasan Minhaj referred to Silicon Valley as “swimming in Saudi cash”. He also criticised Crown Prince Mohammed bin Salman and his Kingdom-backed war in Yemen.\nnewscaststudio.com\n“Now would be a good time to reassess our relationship with Saudi Arabia. And I mean that as a Muslim, and as an American,” he was quoted as saying in the episode that has now been pulled from Saudi Arabia.\nTwitter\nDon't Miss 257 SHARES 11.7 K SHARES 12.5 K SHARES\nAccording to the Saudi government, the episode violated the kingdom’s anti-crime law. Following a legal request, Netflix decided to pull down the episode.\n“We strongly support artistic freedom and removed this episode only in Saudi Arabia after we had received a valid legal request - and to comply with local law,” Netflix’s spokesperson was quoted as saying in a statement.\nAnd people are disappointed!\n#1\nA more apt description would be the lack of balls of Netflix executives for pulling the Patriot act episode on Saudi Arabia. You should be ashamed . — Arpan Bhattacharya (@ArpanAlterEgo) January 2, 2019\n#2\n@patriotact #respect! You were pulled from Netflix in Saudi Arabia!!\nYou must be saying the right things, (not like it was ever in question).\nKeep it up! — Honest Prayers (@PrayersHonest) January 2, 2019\n#3\nHasan Minhaj criticized the Saudi crown prince on \"Patriot Act.\" Netflix immediately pulled down the episode. pic.twitter.com/8MdjIkGYLc — Mohamed (@cyard10) January 2, 2019\n#4\nWe should be really worried that Netflix pulled the “Saudi Arabia” episode from Patriot Act. — Fariha Róisín (@fariharoisin) January 2, 2019\n#5\n1. Good for @hasanminhaj, what he has said obviously matters and they're afraid of him 2. Disappointed in @netflix but not surprised. 3. Can't wait for the return of @patriotact! — Anthony? (@undecidedbeing) January 2, 2019\n#6\nAnyone for censorship? On his brilliant program @patriotact, @hasanminhaj devoted an episode to Saudi Arabia. Then #Netflix bowed to the kingdom's \"request\" that the episode be banned in-country. Score another point for profits before principles. https://t.co/rpDmR0a56d — Randy B Hecht (@RandyBHecht) January 1, 2019\n#7\nThis is disturbing. Love Patriot Act and I’m really bothered that Netflix took this down. https://t.co/5zV55v2NPZ — Erin Jean Warde (@erinjeanwarde) January 1, 2019\n#8\nYou should never negotiate with terrorists @netflix.\nGiving in to the murdering thug Mohammed bin Salman by deleting @hasanminhaj’s #PatriotAct episode is #UnAmerican. #NeverForget — AC (@Abhinary) January 2, 2019\n#9\n#Netflix removed an episode of Patriot Act because it was critical of the crown prince of Saudi Arabia. The Saudis are stuck in the Dark Ages like all brutal Islamist regimes. Muslims have never had #FreeSpeech and we must stop them taking over Europe... #DeportIslam 🇬🇧 🇪🇺 — Sons of Odin (@RitesofOdin) January 2, 2019", "title": "Netflix Pulls Episode Of ‘Patriot Act’ After Saudi Govt Complains & People Are Disappointed", "date_publish": "02/01/2019, 12:58:23", "description": "The episode of Patriotic Act with Hasan Minhaj apparently focussed on journalist Jamal Khashoggi’s killing inside Turkey’s Saudi consulate. It is said that during the act, host Hasan Minhaj referred to Silicon Valley as “swimming in Saudi cash”. He also criticised Crown Prince Mohammed bin Salman and his kingdom-backed war in Yemen.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/netflix-pulls-episode-of-patriot-act-after-saudi-govt-complains-people-are-not-disappointed-359675.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/netflix_pulls_episode_of_patriot_act_after_saudi_govt_complains__people_are_not_happy_1546412950_800x420.png"}