{"text": "Netizens Are Angry With Preity Zinta After A Video Of Her Mocking #MeToo Goes Viral!\nNetizens Are Angry With Preity Zinta After A Video Of Her Mocking #MeToo Goes Viral!\nPreity Zinta is being deeply criticized on social media for making comments that are being perceived to be trivializing the #MeToo movement. People are bashing her for putting across such regressive thoughts in an interview.\nScreengrab\nA part of her interview with Bollywood Hungama is going viral. The video that is being circulated on the website shows how Preity has mocked the movement and cracked a joke around #MeToo. Listen in.\nPreity Zinta's comments didn't go down too well with people. Slamming her for mocking the movement and putting across 'regressive' views, here is what Netizens had to say.\nPreity Zinta is the only woman I have ever heard wish that she'd been molested, harassed or assaulted so she'd have a story to tell. — Aavi (@poisonaavi) November 19, 2018\nDisturbing opinions coming from Preity Zinta on #MeToo movement. Highly insensitive the way she's going about mocking victims. \"You are treated the way you want to be\"- Sure @realpreityzinta, you wanted to be molested by Ness Wadia, right? That's why you filed an FIR against him? pic.twitter.com/AHvpEbF0jv — హిమాలై🌈 (@Oxynom) November 17, 2018\nDon't Miss 881 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n“People treat you the way you want to be treated,” says @realpreityzinta about survivors of sexual harassment.\nShocking victim-blaming while discussing #MeTooIndia—watch why women like #PreityZinta are part of the problem: pic.twitter.com/V1oG9DYvBu — Vishal Choradiya (@VishalChoradiya) November 19, 2018\nCringing and embarrassed as I watch this Preity Zinta Interview.\n1. She filed a case of molestation against Ness Wadia in 2014. Yet, she says she’s never had a #MeToo moment?\n2. @iFaridoon stop capitalising on this movement for views! First Rakhi Sawant, now this. STOP! https://t.co/YnHl1UtEib — Janice Sequeira (@janiceseq85) November 19, 2018\n\"personally do you ever had this experience (harassment)?\"\n\"i wish i had\"\nfuck you preity zinta, you're a piece of shit https://t.co/i3VZfXpn5b — hiba (@zayndeprived) November 18, 2018\nSo Miss #PreityZinta said that people who complain about the #MeToo are the ones who project that image about themselves and ask for it.\nSo according to your privileged ass, I was asking for it at 8 years old when I got molested, huh? — Sharanya Paulraj 👸🏽 (@sharusays) November 18, 2018\n#PreityZinta when people tell you, you are bubbly you don't have to literally be that cheerful and forcefully crassy while talking about something sensitive as #metoo Demeaning it by wishing you had such an experience? Lost a lot of respect for you. — Ankita (@_downandirty_) November 19, 2018\nThis is how people change. The same Preity Zinta would probably be the champion of #Metoo if the movement happened during time when she had a fallout with Ness Wadia https://t.co/Pifl6Int52 — Deepika Bhardwaj (@DeepikaBhardwaj) November 19, 2018\nNo wonder Aman pushed you to another guy and died instead https://t.co/BMunvU85ON — not a damsel, but in distress (@KiskuGhoorra) November 18, 2018\nAfter she was slammed for her views, she said that she was ‘surprised’ and ‘upset’ that her interview was edited to sound controversial for better traction.\nShe wrote, \"Really sad 2see how the interview Is edited to trivialise & be insensitive.\"\nReally sad 2see how the interview Is edited to trivialis& be insensitive. Not everything is traction & as someone being interviewed I expected decency & maturity froma journalist @iFaridoon. I did 25 interviews that day & only yours turned out edited like this #dissappointed — Preity G Zinta (@realpreityzinta) November 19, 2018\nScreengrab\nHer video has spread like wildfire and maybe it's too late for her to apologize or blame someone else. The damage is already done!", "title": "Netizens Are Angry With Preity Zinta After A Video Of Her Mocking #MeToo Goes Viral!", "date_publish": "20/11/2018, 12:46:40", "description": "Preity Zinta is being deeply criticized on social media for making comments that are being perceived to be trivializing the #MeToo movement. People are bashing her for putting across such regressive thoughts in an interview. After receiving backlash on her views on #MeToo campaign, Bollywood actress Preity Zinta said that she was ‘surprised’ and ‘upset’ that her interview was edited.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/netizens-are-angry-with-preity-zinta-after-a-video-of-her-mocking-metoo-goes-viral-357006.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/preity_zinta_1542699642_800x420.jpg"}