{"text": "Reports claim that in the film, Chris will be seen playing the role of a mercenary who is hired for rescuing a kidnapped child. The film will also star actor Randeep Hooda, who will be playing the role of a gangster. Chris is completely enjoying his stay in India and we've seen enough proofs.\nA picture from their chooda ceremony is doing rounds on the internet. One of the key highlights of this picture is how Ranveer is seen wearing a pair of sneakers with a heavily embroidered Sabyasachi outfit. Just like their other functions, here also Deepika is seen in a matching salwar-suit.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n“We were celebrating her 30th birthday. We went to a bar and she was partying with her friends. After a few drinks she got a bit aggressive and then she just wanted to go somewhere. But since I was really tired, I said ‘why don’t you go, I will just go back’. She just left me in the bar. I didn’t have any money, my mobile phone. It was in her bag. I didn’t even have the address where I was staying.”\nFrom asking why Alia is so sad and sullen to pointing out that Ranbir was busy checking out his ex-girlfriend Deepika Padukone's pictures, the comments on these pictures are hilarious!\nDoting parents that Aishwarya Rai Bachchan and Abhishek Bachchan are, they took to their social media accounts to share special wishes for their daughter.", "title": "Netizens Reacts To Alia-Ranbir's Photos, Chris Hemsworth To Shoot In Mumbai & More From Ent.", "date_publish": "17/11/2018, 17:13:04", "description": "In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/netizens-reacts-to-alia-ranbir-s-photos-chris-hemsworth-to-shoot-in-mumbai-more-from-ent-356863.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/wrap_1542455354_800x420.jpg"}