{"text": "1. Blood Bath Is About To Begin & These Latest Pics Of Game Of Thrones Show Jon Snow Is Terrified!\nIf you didn’t know already, the third episode of Game of Thrones season 8 episode 3 is going to be the longest one fans have ever seen. It will be 82 minutes long. It took 55 nights to film this episode. It will mark the beginning of the bloodiest finale battle at the Winterfell.\n2. Keep Your Tissues Handy! Chris Evans Says He Cried 6 Times While Watching Avengers: Endgame\n“I have a lot of my friends and family here tonight, and a lot of them are right up here. We have this bond that transcends what we do for a living… I cried like six times [tonight],” he told Variety.\n3. Police Complaint Filed Against Salman Khan For Misbehaving And Snatching A Fan’s Mobile Phone\nAnd now, a police complaint has been lodged against the star who is behind the Being Human initiative. In the complaint filed against DN Nagar Police Station of Mumbai, the complainant has accused Salman Khan of snatching his phone while he was trying to record his video. According to complainant, he took Salman Khan’s bodyguard’s permission before doing so.\nDon't Miss 159 SHARES 842 SHARES\n4. Pyaar Ka Punchnama Star Sonnalli Seygall Sheds Light On Unrealistic Beauty Standards Of The Film Industry\n\"It was recently when I tested for a well-known casting director for a fantastic role. I was very excited for this audition and prepared myself really well because I really wanted to bag it! And I did! But on meeting the director, there I was asked to make some changes on my body, unnaturally! It was a no brainer for me to say no, even though my heart broke... But I would never put my body under the knife!\"\n5. After Shah Rukh Khan, Aamir And Saif Urge People To Cast Their Vote In The Lok Sabha Elections\nAamir Khan, who is the national icon of the Election Commission Of India, in a video, said, “World's largest democracy, one more time, will choose a new government for itself. Every citizen will get the opportunity to become a part of this process. We often forget that in order to deliver this right to vote to us, our ancestors had sacrificed a lot. So, let's remember them and take an oath that we will definitely cast our vote. For our country, we will fulfil our important responsibility. Jai Hind.”", "title": "New Pics From GoT, Chris Evans Cried 6 Times While Watching Avengers: Endgame & More From Ent", "date_publish": "25/04/2019, 18:31:48", "description": "From HBO releasing new pictures from Game Of Thrones season 8 episode three to Chris Evans revealing he cried six times while watching Avengers: Endgame, here is all that rocked the world of entertainment today. The countdown for the biggest film of the year has begun. Two days before the release of the movie, a cam print of Avengers: Endgame was leaked online in India. But you know the drill, rig", "authors": [], "url": "https://www.indiatimes.com/entertainment/new-pics-from-got-chris-evans-cried-6-times-while-watching-avengers-endgame-more-from-ent-366101.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/new_pics_from_got_chris_evans_cried_6_times_while_watching_avengers_endgame__more_from_ent_1556193452_800x420.png"}