{"text": "New Kids On The Block! Ahan Shetty To Isabelle Kaif, 11 Debutantes To Look Out For In 2019\nNew Kids On The Block! Ahan Shetty To Isabelle Kaif, 11 Debutantes To Look Out For In 2019\n2018 was a spectacular year with many debuts like Jahnvi Kapoor, Ishaan Khattar to Sara Ali Khan. The audiences welcomed the newbies with open arms. Whether it was word of mouth or the box office collection, these stars proved they are here to stay.\nWith the new year, a fresh set of A-listers are going to make their debut with some big banners. Here's taking a look at 11 Bollywood upcoming celebrities that are all set to shine on the silver screen.\n1. Ananya Pandey\nThe actress is all set to make a debut with Student Of The Year 2. Chunky Pandey's gorgeous daughter Ananya Pandey is not only fashion forward but is also interested in her daddy's profession. And she has chosen the right guru to help her launch a career in Bollywood. Karan Johar, who is known to a messiah for star kids, has got Ananya inside his wings. She will be starring alongside Jackie Shroff and we can't wait to see the magic she will create.\n2. Isabelle Kaif\nDon't Miss 862 SHARES 583 SHARES 346 SHARES\nShe has made quite a few public appearances with her superstar sister Katrina Kaif and she is all set to make a mark of her own now. After featuring in a Canadian film, Dr. Cabbie, Isabelle Kaif is making a debut in a Bollywood film this year.\nThe actress will feature opposite Sooraj Pancholi in Time To Dance where she will play the role of a ballroom and Latin dancer while Sooraj essays the role of a street dancer.\n3. Ahan Shetty\nAnd just like his sister Athiya Shetty, Ahaan Shetty will also be venturing into the world of Bollywood, The filmmaker Sajid Nadiadwala confirmed that Ahan will star in a remake of Telugu hit, RX 100.\nThe producer acquired the rights of the film and roped in Ahan Shetty to play the lead. We need to wait and see if he lives up to our expectations.\n4. Karan Deol\nTwitter/Sunny Deol\nThe third generation Deol is all set to make his mark with Pal Pal Dil Ke Pass. He gave a sneak peek of his film last year as it was slated to release in December 2018, however as per reports, his debut film has been pushed to mid 2019.\nA romantic drama film, Sunny Deol is directing and it is being produced by Dharmendra under his banner.\n5. Tara Sutaria\nAnother student who will be launched by Karan Johar is Tara Sutaria. The actress will be seen sharing the frame with Tiger Shroff and Ananya Pandey. The 23-year-old is the only one who is not a star kid, unlike her contemporaries.\nBut facing cameras is not new for her. Tara has been on television in a lot of shows in Disney. She's also an opera singer and has travelled internationally performing the same.\n6. Mohit Raina\nIt's very important for newcomers, especially with non starry background, to choose their debut film as it decides the fate of their career. While he was offered many films in the past, Mohit Raina chose Uri as his debut film. A strong subject with a meaty role is what clicked with the actor. Also, a patriotic film was something he felt was close to his heart. Th movie is slated to release on 11th January, 2019.\n7. Pranutan Bahl\nJust like Karan Johar, Salman Khan too is the god father of many in Bollywood. After making a career of Katrina Kaif, Zareen Khan, Arjun Kapoor, Sooraj Pancholi and Daisy Shah, Pranutan Bahl, Mohnish Bahl's daughter is his next find.\nShe is also Nutan's grand daughter and will be seen in Notebook. The movie is all set to release on March 29,2019 and is produced by Salman Khan productions.\n8. Zaheer Iqbal\nThe boy starring opposite Pranutan is Zaheer Iqbal. He is all set to feature in this romantic Kashmir based love story. Although he doesn't belong to the film family, but his father and Sallu bhai have been friends for years.\n9. Sanjana Sanghi\nShe made news for all the wrong reasons. There were reports she was sexually harassed by her co-star Sushant Singh Rajput during the sets of Kizy Aur Manny. In fact, the director of the film, Mukesh Chabbra was also allegedly reported for misbehavior towards aspiring actresses.\nWhile Sanjana denied the rumours of Sushant Singh's harassment news, Mukesh had to step down from his directorship. Despite the film seeing these ups and downs, Kizy Aur Manny will release this year.\n10 Shanaya Kapoor\nAfter seeing all the Kapoors on the silver screen, the next in line is Shanaya Kapoor. Sanjay Kapoor and Maheep Kapoor's daughter, Shanaya has been taken under the Dharma wing for their upcoming venture.\nShe was spotted outside Karan Johar's office and looks like she will be following her daddy's footsteps soon.\n11. Shoaib Ibrahim\nAfter Dipika Kakar's big win with Bigg Boss 12, her husband Shoaib Ibrahim is all set to make a debut in Bollywood. He will be seen in Batallion 609 as Kamraj Mishra. The movie is slated to release on 11th January, 2019 and will show Shoaib as an army officer.\nLooking at the list of debutantes, we can safely say 2019 is going to be an interesting year. What do you think?", "title": "New Kids On The Block! Ahan Shetty To Isabelle Kaif, 11 Debutantes To Look Out For In 2019", "date_publish": "05/01/2019, 16:24:17", "description": "ahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan shetty, isabelle kaif, year ender, bollywood, debutahan she", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/new-kids-on-the-block-ahan-shetty-to-isabelle-kaif-11-debutantes-to-look-out-for-in-2019_-359702.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_1546421893_800x420.jpg"}