{"text": "Newlyweds Deepika-Ranveer Are Unstoppable As They Shake A Leg On The Dance Floor Again!\nNewlyweds Deepika-Ranveer Are Unstoppable As They Shake A Leg On The Dance Floor Again!\nRanveer Singh and Deepika Padukone are enjoying their marital bliss amidst all the chaos and madness that their profession brings for them. While they are busy fulfilling their work-commitments, their social life is rocking too as they are making appearances together at weddings and parties.\nAgencies\nThe newlyweds attended Film producer Dinesh Vijan’s wedding reception held in Mumbai last night.\nLike always, the couple made head turns and not just with their PDA but they again were the center of attraction at the dance floor.\nInstagram Screengrab\nDon't Miss 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nDeepika and Ranveer danced to their heart's content on his song Gallan Guddiyan.\nThat's not all. The Bajirao Mastani actor also matched steps with Stree actor Rajkummar Rao and filmmaker Karan Johar.\nFrom Aankh Maarey to Nachdene Saare, Singh was in full-form last evening as he danced with his wife and actors Kriti Sanon and Kartik Aaryan. Have a look at all the pictures and videos from last night that prove no matter whose party it is, Ranveer Singh ends up becoming the live-wire in each one of them!", "title": "Newlyweds Deepika-Ranveer Are Unstoppable As They Shake A Leg On The Dance Floor Again!", "date_publish": "15/12/2018, 18:12:32", "description": "Ranveer Singh and Deepika Padukone are enjoying their marital bliss amidst all the chaos and madness that their profession brings for them. While they are busy fulfilling their work-commitments, their social life is rocking too as they are making appearances together at weddings and parties.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/newlyweds-deepika-ranveer-are-unstoppable-as-they-shake-a-leg-on-the-dance-floor-again-358680.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepika_and_ranveer_1544877836_800x420.jpg"}