{"text": "Newly-Wed Celebrity Couple Prince And Yuvika Look Amazing In Their Wedding Pics\nNewly-Wed Celebrity Couple Prince And Yuvika Look Amazing In Their Wedding Pics\nBigg Boss is one of the most popular reality shows in our country. While we see a lot of fights and controversies inside the house, there are some love stories too that blossom their way through.\nOut of the many successful love stories, the one that truly touched our hearts was the story of former Bigg Boss contestants Yuvika Chaudhary and Prince Narula. The couple tied the knot last night in Mumbai in an extravagant wedding ceremony.\nYes, now, who would have thought that a couple on a live TV show would actually come out, date, be together, get engaged and finally get married. Prince Narula and Yuvika proved that true love exists.\nDon't Miss 106 SHARES 365 SHARES\nThe two have been together for than 2 years and finally decided to get married. Prince and Yuvika looked ravishing on their D-Day wearing the most stunning outfits. They were winning in a lovely shade of red and could not get their eyes off each other.\nTake a look at some of their stunning snaps and videos. Apart from the TV fraternity, Bollywood celebrities too attended their wedding. From Tabu, Suniel Shetty, Sohail Khan, Neha Dhupia, Rannvijay Singha, many celebs took our time for #Privika's special occasion.\n1.\n2.\n3.\n4.\n5.\nViral Bhayani\n6.\n7.\n8.\n9.\nWishing the couple a wonderful married life!", "title": "Newly-Wed Celebrity Couple Prince And Yuvika Look Amazing In Their Wedding Pics", "date_publish": "13/10/2018, 12:26:36", "description": "Bigg Boss is one of the most hit reality shows in our country. While we see a lot of fights and controversies inside the house, there are some love stories too that blossom their way through. Out of the many successful love stories, one truly touched our hearts last night. Former Bigg Boss contestants Yuvika Chaudhary and Prince Narula tied the knot in Mumbai in an extravagant wedding ceremony.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/newly-wed-celebrity-couple-prince-and-yuvika-look-amazing-in-their-wedding-pics-354706.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/prince_narula_1539414621_800x420.jpg"}