{"text": "Nick And PC's Wedding Goodies For Guests Consists Of 'The Oh Sh*t Kit' And More!\nNick And PC's Wedding Goodies For Guests Consists Of 'The Oh Sh*t Kit' And More!\nIf Alladin's genie was real, many of us would wish to be invisible right now so that we can just fly down to Jodhpur to attend the royal Nick-Priyanka wedding.\nI mean come on, everything about the wedding screams royal and exquisite.\nFrom the helipad that has been made especially to ferry guests in and out to the wedding guests that the planners have customized for the guests, the preps for the wedding are on point.\nAs if we were not feeling terrible enough already that now palace-turned-luxury hotel took to their social media accounts to give us a glimpse of what all is there inside the goodie kit.\n📸|| Goodies that’s being hand out at Nick and Priyanka’s wedding. Yes that one box is called “The Oh Shit Kit” pic.twitter.com/v50iNdvQ8n — Nick Jonas Daily (@DailyNickJonas) November 30, 2018\nEveryone who is attending the wedding gets a special goodie-package that included a package called an \"The Oh Shit Kit.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhile the name already says it all, everyone is still curious about what all is inside this kit.\nThe freebies also included multiple information packets for the couple's wedding extravaganza. The kit also consists of pamphlets called \"Western Weddings for Dummies\" and \"Indian Weddings for Dummies,\" according to additional Instagram photos obtained by Daily Mail. Priyanka and Nick will also be handing out embellished Juttis to their guests as their takeaway present just like Ranveer and Deepika did.\n(also read: Priyanka Chopra Had No 'Aitraaz' And Took Just 45 Seconds To Say Yes To Nick's Proposal!)\nDaily Mail\nThe couple is all set to solemnize their affair of 7 months by exchanging vows in a traditional Christian wedding, followed by a traditional Indian wedding this weekend.\n(Also read: From The Met Gala To Shaadi Ka Mandap, Here's A Timeline Of PC & Nick Jonas' Whirlwind Romance)", "title": "Nick And PC's Wedding Goodies For Guests Consists Of 'The Oh Sh*t Kit' And More!", "date_publish": "01/12/2018, 13:04:35", "description": "If Alladin's genie was real, many of us would wish to be invisible right now so that we can just fly down to Jodhpur to attend the royal Nick-Priyanka wedding.Nick And PC's Wedding Goodies For Guests Consists Of A Cool 'Oh Sh*t Kits' And More! Read more.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nick-and-pc-s-wedding-goodies-for-guests-consists-of-the-oh-sh-t-kit-and-more-357714.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pc_and_nick_1543650002_800x420.jpg"}