{"text": "Nick Jonas Is Having A Ball At His Bachelor’s Party & Priyanka Chopra Is Lovestruck Over His Sexy Avatar\nNick Jonas Is Having A Ball At His Bachelor’s Party & Priyanka Chopra Is Lovestruck Over His Sexy Avatar\nThe talks about Deepika Padukone and Ranveer Singh’s wedding are going on and grapevine has a lot of details about their big day. After all, there are getting married in just a few days (Nov 14 – 15).\nAnd soon after that, gossip mills suggest that Priyanka Chopra and Nick Jonas may also be tying the knot on Dec 2 at Jodhpur’s Mehrangarh Fort.\nWell, the pre-wedding rituals have already begun. Priyanka Chopra enjoyed her bachelorette with her girl gang – that included Sophie Turner and cousin Parineeti Chopra in Amsterdam.\nAnd now, it’s time for Nick Jonas Bachelor’s party. Nick Jonas has revealed some of the pictures from his own bachelor party in different yet sexy avatars that have left Priyanka Chopra lovestruck. Take a look!\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nRumour has it Priyanka Chopra and Nick Jonas will be hosting their pre-wedding parties soon. Are you excited?", "title": "Nick Jonas Is Having A Ball At His Bachelor's Party & Priyanka Chopra Is Lovestruck Over His Sexy Avatar", "date_publish": "11/11/2018, 17:18:42", "description": "And now, it’s time for Nick Jonas Bachelor’s party. Nick Jonas has revealed some of the pictures from his own bachelor party in different yet sexy avatars that have left Priyanka Chopra lovestruck. Take a look! gossip mills suggest that Priyanka Chopra and Nick Jonas may also be tying the knot on Dec 2 at Jodhpur’s Mehrangarh Fort.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-is-having-a-ball-at-his-bachelor-s-party-priyanka-chopra-is-lovestruck-over-his-sexy-avatar-356459.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nick_jonas_is_having_a_ball_at_his_bachelors_party_leaving_pc_lovestruck_over_his_sexy_avatar_1541935402_800x420.png"}