{"text": "Nick Jonas Extends A Sweet Gesture, Adds Priyanka Chopra’s Brother As Groomsman For The Wedding\nNick Jonas Extends A Sweet Gesture, Adds Priyanka Chopra’s Brother As Groomsman For The Wedding\nAfter to-be bride Priyanka Chopra's epic bachelorette at the Tiffany's in America, it's time for Nick Jonas' 'epic' bachelor party now. On Friday, Nick Jonas decided to give all of us a glimpse of what lies ahead for him before the wedding ceremonies actually begin.\nPosing alongside custom Lime scooters, Nick will be gifting these to his brothers, Kevin Jonas, Joe Jonas, and Frankie Jonas, his Kingdom costar Jonathan Tucker and his bride-to-be’s brother, Siddharth Chopra.\n\"Nick has 11 groomsmen,\" a source tells E! News. Nick has also created a custom scooter for himself.\"\nYes, you read that right.\nTwitter\nExtending the sweetest gesture, Nick announced and gave out deets of his groomsmen for the impending wedding and he added PC's brother Sid.\nNick posted the picture captioning it as, “I was searching for a fun way for my groomsmen to be mobile and ready to roll.” To which his fiance and would-be wife PC replied, “Epic bachelor party coming up!”\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nInternational media reports claimed that PC and Nick also made a secret trip to Beverly Hills last week to obtain their marriage license for the December wedding. They will exchange vows in India in December and they plan to fly back to the U.S to make their wedding official in both the countries.\nAgencies\nThe couple started official courtship in May and after five months of dating, Nick Jonas during their trip to London in late July proposed Quantico star Priyanka Chopra with a Tiffany & Co. diamond ring that reportedly cost $200,000.\nWell, fairy-tales do come true and for Priyanka Chopra who believed in being her own knight and shining armor, this was a very well-deserved love story!", "title": "Nick Jonas Extends A Sweet Gesture, Adds Priyanka Chopra’s Brother As Groomsman For The Wedding", "date_publish": "10/11/2018, 11:49:32", "description": "International media reports claimed that PC and Nick also made a secret trip to Beverly Hills last week to obtain their marriage license for the December wedding. They will exchange vows in India in December and they plan to fly back to the U.S to make their wedding official in both India and America.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nick-jonas-extends-a-sweet-gesture-adds-priyanka-chopra-s-brother-as-groomsman-for-the-wedding-356384.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nick_and_pc_1541831085_800x420.jpg"}