{"text": "Nick Jonas Has His Eye On Ben Affleck's Role As Batman & The Internet Is In Splits!\nNick Jonas Has His Eye On Ben Affleck's Role As Batman & The Internet Is In Splits!\nBen Affleck has almost confirmed in a tweet that he is not playing the iconic role in Matt Reeves' directorial The Batman, which will release on June 24, 2021. And fans are heartbroken.\npopsugar-assets.com\nWhile they are still trying to process what has happened, they are also wondering who will replace him in the Warner Bros movie. Meanwhile, Priyanka Chopra’s husband Nick Jonas has expressed that he wants to play Ben Affleck, and fans, including us, don’t even know what to say.\nAfter the news of Ben Affleck quitting the Batman movie broke, everyone was speculating as to who should/can step into his shoes. A publication called HypeBeast also asked fans the same question.\nTo this, Nick Jonas replied, “First name Nick. Last name Jonas.”\nInstagram\nDon't Miss 186 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nAnd fans had this to say to his comment.\nNick Jonas as Batman is the funniest thing ive seen in a while AHAHHAHAHAHHAAHAAAA — Laura (@comicism_) February 1, 2019\nNick Jonas wants the world to know that he's the perfect replacement for Batman Ben Affleck — Oliver Gosling (@goslingist) February 1, 2019\nI thought Ben Affleck replacing Christian Bale as Batman was worst. But no, Nick Jonas is clearly the most awful for the job. He's not even an actual actor ffs — Prateek (@prateekreports) February 1, 2019\nFinally a fantasy that every kid has comes true for one of them- to become batman! — Amrish Puri (@Naman1912) February 1, 2019\nNick Jonas as Batman??? HmMmMmMmMm........ — 유신히 // 姚瑶 (@geeshasree) February 1, 2019\nNick Jonas offered to become new Batman. Oh right sure. Can you imagine... the Batmobile pulling up and fucking Year 3000 playing in the background like no thanks buddy. pic.twitter.com/7IlzST3k0q — Marielle (@_gypsymouse) February 1, 2019\nNoooooo. @nickjonas as Batman is any Batfan's worst nightmare come true https://t.co/KiMgGD0U6T — Devlina Ganguly (@DevlinaGanguly) February 1, 2019\nNick Jonas batman 😭😂😂😂😂 — ' J ' (@JuliSingh_) February 1, 2019\nImagine nick jonas as Batman 😂😂😂 — rach (@rachuls) February 1, 2019\nIf @nickjonas is the choice for Batman than I will totally stop watching DCEU. You guys are playing with the casting like. 5 years old kid. — Swaraj Saikia (@__SAIKI__) February 1, 2019\nDo you want to see Nick Jonas in the role? Tell us in the comment section below. Meanwhile, we are waiting for Ben Affleck to reply to this.", "title": "Nick Jonas Has His Eye On Ben Affleck's Role As Batman & The Internet Is In Splits!", "date_publish": "01/02/2019, 16:09:22", "description": "After the news of Ben Affleck quitting the Batman movie broke, everyone was speculating as to who should/can step into his shoes. A publication called HypeBeast also asked the fans the same question. To this, Nick Jonas replied, “First name Nick. Last name Jonas.”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-has-his-eye-on-ben-affleck-s-role-as-batman-the-internet-is-in-splits-361422.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/nick_jonas_says_he_wants_to_replace_ben_affleck_as_batman__fans_cant_stop_laughing_at_this_1549016142_800x420.png"}