{"text": "And the groom is all set to arrive in India for his wedding at Jodhpur’s Umaid Bhawan. Nick shared a video of him departing from NYC. “See you later NYC,” he wrote in the caption.\nThe wedding celebrations for Deepika Padukone and Ranveer Singh aren’t getting over so soon. Last night, the happy-in-love couple threw a wedding reception for their friends and family in Bengaluru, which is Deepika’s hometown. As they made their entry dressed up like royalty, they made several heads turn.\nDeepVeer will be hosting another reception for their friends in the film industry in Mumbai on December 1. This reception is going to be grand as a lot of their industry friends have been invited to be a part of the grand celebrations.\nDon't Miss 3.5 K SHARES 5 K SHARES\nWhat’s hinting on this transitional phase of Indian cinema is the fading charm of the Khans of Bollywood. Shah Rukh Khan’s Jab Harry Met Sejal, Salman Khan’s Race 3 and Aamir Khan’s Thugs of Hindostan miserably failed at the box office. On the other hand, films including Badhaai Ho and AndhaDhun, are breaking box office records.\nJason Momoa’s character had bid adieu to the show long ago in the show, but fans still miss him. Remember when Emilia Clarke & Jason Momoa had a mini reunion, fans went gaga over their picture on the Iron Throne. They demanded he should make a comeback on the show, and looks like he will.", "title": "Nick Jonas Lands In India For Wedding, DP-Ranveer's Grand Reception And More From Ent", "date_publish": "22/11/2018, 17:02:05", "description": "And the groom is all set to arrive in India for his wedding at Jodhpur’s Umaid Bhawan. Nick shared a video of him departing from NYC. “See you later NYC,” he wrote in the caption.The wedding celebrations for Deepika Padukone and Ranveer Singh aren’t getting over so soon. Last night, the happy-in-love couple threw a wedding reception for their friends and family in Bengaluru/", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nick-jonas-lands-in-india-for-wedding-dp-ranveer-s-grand-reception-and-more-from-ent-357192.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepveer_1542886457_800x420.jpg"}