{"text": "Nick Jonas Jokes About Hosting Several Wedding Receptions, Says He's Walking Into 100047th One\nNick Jonas Jokes About Hosting Several Wedding Receptions, Says He's Walking Into 100047th One\nYear 2018 ended with a lot of celebrity weddings including that of Deepika Padukone-Ranveer Singh and Priyanka Chopra-Nick Jonas. These weddings were no less than a festival of Navratri, right? After all, the celebrations continued for weeks, and fans witnessed glimpses of a lot of parties on social media.\nhearstapps.com\nAfter a dreamy private wedding at Jodhpur’s Umaid Bhawan, Priyanka Chopra and Nick Jonas threw four wedding receptions. One, for family and friends in Delhi; second, for people from media; third, for their friends from the industry, and the fourth one for Nick's family and friends in North Carolina. After a three-day celebration at Umaid Bhawan, the parties weren’t getting over anytime soon.\nOf course, people poked fun at this. It was not only us who were wondering as to how many parties they will host, but even Nick Jonas poked fun at their never-ending wedding receptions.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nWhen Nick Jonas and Priyanka Chopra attended Learning Lab Ventures 2019 Gala at Beverly Hills Hotel recently, he joked about it while posting a photo on Instagram and wrote, “Walking into wedding reception 100047 like…”\nThe couple looked lovely though, don’t you agree?", "title": "Nick Jonas Jokes About Hosting Several Wedding Receptions, Says He's Walking Into 100047th One", "date_publish": "02/02/2019, 13:02:35", "description": "When Nick Jonas and Priyanka Chopra attended Learning Lab Ventures 2019 Gala at Beverly Hills Hotel, he joked about it and wrote, “Walking into wedding reception 100047 like…” After a dreamy private wedding at Jodhpur’s Umaid Bhawan, Priyanka Chopra and Nick Jonas threw four wedding receptions.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-jokes-about-hosting-several-wedding-receptions-says-he-s-walking-into-100047th-one-361455.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/nick_jonas_jokes_about_attending_100047_wedding_reception_with_priyanka_chopra_1549091130_800x420.png"}