{"text": "Nick Jonas To Go All Desi, Will Reportedly Whisk Away Priyanka Chopra In A Horse-Drawn Chariot!\nNick Jonas To Go All Desi, Will Reportedly Whisk Away Priyanka Chopra In A Horse-Drawn Chariot!\nPriyanka Chopra and Nick Jonas’ wedding is the talk of the town currently. Fans are dying to see Nick Jonas dressed up in Sherwani dancing on desi tunes! Wedding preparations are going on. After Sophie Turner, Joe Jonas and Kevin Jonas, groom’s father and mother – Denise Miller-Jonas, Paul Kevin Jonas Sr – have also arrived.\nViral Bhayani\nThe Mehendi and Sangeet ceremonies will reportedly take place today at Jodhpur’s Umaid Bhawan. The wedding on Dec 2 is going to be a dreamy affair. The Umaid Bhawan is all decked up already! Take a look.\nAnd now, rumour mills suggest that the groom-to-be will arrive in a horse-drawn chariot for Priyanka Chopra at his wedding. The Baraat is going to be quite dramatic, it seems.\nFans are eagerly waiting to see a videsi groom going all desi. But chances are, you might not even be able to catch a glimpse. Why? Because stringent measures are being taken to prevent any leakage! Just like Deepika Padukone and Ranveer Singh did.\nViral Bhayani\nIt is said that guests won’t carry mobile phone for any of the ceremonies. What’s more? The staff has also been handed over basic phones, with which they can’t take pictures.\nWell, Priyanka Chopra and Nick Jonas have struck a $2.5-million (Rs 18 crores) deal with an international magazine for the pictures’ rights.\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 12.5 K SHARES 186 SHARES", "title": "Nick Jonas To Go All Desi, Will Reportedly Whisk Away Priyanka Chopra In A Horse-Drawn Chariot!", "date_publish": "29/11/2018, 17:23:20", "description": "Rumour mills suggest that the groom-to-be Nick Jonas will arrive in a horse-drawn chariot for Priyanka Chopra at his wedding. The Baraat is going to be quite dramatic, it seems. Fans are eagerly waiting to see a videsi groom going all desi. But chances are you might not even be able to catch a glimpse?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-to-go-all-desi-will-reportedly-whisk-away-priyanka-chopra-in-a-horse-drawn-chariot-357622.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/rumour_has_it_nick_will_arrive_with_his_baraat_on_a_horsedrawn_chariot_for_priyanka_chopra_at_his_w_1543492549_800x420.png"}