{"text": "Nick Jonas Brother Joe Welcomes Priyanka Chopra Into The Family In The Sweetest Way Possible\nNick Jonas Brother Joe Welcomes Priyanka Chopra Into The Family In The Sweetest Way Possible\nPriyanka Chopra made her dreams come true on her terms and conditions and that is why this lady is an inspiration to all. She is a dreamer, achiever and we love her. Priyanka’s marriage with her Prince Charming Nick Jonas was one fairytale affair and everything about her wedding was dreamy and gorgeous.\nAfter PC and Nick’s grand wedding, her brother in law welcomed her into the sweetest way possible. Joe Jonas shared a beautiful picture of Priyanka and Nick on Instagram and wrote, “ Super Married! I Love You Both! Welcome to the Family Pri! Congratulations! My face hurts from all the smiling this week.”\nJoe refers to Priyanka as Pri and we find it adorable. Talking about the dreamy wedding in Today’s Show Joe said, “Marrying Nick off to Priyanka has just been fantastic. Obviously, this has been one of the most beautiful weddings I’ve ever seen and to be part of it was a dream. I was just overwhelmed with emotion. This is my brother, my best friend and to see him marrying his dream girl ... there was a lot of tears the whole weekend — and a lot of smiles.”\nDon't Miss 365 SHARES 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nInfact, Joe even slammed an entertainment portal for calling PC a global scam artist.\nThis is disgusting. @TheCut should be ashamed to have someone write such evil words. What Nick & Pri have is Beautiful Love. Thank u, Next. https://t.co/G3hvXmhm9O — J O E J O N A S (@joejonas) December 5, 2018\nClearly, Priyanka has won their hearts too, after all, she's our desi girl.", "title": "Nick Jonas Brother Joe Welcomes Priyanka Chopra Into The Family In The Sweetest Way Possible", "date_publish": "07/12/2018, 12:34:38", "description": "Priyanka Chopra made her dreams come true on her terms and conditions and that is why this lady is an inspiration to all. She is a dreamer and an achiever and we love her. Priyanka’s marriage with her Prince Charming Nick Jonas was one fairytale affair. Everything about herb wedding was dreamy and gorgeous.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-brother-joe-welcomes-priyanka-chopra-into-the-family-in-the-sweetest-way-possible-358112.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nick_1544166506_800x420.jpg"}