{"text": "Nick Jonas Kissed Priyanka Chopra In The Middle Of His Performance & Fans Cannot Stop Gushing!\nNick Jonas Kissed Priyanka Chopra In The Middle Of His Performance & Fans Cannot Stop Gushing!\nPriyanka Chopra and Nick Jonas are head-over-heels in love with each other is a pretty obvious fact. From their romantic dates to a fairy-tale wedding, their relationship is moving at lightening speed. They look adorable together and just can’t get enough of each other.\nRecently, the much-in-love couple made an appearance at the 2019 Billboard Music Awards, and guess what?! Love was in the air!\nWhile Nick Jonas was performing in the audience arena, he brushed past Priyanka Chopra who was hooting and cheering for him. And it is in that moment that they both stole a kiss.\nTake a look!\nPriyanka couldn’t stop giggling post that. And now Twitter is in awe of them both!\nbtw i still can't recover when nick and priyanka kissed i was like OMGGGGG — tia saw endgame twice (@kthparker) May 2, 2019\nDon't Miss 159 SHARES 12.5 K SHARES 161 SHARES 1.1 K SHARES 5.4 K SHARES\nWIAT NICK GIVING PRIYANKA A LIL SMOOCH AS HE PASSED BY WHILE PERFORMING IM DEAD THEYRE SO CUTE — isha (@kandashair) May 2, 2019\nNick Jonas kissing wife Priyanka Chopra during Jonas Brothers performance is couple goals ❤️🥰😘#JonasBrothers #BBMAs pic.twitter.com/pNsBH7BUrl — Siobhain (@summer0001) May 2, 2019\nNick is out there showing his love for Priyanka to the world, kissing her on his way to the stage — rei 레이 (@rei_MVP) May 2, 2019\nnick kissed priyanka in the middle of their billboard performance & im not ok — ياسى - yasi (@yasaminsharif) May 2, 2019\nNICK KISSING PRIYANKA IS THE CUTEST AND PUREST THING IVE EVER SEEN 😭😭 pic.twitter.com/xSJk35LMOa — 🥀 (@zjmrevivaI) May 2, 2019\nDo Priyanka Chopra and Nick Jonas make your heart flutter too?", "title": "Nick Jonas Kissed Priyanka Chopra In The Middle Of His Performance & Fans Cannot Stop Gushing!", "date_publish": "02/05/2019, 12:27:58", "description": "Recently, the much-in-love couple Priyanka Chopra and Nick Jonas made an appearance at the 2019 Billboard Music Awards, and guess what?! Love was in the air! While Nick Jonas was performing in the audience arena, he brushed past Priyanka Chopra who was hooting and cheering for him. And it is in that moment that they both stole a kiss.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-kissed-priyanka-chopra-in-the-middle-of-his-performance-fans-cannot-stop-gushing-366455.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/priyanka_chopra_and_nick_jonas_kiss_during_billboard_music_awards_2019_1556778829_800x420.png"}