{"text": "Nick Jonas' Heartfelt Speech For Wife Priyanka Chopra Was The Highlight Of Their Wedding!\nNick Jonas' Heartfelt Speech For Wife Priyanka Chopra Was The Highlight Of Their Wedding!\nLovebirds Priyanka Chopra and Nick Jonas solemnized their love affair by exchanging nuptial vows in Jodhpur.\nThe wedding celebrations in Jodhpur looked like a big fat Indian wedding. From their Sangeet function to ladkiwale v/s Ladkewale cricket match, the wedding was indeed a union of two completely different traditions.\nAs per DNA report, Nick Jonas also gave a heartfelt speech for Wife PC during their Hindu wedding ceremony.\n(Also read: Priyanka Chopra & Nick Jonas Make Their First Appearance As A Married Couple, Greet Fans With A ‘Namaste’)\nThe report added that Priyanka's brother Siddharth told him the Hindu wedding rituals to Nick Jonas. After Siddharth explained him the significance of saath pheras, Nick was in awe of the ritual that he was completely spell-bound.\nHe later took over the mic and gave a speech for PC.\nA source informed, \"He vowed to stay true to his promise and take care of her forever. In the end, PC was quite overwhelmed with Nick’s sweet gesture.\"\nShe was teary-eyed after this speech and Nick went ahead and hugged her.\nAfter three days of celebrations in Umaid Bhawan Palace, Jodhpur, the couple flew back to Delhi.\nAgencies\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nThey will host their first wedding reception in Delhi tonight.", "title": "Nick Jonas' Heartfelt Speech For Wife Priyanka Chopra Was The Highlight Of Their Wedding!", "date_publish": "04/12/2018, 16:03:08", "description": "Lovebirds Priyanka Chopra and Nick Jonas solemnized their love affair by exchanging nuptial vows in Jodhpur. The wedding celebrations in Jodhpur looked like a big fat Indian wedding. From their Sangeet function to ladkiwale v/s Ladkewale cricket match, the wedding was indeed a union of two completely different traditions.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nick-jonas-heartfelt-speech-for-wife-priyanka-chopra-was-the-highlight-of-their-wedding-357923.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nick_1543920126_800x420.jpg"}