{"text": "Nick Jonas Is Enroute To India For His Wedding With Priyanka Chopra & Fans Are Already Calling Him As 'Jiju'\nNick Jonas Is Enroute To India For His Wedding With Priyanka Chopra & Fans Are Already Calling Him As 'Jiju'\nSaajan Ji Ghar Aaye, Saajan Ji Ghar Aaye!\nWhile Deepika Padukone and Ranveer Singh’s wedding celebrations aren't over yet, it’s almost time for Priyanka Chopra and Nick Jonas’ marriage.\nDeepika-Ranveer flew to Italy to get married in a hush-hush affair. On the other side, PC-Nick will tie the knot in Jodhpur. They will marry twice in Hindu as well as Christian ceremonies on Dec 2 and Dec 3 respectively, it is being said.\nFans are obviously excited. We are also waiting for Nick Jonas to dance to a Hindi tune at his Band Baajaa Baaraat. Videsi groom and desi bride – people are excited to see them both in their wedding attire.\nAnd the groom is all set to arrive in India for his wedding at Jodhpur’s Umaid Bhawan. Nick shared a video of him departing from NYC. “See you later NYC,” he wrote in the caption.\nA lot of Hollywood celebrities are expected to be a part of the wedding, according to reports.\n“Though Prince Harry and Meghan, the Duchess of Sussex, may not make it, many Hollywood names are expected. Since it will be their first brush with an Indian wedding, Priyanka wants to make it special,” a source told Mid-Day.\nDon't Miss 837 SHARES 3.6 K SHARES 193 SHARES\nWhat’s more? Fans are so excited that they have started calling him Jiju. Don’t believe us? Read these comments on his picture below.", "title": "Nick Jonas Is On His Way To India For Wedding With Priyanka Chopra & Fans Are Already Referring To Him As ‘Jiju’", "date_publish": "22/11/2018, 12:55:00", "description": "Priyanka Chopra and Nick Jonas will tie the knot in Jodhpur. They will marry twice in Hindu as well as Christian ceremonies on Dec 2 and Dec 3 respectively, it is said. Fans are, of course, excited. We are waiting for Nick Jonas to dance to a Hindi tune at his Band Baajaa Baaraat. Videshi groom and desi bride – fans are excited to see them both in their wedding attires.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nick-jonas-is-enroute-to-india-for-his-wedding-with-pc-fans-are-already-calling-him-as-jiju-357156.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/fans_call_nick_jonas_jiju_as_he_arrives_in_india_for_his_wedding_with_priyanka_chopra_1542870582_800x420.png"}