{"text": "Nimrat Kaur Is Excited For Her Comeback In The Eighth Installment Of American Series Homeland!\nNimrat Kaur Is Excited For Her Comeback In The Eighth Installment Of American Series Homeland!\nFor every actor, being chosen for a role for a new season of the show that mattered to them once is a big achievement. For Nimrat Kaur, returning to the final season of Homeland has come as a big surprise.\nDuring a recent interaction with PTI, she said she never thought she would reprise her role in the hit American TV series.\nJust to jog your memory a little, Nimrat, Tasneem Qureshi, an ISI officer in the fourth season of the award-winning show and is now all set to return for the eighth installment. Talking to PTI, Nimrat said,\nInstagram\n“When I did season four, I had no idea I will be brought back. It was just one season deal. This offer came as a surprise to me. Who would have thought? I had never thought I would go back on the show as that character again.\"\nRecollecting how she got a chance visit to Los Angeles played an integral role in bagging the last season, she added,\ninstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“They (the team) wanted to meet me as they were in the process of scripting the final season. Luckily, I was in Los Angeles at the same time. They wanted my character to return because it did well for them.\"\nKaur is excited for the opportunity and she said that she's looking forward to playing Tasneem again.\nTwitter\n“The opportunity to play it again and to jump into that universe is exciting. It is for the first time that I am repeating what I played onscreen,” she said.\nShe recalled it was tough adjusting to a different type of role and a different working environment in Hollywood. “It was a little challenging when I got there as it was first time I was working abroad so the system was new to me. It is out and out grey character and I had to train myself to be comfortable playing the part.”\nEven though she had limited screen time in the fourth season, Nimrat said it garnered universal acclaim and opened new avenues for her.\n“People come to me at airports and say they don’t like me. It is rewarding to see that people hate this character. It makes me feel ‘job well done’. It is the last and final season so it is exciting to be part of it,” she said.\nThe 36-year-old actor said her character has evolved in the past four years.\n“She (Tasneem) is now at the senior level in the ISI and she is the face of Pakistan. She has moved up in authority and is a figure of great importance. There will be pivotal decisions taken by her. I don’t know the complete arc of the character so I am not aware how she becomes in the end. I just have the script of the first few episodes in my hand\"\nIn such a scenario, she truly believes it is essential to have faith in the makers as they know the overview better. She said what she has learnt working on the series is the level of planning and the time the makers invest in pre-production.\n“There is proper clarity on the sets, everything works as per the clock. There is no room for error. I learnt to be spontaneous and not be worried about how it will pan out. I went with the flow and had trust.”\n(With agency inputs)", "title": "Nimrat Kaur Is Excited For Her Comeback In The Eighth Installment Of American Series Homeland!", "date_publish": "03/02/2019, 15:31:25", "description": "Nimrat Kaur on her return to Homeland: Had no idea I will be brought back Nimrat, who played Tasneem Qureshi, an ISI officer in the fourth season of the award-winning show Homeland, will return for the eighth installment. “When I did season four, I had no idea I will be brought back. It was just one season deal. This offer came as a surprise to me.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/nimrat-kaur-is-excited-for-her-comeback-in-the-eighth-installment-of-american-series-homeland-361513.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/nimrat_kaur_1549188786_800x420.jpg"}