{"text": "After an eight-month battle with the Central Board of Film Certification (CBFC), Ashvin Kumar's directorial \"No Fathers in Kashmir\" will hit the screens on April 5.\nThe movie is finally seeing the light of the day and in a statement, Kumar said, \"It is a film made for young people all over India to connect with young people all over Kashmir, about the euphoria and hopefulness of being young - an A certificate would keep both these audiences away from each other. Now I am confident that kids will come out with their hearts beating for Kashmir.\"\nThe film is everything we should know about Kashmir-that we don't!\nScreengrab\nThe film is a story of a British-Kashmiri girl Noor (Zara La Peta Webb) who visits Kashmir to look for her father, who had disappeared years ago. She gets help from a local teenager, Majid (Shivam Raina), who takes her to a forbidden zone near the Indo-Pak border. However, they get caught and arrested.\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhile Noor gets freedom because she is British, the tale then takes us through the journey of a struggle for Majid's freedom.\nScreengrab\nThe trailer of Ashvin Kumar’s No Fathers in Kashmir is out and it shows harsh realities in Kashmir with how Noor and Majid's friendship helps them in surpassing all odds. The supporting cast includes the writer and director, Kulbhushan Kharbanda, Soni Razdan and Anshuman Jha. The film will release on April 5. Watch the trailer now.", "title": "‘No Fathers in Kashmir’ Trailer: Everything That We Don't Know About Kashmir But We Should", "date_publish": "19/03/2019, 17:42:16", "description": "After an eight-month battle with the Central Board of Film Certification (CBFC), Ashvin Kumar's directorial \"No Fathers in Kashmir\" will hit the screens on April 5.After an eight-month battle with the Central Board of Film Certification (CBFC), Ashvin Kumar's directorial \"No Fathers in Kashmir\" will hit the screens on April 5.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/no-fathers-in-kashmir-trailer-everything-that-we-don-t-know-about-kashmir-but-we-should-363967.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/no_fathers_in_kashmir_1552997694_800x420.jpg"}