{"text": "A lot of times, celebrities find themselves in the centre of controversies, mostly because they are always under the spotlight. With social media coming into picture, their opinions have suddenly become more important than they were before.\nTalking about her recent film 'No Fathers In Kashmir', Soni Razdan recently opened up about the trolling culture. She spoke about the very fact that today, celebrities are targeted for their views and opinions on issues of national importance.\nSoni was sharing her opinion at the press conference at the trailer launch of her upcoming film 'No Fathers in Kashmir'. She added that actors don't select films based on their patriotic feelings but sometimes, films are just related to an issue that might come their way and they get involved in it.\nTwitter\nShe said that it's unfair for the people to make it look like it's only an actors' responsibility to make the society a better place and the responsibility must be shared by the citizens too. She further justified her take by saying that it doesn't come from the point that she doesn't like our country, but she wants to improve and make it a better place for her children and this is her patriotism.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAfter a long battle of eight months, Soni's film finally got the certification from the Central Board of Film Certification and is all set to hit the theaters on April 5.", "title": "'No Fathers In Kashmir' Actor Soni Razdan Feels Celebs Are Trolled In The Name Of Patriotism", "date_publish": "20/03/2019, 16:36:44", "description": "Soni was sharing her opinion at the press conference at the trailer launch of her upcoming film 'No Fathers in Kashmir'. She added that actors don't select films based on their patriotic feelings but sometimes, films are just related to an issue that might come their way and they get involved in it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/no-fathers-in-kashmir-actor-soni-razdan-feels-celebs-are-trolled-in-the-name-of-patriotism-364034.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/soni_razdan_1553076825_800x420.png"}