{"text": "Nora Fatehi Makes People Go Bonkers Once Again, This Time With An Arabic Version Of ‘Dilbar’!\nNora Fatehi Makes People Go Bonkers Once Again, This Time With An Arabic Version Of ‘Dilbar’!\nNobody can do it better than Sushmita Sen, we know! And Perhaps, Nora Fatehi knows it too. She was reluctant the first time she danced on the new version. She was the happiest when Sushmita Sen applauded her.\nDilbar was one of the rare recreated version of an old song that stole people’s hearts. It became a rage when it was released. Everyone – in the clubs and at house parties – was dancing to Dilbar.\nNow, the diva is back again. This time, Nora Fatehi has done the Arabic version of the song. Without further ado, watch the video below!\nAlso Read: Sushmita Sen Dances To Nora Fatehi’s ‘Dilbar’ & Proves Nobody Can Do It Better Than Her!\nAnd people are going bonkers!\nNew version #dilbar in Arabic @Norafatehi again nailed it with the hot moves 😍😍 — Kapil Singh Bisht (@Pakka_Chichora) November 30, 2018\nNora Fatehi's Arabic version of Dilbar reached 10M views in a Day!\nShe's turned out to be the 2nd most successful BB contestant after Sunny leone#BB12 — . (@itsraviiii) December 1, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nIt's really really beautiful Nora it's amazing 😍 though can't understand the Arabic language but still ur voice seems so beautiful like flow of waves like it soo much also a good job by @Fnaireofficiel\nOn Indian outfit@Norafatehi#DilbarArabic @TSerieshttps://t.co/HBtl3QFfew — Kasturi Chakravarty 🇮🇳🇮🇳🇮🇳 (@ShivaniBarun) November 30, 2018\nI didn't expected to like the Arabic version of Dilbar so much!!❤️ @Fnaireofficiel is a surprise element and @Norafatehi please don't stop killing it everytime🤩. Your singing and dancing is so on point! The song is stuck in my head, hope I don't write the song in my exams 🤭😍! — Deepkumar Borude (@kungfupanda_roh) December 2, 2018", "title": "Nora Fatehi Makes People Go Bonkers Once Again, This Time With An Arabic Version Of ‘Dilbar’!", "date_publish": "02/12/2018, 18:18:30", "description": "Dilbar was one of the rare recreated version of an old song that stole people’s hearts. It became a rage when it has released. Everyone – in the clubs and at house parties – was dancing to Dilbar. This time, Nora Fatehi has done the Arabic version of the song.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nora-fatehi-makes-people-go-bonkers-once-again-this-time-with-an-arabic-version-of-dilbar-357791.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/nora_fatehi_makes_people_go_bonkers_once_again_this_time_with_arabic_version_of_dilbar_1543752605_800x420.png"}