{"text": "A lot of films on sports have been made in Bollywood, but there still hasn’t been one like Chak De India!. For a country who lives and feeds on cricket, the Shah Rukh Khan starrer was a stark reminder of the feeling of belongingness for national sports in the heart of every Indian. Not only did the movie ignite patriotism, but the compelling plot of the movie gave women sports players an apt depiction on the silver screen.\nPTI\n“Sattar(70) Minute, sattar min hai tumhare paas. Shayad yeh.. tumhare zindagi ke sab se khaas sattar minute hai. Aaj tum achha khelo ya bura khelo, yeh sattar minute tumhe zindagi bhar yaad rahenge…”\nWhen Shah Rukh Khan had mouthed this very dialogue in the movie, it had sent chills down the spines of every viewer. And yesterday, when Shah Rukh Khan was at the Hockey World Cup 2018’s opening ceremony at the Kalinga Stadium in Bhubaneswar, he charmed the audiences again with his goosebumps-inducing speech.\nSattar Minute, Sattar Minute hai tumhare paas 🔥 Aag hi laga diya Jaan ne toh aaj, Hath mein Hockey Stick lekar uss mahol mein yeh Iconic lines bole, dialogue ke jaise nahi waise jaise apne Bacchon ko advice karte huye kehte, Dil se unhe motivate kiye💘😍\npic.twitter.com/xc33Op1g2H — ✿ Sнαн Kι Bιωι ✿ ᶻᵉʳᵒ (@JacyKhan) November 27, 2018\nHe walked in with a hockey stick in his hands reminding fans of Chak De India and shared some words of motivation.\nPTI\nDon't Miss 153 SHARES 805 SHARES 343 SHARES\n“This is the most important tournament of the world. Because it is our sport, it is our hockey and there is no more special game than field hockey. And what sets it apart is that it is an amalgamation of a lot of emotions, thought and lots and lots of action. It involves guile, strength and stamina. It is a sport that involves artistry. Players are not mere players, they are artists,” he said.\nBe it off-screen or on-screen, Shah Rukh Khan and his charming personality leaves us all in awe of him, don’t you agree?", "title": "Nostalgia Alert! SRK Recreates Iconic ‘70 Minute’ Dialogue At Hockey World Cup Opening Ceremony", "date_publish": "28/11/2018, 12:06:00", "description": "A lot films on sports have been made in Bollywood, but there still hasn’t been one like Chak De India. For a country who lives and feeds on cricket, the Shah Rukh Khan starrer was a stark reminder of the national sports of India. Not only did the movie, once again, ignited patriotism, but a compelling plot of the movie gave women sports players an apt representation on the silver screen.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/nostalgia-alert-srk-recreates-iconic-70-minute-dialogue-at-hockey-world-cup-opening-ceremony-357507.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shah_rukh_khan_recreates_iconic_70_minute_dialogue_walks_in_with_a_hockey_stick_at_world_cup_openi_1543385946_800x420.png"}