{"text": "Not Failure, Aamir Khan's Biggest Fear Is Not Trying Anything New & We're Not Surprised\nNot Failure, Aamir Khan's Biggest Fear Is Not Trying Anything New & We're Not Surprised\nAamir Khan is one of the most celebrated Khans in Bollywood. He takes his time with each film, but each one is a blockbuster. He is not only popular in India but he is also making waves in China. So much so, that people fondly called him Uncle Khan there.\nTwitter\nFrom Lagaan to Rang De Basanti, from Taare Zameen Par to PK, Dangal and now Thugs Of Hindostan -- actor Aamir Khan, who has experimented with genres and looks galore in his movies, says he is scared about not trying something new. On Aamir ki Paathshala on Tata Sky Acting Adda, Aamir spoke about his motto of success, his responsibility as a film producer and more, read a statement.\n\"I don't feel fear of failing, I fear not trying. As a producer or a director, when a story grips the audience, that's when I feel, I have achieved something out of my art,\" he said.\nscreen grab/youtube\nStarting from an early age, Aamir had been heavily influenced by his director father Tahir Hussain, who always asked him, \"How will you describe the story in one line? What's the premise of your story?\" These questions helped established a base in Aamir's life for the selection of scripts of his movies.\nDon't Miss 337 SHARES 468 SHARES\nAs an actor, Aamir said, \"I don't charge a single rupee for my films. It is my responsibility to take care that the cost is recovered and the whole crew has been paid.\nscreen grab/youtube\nAnd when this is done, I get my share in profit. This gives me a sense of responsibility, of which you all can see the results.\"\nThe actor will soon be seen in Thugs Of Hindostan, Yash Raj Films' mega project which features Aamir for the first time with megastar Amitabh Bachchan. They are joined on-screen by Katrina Kaif and Fatima Sana Shaikh in what promises to be a high-octane action drama.\nInputs From IANS", "title": "Not Failure, Aamir Khan's Biggest Fear Is Not Trying Anything New & We're Not Surprised", "date_publish": "01/11/2018, 16:57:59", "description": "Aamir Khan is one of the most celebrated Khans in Bollywood. He takes his time with each film, but each one is a blockbuster. He is not only popular in India but he is also making waves in China. So much so, that people fondly called him Uncle Khan there.", "authors": [], "url": "https://www.indiatimes.com/entertainment/not-failure-aamir-khan-s-biggest-fear-is-not-trying-anything-new-we-re-not-surprised-355868.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/i_fear_for_trying_says_aamir_khan_1541063226_800x420.jpg"}