{"text": "Not Just A Cricket Connection! Anushka Sharma, Sakshi Dhoni Were Classmates & Here Are The Pics\nNot Just A Cricket Connection! Anushka Sharma, Sakshi Dhoni Were Classmates & Here Are The Pics\nIt’s a small world, they say and rightly so. We know that Anushka Sharma and Sakshi Dhoni have one thing in common – that is their cricketer husbands. But did you know at one point in their life, they were classmates as well?\nAnushka Sharma has studied in a number of schools during her childhood. She travelled across cities along with her father, who was in Army. So, when his father was posted in Assam, Anushka Sharma and Sakshi Dhoni attended the same school together. Here’s proof.\ntwitter/AnushkaSFanCIub\ntwitter/AnushkaSFanCIub\ntwitter/AnushkaSFanCIub\nDon't Miss 939 SHARES 7.3 K SHARES 564 SHARES 587 SHARES\nIn an earlier interview, Anushka Sharma had talked about reuniting with Sakshi Dhoni years after graduating.\n“Sakshi and I lived together in a very small town in Assam. When she told me where she lived, I said wow, I have lived here too! She said I went to this school, I said I went to this school too. And then I found a picture in which Sakshi is dressed as a fairy and I’m dressed in a ghaghara like my favourite idol Madhuri. Sakshi is extremely funny.”\ntwitter/AnushkaSFanCIub\nAnushka Sharma and Sakshi Dhoni studied in St. Mary’s School Margherita in Assam.", "title": "Not Just A Cricket Connection! Anushka Sharma, Sakshi Dhoni Were Classmates & Here Are The Pics", "date_publish": "31/01/2019, 15:38:29", "description": "Anushka Sharma has studied in a number of schools during her childhood. She travelled across cities along with her father, who was in Army. So, when his father was posted in Assam, Anushka Sharma and Sakshi Dhoni attended the same school together. Here’s proof.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/not-just-a-cricket-connection-anushka-sharma-sakshi-dhoni-were-classmates-here-are-the-pics-361367.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/virat_kohli_and_ms_dhonis_wives_anushka_sharma_and_sakshi_dhoni_were_classmates_in_school_1548928446_800x420.png"}