{"text": "Ayushmann Khurrana is a real life Bunny (Ranbir Kapoor from Yeh Jawaani Hai Deewaani) jo udna chahta, daudna chahta hai,girna bhi chahta, hai bus rukna nahi chhata.\nTwitter\nIndiatimes met this inspiring soul to have a chat with him about his new venture in music, where we spoke to him about films, success, life and everything in between.\nTwitter\nFirst things first, he told us about the new music venture he is starting, he said, “It’s a very heartfelt collaboration that I am doing, called Jam Session with Ayushmann Khurrana; it’s unique in a way because we are not looking for singers but even lyricists, so I am really looking forward to this project.”\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES\nAdding further he said, music is his second love and he always wanted to do something with it, “Doing something with music was my childhood dream, I have been jamming with my school friend Rochak since the good old days, and in college we used to write and compose our own songs, so music keeda was there from the beginning. However, I always wanted to be an actor first and then a singer”.\nTwitter\nRight now Ayushmann is the most talked about actor in the industry especially with the kind of films he is doing, we informed him how even Ranveer Singh feels why he isn’t getting the kind of films Ayushmann is doing, to which the actor said, “ It’s very kind of him to say that, but genuinely what I like, I do. I think success also depends on the people, how audience grasps your script, and how much they resonate with it, so I owe my success to the audience at the same time.”\nTwitter\nWe asked him to reveal the secret mantra on choosing the right scripts, he said, “Most of my decisions are impulsive, you must be thinking I think a lot before taking a decision but its impulsive, because your first reaction is the most organic reaction, be it first reaction to a script, song or any particular talent which I will see on this platform. I have a very intuitive reaction, that’s about it. It’s as simple as that, I think as an audience, I don’t think like a star, jaise audience grasp karti hai kisi concept ko, mai waise hi karta hu.”\nTwitter\nThe moment Ayushmann said he doesn’t think like a star, we asked him if he has started feeling like a star, he said,\n“Since you are giving successful films you think that you have become a star but you should not take it to your head that’s the most important thing. If you have that connection with the audience, you have to be the audience, aapko unki tarah hi rehna padega and I have no other option but to do that because the kind of films that I am doing a middle of the road cinema and they deal with realism, so mujhe real hi rehna padega , that’s my zone.”\nTwitter\nThe man who has given back-to-back hits still craves to do a lot more in his life, “I want to do everything, I want to produce, direct, compose more act more, have more beautiful scripts coming my way. I am very restless as an artist so I just crave to do every single thing which satiates my soul.”\nBefore ending our interview we asked him what’s his biggest fear, he said, “I am very fearless, kyuki jis tarike ka risk mai leta lu cinema mai bhi aur apne life ke saath, so I feel I am quite happy go, lucky person”.\nWe couldn’t agree more. His vibe is genuinely so enigmatic that you just cannot get enough of him.", "title": "Not Just Acting Or Music, Ayushmann Khurrana Dreams Of Doing Everything That Satiates His Soul", "date_publish": "15/04/2019, 16:53:22", "description": "Indiatimes met this inspiring soul to have a chat with him about his new venture with music, where we spoke to him about music, films, success life and lot more. Sitting in a uber cool Facebook office Ayushmann spoke his heart out with his, firstly he excitedly told us about the new music venture he is starting, he said, “It’s a very heartfelt collaboration that I am doing, called Jam Session wit", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/not-just-acting-or-music-ayushmann-khurrana-dreams-of-doing-everything-that-satiates-his-soul-365482.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ayushmann_khurrana_1555323710_800x420.jpg"}