{"text": "Not Jon Snow Or Daenerys Targaryen, But Looks Like This GoT Character Is Azor Ahai, Here’s Why!\nNot Jon Snow Or Daenerys Targaryen, But Looks Like This GoT Character Is Azor Ahai, Here’s Why!\nWarning: Obviously, this article contains major spoilers for season 8 of Game of Thrones. If you haven’t watched episode three yet, you can read this instead.\nvia GIPHY\nThe long night was indeed very dark (so much that I literally had to adjust the screen a lot of times in order to see clearly as to what was happening) and of course, it was also full of terrors.\nvia GIPHY\nBut still, the Battle of Winterfell, the longest and the best episode of Game of Thrones till date, defied every expectation of greatness – in a good way, of course.\nvia GIPHY\nThe Night King, the most terrifying villain in any of the shows ever, is dead and shattered into piece. And you know, the hero who killed him was the someone whose name starts with A, is a four letter word and isn’t Aegon.\nvia GIPHY\nThe hero was none other than Arya Stark or should we say Azor Ahai?\nvia GIPHY\nArya had a long list of people who she wanted to kill. The Night King was never on the list, but in the end, she saved everyone by just killing one character – The Night King.\nAnd we’re sure, Syrio Forel, the master sword-fighter and instructor hired by Eddard Stark to train Arya Stark, would be so proud of her.\nTwitter\n“What do we tell death?,” Melisandre asks Arya as they look at Beric Dondarrion who is now dead again, perhaps for the last time, and she says, “Not today”.\nBut does killing the Night King prove Arya Stark is Azor Ahai?\nvia GIPHY\nThe prophecy states that Azor Ahai or the ‘prince that was promised’ will fight the night and restore the peace to land. That’s exactly what Arya Stark did.\nbuzz.ie\nBut then, she wasn’t born under a bleeding star or anywhere near salt and smoke, and she didn’t even hatch a dragon out of a stone. But these conditions aren’t fulfilled by any of the other characters too. So, is Arya Stark the Azor Ahai? Or could it be Jaime Lannister?\nDon't Miss 3.1 K SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES", "title": "Not Jon Snow Or Daenerys Targaryen, But Looks Like This GoT Character Is Azor Ahai, Here’s Why!", "date_publish": "29/04/2019, 13:19:10", "description": "Who is Azor Ahai? The prophecy states that Azor Ahai or the ‘prince that was promised’ will fight the night and restore the peace to land. That’s exactly what Arya Stark did. But then, she wasn’t born under a bleeding star or anywhere near salt and smoke, and she didn’t even hatch a dragon out of a stone. But these conditions aren’t fulfilled by any of the other characters too. So, is Arya Stark", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/not-jon-snow-or-daenerys-targaryen-but-looks-like-this-got-character-is-azor-ahai-here-s-why-366259.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/not_jon_snow_or_daenerys_targaryen_but_looks_like_this_got_character_is_azor_ahai_heres_why_1556535394_800x420.png"}