{"text": "Bollywood celebrities inspire us in a lot of ways. Some of us might call their glamorous lives frivolous and unreal, but everyone secretly dreams to get into their shoes and live their lives at least once in a lifetime. From their luxurious vacations, make up on fleek faces and perfect bodies, we want to look just like them.\nI, at least, want to make the money like all these A-listers make, ONCE, like Rs 10 crore for an advertisement. But have we ever wondered, what have they done to deserve such big bucks. Thanks to social media now, we know the amount of hard work these Bollywood celebrities put in at the gym, every single day of their lives.\nHere's taking a look at 7 lessons these celebs give us each time they walk into their work out temple.\n1. Age is just a number - From Malaika to Sara - everyone works out religiously\nMalaika is 45 and Sara Ali Khan is about 25, almost half her age but that has not stopped them from becoming friends and gym freaks. The duo has been often seen working out together which proves age is just a number in friendships.\nDon't Miss 862 SHARES 346 SHARES\nAlso, Malaika sweating it out at this age is a life lesson. To all the ladies who think they can't push the bar, this one's an inspiration.\n2. Two girls can be friends despite dating the same man\nFor those who have not been following their work out videos must have most definitely followed Koffee With Karan. For people who are Bollywood buffs know Ranbir Kapoor has been a ladies man. Right from dating Deepika Padukone, Katrina Kaif to now Alia Bhatt, he has had a colourful life. But did it affect the equation of the three leading stars of Bollywood with each other?\nWell, not at all. So much so that Deepika and Alia came for the KWK show and Katrina and Alia work out together. In fact, the trio has a membership in the same gym. Now this is what you can call a life lesson.\n3. Which also means Two female actresses can be FRIENDS\nThis again reiterates the above point. There is a big notion that two A-listers cannot be courteous and friendly. They are constantly pitted against each other but when it comes to the latest brats Janhvi and Sara Ali Khan, they are highly comfortable with each other. And take each other's gym videos very seriously and get all inspired.\n4. Fit is beautiful\nSonakshi Sinha's transformation is an inspiration for all of us. Even Bhumi Pednekar. The two have proved that if one is determined and focused, then you can achieve anything.\n5. Girl power - No cat-fights, only support to one another to look their best\nParineeti Chopra joined the health circuit much later. In one of her earlier interviews, Pari mentioned how Katrina pulled her up to work out a bit more. Whenever Parineeti got tired, Katrina and Alia were there to pump her up, which proves if you have the right company then gymming can be quite a breeze.\n6. Just like us commoners, actresses are NOT born with perfect bodies, so work out\nKareena Kapoor is a perfect example of this. She came to this industry plump but lost the weight with her hard work. She has been in the industry for the past 18 years and has shown us size zero, her pregnant belly and now her petite figure again.\nKareena proves nothing is impossible. She flaunts her skinny figure as much as she flaunted her pregnancy.\n7. Pilates is the new thing in town\nAnd if your new year resolution is to lose some weight and get a fitter body, then you must join Pilates. The Bollywood celebrities are swearing by the new work out and we're sure it can show you great results too. So get that body moving!", "title": "Not Just Fitness Goals, These Celebs Are Giving Us 7 Life Lessons With Their Workout Regimes!", "date_publish": "22/01/2019, 15:14:04", "description": "Bollywood celebrities inspire us in every way. Some of us might call their lives frivolous and unreal, but everyone secretly dreams to get into their shoes and live their lives at least once. From their luxurious vacations, make up on fleek faces and perfect bodies, we want to look and feel like them.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/not-just-fitness-goals-these-celebs-are-giving-us-7-life-lessons-with-their-workout-regimes-360833.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_1548150367_800x420.jpg"}