{"text": "Not Just Aamir But Anil Kapoor, Big B And Disha Ditched Fancy Cars, Private Jets To Travel Like Us!\nNot Just Aamir But Anil Kapoor, Big B And Disha Ditched Fancy Cars, Private Jets To Travel Like Us!\nAamir Khan is the talk of the internet town and for all the right reasons. A video of Aamir Khan travelling in the Economic Class of a domestic class is doing rounds on the internet. This viral video of 54-year-old Aamir Khan has pleasantly surprised all his fans and his followers have flooded the comments section of these videos by leaving adorable comments.\nOne fan wrote,\"Aamir bhai Masha Allah you are real hero economy class.\" and the other commented on his simplicity and wrote, \"It's actual class of simplicity.\"\nBut this is not the first time that an A-lister ditched their expensive car or private jet to travel like us. Here are some other Bollywood stars who did something similar and won our hearts!\nWhat would have taken us 2hrs today took us 20mins #lifeasweknowit On time for Visarjan #ganpatibappamorya pic.twitter.com/Gqo7aWFolN — Anil Kapoor (@AnilKapoor) September 6, 2016\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES\n3. Even though she is one of the most popular actors on social media but Disha Patani still prefers to use an Auto to commute short distances!\n4. Hrithik and his kids love Auto Rides in Mumbai and pictures of the same have floated on the internet\nWell, some stars are just like us.", "title": "Not Just Aamir But Anil Kapoor, Big B And Disha Ditched Fancy Cars, Private Jets To Travel Like Us!", "date_publish": "23/04/2019, 16:07:13", "description": "Aamir Khan is the talk of the internet town and for all the right reasons. A video of Aamir Khan traveling in the Economic Class of a domestic class is doing rounds on the internet and is viral. This video of 54 year old Aamir Khan has pleasantly surprised all his fans and his fans have flooded the comments section of these videos by leaving adorable comments.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/not-just-aamir-but-anil-kapoor-big-b-and-disha-ditched-fancy-cars-private-jets-to-travel-like-us-365954.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/aamir_khan_1556016000_800x420.jpg"}