{"text": "First of all, here is a mandatory spoiler alert for those of you who are too late to watch the third episode of Game of Thrones season 8. Don't cry and curse us for giving spoilers, instead go and watch the episode right away, and then come back here to read this insane theory, which could again be a possible spoiler for episode four.\nvia GIPHY\nThe dude is weird and creepy AF, don’t you agree? I mean, when everyone is battling for their lives, Bran Stark plans to go warging. He keeps staring at people, and even being a crippled, he isn’t scared of anyone. Not even the Night King.\nHotstar\nWhen the Night King was approaching him, we all were shitting bricks but Bran was sitting their without a care in the world. Ever wondered why? The fans think not the Night King but he is the real villain of Game of Thrones. And here’s why!\nTwitter\nThis Reddit User’s theory that Bran is the real villain of Game Of Thrones pretty convincing and insane. He says:\n“I think there’s more going on than what meets the eye. Why else was Bran warged for so long? Could it be going back in time to prevent all this bloodshed? Could he have been making a deal with the Night King? When the Night King walked up to Bran, he looked like he accepted his fate. I just feel like the Night King is Bran, the Night King was going to kill Bran to destroy himself. I mean, the way the Night King just looked at Bran, it felt like he had to do it when he didn’t want to. Arya ruined the plans for Bran.”\nvia GIPHY\nAnd why, out of everyone, Bran wanted Theon Greyjoy, the man who isn’t known for his bravery, to protect him. And then, he let Theon die. Is that because he didn’t want any witness there? Also, this tweet makes sense, doesn't it?\nDon't Miss 842 SHARES 596 SHARES\nHow did the #NightKing change Craster's babies?\nBy touching them.\nHow did he change Viserion?\nBy touching it.\nWhat did Bloodraven say to #BranStark in the cave?\n\"He touched you.\"#foodforthought#nightking #GameofThrones — Vladimir Furdik (@Vladimir_furdik) April 28, 2019\nThere are three episodes left, and we’re sure the fight is not only between Cersei and Daenerys Targaryen and others for the Thrones. There is more the story. It’s going to get bigger and better, don’t you all agree?\nAlso Read: 11 Instances That Prove Game Of Thrones Season 8 Has Been The Most Dramatic One Of The Lot", "title": "Not The Night King, Fans Are Convinced That Bran Stark Is The Real Villain Of Game Of Thrones. Here's Why", "date_publish": "01/05/2019, 12:42:20", "description": "This Reddit User’s theory that Bran is the real villain of Game Of Thrones pretty convincing and insane. When the Night King was approaching him, we all were shitting bricks but Bran was sitting their like a cool dude. Ever wondered why? The fans think not the Night King but he is the real villain of Game of Thrones. And here’s why!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/not-the-night-king-fans-are-convinced-bran-stark-is-the-real-villain-of-game-of-thrones-here-s-why-366391.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/bran_stark_night_who_is_the_real_villain_of_game_of_thrones_1556693328_800x420.png"}