{"text": "2008 kick-started the world of reality show. Bigg Boss really paved the way for Indian audience and the way they looked at stars. From being unreachable to suddenly see them eat, play, love caught everyone's attention and became an instant hit formula. Soon after, other reality shows followed. Splitsvilla, Power Couple, Roadies, Rahul Dulhania Le Jayega and so on, so forth. Many found love in the other contestants, while some lasted and converted into marriage, others enjoyed the love till it lasted on the reality show,\nSo here's taking a look at 9 such couples who were lit in the reality shows but broke up the minute the show got over. Check it out.\n1. Malaika Arora - Arbaaz Khan\nTwitter\nThis was the most shocking out of all. The duo are also Bollywood's mega A-listers and had made a debut on TV together with Power Couple two years ago. The entire show was about how compatible are you with your partner but little did the fans of the show knew that the couple host would end up parting ways. Currently, Malaika is in a relationship with Arjun Kapoor and Arbaaz has also moved on.\n2. Kushal Tandon- Gauahar Khan\nColors/screengrab\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThey were the most loved couple on the Bigg Boss show. They defined true love and stuck by each other, to an extent that when Kushal was asked to leave because of his inappropriate behaviour, Gauahar fainted and begged Bigg Boss to go out of the show too. The drama was loved by the audience and they ended up making Gauhar as their winner.\nEventually, the duo went and spoke about how real their love was but just like most of the relationships, this one too fizzled out.\nTanisha and Armaan were one such couple too in the same season 7 and they too chose different paths after the show got over.\n3. Karisma - Upen Patel\nNach Baliye screengrab\nThis pyaar-bhari relationship too kickstarted inside the Bigg Boss house and went on till a couple of reality shows, Nach Baliye and Love School. The couple were very serious and Upen Patel even proposed to her.\nHowever, it was not meant to be long term. While Upen touted Karishma's mother to be problematic, Karishma addressed it more gracefully saying, they weren't looking for same things which lead to their break up.\n4. Sara Khan -Ali Merchant\nColors/Bigg Boss\nThis relationship outscores all the other ones. While the above are the ones where people found love and got into a relationship, in this case, Sara Khan and Ali Merchant got married for the reality show. Sara got married to Ali Merchant, in an Islamic wedding ceremony at Bigg Boss 4 in 2010. But the couple got divorced after two months in 2011. It was said that the actors were paid a sum of Rs 50 Lakh to get married in the Bigg Boss' house, but the channel denied it and called it their personal wish.\n5. Rahul Mahajan- Dimpy Ganguly\nColors/Bigg Boss\nAn entire show was created around Rahul Mahajan and his wedding. Swayamvar as one calls it, there were 16 girls out of which Rahul Mahajan had to choose his pick his loved one.\nHe chose Dimpy Ganguly as his wife but as luck would have it, their marriage did not survive for long. This was Rahul Mahajan's second marriage.\n6. Anup Jalota- Jasleen Matharu\nColors/Bigg Boss\nThey were the newest couple on Bigg Boss 12. Anup Jalota and Jasleen Matharu revealed their relationship status the minute they entered the show. People were shocked to see the couple getting up, close and personal in the show but they broke all stereotypes and claimed to be in love.\nHowever, the minute they were eliminated from the show, both denied being in a relationship ever. While Anup Jalota siad she's like a daughter, Jasleen called it a big prank gone wrong.\nThis was their strategy to survive on the show and they sure for as long as they could.\n7. Veena Malik- Ashmit Patel\nColors/Bigg Boss\nWe all know how the TRPs of Bigg Boss went soaring high. It was not only because of Dolly Bindra but sizzling chemistry between Ashmit Patel and Veena Malik. From head massages to one another, sleeping in the lawn in sleeping bags to Veena dancing in heels on the dining table, the season was one the lit ones.\nBut just like all other couples, this chemistry too fizzled out right after.\n8. Divya Agarwal-Priyank Sharma\nColors/Bigg Boss\nThis was a first. Before entering Bigg Boss, Priyank was in a relationship with Divya Aggarwal. However, upon entering the show, he made no mention of her rather spoke about other girlfriends he was dating. So when the episode of meet your loved ones came, Divya came to the show to give him a reality check and broke up with Priyank. It was a big blow to Priyank and other contestants were shocked about Divya's presence in his life.\n9. Benfasha - Varun Sood\nInstagam/Varun Sood\nShe was dating Varun Sood before she entered Bigg Boss 11. In the house, she never denied or admitted her relationship with Varun but he kept rooting for her 'Bee' as he liked to call her on social media. Looking at the reality show, it was clear Benafasha was enjoying the attention she got from another contestant Priyank Sharma and even confessed that she likes him. However the minute she came out of the house, she did an Instagram live with Varun Sood stating that all's good in the hood and she is still with Varun. But few weeks after coming out, Benafsha broke up with Varun and started dating Priyank. Phew, this sure was a complicated love triangle.\nMany people want to be part of such shows and aspire to fall in love with their co-stars and colleagues but reality shows are far different from reality. These shows give hope to fall in love but the turmoil after the cameras stop rolling is something only celebs can relate to.\nWhile we watch these shows as masaladaar entertainment, it sure is far from real. With stakes so high, money pumped in, and TRPs to fight for, celebrities take desperate measures to make their show a hit.\nSome have definitely lasted for long but majority have had shcoking break ups. Now, it is for us to decide about how real is this reel world.", "title": "Not Such A Love School Here! Meet 9 Couples Who Split Right After Their Shows", "date_publish": "20/04/2019, 12:53:17", "description": "So here's taking a look at 9 such couples who were lit in the reality shows but broke up the minute the show got over. Check it out. So here's taking a look at 9 such couples who were lit in the reality shows but broke up the minute the show got over.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/not-such-a-love-school-here-meet-9-couples-who-split-right-after-their-shows-365608.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/reality_show_1555486322_800x420.jpg"}