{"text": "Not Just GoT, The Big Bang Theory Is Ending This Year & The Cast Is In Tears Just Like Us!\nNot Just GoT, The Big Bang Theory Is Ending This Year & The Cast Is In Tears Just Like Us!\n\"Scissors cuts paper, paper covers rock, rock crushes lizard, lizard poisons Spock, Spock smashes scissors, scissors decapitates lizard, lizard eats paper, paper disproves Spock, Spock vaporizes rock, and as it always has, rock crushes scissors.\"\nYou are reading this in Sheldon’s voice, aren’t you?\nvia GIPHY\nThey started with a bang but they will break our hearts when they go!\nWe know 12 seasons and 12 years is a long time, but these quirky physicists and their friends made a big place for themselves in our hearts, didn’t they?\ncbs\nThis year marks the end of a lot of long-running shows. As if Game Of Thrones wasn’t enough, Suits and The Big Bang Theory is following suit!\nGoodbyes are always hard and imagine saying it to the team that has been together for 12 long years. The final table read that took place last night was as emotional as it can get. So much so that Kaley Cuoco aka Penny had a breakdown of sorts.\nDon't Miss 159 SHARES 842 SHARES\nFor the uninitiated, a final table read means that the entire cast and crew huddle together and read the script of the last episode of a season before the filming but in this case it was the series!\ntwitter\nIt was obvious that unlike the previous seasons which held a promise to meet again for the next one, this one was exceptionally difficult. This huddle was all about tears, sweet anecdotes, hugs and lots of tissues. Literally!\nThe members of the cast took to their social media accounts to share pictures from the reading.\nPenny first teased the fans with the last page of the final script which read ‘End Of Series’.\nThe actress then shared multiple photos which included one of herself holding on to the script for dear life with tears streaking down her face and another one of her script covered in tissues.\nShe wrote, “Prepare yourselves … for a finale that has truly given me a loss for words ❤️ Our whole universe …. @bigbangtheory_cbs.”\nJohnny Galecki who plays Leonard also shared a photo of himself sitting on the stairs outside their iconic apartment looking sullen.\ninstagram\nMelissa Rauch aka Bernadette and Mayim Bialik aka Amy arrived a little late to the party (post season three) but that doesn’t mean that goodbye was easy for them. Before the reading, Melissa shared a group photo of the cast and the crew. She captioned it as,\n“About to go into our table read for the series finale written by this group of geniuses ~ AKA: the heart and soul of @bigbangtheory_cbs 💗.People often ask what the secret is behind the success of the show…well, it’s no secret…it’s the sheer brilliance of these incredible minds. Love them all so very much.”\nShe then posted another photo of them sharing a group hug. This hug has been a ritual for the team of The Big Bang Theory. She captioned it as,\n“Just because I haven’t flooded my face with enough tears during/after today’s final @bigbangtheory_cbs table read…here’s a pic of our pre-show huddle last night. I was always picked last for every team as a kid, so getting to be a part of a huddle ~ let alone this particular huddle has been extra special. I‘ll forever cherish these moments with my TBBT brothers and sisters.”\nIt won’t be wrong to say that this year definitely marks the end of an era! I wish i could Bazinga you right now, tbh!\nvia GIPHY\nThe Big Bang Theory hour-long series finale airs May 16 on CBS.", "title": "Not Just GoT, The Big Bang Theory Is Ending This Year & The Cast Is In Tears Just Like Us!", "date_publish": "25/04/2019, 16:51:48", "description": "Scissors cuts paper, paper covers rock, rock crushes lizard, lizard poisons Spock, Spock smashes scissors, scissors decapitates lizard, lizard eats paper, paper disproves Spock, Spock vaporizes rock, and as it always has, rock crushes scissors. You are reading this in Sheldon’s voice, aren’t you? They started with a bang but they will break our hearts when they go! 12 seasons and 12 years is a", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/not-just-got-the-big-bang-theory-is-ending-this-year-the-cast-is-in-tears-just-like-us-366095.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/penny_1556190201_800x420.jpg"}