{"text": "Not Just 'Gully Boy', Vinay Pathak's ‘Dust’ Also To Be Screened At Berlin Film Festival\nNot Just 'Gully Boy', Vinay Pathak's ‘Dust’ Also To Be Screened At Berlin Film Festival\nThe Berlin Film Festival this year has been in news majorly for the premiere of Gully Boy but there is a lot more that is important and relevant. Not many know that Vinay Pathak starrer \"Dust\" is also all set to have its world premiere at the Berlin International Film Festival 2019. The film will be screened in the 'Perspektive Deutsches Kino (New German Cinema) section.\nThe film, with the backdrop of the Maoist conflict that affects large parts of India, is a German Indian co-production shot entirely in India with an international crew.\nBhargava is an Indian filmmaker who has previously worked on films like Danny Boyle's \"Slumdog Millionaire\", Lars von Trier's \"Antichrist\" and Mira Nair's \"The Migration\". \"Dust is her first feature film as a director.\n\"We are delighted to start our journey at the Berlinale. It feels like a homecoming for many of us, since a large part of our team is from Berlin. Also, as an Indian, I am looking forward to watching Zoya and Rima's films and hope they too can watch mine,\" Bhargava said in a statement.\nTwitter\nThe film, produced by Titus Kreyenberg's Unafilm, also stars Abu Bakr Golu, Kalyanee Mulay and Amrita Bagchi in pivotal roles.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I was amazed with the understanding of the grave subject that Udita has and the sincerity with which she wanted to tell the story. We are happy the film is being screened at Berlinale. We are looking forward to the response as this is the first screening for a larger audience,\" said Kreyenberg.\nApart from Gully Boy and Dust, Rima Das will also be showcasing Bulbul Can Sing.\n(With agency inputs)", "title": "Not Just 'Gully Boy', Vinay Pathak's ‘Dust’ Also To Be Screened At Berlin Film Festival", "date_publish": "12/02/2019, 14:30:26", "description": "\"We are delighted to start our journey at the Berlinale. It feels like a homecoming for many of us, since a large part of our team is from Berlin. Also, as an Indian, I am looking forward to watching Zoya and Rima's films and hope they too can watch mine,\" Bhargava said in a statement.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/not-just-gully-boy-vinay-pathak-s-dust-also-to-be-screened-at-berlin-film-festival-362016.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vinay_pathak_1549962181_800x420.jpg"}