{"text": "Remember Abhishek Bachchan starrer Raavan? The movie was a flop in terms of its collections at the box office, but a lot of people say it was not so bad and rather a good one-time watch film. Starring Aishwarya Rai Bachchan and Abhishek Bachchan in lead roles, Raavan was directed, co-produced and co-written by Mani Ratnam, a filmmaker who is known for his movies including Roja (1992), Dil Se (1998) and Guru (2007) among others.\nbollyone.com\nBut did you know Raavan was first offered to Shah Rukh Khan and not Abhishek Bachchan, but he declined the movie? “I enjoyed working with Mani Ratnam. It was fun. He wanted me to do Raavan. But I was caught up then. Also, it was bilingual. I found it difficult to do that,” said Shah Rukh Khan told Filmfare.\nmasala.com\nRecently, Shah Rukh Khan has reportedly declined to star in the Rakesh Sharma biopic, which was first offered to Aamir Khan. It is said that Shah Rukh doesn’t want to experiment and take a risk, especially after the failure of Zero. Meanwhile, he will reprise the role of a gangster in Don 3, which is tentatively titled Don: The Final Chapter.\nDo you think the fate of Raavan would have changed had Shah Rukh Khan and not Abhishek Bachchan starred in it?\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES", "title": "Shah Rukh Khan:Not Abhishek Bachchan, But Shah Rukh Khan Was The First Choice For Raavan, Here’s Why He Declined It", "date_publish": "02/02/2019, 15:46:19", "description": "Starring Aishwarya Rai Bachchan and Abhishek Bachchan in lead roles, Raavan was directed, co-produced and co-written by Mani Ratnam, a filmmaker who is known for his movies including Roja (1992), Dil Se (1998) and Guru (2007) among others. But did you know Raavan was first offered to Shah Rukh Khan and not Abhishek Bachchan but he declined the movie.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/not-abhishek-bachchan-shah-rukh-khan-was-the-first-choice-for-raavan-here-s-why-he-declined-the-offer-361465.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/shah_rukh_khan_was_offered_mani_ratnams_raavan_before_abhishek_bachchan_but_he_rejected_it_1549099907_800x420.png"}