{"text": "2018 was a good year for cinema lovers. The content finally was declared the king and we saw several experimental and good stories, One such story was Shoojit Sircar's October. Starring Banita Sandhu and Varun Dhawan in lead roles, the film revolved around Dan (Dhawan)'s unrequited love and affection for a young woman called Shiuli who slips into coma after meeting an unfortunate accident.\nTwitter\nMore than a year after the release, Film writer Juhi Chaturvedi, revealed the real-life inspiration for the character of Shiuli Iyer in Varun Dhawan-starrer October. She wrote an emotional post, where she shared that her mother was her ‘real life Shiuli’.\nTwitter\nSharing a picture of her mother, she wrote,\nMy ma. real life Shiuli. 30 years of her illness: haemorrhage/depression/renal failure/transplnt/memory loss/cancer/coma made me a quasi nephro-onco-neuro-therapst/full time caregiver/writer & humour appreciator. To nt hv medical refrnce in wht I write is tuf bt Ive tried. Next:) pic.twitter.com/vaCotTPnaG — juhi chaturvedi (@writeonj) April 12, 2019\nDon't Miss 207 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“My ma. real life Shiuli. 30 years of her illness: haemorrhage/depression/renal failure/transplnt/memory loss/cancer/coma made me a quasi nephro-onco-neuro-therapst/full time caregiver/writer & humour appreciator. To nt hv medical refrnce in wht I write is tuf bt Ive tried. Next:)”\nJust to jog your memory a little, she had share similar details with DNA in an interview. She had said,\nTwitter\n“I was in Class 2 or 3 when mom had a haemorrhage, she survived that. Then there was kidney faliure and transplant, cancer.... I almost grew up in hospitals and around doctors. It was like hum hi aadhe doctor khud ban gaye the. I was checking blood pressure when I was in class six. I guess if I wasn’t in this profession, I would’ve ended up being a doctor. She passed away after 30 years of suffering, just before Vicky Donor released, but we managed to show it to her at home.\"\nJuhi and Shoojit Sircar have collaborated for several films including Madras Cafe, Vicky Donor, Piku and October.", "title": "'October' Writer Juhi Chaturvedi Reveals How Shuili's Character Was Inspired By Her Mother", "date_publish": "12/04/2019, 14:46:58", "description": "2018 was a good year for cinema lovers. The content finally was declared the king and we saw several experimental and good stories, One such story was Shoojit Sircar's October. Starring Banita Sandhu and Varun Dhawan in lead roles, the film revolved around Dan (Dhawan)'s unrequited love and affection for a young woman called Shiuli who slips into coma after meeting an unfortunate accident.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/october-writer-juhi-chaturvedi-reveals-how-shuili-s-character-was-inspired-by-her-mother-365337.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/varun_dhawan_1555061634_800x420.jpg"}