{"text": "Old Wine In A New Bottle? Fans Think ‘Simmba’ Is A Recycled Version Of Dabangg & Singham!\nOld Wine In A New Bottle? Fans Think ‘Simmba’ Is A Recycled Version Of Dabangg & Singham!\nFlying cars, high voltage action and lots of drama, Rohit Shetty movies are commercial potboilers which are over-the-top but high on the fun element.\nThe man is back in action with yet another action fuelled drama in the Singham series. This time with Ranveer Singh, Ajay Devgn and Sara Ali Khan starrer Simmba – and going by the trailer, the movie looks like a complete dose of masala entertainment.\nRanveer Singh who is known for his eccentric vibe and crazy energy is playing the lead role in the movie. He plays the role of a corrupt police officer who takes on rapists. His one-liners and punches have caught people's fancy.\nSonu Sood and Ashutosh Rana are also a part of the movie. Sara Ali Khan is playing Ranveer’s love interest, and there is original Singham AKA Ajay Devgn in the movie too. Take a look at the trailer below.\nDon't Miss 812 SHARES 185 SHARES 544 SHARES\nBut wait, isn’t this giving you a feeling of Déjà vu? Simmba trailer looks like a mix of Dabangg and Singham, don’t you think? Well, people on social media think so.\nSimmba is just Rohit Shetty retweeting Singham — P.R. (@pr_akash_raj) December 3, 2018\n@ajaydevgn's screen presence is incredible..His 10sec. Appearance is the main highlight of 2:54 minute Trailer...#SimmbaTrailer — Jon Snow (@Rohits_Pull) December 3, 2018\n#SimmbaTrailer has nothing new to serve to the audience. I love Ranveer Singh but he doesn't have that aggression which we have seen in Ajay Devgn and Salman Khan. Rohit Shetty is doing the same thing yet again and i am DISAPPOINTED ! @RanveerOfficial #SimmbaTrailer — Siddharth Mathur (@TheSidMathur) December 3, 2018\nReview of #SimmbaTrailer in a single pic by all who have seen it pic.twitter.com/BIIab08Twl — naman pandit (@namanpandit6) December 1, 2018\n#SimmbaTrailer is good .May do well initially but will not cater goers for a long time . — Rahul verma (@RahulVerma4860) December 3, 2018\n#SimmbaTrailer K 70% TWEETS ME TO TRAILER KI MAA BEHEN HO RI H 😂😂😂😂😂#Issaqbaazi — SRK'S Mjölnir (@mayankr268) December 3, 2018\n#SIMMBATRAILER sucks, sucks and just sucks. That's all. — Aaliyaan Khan (@aaliyaanhere) December 3, 2018\nThe Trailer is full of overacting of @RanveerOfficial.\nThe only highlight of the Trailer is @ajaydevgn#SimmbaTrailer#RohitShetty — shashikant singh (@shashikantsngh) December 3, 2018\nApart from Ajay Devgn there's nothing in #SimmbaTrailer\nIt leaves you with no impact. This Genre needs dialogue, good action and much more.\nIt started nicely but ended a dumb squib.\nOne of the weakest trailers for a big film.\nDisappointed. — Abhishek Parihar (@BlogDrive) December 3, 2018\nFor the uninitiated, Simmba is a remake of Telugu movie Temper.", "title": "Old Wine In A New Bottle? Fans Think ‘Simmba’ Is A Recycled Version Of Dabangg & Singham!", "date_publish": "03/12/2018, 17:10:52", "description": "Simmba trailer starring Ranveer Singh, Sara Ali Khan, Ajay Devgn, Sonu Sood and Ashutosh Rana is out. Ranveer Singh who is known for his eccentric vibe and crazy energy is playing the lead role in the movie. He plays the role of a corrupt police officer who takes on rapists. His one liners and punches are hilarious.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/old-wine-in-a-new-bottle-fans-think-simmba-is-a-recycled-version-of-dabangg-singham-357843.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/simmba_1543839146_800x420.jpg"}