{"text": "Actress Divya Bharti's untimely death came as a shocker for many in the film industry. Divya garnered a lot of popularity in India in the 90s and she gained a solid position in the industry with back to back successes in Hindi and Telugu films.\nShe is still fondly remembered for her song Saat Samundar Paar from Vishwatma (1992) that went on to become a big hit.\nEven though she lived briefly and did just 14 films between 1992 and 1993, her contribution is still acknowledged and remembered. Today, on her 26th death anniversary, Actor Sanjay Kapoor took to social media to share a post about late actor Divya Bharti.\nWhat looks like a shot is from their film Kartavya (1995), Divya had almost shot 30% of the film before her unfortunate death. The role later went to Juhi Chawla's kitty.\nTwitter\nSharing a picture with Divya, he wrote, “You will always be missed, #april5th #1993 #26thdeathanniversary #divyabharti.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nDivya Bharti was just 19 when she succumbed to her injuries after an accidental fall in Mumbai. She was reportedly at a house party when she fell from the fifth floor and passed away.\nShe was married to producer Sajid Nadiadwala when this unfortunate instance happened.", "title": "On Divya Bharti’s 26th Death Anniversary, Sanjay Kapoor Shares A Sweet Post Remembering Her", "date_publish": "05/04/2019, 15:41:51", "description": "Actress Divya Bharti's untimely death came as a shocker for many in the film industry. Divya garnered a lot of popularity in India in the 90s and she gained a solid position in the industry with back to back successes in Hindi and Telugu films. Actress Divya Bharti's untimely death came as a shocker for many in the film industry. Divya garnered a lot of popularity in India in the 90s.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/on-divya-bharti-s-26th-death-anniversary-sanjay-kapoor-shares-a-sweet-post-remembering-her-364940.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/divya_bharti_1554460467_800x420.jpg"}