{"text": "On Smita Patil's 63rd Birth Anniversary, 11 Facts Which Prove That She Is A Forgotten Legend\nOn Smita Patil's 63rd Birth Anniversary, 11 Facts Which Prove That She Is A Forgotten Legend\nShe was fearless, bold and one of the finest actresses of her time. She set a precedent for all her fellow actresses and the way the audience looked at the Hindi film industry. Getting parallel cinema on board and in sync with the viewers was kickstarted by this phenomenal actress.\nShe is none other than Smita Patil. The legend who chose to let go off main stream cinema and release fresh leash of movies in Hindi film industry.\nRemembering the beauty, Bollywood actress Madhuri Dixit tweeted about her legendary performances.\nRemembering #SmitaPatil ji on her birth anniversary! Her legendary performance in films like Manthan & Mirch Masala are unforgettable ❤✨ — Madhuri Dixit Nene (@MadhuriDixit) October 17, 2018\nHere's taking a look at 11 stunning pictures and rare facts of Smita Patil that will take you back into the 80s era. Take a look.\n1. Smita Patil was a star of the 80s and always took the road less taken. She was known for strong woman oriented roles\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n2. From a TV announcer in DD to a leading actress in Bollywood, Smita Patil was the youngest film artist to be honoured with Padmashri\n3. The evergreen actress broke stereotypes with the roles that she chose with Bhumika, Umbartha and Bazaar\n4. Apart from acting, Patil was an active feminist and a member of the Women's Centre in Mumbai. She was deeply committed to the advancement of women's issues\nTwitter\n5. Not many know that 10 of her movies released after her unexpected death due to child birth complications in 1986.\nSmita Patil FC\n6. After working in off-beat cinema for 5 years, she was gradually accepted in commercial cinema. She was paired with Rajesh Khanna which became a hit jodi of its time. They went onto feature in films like Aakhir Kyon?, Anokha Rishta, Angaarey, Nazrana, Amrit.\n7. Her greatest performance came when she played Sonbai in Mirchi Masala which also happened to be her last. Infact, on the centenary of Indian cinema in April 2013, Forbes included her performance in the film on its list, \"25 Greatest Acting Performances of Indian Cinema\nLatestly\n8. Alumna of FTII - Pune, 2 National awards, 1 Filmfare award and a bunch of brilliant movies behind her - Smita was dazzling in parallel as well as commercial cinema in her prime. In 2011, Rediff.com listed her as the second-greatest actress of all time, behind Nargis\n9. If you have been a big fan of Smita Patil' unmatchable dusky beauty and brilliant choice of cinema, then you must get hold of some of her most notable roles that include Manthan (1977), Bhumika (1977), Aakrosh (1980), Chakra (1981), Chidambaram (1985) and Mirch Masala (1985).\n10. Patil married Raj Babbar, who was then married to Nadira Babbar. As per her sister Manya Patil, Smita regretted the decision of marrying a married man and felt the decision was not right.\nTwitter\n11. Smita loved kids and wanted to have her child soon after marriage. Unfortunately, she passed away barely two weeks after giving birth to her son, Prateik Babbar. Pateik later went onto become an actor as well and made a debut in 2008.\nAs we wish remember Smita on her birthday, son Prateik wished his late mother on Instagram.", "title": "On Smita Patil's 63rd Birth Anniversary, 11 Facts Which Prove That She Is A Forgotten Legend", "date_publish": "17/10/2018, 18:33:42", "description": "Captivating the audiences, she set a benchmark with her screen presence and realist powerful performances in some of the landmark films in Indian cinema. Most of her characters inspired women and claimed their position and role in society. Here's taking a look at 11 stunning pictures and rare facts of Smita Patil that will take you back into the 80s era. Take a look.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/on-smita-patil-s-63rd-birth-anniversary-11-facts-which-prove-that-she-is-a-forgotten-legend-354936.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/smita_1539759650_800x420.jpg"}