{"text": "On Their 88th Anniversary Of Martyrdom, Celebs Pay Tribute To Bhagat Singh, Rajguru & Sukhdev\nOn Their 88th Anniversary Of Martyrdom, Celebs Pay Tribute To Bhagat Singh, Rajguru & Sukhdev\n“Inquilab Zindabad!” – It’s been more than eight decades since the slogan was first raised but it is still afresh in the minds of people.\nTwitter\nOn March 23, 1931, three bravehearts of the nation Bhagat Singh, Rajguru and Sukhdev sacrificed their lives fighting for the freedom of India from the colonial rulers. They were hanged to death by the British Police Officer John Saunders. As people celebrate the Shaheed Day today, they remember and pay tribute to the martyrs and make sure that their sacrifice doesn’t go unnoticed.\nTwitter is flooded with tributes paid to the three bravehearts. Among other people, Bollywood stars also remembered Bhagat Singh, Rajguru and Sukhdev. From Diljit Dosanjh to Pankaj Tripathi, here’s how everyone paid homages to the freedom fighters.\nKot Kot Parnam Shaheeda nu🙏🙏\nSardar Bhagat Singh, Rajguru, Sukhdev 🙏 pic.twitter.com/IFZCVLHx1R — DILJIT DOSANJH (@diljitdosanjh) March 23, 2019\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n“I’m such a lunatic that I’m free even in the jail.”\n-Bhagat Singh\n#ShahidDivas — Ayushmann Khurrana (@ayushmannk) March 23, 2019\n\"They may kill me but they cannot kill my ideas\"\n23 मार्च। पता नही क्यो लेकिन आज का दिन बेहद ही गर्व और आत्मविश्वास पैदा करता है। भगत सिंह, सुखदेव और राजगुरु के शहादत से बेहतर 'ज़िन्दगी' और 'ज़िन्दगी के लक्ष्य' को और कौन परिभाषित कर सकता है?\nकृतज्ञ नमन!! — पंकज त्रिपाठी/Pankaj Tripathi (@TripathiiPankaj) March 23, 2019\nWe bow our heads with respect, tributes, remembrances & homage for the ultimate sacrifices for Bharat Mata of the courageous martyrs #BhagatSingh, #Sukhdev #Rajguru.\nBharat Mata ki Jai!#InquilabZindabad#ShaheediDiwas23rdMarch — Shatrughan Sinha (@ShatruganSinha) March 23, 2019\nBhagat Singh, Shivaram Rajguru, and Sukhdev Thapar’s love for the nation and selfless fight for it continues to inspire us all.", "title": "On Their 88th Anniversary Of Martyrdom, Celebs Pay Tribute To Bhagat Singh, Rajguru & Sukhdev", "date_publish": "23/03/2019, 17:45:44", "description": "On March 23, 1931, three bravehearts of the nation Bhagat Singh, Rajguru and Sukhdev sacrificed their lives fighting for the freddom of India from the colonial rulers. They were hanged by death by the British Police Officer John Saunders. As people celebrate the Shaheed Day today, they remember and pay tribute to the martyrs and make sure that their sacrifice doesn’t go unnoticed.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/on-their-88th-anniversary-of-martyrdom-celebs-pay-tribute-to-bhagat-singh-rajguru-sukhdev-364194.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/on_their_88th_anniversary_of_martyrdom_celebs_pay_tribute_to_bhagat_singh_rajguru__sukhdev_1553342688_800x420.png"}