{"text": "On Their 1st Anniversary, Virat & Anushka Share A Beautiful Clip From The Dreamy Tuscan Wedding!\nOn Their 1st Anniversary, Virat & Anushka Share A Beautiful Clip From The Dreamy Tuscan Wedding!\nWhen love feels right, everything automatically falls into place. For Virat Kohli and Anushka Sharma, love has always felt right and this is just one of the reasons behind their rock-solid relationship as a couple.\nThe couple tied the knot in Tuscany, Italy last year and today they have completed a year of a blissful marriage.\nEven when they juggled between their professional and personal commitments, their marriage has never taken a backseat. Whenever they could squeeze some time out of their hectic schedule, they were seen spending quality time together.\n(Also read: Anushka Sharma Wishes Husband Virat Kohli In An Adorable Post, Thanks God For His Birth)\nInstagram/Anushka Sharma\nThe couple is filled with nostalgia of happy memories today on their wedding anniversary. They took to Instagram to re-live the day that changed their lives forever.\nVirat shared some beautiful photographs from their Hindu Wedding Ceremony. He captioned the pictures as:\n\"Can't believe it's been a year already because it feels like it happened just yesterday. Time has truly flown by. Happy anniversary to my best friend and my soulmate.Mine forever ❤ @anushkasharma \"\nInstagram/Virat Kohli\nInstagram/Virat Kohli\nDon't Miss 3.4 K SHARES 518 SHARES 235 SHARES\nInstagram/Virat Kohli\nInstagram/Virat Kohli\nAnushka expressed her feelings of being married to a 'good man' for a year by sharing a part of their wedding video. In the video, Virat gives a special 'thank you' speech to the love of his life.\nCongratulations, you two! To many more years filled with love and togetherness.", "title": "On Their 1st Anniversary, Virat & Anushka Share A Beautiful Clip From The Dreamy Tuscan Wedding!", "date_publish": "11/12/2018, 11:55:20", "description": "When love feels right, everything automatically falls into place. For Virat Kohli and Anushka Sharma, love has always felt right and this is just one of the reasons behind their rock-solid relationship as a couple. The couple tied the knot in Tuscany, Italy last year and today they have completed a year of a blissful marriage.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/on-their-1st-anniversary-virat-anushka-share-a-beautiful-clip-from-the-dreamy-tuscan-wedding-358317.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/virat_and_anushka_1544508106_800x420.jpg"}