{"text": "On World Cancer Day, Sonali Bendre Pens Down A Note On How To Stay Positive Amidst The Battle\nOn World Cancer Day, Sonali Bendre Pens Down A Note On How To Stay Positive Amidst The Battle\nNot all heroes wear capes and Sonali Bendre is one person who is inspiring millions every day. Her heroism lies in her endurance and strength to battle cancer. In July 2018, Bendre broke the devastating news of being detected with cancer. She took off to New York and stayed there for six months for her treatment.\nIn those six months, she documented her everyday struggles, small victories and joys on social media in notes on social media. Even though they were just words, they had the power to inspire and evoke the sense of fighting back in many.\nBe it the beginning of her chemotherapy, losing her hair or the pain of staying away from her loved ones, her journey broke our hearts but sewed the pieces back perfectly-thanks to her positivity to see the silver lining.\nIn December, she returned to Mumbai with husband Goldie Behl and even though her fight wasn't over, her smile expressed her will to fight back perfectly. Recently, she even shared the news of returning to work and facing the camera ‘after a major sabbatical’.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nToday, on world cancer day, she once again expressed herself on social media and shared a powerful note on how cancer needs- caution, awareness and wisdom.\nShe wrote,\nInstagram\n“And just the mere mention of the C word brings dread in the hearts of anyone who hears it. We fear it so much that we’d rather not talk about it... which is why it’s important to have a day where we pull out the band aid and help us deal with this disease.”\nShe added that she battled her fear and decided to fight back. She added,\n“I was scared too, but soon realised that burying my head in the sand was not the way to deal with this. And so... with the little experience I have had, I urge you all to take the time to understand it. There’s more to cancer than being emotional or weak or even being called a fighter or a survivor. It requires you to study it, find out what works for you and to be diligent about your treatment. It requires days of strongly believing in oneself, of knowing that tomorrow will be better than today. It is not a fight against negative thoughts. It’s taking a stand to not give in, no matter what. Most importantly, it is about living every day, and not just surviving.”", "title": "On World Cancer Day, Sonali Bendre Pens Down A Note On How To Stay Positive Amidst The Battle", "date_publish": "04/02/2019, 17:23:21", "description": "Be it the beginning of her chemotherapy, losing her hair or the pain of staying away from her loved ones, her journey broke our hearts but sewed the pieces back perfectly-thanks to her positivity to see the silver lining. This is a message you can't miss reading.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/on-world-cancer-day-sonali-bendre-pens-down-a-note-on-how-to-stay-positive-amidst-the-battle-361578.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sonali_bendre_1549281321_800x420.jpg"}