{"text": "On World Cancer Day, Ayushmann Khurrana's wife and filmmaker Tahira Kashyap posted a picture with a very important message. Tahira, who was diagnosed with breast cancer in September 2018 has been battling it with positivity and strength.\nToday, she shared a powerful note with an even more moving message that's a must read for everyone.\n'Bald' and beautiful Tahira posted a stunning back shot with bald head, bare back and a mastectomy scar. Ever since she started her journey towards recovery, she has been very vocal and expressive about her journey which definitely is very inspiring.\n(Also read: Bollywood Showers Love And Extends Support To Ayushmann's Wife Tahira Amidst Cancer Treatment)\nIn her note, Tahira wrote,\n“Today is my day! Wish you all a happy #worldcancerday and hope each one of us celebrates this day in an embracing way. That we remove any stigma or taboo associated with it. That we spread awareness about it and that we have self love no matter what,” she wrote in her post. I truly embrace all my scars as they are my badges of honour. There is nothing known as perfect. Happiness lies in truly accepting yourself. This was a tough one for me. But this picture was my decision as I want to celebrate not the disease but the spirit with which I endured.\"\nJust a few weeks ago, she had shared another powerful note about her journey. After she had to chop off her hair for her treatment, she showcased utmost strength and wrote:\nDon't Miss 122 SHARES 197 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"Hello, world! That's a new me with the old self! Was getting tired of the extensions. Well, this is how it is and it's so liberating, so much so that I don't have to duck the shower while bathing or while picking up the soap! Never thought I had to go bald, but this feels good.\"\nWhile we wallow in sadness and crib over smallest issues in life, Tahira's spirit to battle cancer is worth taking inspiration from. More power to her.", "title": "On World Cancer Day, Ayushmann's Wife Tahira's Powerful Note Is The Only Thing You Should Read", "date_publish": "04/02/2019, 15:21:09", "description": "Tahira, who was diagnosed with breast cancer in September 2018 has been battling it with positivity and strength. Today, she shared a powerful note with an even more power message that's a must read for everyone. 'Bald' and beautiful Tahira posted a stunning back shot with bald head, bare back and a mastectomy scar.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/on-world-cancer-day-ayushmann-s-wife-tahira-s-powerful-note-is-the-only-thing-you-should-read-361557.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/tahira_kashyap_1549274285_800x420.jpg"}