{"text": "One Of India's Most Eligible Bachelors, Prabhas Might Tie The Knot After Saaho's Release In 2019\nOne Of India's Most Eligible Bachelors, Prabhas Might Tie The Knot After Saaho's Release In 2019\nThe rumours around Prabhas' marriage have been doing the rounds since a long time now. Every year, there are several rumors that claimed how Prabhas might tie the knot soon. And now, according to recent reports, looks like Prabhas has made up his mind and may tie the knot in 2019 after the release of Saaho.\nTwitter\nA popular Hyderabad-based daily has quoted a source as saying,\nTwitter\n\"Actually, he wanted to settle down after Baahubali was completed and he even informed his family [about the same], but then Saaho happened. He had to put in a lot of effort and time in the film, so once again he postponed his marriage plans and will now think about it after Saaho is completed.\"\nWell, the reason why Prabhas has given a nod is exactly a problem that many of us 'singles' face. Reports claim that it was Prabhas's mom who is pressurising him to \"settle down\". Well, okay then!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "One Of India's Most Eligible Bachelors, Prabhas Might Tie The Knot After Saaho's Release In 2019", "date_publish": "26/10/2018, 17:58:59", "description": "\"Actually, he wanted to settle down after Baahubali was completed and he even informed his family [about the same], but then Saaho happened. He had to put in a lot of effort and time in the film, so once again he postponed his marriage plans and will now think about it after Saaho is completed.\" Well, the reason why Prabhas has given a nod is exactly a problem that many of us face. Reports claim t", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/one-of-india-s-most-eligible-bachelors-prabhas-might-tie-the-knot-after-saaho-s-release-in-2019_-355529.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/prabhas_1540557166_800x420.jpg"}