{"text": "We're all aware of the Censor Board of India that proof checks the content that goes on television and silver screen. Online channels were the only platform where influencers, filmmakers and users could post videos and not worry about being banned.\nTwitter/Netflix\nBut looks like self censorship of portals like Netflix and Prime has landed them up in trouble, The Delhi High Court on Wednesday sought the Centre's response on a plea for removal of vulgar and sexually explicit content from online platforms like Netflix, Amazon Prime Video and others.\nA bench of Chief Justice Rajendra Menon and Justice V. Kameswar Rao listed the matter for further hearing on February 8.\nDon't Miss 168 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nThe petition was filed by NGO, Justice for Rights. Advocate Harpreet S. Hora appearing for the NGO sought a law or guidelines for regulating such contents available on these platforms.\nScreengrab\nThe petitioner said online platforms offered vulgar, sexually explicit, pornographic, profane, virulent, religiously forbidden and morally unethical contents in order to attract more subscribers and generate profit.\nThe NGO alleged that most of the contents available was in violation of the Indian Penal Code and the Information Technology Act.\nInputs from IANS", "title": "Netflix And Prime Sued For Vulgar And Sexually Explicit Content, Petition Filed By NGO", "date_publish": "14/11/2018, 16:14:57", "description": "The Delhi High Court on Wednesday sought the Centre's response on a plea for removal of vulgar and sexually explicit content from online platforms like Netflix, Amazon Prime Video and others. A bench of Chief Justice Rajendra Menon and Justice V. Kameswar Rao listed the matter for further hearing on February 8.", "authors": [], "url": "https://www.indiatimes.com/entertainment/online-portals-netflix-and-prime-sued-for-vulgar-and-sexually-explicit-content-petition-filed-by-ngo-356674.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/netflix_amazon_prime_sued_for_obscene_content_1542194485_800x420.jpg"}