{"text": "“My go to pick-up line is Hard-dick. It’s an ice breaker”\n“It’s not talking. It’s just watching. I like to watch and observe how they (women) move. I’m little from the black side so I need to see how they move”\n“Aaj mai kar ke aya”\nHardik Pandya made a lot of objectionable comments on Koffee With Karan. The chat show indeed changed his life. It has almost been a month since the episode aired, but there seems to be no end to the trouble that Hardik Pandya and KL Rahul are facing. What happened on the show will haunt him forever, it seems.\nAlso Read: Controversy Isn't Over Yet! Case Registered Against Hardik Pandya, KL Rahul & Karan Johar In Jodhpur\nAfter being suspended, he made a comeback to the world of cricket, but people have not been able to move on, it seems.\nAt T20 international between India and New Zealand on Feb 8, a girl trolled Hardik Pandya by holding a banner that read, “Pandya Aaj Karke Aaya Kya?”\nIs she is a Fan or Hater of Pandya ? pic.twitter.com/P3vGD7rSXV — Tanitalks (@Tanitalks1) February 8, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nBecause of the fact that Hardik Pandya conceded 36 runs in four overs without any wickets in the match, this picture has caught the fancy of fans even more.\nAlso Read: Hardik Pandya Wasn’t The Only One! 11 Times Celebs Made Sexist & Misogynistic Remarks On Koffee With Karan", "title": "Online To Real Life! Girl Trolls Hardik Pandya With ‘Aaj Karke Aaya Kya?’ Banner During Match", "date_publish": "09/02/2019, 13:16:49", "description": "Hardik Pandya made a lot of objectionable comments on Koffee With Karan. After being suspended, he made a comeback to the world of cricket, but people have not been able to move on, it seems. At T20 international between India and New Zealand on Feb 8, a girl trolled Hardik Pandya by holding a banner that read, “Pandya Aaj Karke Aaya Kya?”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/online-to-real-life-girl-trolls-hardik-pandya-with-aaj-karke-aaya-kya-banner-during-match-361839.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/girl_trolls_hardik_pandya_during_cricket_match_with_pandya_aaj_karke_aaya_kya_banner_1549697331_800x420.png"}