{"text": "Rock band Queen is all set to perform at the upcoming 91st Academy Awards ceremony, with Adam Lambert on vocals. The reports were confirmed when the Motion Picture Academy made the announcement on social media on Monday, reports variety.com.\nAgencies\nThe move comes in the wake of the blockbuster success of the film Bohemian Rhapsody, the biopic about the band and its late singer, Freddie Mercury. The film is nominated for five Academy Awards including Best Picture.\nAgencies\nThe band now performs under the name Queen + Adam Lambert, with two of the four original members - guitarist Brian May and drummer Roger Taylor - fronted by former \"American Idol\" star Lambert, who has won critical applause in his role as the group's front-man over the past few years. Bassist John Deacon has not performed with Queen for many years.\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nAgencies\nThe telecast producers were known to have reached out to representatives for the film and the band early in the planning process to try to procure Queen for the opening slot of the show.\nThe 91st Academy Awards will be held on February 24 and will also air in India on Star Movies.\n(With IANS inputs)", "title": "Oscars 2019: Iconic band Queen All Set To Perform Live At The Academy Awards", "date_publish": "19/02/2019, 11:48:06", "description": "Rock band Queen is all set to perform at the upcoming 91st Academy Awards ceremony, with Adam Lambert on vocals. The reports were confirmed when the Motion Picture Academy made the announcement on social media on Monday, reports variety.com.The move comes in the wake of the blockbuster success of \"Bohemian Rhapsody\", the biopic about the band and its late singer, Freddie Mercury. The film is nomin", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/oscars-2019-iconic-band-queen-all-set-to-perform-live-at-the-academy-awards-362390.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/queen_1550557488_800x420.jpg"}