{"text": "Oscars are the most anticipated ceremonies in the world of films across the globe. They are the most looked upto award functions for filmmakers and actors and rightly so. The 91st Academy awards was interesting in a lot of ways. This was the first ceremony in three decades, since the 61st Academy Awards in 1989, to be conducted with no host.\nFrom the moments the nominations were announced in January, this year's awards were poised to be a battle between Bohemian Rhapsody, A Star Is Born and Green Book. In the end, Peter Farelly's Green Book emerged victorious.\nBased on the true life, the movie is about a Afro-American pianist who embarks on a concert with Italian-American driver. Taking the award, the cast was speechless and gave the most heartwarming speech.\nDon't Miss 153 SHARES\nTwitter, which was already predicting the winner for the best picture, have been congratulating the entire team of the film. The rest of the evening focussed on an electrifying performance by the Queen followed by Lady Gaga and Bradley Cooper's Shallow performance.\nThe awards took place at the Dolby Theatre in Hollywood, Los Angeles, California.", "title": "Oscars 2019: Green Book Takes Home Best Picture Award Beating A Star Is Born & Bohemian Rhapsody", "date_publish": "25/02/2019, 14:31:21", "description": "Oscars 2019: Green Book Takes Home Best Picture Award Beating A Star Is Born & Bohemian RhapsodyOscars 2019: Green Book Takes Home Best Picture Award Beating A Star Is Born & Bohemian RhapsodyOscars 2019: Green Book Takes Home Best Picture Award Beating A Star Is Born & Bohemian RhapsodyOscars 2019: Green Book Takes Home Best Picture Award Beating A Star Is Born & Bohemian RhapsodyOscars 2019: Gre", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/oscars-2019-green-book-takes-home-best-picture-award-beating-a-star-is-born-bohemian-rhapsody-362698.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscars_1551000016_800x420.png"}