{"text": "Oscar-Nominated Director Discusses His Struggles To Get A Censor Certificate For His Next Film\nOscar-Nominated Director Discusses His Struggles To Get A Censor Certificate For His Next Film\nNational Award-winning director Ashvin Kumar who received an Oscar nomination for the short film \"Little Terrorist\" is now fighting a fresh battle.\nThe filmmaker is still struggling to get U/A certificate for his next movie \"No Fathers In Kashmir\".\n\"After an inordinate delay of nearly 90 days and no clarity on what the CBFC (Central Board of Film Certification) was finding objectionable or why it took them so long to watch the film in the first place, finally, when CBFC came up with a list of cuts, we objected as the cuts proposed were based neither on reality nor on law,\" Kumar said in a statement.\n\"The A certificate violates the fundamental rights of our core audience of youth, denying them a chance to know what is happening in their country, in their own name.\ntwitter\nIt denies the possibility of dialogue between the youth of Kashmir and that of the rest of India. It is only through dialogue that any peaceful solution can be found. And it is only through telling the truth that a dialogue is possible in the first place, he said.\n\"Our film has no sex, no violence, no nudity, no vulgarity, no drugs,\" he added.\n\"No Fathers in Kashmir\" is a love story between two 16-year-olds whose fathers have disappeared in Kashmir with no certainty of their return.\ntwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"We went to FCAT (Film Certification Appellate Tribunal) for relief. They returned it to the CBFC as the latter did not give us a legally-mandated hearing. This is indicative of the CBFC's poor grasp of its mandate and legalities. It does not take so long to give a censor certificate and we still have no idea when we will get it,\" said the director.\n\"We have gone from two hearings in Mumbai to one in Delhi and now back to Mumbai and again back to Delhi, he added. Ashvin asserted that the film tries to show Kashmir with empathy and compassion.\nInputs From IANS", "title": "Oscar-Nominated Director Discusses His Struggles To Get A Censor Certificate For His Film!", "date_publish": "29/12/2018, 15:02:05", "description": "National Award-winning director Ashvin Kumar who received an Oscar nomination for the short film \"Little Terrorist\" is now fighting a fresh battle. The filmmaker is still struggling to get U/A certificate for his next movie \"No Fathers In Kashmir\". Read more.", "authors": [], "url": "https://www.indiatimes.com/entertainment/oscar-nominated-director-discusses-his-struggles-to-get-a-censor-certificate-for-his-next-film-359475.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/no_fathers_in_kashmir_1546077080_800x420.jpg"}