{"text": "Pankaj Tripathi Knows Stardom Is Not Permanent, Says He’s Aware That Every Actor Is Replaceable\nPankaj Tripathi Knows Stardom Is Not Permanent, Says He’s Aware That Every Actor Is Replaceable\nWith just one film, Pankaj Tripathi proved his mettle as an actor. With Gangs of Wasseypur, many actors including Nawazuddin Siddiqui came to the forefront. Pankaj Tripathi, since then, has given stella performances one after the other. He is a star, for sure, but he says, he is aware of the fact that stardom is not permanent.\n\"After sometime there will another Pankaj Tripathi\", says the award winning actor, admitting he is aware that every actor in the film industry today is replaceable.\nTripathi has made a significant mark in the past few years after a long struggle before the glory. He shot to fame with Anurag Kashyap's 2012 gangster drama Gangs of Wasseypur but before that he slogged for years and kept working hard, till the industry took notice of his talent.\nBCCL\nReflecting on his early days, Tripathi, a student of NSD, told PTI, \"I was not worried much back then. Now, when I am successful I am not arrogant, I am not flying high. I know that I am popular now and there is stardom but it is not at all permanent.\n\"I know after sometime there will another Pankaj Tripathi. My success might fade away as they will find a new name. I was not worried then, I am not worried now.\" The actor believes in staying happy in the moment. \"I live in the present,\" he adds.\nTripathi is glad he is getting to play such varied roles -- an upright CRPF officer Atma Singh in Newton, Narottam Mishra in Bareilly Ki Barfi to Rudra Bhaiya in latest hit Stree.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"Whatever is happening with me is unexpected. I came here for survival and I was hoping that I would be able to run my house by acting in films. Things are better today. I have increased my fee as well. But I work on my conditions. As a person, I am still grounded and humble,\" he says.\nBCCL\nTripathi is excited for Satish Kaushik's \"Kaagaz\", based on the life of Bharat Lal aka Lal Bihari from Azamgarh, who fought a legal battle for 18 years to prove that he is alive. He has been shooting for the biographical drama, in which he plays the lead role. The actor says while his hands are full with meaty roles currently, he wishes to concentrate on one project at a time.\n\"Today, I want to do one film at a time. There is too much load that I am not taking up or signing any new film. I am already booked till next year September. My dates are full. I am getting lot of good scripts but my dates are full so I am unable to say yes to them. I had never imagined that after coming to Mumbai that as an actor my dates would be booked in six-eight months in advance. I had never imagined all this to happen.\"\nHe understands, playing the lead role in a film is a huge responsibility but according to him, it is also an opportunity to showcase his talent.\nTripathi, who doesn't believe in the term character artiste, says, \"Heroes are also playing characters. Today, audience have a platform to give their opinion not just about the film but about the actor or supporting actors. I am happy people have given me so much love in the films that I have done, where I was not in the lead.\"\nTwitter\nThe multi-faceted actor struggled for over a decade before establishing himself in Bollywood. He says he is reaping the benefit of his hardwork today.\n\"All this is because of my hard work. Today, I understand that hard work always pays off, good artiste are always worshipped. Earlier, supporting actors were not getting that much recognition and respect but that is not the case today.\"\nHis other projects include Shakeela biopic, web-series Mirzapur, Hrithik Roshan's Super 30, Luka Chupi, Abhi Toh Party Shuru Hui Hai.\n\"I also have 'Panga' with Ashwiny Iyer Tiwari. She is a friend and we have decided that I will always act in her films. I don't know what role I have in this film but I have to keep aside a week to ten days.\"\nThe actor has worked with Tiwari on both her films Nil Battey Sannata and Bareilly Ki Barfi, said.\nWith inputs from PTI", "title": "Pankaj Tripathi Knows Stardom Is Not Permanent, Says He’s Aware That Every Actor Is Replaceable", "date_publish": "18/11/2018, 15:21:44", "description": "\"After sometime there will another Pankaj Tripathi\", says the award winning actor, admitting he is aware that every actor in the film industry today is replaceable. Tripathi has made a significant mark in the past few years after a long struggle before the glory. He shot to fame with Anurag Kashyap's 2012 gangster drama \"Gangs of Wasseypur\" but before that he slogged for years.", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/pankaj-tripathi-knows-stardom-is-not-permanent-says-he-s-aware-that-every-actor-is-replaceable-356896.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pankaj_tripathi_1542532817_800x420.jpg"}