{"text": "Pankaj Tripathi is an exceptional actor who can transform into any character he plays, leaving the audiences spellbound. His latest web series Mirzapur has the world buzzing. He plays a godfather in the show and totally nails it.\nIndiatimes had an exclusive interaction with the ace actor, where we spoke to him about life after Mirzapur, success, failure, critics, nepotism and lot more.\nTwitter\nHe had no idea Mirzapur would become so big\nWhen we asked Pankaj if he ever thought Mirzapur would become so big, he honestly replied, “ I never thought that it will be so big. In fact, I had no idea about digital and never watch anything on it. I haven’t even watched Mirzapur and Sacred Games. I don’t get time to watch the shows, I am super tied up with work, but I like it when I hear and read appreciation from people.”\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHaving the time of his life\nPankaj says he is having the best time and he is enjoying every minute of it, “It’s the best time as I love to act. It’s my passion, I never get bored to be on sets, I love to play different characters, I can do it all my life without getting bored. I try to make myself better every day and practice makes you perfect. I like to be perfect with my every film or web series.”\nTwitter\nCherish My Struggling Days\nTalking about his days as a struggling actor, he says he cherishes them, and never thought it was a bad phase. “It was a very difficult phase but now I am in a good space. When you swim in the river, there are lots of waves you have to cross, but you should be determined. If I would have given up then, I wouldn’t get what I got today. For me, the journey is very important, and I have enjoyed all phases of my life – both good or bad, I have no complaints.”\nTwitter\nSuccess Is Not Permanent\nThe actor even admits he is very much aware that success is ephemeral and he has no fear of losing it, “I have learnt that I don’t want to hold success, because when you try to hold it you lose it. Why should I do it? I knew that success and failure will come and go. At the end of the day, being happy is important. Why should I fear losing success? One should be fearful only of losing relationships because you need to cherish them for life. This has been huge learning for me.”\nTwitter\nNepotism Exists, But That’s Not My Race\nTalking about nepotism in Bollywood, he said he is least bothered about it because he never came here to be launched, “I never came here to make a debut. I just came to get work, I never excepted a big launch. I am here to run a marathon, I have no concerns with who is doing what. And no matter how big a launch you get, only your talent will help you survive. Yes, people will definitely recognise you, but your talent will take you places. Today, films with big stars don’t work, because our audiences want to see good cinema, good work.”\nAccept Criticism\nIt’s near impossible to criticise Pankaj as an actor, but if he faces any he accepts it with open heart, “I listen to my critics because that will only make you better.”\nTwitter\nIt was Time for the #MeToo Movement In The Industry\nIn 2018, we saw the #MeToo Movement in Bollywood, which left many shocked and surprised. Speaking about his learning form the movement, Pankaj said, “Firstly, I liked how so many women were coming and talking about the injustice that happened to them. They deserve equal rights in society, and unfortunately, they have to fight for that. I want them to make their voice even stronger. Also, I was very proud of myself that I never did anything like this in my life. I really support this movement. But, I am also concerned that some women shouldn’t use this as a platform to vent their personal grudges without any provocation, because that will be injustice.”\nHe further added, “I will give you my example. I was travelling somewhere, where a lady and a man showed me a picture of a boy with me and asked me if I recognised him. I said no, and they told me he claims to be your son. I was like I don’t even know him. I wondered what made the kid call me his father. I laughed over it and moved on. Maybe that kid said it innocently, but it was a matter of concern. I support #MeToo Movement, but everyone deserves justice. As a society, we have always looked down our women, but it’s high time they should get what they deserve.”\nTwitter\nPankaj Tripathi is looking forward to 2019 with optimism and hope.", "title": "Pankaj Tripathi Talks About His Journey From Being Nobody To Becoming A Rising Star Actor In 2018", "date_publish": "26/12/2018, 14:56:52", "description": "Pankaj Tripathi is an exceptional actor who can transform into any character he plays, leaving the audiences spellbound. His latest web series Mirzapur has the world buzzing. He plays a godfather in the show and totally nails it. Indiatimes had an exclusive interaction with the ace actor, where we spoke to him about life after Mirzapur, success, failure, critics, nepotism and lot more.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/pankaj-tripathi-talks-about-his-journey-from-being-nobody-to-becoming-a-rising-star-actor-in-2018_-358840.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pankaj_tripathi_1545131167_800x420.jpg"}