{"text": "1. Pankaj Tripathi Scales New Heights, Bags His First Hollywood Film With Chris Hemsworth AKA Thor\nThe man is unstoppable. One of the finest actors in Bollywood today, Pankaj Tripathi has bagged his first Hollywood project too. Guess which Hollywood biggie is starring in it? Chris Hemsworth AKA Thor!\n2. Kangana Ranaut Slams Alia Bhatt, Calls Her Karan Johar's Puppet & Tells Her To Grow A Spine\n“I reached out to Alia and asked her what makes her think Manikarnika is my personal controversy, it’s a film whole nation is talking about and wondering why Bollywood is keeping quiet on such a relevant work...I suggested that she grows some spine and supports an important film about woman empowerment and nationalism...if she doesn’t have a voice of her own and her existence is all about being KJo's (Karan Johar) puppet then I don’t consider her successful...I told her if she is only focusing on earning bucks and not raise a voice, then her success has no value...,” she said.\n3. Fans Point Out That Jaime Lannister Is Wearing Robb Stark's Armour In New Pictures & We're Shook\nThe pictures gave a glimpse of all the characters of the show, and curious fans found something weird in that too. In Jaime Lannister’s pictures, ardent Game of Thrones fans noticed the similarity of his armour with that of Robb Stark’s armour. Robb Stark had died in season 3, so what does this hint?\n4. Kangana Ranaut Disses Bollywood Yet Again, Says Won’t Spare Anyone For Ganging Up Against Her!\nDon't Miss 153 SHARES 126 SHARES 336 SHARES 247 SHARES\n“What Bollywood is doing, the planning and plotting, one thing is for sure, earlier I used to call them out for sexism, nepotism or pay disparity, but now I'll be after them. 'Inki vaat laga dugi'. I'll expose each and every one. They have asked for trouble by ganging up against me.”\n5. Ranveer Singh’s Gully Boy Fever Hits DJ Diplo, Grammy Award Winner Says ‘Mera Time Bhi Ayega’\nInternational artist DJ Diplo is apparently awestruck with his line too. He recently uploaded a poster of Gully Boy and morphed his own picture instead of Ranveer Singh’s. “Random White Boy,” he wrote on it.", "title": "Pankaj Tripathi Bags Hollywood Film With Chris Hemsworth, Kangana Ranaut Slams Alia Bhatt & More From Ent", "date_publish": "08/02/2019, 18:23:24", "description": "From Pankaj Tripathi bagging his first hollywood movie alongside Chris Hemsworth to Kangana Ranaut slamming Bollywood yet again, here’s all that rocked the world of entertainment today. Calling Alia Bhatt a puppet of Karan Johar, Kangana Ranaut said that she has told her she is spineless.", "authors": [], "url": "https://www.indiatimes.com/entertainment/pankaj-tripathi-bags-hollywood-film-with-chris-hemsworth-kangana-ranaut-slams-alia-bhatt-more-from-ent-361814.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/pankaj_tripathi_bags_hollywood_film_with_chris_hemsworth_kangana_ranaut_slams_alia_bhatt__more_fro_1549627637_800x420.png"}