{"text": "Pankaj Tripathi is one actor who is not just loved for his acting calibre, but people love his sincerity and humility as well.\nIn his recent interview, Pankaj Tripathi expressed how he believes a doctor can save a dying man, but an artiste can do a lot more: heal a dying society by questioning the wrong and upholding the right. The actor says an artist’s work should never exist in vanity as while science makes life easier, arts give it a meaning.\n“In life, we have two segments: arts and science. We need science to make our lives easier. But what do we live for? We enjoy life through arts. So it’s an artistes duty to question the wrongs happening in the society. “To make a satire out of it. To make people aware through their art forms — writing, painting, acting, etc” Tripathi told PTI.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe reason for the emphasis on an artiste to do work which reflects current scenario is, Tripathi says, art has the power to make people better. “If every individual starts listening to poetry, watch plays and see paintings, they’ll become a better human. Art makes you a better human being and that reflects in society. Across the world, wherever good art has been created, that society has been in crisis.”\nमैं पढ़ता हूँ। किताबों को, समीक्षाओं को और आपके हर एक कॉमेंट्स को। प्रेरणा स्रोत हैं ये मेरे लिए।\nशुक्रिया माधाव मिश्रा को मिल रहे आपके प्यार के लिए। क्रिमिनल जस्टिस की पूरी टीम की तरफ से शुक्रिया आप सभी का। — पंकज त्रिपाठी/Pankaj Tripathi (@TripathiiPankaj) April 7, 2019\nThe actor says his choices of films — and more specifically his characters — always have a commentary to make. “I am an aware citizen so I want my characters to be aware too. They should be aware of what’s happening in the society and make a commentary. They’re not in a la la land.\n“Today we have films made on several topics. Stree is an entertaining film but it has strong commentary about women. I make sure I say something important without being preachy through all my performances.” The 42-year-old actor has been in the industry for nearly 15 years and has several critically-acclaimed performances to his credit. To make sure an actor never loses his edge, Tripathi says it is of utmost importance for one to be aware about the surroundings.\nTwitter\n“An actor must read a lot. Books not only make one a good actor, but also a better human being. Second, you must work on your senses. We don’t realise but we are losing the sense of sound slowly. When was the last time you registered listening to a flowing river or a chirping bird? “We are losing the essence of touch. An actor has to work on his senses. You just have to be present for this, be aware. In life, we create. In cinema, actors recreate and for this, your mind and body need to be in sync.”\n(With agency inputs)", "title": "Pankaj Tripathi Explains How Science Makes Life Easier But Art Makes It Worth Living", "date_publish": "16/04/2019, 18:32:32", "description": "“In life, we have two segments: arts and science. We need science to make our lives easier. But what do we live for? We enjoy life through arts. So it’s an artistes duty to question the wrongs happening in the society. “To make a satire out of it. To make people aware through their art forms — writing, painting, acting, etc” Tripathi told PTI.", "authors": [], "url": "https://www.indiatimes.com/entertainment/pankaj-tripathi-explains-how-science-makes-life-easier-but-art-makes-it-worth-living-365585.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/pankaj_tripathi_1555420161_800x420.jpg"}