{"text": "Radhika Madan, who started her acting career in TV and then made her smashing debut with Vishal Bhardwaj Pataakha, is now all set for her next film Mard Ko Dard Nahi Hota with Bhagyashree's son Abhimanyu Dassani.\nTwitter\nIndiatimes met Radhika for a quick interaction about her next film and lots more. While talking to us, Radhika had her chirpy mode on and happily answered all the questions. Looking adorable in a regular white tee paired with a sexy denim skirt, Radhika spoke her heart out with us.\nInstagram\nRadhika, who recently tasted success with Pataakha, feels she is fortunate to be in the current time of cinema,\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n“Today is the best time for us because there are people ready to experiment and there is work for everyone. Plus the audience have become smart, you cannot fool them, they will take your case, like Kangana started this nepotism debate. Ever since then, whichever star kid is coming is being grilled. Infact, I feel they will stop getting opportunities also, it doesn’t matter whosoever son or daughter you are, you will only survive with talent and that’s the best part.\nTwitter\nAlso today, every filmmaker is experimenting, like Vishal sir didn’t have the need to give me a chance he could have taken anybody and they would happily do it for him, but even he is trying something new, so it’s just the best phase for everyone, not only actresses. Today, the directors don’t want to make films on super hit formulas even they want to try new stuff”.\nTwitter\nWhen we quizzed Radhika how calm she kept herself while choosing her second film as she saw an overnight success with her debut film, to which she said she has seen success in her TV career before and it was crazy, \"You get overnight success in TV and not movies, in television if your show is on air, you are god, and I have seen that stardom which I never imagined in my TV times, I was like aise kaise ho sakta hai. Itni log dekhte hai kya TV serial. But that time someone had told me which stuck in my head, that person said, Radhika, you will be god till your show is on air, once it goes off air people will forget you in a month. I realised that success is temporary and I do not want to get trapped in my ego, so I don’t get trapped”.\nTwitter\nShe further added, \"I just want to be honest in whatever I do, I just don’t want to reach that phase where my ego comes or I become dishonest or plastic and that will start reflecting in my acting, I just want to be honest and that’s my only fear.”\nThe actress is strong headed and has made a right choice to not become egoistic with her success. More power to her.", "title": "'Pataakha' Actress Radhika Madan Admits Star Kids Are Being Grilled After Kangana Ranaut's Nepotism Debate", "date_publish": "19/03/2019, 17:44:04", "description": "Radhika Madan has made it on her she has no sugar daddy and belongs to no filmy family, she started her acting career in TV and then made her smashing debut with Vishal Bhardwaj Pataakha and now she is all set for her next film Mard Ko Dard Nahi Hota with Abhimanyu Dassani, a nepotism product. Indiatimes met Radhika for a quick interaction where she was in her full chirpy mood and happily answere", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/pataakha-actress-radhika-madan-admits-star-kids-are-being-grilled-after-kangana-ranaut-s-nepotism-debate-363972.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/radhika_madan_1553002063_800x420.jpg"}