{"text": "Tanushree Dutta kick-started a movement in India that has escalated to an extent that everyday, new names are joining the list of sexual predators in India. Many have called out people like Alok Nath, Rajat Kapoor and Sajid Khan to Vikas Bahl, Bhushan Kumar and Subhash Ghai, accusing them of sexually assaulting them at some point in their careers.\nJoining the list is Actress Payal Rohatgi, who has rekindled her allegations against director Dibakar Banerjee of sexual misconduct in 2011.\nAgencies\nTalking to Midday, she mentioned that despite her strong allegations against him, Banerjee continues to make movies in the last seven years. In fact, his next film is with YRF and starring in Sandeep Aur Pinky Faraar are Arjun Kapoor and Parineeti Chopra.\nAccusing Banerjee once again, Payal spoke to Mid-day and said,\n“Dibakar did six films after that. He doesn't look like a villain, but that doesn't take away from the fact that he used his sob story of a bad marriage to make a move. I didn't file an FIR against him because I was intimidated. In the wake of #MeToo, I hope things will be different. I don't know if YRF [Yash Raj Films, producer of Sandeep Aur Pinky Faraar] will take a stand. YRF knows about Dibakar.\"\nJust to jog your memory a little, years ago, Payal Rohatgi had accused Banerjee of trying to take advantage of her in lieu of offering her a role in one of his upcoming films. In her claims, she added how he told her to “lift my shirt and show him my stomach.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nPayal added how after accusing Dibakar, she failed to get any roles as “no one called me for an audition again.”\nShe added how she wanted to end the matter because she thinks she, her fiance and the entire family doesn't deserve to go through this turmoil again.", "title": "Payal Rohatgi Accuses Dibakar Banerjee Of Sexual Harassment, Urges YRF To Take A Stand!", "date_publish": "23/10/2018, 12:16:35", "description": "Accusing Banerjee once again, Payal spoke to Mid-day and said, “Dibakar did six films after that. He doesn't look like a villain, but that doesn't take away from the fact that he used his sob story of a bad marriage to make a move. I didn't file an FIR against him because I was intimidated. In the wake of #MeToo, I hope things will be different.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/payal-rohatgi-accuses-dibakar-banerjee-of-sexual-harassment-urges-yrf-to-take-a-stand-355268.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/payal_rohtagi_1540277396_800x420.jpg"}