{"text": "PC Lends Support To Fiance Nick Jonas Who Opened Up About Battling Diabetes Since The Age Of 13\nPC Lends Support To Fiance Nick Jonas Who Opened Up About Battling Diabetes Since The Age Of 13\n“You don't love someone because they're perfect, you love them in spite of the fact that they're not.\"\nThis saying fits in perfectly in Priyanka Chopra and Nick Jonas' love story. American singer and Priyanka Chopra's soon-to-be-husband Nick Jonas recently revealed that he was diagnosed with Type 1 diabetes at a very young age.\nIn his post, Nick didn't just mention his lifelong struggle with diabetes but also explained why one should never let anything hold you back from living your best life.\nFacebook/Nick Jonas\nNick shared his 'then and now' pictures and explained how he has a full control over his life now on day-to-day activities.\nIn his post, he wrote,\n\"13 years ago today I was diagnosed with type 1 diabetes. The picture on the left is me a few weeks after my diagnosis. Barely 100 pounds after having lost so much weight from my blood sugar being so high before going to the doctor where I would find out I was diabetic. On the right is me now. Happy and healthy. Prioritizing my physical health, working out and eating healthy and keeping my blood sugar in check.\"\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nHe also thanked his family and fans for the good wishes. He added,\n\"I have full control of my day to day life with this disease, and I'm so grateful to my family and loved ones who have helped me every step of the way. Never let anything hold you back from living your best life. Thank you to all my fans for your kind words and support. Means more than you know. Love you all. #grateful#diabetes #livebeyond#fbf.\"\nWhat was sweeter than the message he posted was how PC wrote the most beautiful thing on the post. She wrote,\nThe 26-year-old recently celebrated his super fun bachelor weekend with his gang of boys, including brothers Joe Jonas, Kevin Jonas and Franklin Jonas, brother-in-law Siddharth Chopra and close friend Jonathan M Tucker.\nAfter dating for five months, Nick popped the question and PC couldn't say no. The couple got engaged in Mumbai in August and reports claim that the two are looking forward to tying the knot in Jodhpur in December. The couple also obtained a marriage license in the United States recently.\n(Also read: Talking About Fiance PC, Nick Jonas Says Real Relationship Is All About Being Your Authentic Self)\n(With ANI inputs)", "title": "PC Lends Support To Fiance Nick Jonas Who Opened Up About Battling Diabetes Since The Age Of 13", "date_publish": "17/11/2018, 17:10:57", "description": "This saying fits in perfectly in Priyanka Chopra and Nick Jonas' love story. American singer and Priyanka Chopra's soon-to-be-husband Nick Jonas recently revealed that he was diagnosed with Type 1 diabetes at a very young age. In his post, Nick didn't just mention his lifelong struggle with diabetes but also explained why one should never let anything hold you back from living your best life.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pc-lends-support-to-fiance-nick-jonas-who-opened-up-about-battling-diabetes-since-the-age-of-13_-356862.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/nick_and_pc_1542455234_800x420.jpg"}