{"text": "After the music set up was done, the on-screen couple got comfortable as they started the Shallow duet. Why you might be suffering from a major FOMO for missing out this sort of experience, this video straight from L.A will make you feel covered\nThe jokes and memes around PC and Nick's endless wedding receptions weren't even over that now we have deets about their YET another reception. Nick Jonas' parents Denise and Paul Kevin Jonas hosted a wedding reception in the US and it was a fam-jam affair.\nIn the conversation, Esha’s friend called Iwobi a “gorilla” and said that “evolution stopped for him”. To that, Esha replied: “Haha... I don’t know why they don’t bench him more.” This “ignorance” didn't go down too well with people and they hit back, calling her out for being racist despite having claimed she herself has been a victim in the past.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThis fever is spreading like a wildfire and the new member in this josh club is Defence Minister Nirmala Sitharaman.\nSara Ali Khan is topping the favorite list of a lot of people and there are plenty of reasons behind her. Be it her Koffee debut with Daddy Saif Ali Khan where she won hearts with her mature take on her parents' separation or her take on how important it is for her to prove herself with every film-Sara has all the traits that make her one of the most likable newbies.", "title": "PC- Nick Host A Reception In U.S, Bradley Cooper Surprises Audience And More From Ent World", "date_publish": "28/01/2019, 18:02:58", "description": "Bradley Cooper And Lady Gaga Surprise Her L.A Concert Audience With An Impromptu Duet On 'Shallow' After the music set up was done, the on-screen couple got comfortable as they started the Shallow duet. Why you might be suffering from a major FOMO for missing out this sort of experience, this video straight from L.A will make you feel covered", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pc-nick-host-a-reception-in-u-s-bradley-cooper-surprises-audience-and-more-from-ent-world-361188.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_trending_1548678895_800x420.jpg"}