{"text": "One thing that has been consistent in all the promotional appearances that Ranveer has done is- He could not stop himself from talking about his 'Dharampatni Deepika'. Ranveer was promoting his film on a reality show when he divulged into the details of preparations for his wedding receptions. He shared a very interesting detail about the food menu and how the couple juggled between hogging and hitting the gym.\nBut, are wedding celebrations over yet? Seemingly not! Rumours are rife that just like Deepika-Ranveer, Priyanka-Nick are also planning to throw two wedding receptions in Mumbai. That’s clearly the new fad.\nDon't Miss 10.9 K SHARES\nRanveer said, \"The rationale behind that was pretty convincing. They rationalized saying how audiences are very emotional, they even draw lines between actors and stars. If they love a character, they will shower the love on who played the character and if they hate the character, that hate will come upon the actor.\"\nSo far, Rajkumar Hirani’s Sanju, which starred Ranbir Kapoor in the role of Sanjay Dutt, was the biggest blockbuster of the year at the global box office. The movie had hinted 586.85 crore. Next on the list was Sanjay Leela Bhansali’s Padmaavat, which starred Ranveer Singh and Deepika Padukone in lead roles, by earning Rs 585 crore at the worldwide box office.\nSo, this time Mika Singh was accused of sending inappropriate pictures to a 17-year-old Brazilian model. Following this, he was reportedly arrested in Dubai. He was taken to Abu Dhabi as the accused was a resident of the place.Amid all of this, Mika Singh, today, posted a video of him having a gala time in Dubai. In the video, he can be seen going into a jewellery store and clicking photos with fans. “Having a good time in Dubai,” he captioned the video.", "title": "PC-Nick To Host Two Receptions In Mumbai, Ranveer Shares Details Of His Reception And More From Ent", "date_publish": "12/12/2018, 17:43:13", "description": "One thing that has been consistent in all the promotional appearances that Ranveer has done is- He could not stop himself from talking about his 'Dharampatni Deepika'. Ranveer was promoting his film on a reality show when he divulged into the details of preparations for his wedding receptions. He shared a very interesting detail about the food menu and how the couple juggled between hogging and hi", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pc-nick-to-host-two-receptions-in-mumbai-ranveer-shares-details-of-his-reception-and-more-from-ent-358462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/deepveer_wedding_1544616954_800x420.jpg"}