{"text": "Celebrities surely know how to have larger than life celebrations. This year, a lot of celebrities tied the knot and endless jokes started with their endless number of receptions. We were not over Ranveer-Deepika's endless reception parties that now we have newly-weds PC-Nick giving them a tough competition.\nAgencies\nAfter hosting three grand receptions in India, PC-Nick is all set to host their fourth reception in Los Angeles in the last week of January.\nA Mid-day report has quoted a source as saying,\n“After their honeymoon in Switzerland, Priyanka will fly down to Mumbai for a schedule of The Sky Is Pink. She will join Nick in LA towards the month-end, to host a reception for their friends. Her team is currently doing a recce in Malibu and will soon finalise a venue. It will be a black-tie event, with Priyanka’s close friends Kerry Washington, Dwayne Johnson, Ellen DeGeneres, and Meghan, Duchess of Sussex, on the guest list. Many other Hollywood stars, including her co-stars from A Kid Like Jake and Isn’t It Romantic?, and Nick’s friends from the music fraternity are also expected. Besides her family, Priyanka’s cousin Parineeti Chopra is also likely to fly down for the soiree.”\nPriyanka Chopra and Nick Jonas solemnised their affair of six-months by tying the knot in a multiple-day wedding ceremony at the Umaid Bhawan in Jodhpur.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES", "title": "PC-Nick To Host A Grand Reception In L.A, Guest List Includes Meghan Markle-Dwayne Johnson", "date_publish": "22/12/2018, 11:46:09", "description": "We were not over Ranveer-Deepika's endless reception parties that now we have newly-weds PC-Nick giving them a tough competition. After hosting three grand receptions in India, PC-Nick are all set to host their fourth reception in Los Angeles in the last week of January.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pc-nick-to-host-a-grand-reception-in-l-a-guest-list-includes-meghan-markle-dwayne-johnson-359068.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_chopra_and_nick_jonas_1545459461_800x420.jpg"}