{"text": "People Have Found Peter Dinklage AKA Tyrion Lannister’s Look Alike In Pakistan & The Resemblance Is Striking\nPeople Have Found Peter Dinklage AKA Tyrion Lannister’s Look Alike In Pakistan & The Resemblance Is Striking\n“I am the god of tits and wine!” – when Peter Dinklage AKA Tyrion Lannister had said this line on Game of Thrones, he proved he was the king of sass. You’re probably living on some other planet, if you don’t like Tyrion Lannister. I mean, he's witty, he is powerful, he is never afraid to say the truth and he always has a great piece of advice.\nvia GIPHY\nBut we are not here to give you a brief on how awesome that character on Game of Thrones is. We want to introduce you to his doppelganger. Remember Imtiaz Ali had found Peter Dinklage’s look-alike in Kashmir? Now, another one has been spotted in Peshawar, Pakistan.\nAlso Read: Meet Tariq Mir, India's Very Own Tyrion Lannister, Who Was Spotted By Imitaz Ali In Kashmir\nThe man has reportedly been identified as Roza Khan. The resemblance is uncanny, right?\nWajahat Rauf, who is a director and producer from Pakistan also shared the picture. And he asked Peter Dinklage to acknowledge him too. Take a look!\nTyrion Lannister in Pakistan! @Peter_Dinklage Please say to him. His name is Roza Khan pic.twitter.com/KphpBrVo6Q — Wajahat Rauf (@wajahatrauf) February 12, 2019\nHere’s how fans reacted!\nfound Tyrion Lannister in Peshawar, Pakistan pic.twitter.com/dr5Y7QDisn — Farrukh (@AbyyLay) February 12, 2019\nDon't Miss 837 SHARES 2.4 K SHARES 763 SHARES 2.1 K SHARES 1.3 K SHARES\nGhareebon ka Tyrion Lannister — Ishfaq (@ItsIshfaq) February 12, 2019\nYou vs the guy she told you not to worry about.#peterdinklage pic.twitter.com/RjMmkYU22i — Pat_Han (@Pengestani) February 12, 2019\nHr cheez ki copy hai humare pass — Erish 🍁 (@erishsays) February 12, 2019\nHahaha meri khwahish hai isse milna — Imama (@imamayourmama) February 12, 2019\nHe is the spitting image of tyrion, amazing — Muhammad Sohail (@Sohailzzz) February 13, 2019\nHe was falsely accused of murdering his nephew, King Joffrey, so he ran to peshawar. 😂 Season 8 — Danish (@fictionalshad0w) February 12, 2019\nTyrion lannister escaped from kings landing and found in Rawalpindi 🔥 pic.twitter.com/jW5t9R4pOC — Gujjar Scaram (@gujjar_scaram22) February 13, 2019\nWow 😮 almost same — IMRAN JANJUA. (@imranjanjua338) February 12, 2019", "title": "People Have Found Peter Dinklage AKA Tyrion Lannister’s Look Alike In Pakistan & The Resemblance Is Striking", "date_publish": "14/02/2019, 14:12:07", "description": ". Remember Imtiaz Ali had found Peter Dinklage’s look-alike in Kashmir? Now, another one has been spotted in Peshawar, Pakistan. . Remember Imtiaz Ali had found Peter Dinklage’s look-alike in Kashmir? Now, another one has been spotted in Peshawar, Pakistan.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/people-have-found-peter-dinklage-aka-tyrion-lannister-s-look-alike-in-pakistan-the-resemblance-is-striking-362155.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/people_have_found_peter_dinklages_look_alike_in_pakistan__the_resemblance_is_striking_1550132958_800x420.png"}