{"text": "Veteran actress and BJP MP Hema Malini has condemned the terror attack on a Central Reserve Police Force (CRPF) convoy in Pulwama, Jammu and Kashmir. Expressing her opinion on the same, she said that she is confident that Prime Minister Narendra Modi will take a firm decision to curb anti-national activities in the Kashmir valley.\nWhen she was asked about the measures she expects from the Modi-led government after the terror attack, she said,\nAgencies\n\"I am sure that he will take a very firm decision. I am very happy that I am a Member of Parliament from Mathura under his regime as a Prime Minister. I know that he will be taking a very wonderful decision with respect to how to face these terror attacks.\"\nThe Maharashtra police on Saturday baton-charged a group of people who were protesting against the Pulwama terror attack at Nalasopara station in Palghar district of Maharashtra. Police had to resort to the lathi-charge in order to evacuate the rail tracks as attempts to talk to the protesting group had failed. Reacting to the incident, she added,\n\"I think people over here shouldn't show off that they really care for the nation. If they want to express their grief, then they should spend their time with the martyrs' families. I have also been associated with them in my constituency. There are many boys in my Mathura constituency who are sons of farmers, but they have sacrificed their lives for the country, so I know what their families go through in such scenarios. People should contribute financially towards their families instead of creating havoc here. What will they get by doing all this nonsense?\"\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nA lot of film-related events were cancelled in Mumbai as a mark of respect to the martyrs of the Pulwama attack, the show for \"Cakewalk\" went on. Defending the decision, she said,\n\"It is a very unfortunate, heinous and bad incident. I was also asking makers of the film over the phone calls whether we should host the film's screening or not but they told me that there are other events which are taking place and moreover, it was a pre-planned screening. So, it was difficult for them to shift it on another date. It is a joyous occasion for the makers of the film, but at the same time, it is really sad news for the entire country that our young soldiers have been killed in such a bad manner.\"\nShe concluded by saying,\nAgencies\n\"As an MP of Mathura, I know the fact that there are many soldiers from Mathura who have sacrificed their life for the country. There wasn't any soldier who belonged to Mathura who died in this attack but generally there are, so I always meet their families in their houses as I have the highest amount of respect and gratitude towards them.\"\n(With agency inputs)", "title": "People Should Contribute & Spend Time With The Families Of Martyred Soldiers, Says Hema Malini", "date_publish": "18/02/2019, 15:05:49", "description": "Veteran actress and BJP MP Hema Malini has condemned the terror attack on a Central Reserve Police Force (CRPF) convoy in Pulwama, Jammu and Kashmir. Expressing her opinion on the same, she said that she is confident that Prime Minister Narendra Modi will take a firm decision to curb anti-national activities in the Kashmir valley.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/people-should-contribute-spend-time-with-the-families-of-martyred-soldiers-says-hema-malini-362350.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/hema_malini_1550482779_800x420.jpg"}