{"text": "\"True love mein kuch na kuch siyappa toh ho hi jata hai..\"\nWell, we have seen over a million films revolving around the idea of love and how the characters struggle to find their happy ending but this time, there is something different that deserves our attention.\nWe have seen some brave films touching the topic of homosexuality but never in Bollywood did we see a mainstream film doing justice to it. Well, the change we wanted to see is finally here.\nThe trailer of Sonam Kapoor-Anil Kapoor-Rajkummar Rao-Juhi Chawla starrer 'Ek Ladki Ko Dekha Toh Aisa Laha' was out yesterday and people are overwhelmed.\nIn a first, we will see a family drama that will revolve around the topic that many filmmakers are scared of even touching.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe trailer showcases Sonam Kapoor as a typical Indian girl who dreams of “happily ever after”.\nHowever, after many twists and turns in her arranged marriage proposals, she finally is seen talking about her 'secret' that she is afraid of sharing.\nAs soon as the trailer was out, people started raving the team for touching the topic. The team was applauded and especially Sonam Kapoor, who has become one of the first few actresses who chose to experiment and take up a subject that many mainstream actors would have not taken up.\nVVC Films\nHere is how the Internet celebrated the trailer of ELKDTAL. Have a look.\nABSOLUTELY LOVED #EkLadkiKoDekhaTohAisaLaga trailer. Such a fresh concept and such an endearing cast. Totally looking forward to this one. — Dharmjeet Vaidya Namdev (@dharmvaidya) December 28, 2018\nSaw #EkLadkiKoDekhaTohAisaLaga trailer right now and am spellbound by the courage of the cast and crew for putting out this story so beautifully. #SonamKapoor #AnilKapoor #RajkumarRao — Vikram shah (@5Vikram7) December 28, 2018\nSonam Kapoor is playing a lesbian in #EkLadkiKoDekhaTohAisaLaga? Whoah. This is one brave choice! Nice. — I. (@ForeverFilmyy) December 27, 2018\nIt is only when India’s first mainstream lesbian Bollywood movie comes out #EkLadkiKoDekhaTohAisaLaga I chose to be single — bawang buruk (@harviedavie) December 28, 2018\n#EkLadkiKoDekhaTohAisaLaga Nice trailer. It's very rare to see Bollywood filmmakers & leading ladies especially to touch upon the concept of homosexuality. Kudos to @sonamakapoor for taking up this role 👍🏻 — Deeewaaanaaa! (@BeingAltaff) December 27, 2018\nWhoever came up with the idea of this movie to represent lqbtq+ community in India, youre a legend. This is the Movie of the year already thank you #EkLadkiKoDekhaTohAisaLaga — استر (@winterksj4) December 28, 2018\n@AnilKapoor @sonamakapoor truly looking forward to watching #EkLadkiKoDekhaTohAisaLaga I'm glad such topics are getting addressed even tho people try to hide them. father daughter duo have teamed up for show love has no gender.. it's all about falling in love pic.twitter.com/rE8giOHs1M — naina (@puppypowers25) December 28, 2018\n#EkLadkiKoDekhaTohAisaLaga Really proud of Bollywood to make a movie on a taboo topic and feel prouder of the comment section on YT, after seeing all these sensible comments. Really progressive 👍 — Gunjan (@Gunjanwitty) December 28, 2018\nI’m already going through a lot I didn’t need to see the #EkLadkiKoDekhaTohAisaLaga trailer. Not this week. Airport mein rona shuru. — Imaan Sheikh 🌈 (@sheikhimaan) December 27, 2018\ndesi gay culture is watching the #EkLadkiKoDekhaTohAisaLaga trailer on repeat and sobbing in your room alone — anisha (@flickerwarmth) December 28, 2018", "title": "People Praise 'Ek Ladki Ko Dekha Toh Aisa Laga' Team For FINALLY Making A Mainstream LGBT Film", "date_publish": "28/12/2018, 17:19:09", "description": "As soon as the trailer was out, people started raving the team for touching the topic. The team was applauded and especially Sonam Kapoor, who has become one of the first few actresses who chose to experiment and take up a subject that many mainstream actors would have not taken up.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/people-praise-ek-ladki-ko-dekha-toh-aisa-laga-team-for-finally-making-a-mainstream-lgbt-film-359438.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonam_1545998046_800x420.jpg"}