{"text": "Queen has been one of the most loved Indian movies. The Kangana Ranaut starrer influenced the lives of many in a positive way and taught many big lessons about life in general – like how a broken relationship can stop you from growing as a person and living the life you always wanted to live.\nIt was a beautiful film, indeed. But do you know that many people who read the script of the movie before it was made found it lame? Kangana Ranaut has recently revealed that the script of the Vikas Bahl directorial was considered lame earlier.\nAlso Read: After Tanushree Dutta, Kangana Ranaut Takes #MeToo Forward, Accuses ‘Queen’ Director Of Sexual Misconduct\n“Whoever read Queen’s script before, they said it was the most-lame script they’d ever seen,” she told Pinkvilla.\nAlso Read: Feeling ‘Underutilised’ After Queen, Kangana Ranaut Decided To Don The Director's Hat For Manikarnika\nDon't Miss 126 SHARES 1 K SHARES 336 SHARES 3.1 K SHARES\nMeanwhile, after blasting Bollywood for ganging up against her, Kangana Ranaut is planning to make a film on her own life, and it is said that she would be directing the movie herself too.\n“I am very excited and look forward to sharing what seems unbelievable even for me... My story is more magical than magic itself,” Kangana Ranaut was quoted as saying by IANS.\nAlso Read: Kangana Ranaut Slams Alia Bhatt, Calls Her Karan Johar's Puppet & Tells Her To Grow A Spine", "title": "People Didn’t Like Kangana’s Queen Initially, Called It The Most Lame Script They’d Ever Seen", "date_publish": "15/02/2019, 13:29:13", "description": "Kangana Ranaut's Queen was a beautiful film, indeed. But do you know that many people who read the script of the movie before it was made found it lame? Kangana Ranaut has recently revealed that the script of the Vikas Bahl directorial was considered lame earlier.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/people-didn-t-like-kangana-s-queen-initially-called-it-the-most-lame-script-they-d-ever-seen-362207.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/people_didnt_like_kangana_ranauts_queen_initially_thought_it_was_mostlame_script_theyd_ever_see_1550215848_800x420.png"}