{"text": "People Can’t Get Enough Of Taimur Doll! Sister Sara Ali Khan Gets It As A Gift & We’re Creeped Out\nPeople Can’t Get Enough Of Taimur Doll! Sister Sara Ali Khan Gets It As A Gift & We’re Creeped Out\nThe little one can’t live in peace. In the age, when he should be playing with toys, Taimur is exposed to the media glare. The paparazzi goes crazy following him almost everywhere and leaking his new pictures and videos.\nSomebody has made a doll that looks like Taimur and it’s selling on First Cry. Yeah, you can buy that too, for whatever reasons.\nAlso Read: Saif Ali Khan Is Stunned Seeing Taimur’s Doll, Feels He Should Trademark His Son's Name\nIt’s just getting crazy with every passing day. After the news of Taimur doll took us all by surprise, it apparently didn’t end there.\nWhen Taimur’s sister Sara Ali Khan appeared on Koffee With Karan, she talked about her little brother too. She is all set to make her debut in the industry with Sushant Singh Rajput starrer Kedarnath, and she is on a promotion spree.\nDon't Miss 234 SHARES 7.9 K SHARES 707 SHARES 12.5 K SHARES\nWhen she visited the sets of reality TV show Sa Re Ga Ma Pa 2018, she got a rather unique gift – a doll of her brother Taimur Ali Khan. That’s creepy, don’t you think?\nBeing the good sister that she is, Sara Ali Khan said, “I am glad people are benefiting from him. I only ask God for his safety and happiness in return,” and hugged the doll.\nBut what’s wrong with people?! Why make a Taimur Doll in the first place?", "title": "People Can’t Get Enough Of Taimur Doll! Sis Sara Ali Khan Gets It As A Gift & We’re Creeped Out", "date_publish": "28/11/2018, 14:38:08", "description": "When Sara Ali Khan visited the sets of reality TV show Sa Re Ga Ma Pa 2018, she got a rather unique gift – a doll of her brother Taimur Ali Khan. That’s creepy, don’t you think? Being the good sister that she is, Sara Ali Khan said, “I am glad people are benefiting from him. I only ask God for his safety and happiness in return,” and hugged the doll.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/people-can-t-get-enough-of-taimur-doll-sis-sara-ali-khan-gets-it-as-a-gift-we-re-creeped-out-357525.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sister_sara_ali_khan_gets_taimur_doll_as_gift_1543394171_800x420.png"}