{"text": "People Should Get A Chance Of Being Heard, Says Sushmita Sen On The Ongoing #MeToo Movement!\nPeople Should Get A Chance Of Being Heard, Says Sushmita Sen On The Ongoing #MeToo Movement!\nWhen it comes to taking a stand and rooting for social causes, no one does it better than Sushmita Sen. She doesn't hold back and expresses herself honestly. During a recent media interaction, Sushmita Sen was asked to give her take on #MeToo movement in India. Talking about the same, Sushmita said how everyone who is coming out with their story deserves to be heard. She said,\n“It’s just the beginning. We need to listen and believe. You have to understand the simple truth that when one person blames another, you may question it. But when 50 people blame the same person, there must be some truth to it. You should listen to people and give them a fair hearing; justice will prevail. Well done, women and men who are supporting the movement. It’s about time.”\nSushmita also added how proud she is as a woman to have witnessed this huge movement. She added,\nAgencies\n“I am very proud of everyone. And there’s no gender bias. I think the fact that people are standing up and expressing themselves is so powerful. I’ve gotten to see that in my lifetime, and it makes me very proud as a woman.\"\nRecently, Sushmita has been in news for her dating life. She is rumored to be dating Rohman Shawl. The actress has been spotted with Rohman on several occasions and that has sparked rumors of them dating.\nDon't Miss 343 SHARES 597 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nTwitter\nReports also hint that Rohman shares a very warm rapport with Sushmita's daughters as well.", "title": "People Should Get A Chance Of Being Heard, Says Sushmita Sen On The Ongoing #MeToo Movement!", "date_publish": "16/10/2018, 14:40:02", "description": "When it comes to taking a stand and rooting for social causes, no one does it better than Sushmita Sen. She doesn't hold back and expresses herself honestly. During a recent media interaction, Sushmita Sen was asked to give her take on #MeToo movement in India. Talking about the same, Sushmita expressed how everyone who is coming out with their story deserves to be heard.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/people-should-get-a-chance-of-being-heard-says-sushmita-sen-on-the-ongoing-metoo-movement-354885.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sushmita_sen_1539682046_800x420.jpg"}