{"text": "PETA Slams Priyanka Chopra-Nick Jonas, Trailer Of Simmba Is Out & More From Ent\nPETA Slams Priyanka Chopra-Nick Jonas, Trailer Of Simmba Is Out & More From Ent\nPETA India took to Twitter to slam the couple. With that, PETA also shared its video from four years ago, highlighting the woes of the animals, titled, 'Captive Elephants in Jaipur: PETA India's 2014 Inspection'.\n2. Old Wine In A New Bottle? Fans Think ‘Simmba’ Is A Recycled Version Of Dabangg & Singham!\nSimmba trailer looks like a mix of Dabangg and Singham, don’t you think? Well, people on social media think so.\n3. Sonali Bendre Returns To India With A Brave Smile, Says Battle With Cancer Is Not Over Yet\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 185 SHARES 544 SHARES\nThe diva is back in India. In the morning, Sonali Bendre landed in Mumbai along with husband Goldie Behl. Twinning in black, she had a glittering smile on her face as she walked hand-in-hand with him.\n4. Beyonce Recreates Deepika Padukone’s Iconic Cannes' Look & We Can’t Decide Who Pulled It Off Better\nWell, Queen Bey AKA Beyonce, who is busy promoting her recent album Everything Is Love, just recreated her look at Global Citizen Festival in South Africa.\nThe actress who will be seen in Sushant Singh Rajput starrer Kedarnath and Ranveer Singh starrer Simmba, recently sent out ‘thank you’ notes to the paparazzi. She was so touched by their warm and welcoming attitude towards her, even before her debut, that she wants to take them out for coffee.", "title": "PETA Slams Priyanka Chopra-Nick Jonas, Trailer Of Simmba Is Out & More From Ent", "date_publish": "03/12/2018, 18:57:20", "description": "Priyanka Chopra and Nick Jonas didn’t share their wedding pictures, but when people saw fireworks at Umaid Bhawan in the night sky, they knew the lovebirds have tied the knot. And soon after, with the congratulatory posts, a lot of people also lambasted Priyanka Chopra. What for? UNICEF goodwill ambassador who is also an asthmatic has been campaigning for cracker free Diwali. Fans called her out f", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/peta-slams-priyanka-chopra-nick-jonas-trailer-of-simmba-is-out-more-from-ent-357859.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/peta_slams_priyanka_chopranick_jonas_trailer_of_simmba_is_out__more_from_ent_1543843162_800x420.png"}