{"text": "Peter Dinklage Drops Major Spoiler About Tyrion's Fate In Game Of Thrones 8 & We Are Bummed Out Already!\nPeter Dinklage Drops Major Spoiler About Tyrion's Fate In Game Of Thrones 8 & We Are Bummed Out Already!\nHe is powerful, he is witty - He always gives a great piece of advice. He isn’t afraid to say the truth. He is the coolest character in Game of Thrones, isn’t he?\nTyrion Lannister is one of the most loved characters on Game of Thrones, and why wouldn’t he be? He may not fight during battles, but he is the brain behind all of them. He drinks wine and he knows things.\nvia GIPHY\nGame of Thrones is all about who dies and who survives. But can you ever imagine the death of Tyrion Lannister? I mean, his fans are already rooting for him to sit on the Iron Throne at the end of the show, and his death is something that no fan would even dare think in his/her wildest dreams. The day he dies, the show will somewhat lose its charm.\nAlso Read: Meet Tariq Mir, India's Very Own Tyrion Lannister, Who Was Spotted By Imitaz Ali In Kashmir\nTwitter\nPerhaps, that is the reason why the makers of Game of Thrones decided to give his character a tragic end in the final season. Yes, you read that right. Tyrion Lannister might just die in season 8, and hinting at the same is the man who plays this very role. Peter Dinklage himself has dropped a major spoiler about Tyrion Lannister’s death.\nvia GIPHY\n“I feel very, very — I’m trying to find the right word. I think he was given a very good conclusion. No matter what that is — death can be a great way out,” he told The Vulture.\nvia GIPHY\nAnd you were only worrying about Game of Thrones coming to an end! *sob sob*\nDon't Miss 161 SHARES 896 SHARES", "title": "Peter Dinklage Drops Major Spoiler About Tyrion's Fate In Game Of Thrones 8 & We Are Bummed Out Already!", "date_publish": "17/10/2018, 15:43:19", "description": "Tyrion Lannister might just die in season 8, and hinting on the same is the man who plays his role. Peter Dinklage himself has teased Tyrion Lannister’s death. And you were wondering what could be more sad than Game of Thrones coming to an end, right?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/peter-dinklage-drops-major-spoiler-about-tryion-s-fate-in-game-of-thrones-8-we-are-bummed-out-already-354953.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/peter_dinklage_teases_the_tragic_death_of_tyrion_lannister_in_game_of_thrones_season_8__we_are_cryi_1539769737_800x420.jpg"}