{"text": "Just a few days ago, actor Pankaj Tripathi shared his personal story of finally owning his dream home. In the interview, he bared his heart out and said that even though he now owns his dream house, but he still hasn’t forgotten about one-room shed which had a tin roof. Talking to IANS, he said,\n“Today, my wife Mridula and I own our dream house. But I haven't forgotten my one-room shed with its tin roof in Patna. One night, the rains and wind were so intense that one of the tin sheets blew away and I was left looking at the naked sky. It was our dream home, a love nest at the seaside. Now I've finally bought our dream house in Madh Island. My wife got very emotional after we shifted into our new home.”\nAnd now, we have pictures from the house-warming/grah pravesh puja shared by Pankaj's friends and they are precious for reasons more than one.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe pictures are a testimony to the fact that no dream is too small. Have a look at the pictures.\nfacebook\nFacebook\nFacebook\nThe joy of owning your own house with hard-earned money is priceless and these photos reflect his simplicity that surely will touch all his fans! No wonder he is one of the most respected and loved actors in the industry today!", "title": "Pictures From Puja At Pankaj Tripathi's New Sea-Facing Apartment Prove Dreams Do Come True!", "date_publish": "17/04/2019, 15:10:27", "description": "Just a few days ago, actor Pankaj Tripathi shared his personal story of finally owning his dream home. In the interview, he bared his heart out and said that even though he now owns his dream house, but he still hasn’t forgotten about one-room shed which had a tin roof.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pictures-from-puja-at-pankaj-tripathi-s-new-sea-facing-apartment-prove-dreams-do-come-true-365623.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/pankaj_tripathi_1555492227_800x420.jpg"}