{"text": "PM Modi Gifted PC-Nick The Exact Same Thing He Gave Virat-Anushka - Two Beautiful Red Roses!\nPM Modi Gifted PC-Nick The Exact Same Thing He Gave Virat-Anushka - Two Beautiful Red Roses!\nYes, Prime Minister Narendra Modi was there! After taking the social media by storm for releasing their wedding pictures, Priyanka Chopra and Nick Jonas, yesterday, threw a wedding reception in Delhi for politicians, businessmen and fashion designers among others. And guess who we spotted? Prime Minister Narendra Modi.\nNo, it’s not the first time that Modi has attended a Bollywood wedding reception. He was also seen at Virat Kohli and Anushka Sharma’s wedding reception, remember? He even made headlines for gifting the couple a pair of red roses.\nSo, this time, once again, Modi Ji was spotted at Priyanka Chopra and Nick Jonas’ wedding reception. No brownie points for guessing what he gifted the newly-weds – two beautiful red roses!\nMeanwhile, some people cannot get over the fact that PM Modi actually attended Priyanka Chopra and Nick Jonas’ wedding reception!\nDon't Miss 7.9 K SHARES 365 SHARES 161 SHARES 769 SHARES 182 SHARES\nWhy modi ji is starring priyanka's mom! pic.twitter.com/gCId1VCnN2 — S H I V A N I (@missbunnyteeth) December 4, 2018\nPriyanka: \"Thnx for d blessings, Modi Ji\"\nModi: \"Beti, Accha kiya Yogi ji ko invite nahi kiya, nahi toh kal se iska naam Nikhil Joshi hota\" #PriyankaNickWedding pic.twitter.com/cz00sHX6dr — Amar SP 🇮🇳 (@amarDgreat) December 5, 2018\nModi: Kabhi kabhi India aate rhna.\nPriyanka: Aap bhi.#silence — Faisal (@_thelunchbox_) December 5, 2018\nPriyanka “Diwali ke patakhe ban ho gaye accha hua sir hehe”\nModi “Agli baar stars ki shadiyo mein bhi ban karwa dunga haha”. 😂 pic.twitter.com/J7LcCWfpAj — Smoking Skills (@SmokingSkills_) December 5, 2018", "title": "Two Beautiful Red Roses", "date_publish": "05/12/2018, 13:21:02", "description": "Priyanka Chopra and Nick Jonas, yesterday, threw a wedding reception bash in Delhi for politicians, businessmen and fashion designers among others. And guess who we spotted? Prime Minister Narendra Modi. No, it’s not the first time that Modi has attended a Bollywood wedding reception. He was also seen at Virat Kohli and Anushka Sharma’s wedding reception, remember?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/pm-modi-gifted-pc-nick-the-exact-same-thing-he-gave-virat-anushka-two-beautiful-red-roses-357978.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pm_narendra_modi_gifted_pcnick_exactly_what_he_gifted_viratanushka_two_beautiful_red_roses_1543995160_800x420.png"}