{"text": "PM Modi’s Selfie With The Young Bollywood Brigade Gets Trolled, People Call Them ‘A Bunch Of Cowards’\nPM Modi’s Selfie With The Young Bollywood Brigade Gets Trolled, People Call Them ‘A Bunch Of Cowards’\nHailed as notable young icons of the Hindi film industry, Bollywood biggies including Alia Bhatt, Ranbir Kapoor, Ranveer Singh, Rajkummar Rao, Ayushmann Khurrana, Bhumi Pednekar, Karan Johar, Rohit Shetty, Ashwiny Iyer Tiwari, Varun Dhawan and Sidharth Malhotra landed in Delhi yesterday to meet the Prime Minister of the nation Narendra Modi.\nThis time the meeting included women figures from the industry too – that was indeed a cautionary measure considering how the meeting was criticised last time for lack of female representation.\nBut did this spare them from getting trolled? Not really!\nIt was an honour to join my fellow industry mates in this special discussion with our honourable prime minister @narendramodi ji. Thank you sir for this insightful meeting. pic.twitter.com/4c1xvsiwd4 — Rajkummar Rao (@RajkummarRao) January 10, 2019\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nJaadoo ki Jhappi! 🤗 Joy to meet the Honourable Prime Minister of our great nation 🇮🇳 @narendramodi pic.twitter.com/7OEz6hIOWP — Ranveer Singh (@RanveerOfficial) January 10, 2019\nGot the opportunity to meet the honourable PM Sh @narendramodi ji. Thanks for supporting our industry. Thanks @karanjohar and Mr Mahavir jain. pic.twitter.com/3SFamuNlHY — Ayushmann Khurrana (@ayushmannk) January 10, 2019\nIt was honour to meet our honourable prime minister @narendramodi ji with inspiring lovely https://t.co/WE9Jw5tLrU interaction that takes storytelling to new heights.Building a better society through entertainment.Thank-You for the GST change & space to connect thoughts. pic.twitter.com/3tRYR2yI6s — Ashwiny Iyer Tiwari (@Ashwinyiyer) January 10, 2019\nWas this PM’s “planned PR”? Well, that’s what Nafisa Ali said.\n\"Felt sad to see my Fraternity being part of PM’s planned PR ... I will pray that the truth is exposed and the closed door planning of divide & rule is understood . I worry for the Constitutional rights of every Indian . I was in Gujarat soon after the riots and will never forget the reality of what I saw . I pray for the Unity of India,\" she wrote.\nOdisha-born academician Professor Ashok Swain, who has often voiced his opinion on a range of different issues called them all a “bunch of cowards”.\nWhy Hollywood is Hollywood, and Bollywood is Bollywood? A bunch of cowards. https://t.co/DqL6WSLNfA — Ashok Swain (@ashoswai) January 10, 2019\nOthers on Twitter criticised the pictures too!\nModi has no tym to do debate with the reporters..\nBut he has tym to meet with these actors...\nCommon people's are facing problem by these people...\nN he supports them...\nShame 😨😰😔 on our @narendramodi.\nHe has to think to himself what he doing is right or wrong. — Md Akbar Noorie (@MdNoorie) January 10, 2019\nwah bollywood bhi politics main lga hai yhi din rh gye the dekhne ko..... — लौहे का आदमी (@ManofIron8) January 10, 2019\nNo vivek oberai 😂 — भाईसाहब (@Bhai_saheb) January 10, 2019\nA real actor knows exactly where the camera is #Modi https://t.co/LIlC727G1s — Hemanth Raj (@hemanthrj) January 11, 2019\nWas this really the selfie of the year?\nWell, it is being compared with Ellen Degeneres’ Oscar selfie that had went viral a few years ago.\nApparently, the meeting was arranged by Mahaveer Jain and Karan Johar. Thanking Modi in a post, here’s what Karan Johar wrote:\n“Powerful and timely conversations can bring about change and this was one of what we hope will become a regular conversation. Meeting the Honorable Prime Minister @narendramodi today was an incredible opportunity.\nAs a community, there is a huge interest to contribute to nation building. There is so much that we want to do. And can do and this dialogue was towards how and what ways we can do that. When the youngest country (in demography) joins hands with the largest movie industry in the world, we hope to be a force to reckon with. Together we would love to inspire and ignite positive changes to a transformative India.\nThe film industry would also like to send a huge thanks for the GST reduction in movie ticket prices that was implemented recently!\nThank you so much for your time, Sir!”", "title": "PM Modi’s Selfie With The Young Bollywood Brigade Gets Trolled, People Call Them ‘A Bunch Of Cowards’", "date_publish": "11/01/2019, 10:59:11", "description": "Hailed as notable young icons of the Hindi film industry, Bollywood biggies including Alia Bhatt, Ranbir Kapoor, Ranveer Singh, Rajkummar Rao, Ayushmann Khurrana, Bhumi Pednekar, Karan Johar, Rohit Shetty, Ashwiny Iyer Tiwari, Varun Dhawan and Sidharth Malhotra landed in Delhi yesterday to meet the prime minister of the nation Narendra Modi.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/pm-modi-s-selfie-with-the-young-bollywood-brigade-gets-trolled-people-call-them-a-bunch-of-cowards-360208.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/pm_modis_selfie_with_young_bollywood_icons_gets_trolled_people_call_them_a_bunch_of_cowards_1547186360_800x420.png"}