{"text": "PM Modi To Aishwarya Rai, Here Are The 7 Coolest Celebrity Selfies Of 2019 You Just Cannot Miss\nPM Modi To Aishwarya Rai, Here Are The 7 Coolest Celebrity Selfies Of 2019 You Just Cannot Miss\nOur Bollywood celebrities too are equally crazy for selfies, just like us. After all, who doesn’t like to capture their best moments and pretty faces? From ordinary people to mega stars, if you have a smart phone, you leave no stone unturned to click selfies with your friends and family.\nInstagram\nThis week, we saw some of the coolest selfies shared by our Bollywood celebrities. While some created a huge sensation on the internet some were trolled by the fans. Here's taking a look at the coolest selfies of our Bollywood stars from this week.\n1. Epic Selfie Of The Year\nTo begin with, this selfie is definitely epic; After all, we have all the young Bollywood brigade in one frame. Right from Ranbir Kapoor, Ranveer Singh, Ayushmaan Khurrana, Alia Bhatt, Rajkummar Rao to Vicky Kaushal are in this groupie along with PM Narendra Modi.\nDon't Miss 233 SHARES 185 SHARES 460 SHARES 870 SHARES 544 SHARES\nAs per reports, director Karan Johar had lined up a meeting with PM Modi and decided to take all the young talent with him to meet him and talk about their requirements for the Hindi Film Industry. This picture was called cool as there was female representation for a change but it was trolled equally bad by the fans on social media. Take a look.\nNo vivek oberai 😂 — भाईसाहब (@Bhai_saheb) January 10, 2019\n2. Favourite Boys In A Selfie\nInstagram\nThis one is my personal favourite as it has Ranbir Kapoor and Vicky Kaushal together. These two stars left us spellbound with their mind blowing performances in Sanju, especially Vicky, who was a surprise package in it. This film bought all the recognition for Vicky that he deserved. Fans are going gaga over their reunion.\n3. Best Honeymoon Selfie Award Goes To ....\nWhen we talk about best selfies, Baba has to be there. Apna Gully Boy Ranveer Singh is the king of selfies. He loves to get clicked anywhere and everywhere. The man who recently got married to the love of his love, Deepika Padukone went for his honeymoon in Sri Lanka. Before departing, the duo clicked a cool selfie with the fans. The husband and wife were as usual looking classy and sassy. This selfie was shared on Ranveer’s fan page and his fans went awing over it.\n4. Adorable Selfie Of The Year\nThis is one of the sweetest selfies. Aishwarya Bachchan shared this adorable picture with her two lifelines, hubby Abhishek Bachchan and their daughter Aaradhya. Aishwarya’s life currently revolves around her family and she sure knows how to embrace this blessing. All three just looked lovely in this New Year picture.\n5. It's Called The 'Sizzling It Up' Selfie\nPriyanka Chopra who is high on life shared the smoking hot selfie around New Year and left her fans drooling. She looked HOT AF in this selfie and you just cannot let your eyes off her.\n6. Caption Of The Year\nAjay Devgn’s selfie is full of love and Aww. Looks like Ajay is missing his holidays which he recently went on with his kids and wifey Kajol. Just a day ago, he shared one of the beautiful picture of him along with his daughter Nysa and son Yug and wrote, “Smiling again looking at this...” The caption of this selfie won our hearts.\n7. Coolest Selfie\nLast but not the least, Ranveer Singh yet again made it to this list. AGAIN. The enigmatic personality shared the coolest selfie with the real Gully Boy Naved Shaikh and left the world rapping along with him. His selfie caption will instantly make you say, “ Apna Time Aayega”.\nWhich one is your favourite selfie? Tell us in the comment section below.", "title": "PM Modi To Aishwarya Rai, Here Are The 7 Coolest Celebrity Selfies Of 2019 You Just Cannot Miss", "date_publish": "11/01/2019, 16:50:12", "description": "Our Bollywood celebs too are equally crazy for selfies. Well, self-love is the best love. Who doesn’t like to love and motivate themselves? Everyone, including our B town stars. This week we saw some coolest selfies shared by our B Town celebrities, some created a huge sensation on the internet while some were trolled by the fans. So let’s take a look at the coolest selfies of our Bollywood star", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/pm-modi-to-aishwarya-rai-here-are-the-7-coolest-celebrity-selfies-of-2019-you-just-cannot-miss-360254.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/narendra_modi_1547209300_800x420.jpg"}