{"text": "After posting a cryptic tweet on Monday, Akshay Kumar finally clarified this morning as to what was he referring to – his interview of Prime Minister Narendra Modi.\nGetting into an unknown and uncharted territory today. Doing something I have never done before. Excited and nervous both. Stay tuned for updates. — Akshay Kumar (@akshaykumar) April 22, 2019\nGrateful for all the interest shown in my previous tweet but just clarifying in light of some wild speculation, I am not contesting elections. — Akshay Kumar (@akshaykumar) April 22, 2019\nAkshay said it was a “candid” and “completely non-political conversation” with PM Modi that will reveal some lesser known facts about him.\nWhile the whole country is talking elections and politics, here’s a breather. Privileged to have done this candid and COMPLETELY NON POLITICAL freewheeling conversation with our PM @narendramodi . Watch it at 9AM tomorrow via @ANI for some lesser known facts about him! pic.twitter.com/Owji9xL9zn — Akshay Kumar (@akshaykumar) April 23, 2019\nAmong other things that he talked about including his love for mangoes and his personal life, Prime Minister Narendra Modi surprisingly mentioned about Akshay Kumar’s wife Twinkle Khanna as well. “Vo mere upar gussa nikalti hai,” he said.\nDon't Miss 6.8 K SHARES 814 SHARES 828 SHARES 776 SHARES 1.2 K SHARES\nDo you ever wonder whether PM Modi manages to laugh during the heat of the election campaign? You’ll get the answer tomorrow at 9am @ANI, in an informal and non-political conversation that I got the chance to do with @narendramodi ji. Do watch! pic.twitter.com/pczNar7k3A — Akshay Kumar (@akshaykumar) April 23, 2019\nMentioning Twinkle Khanna and her political tweets against him, Narendra Modi said, “Main aapka bhi Twitter dekhta hoon aur Twinkle Khanna ji ka bhi dekhta hoon. Kabhi kabhi toh mujhe lagta hai ki vo mere upar gussa nikalti hain Twitter pe toh usske kaaran aapka paarivarik jeewan mein badi shaanti hoti hogi. Unnka poora gussa mujh pe nikal jaata hoga isliye aapko aaram rehta hoga. Toh iss prakar se main aapke kaam aaya hoon (laughs). (I follow you as well as Twinkle on Twitter. Sometimes I feel that the way she expresses her anger on me on Twitter, your married life must be calmer because she throws all her anger on me. So this way, I am being of great help to you).”\nHere’s how Twinkle Khanna AKA Mrs Funnybones reacted to this:\nI have a rather positive way of looking at this-Not only is the Prime Minister aware that I exist but he actually reads my work :) 🙏 https://t.co/Pkk4tKEVHm — Twinkle Khanna (@mrsfunnybones) April 24, 2019\n“I have a rather positive way of looking at this-Not only is the Prime Minister aware that I exist but he actually reads my work,” she wrote.\nFor the unversed, Twinkle Khanna is quite popular for taking potshots at PM Modi and his government. She often, through her blogs and tweets, expresses her concerns and disagreements on how the government is functioning.\nIn one of her blogs for TOI, she wrote, “Around the world, April Fools’ Day comes once a year, but we Indians celebrate it every day, we just call it achhe din.”\nRead More: From CBSE Paper Leak To ‘Achhe Din’, Twinkle Khanna Says This Fool’s Day, The Joke Is On Us\nShe had once even clarified that husband and wife need not necessarily share same ideologies.\nBetter than a regressive tweet like this that calls 'progressive' pieces fluff and believes that marriage means sharing the same ideologies https://t.co/PwvKH0zwl3 — Twinkle Khanna (@mrsfunnybones) May 10, 2017\nMeanwhile, Sunny Deol has joined BJP and people can’t stop making 'Dhai Kilo Ka Haath' memes.", "title": "Twinkle Khanna:PM Narendra Modi Tells Akshay Kumar ‘Twinkle Ji Mere Upar Gussa Nikalti Hain’, She Gives A Classy Reply!", "date_publish": "24/04/2019, 13:06:44", "description": "Among other things that he talked about including his love for mangoes and his personal life, Prime Minister Narendra Modi surprisingly mentioned about Akshay Kumar’s wife Twinkle Khanna as well. “Vo mere upar gussa nikalti hai,” he said. Here’s how Twinkle Khanna AKA Mrs Funnybones reacted to this", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/pm-narendra-modi-tells-akshay-kumar-twinkle-ji-mere-upar-gussa-nikalti-hain-she-gives-a-classy-reply-365999.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/twinkle_khanna_responds_to_pm_narendra_modis_mention_in_an_interview_with_akshay_kumar_1556091080_800x420.jpg"}