{"text": "Looks like Bhai is in trouble again. Of course, this isn’t his first brush with the law. However, this one isn’t as grave and complicated as the other times.\nTwitter\nSo, recently Salman Khan was spotted on the roads of Mumbai on his bicycle. No points for guessing that the fans apparently went berserk. Salman Khan reportedly lost his cool, misbehaved with a fan, and snatched away his mobile phone.\nAnd now, a police complaint has been lodged against the star who is behind the Being Human initiative. In the complaint filed against DN Nagar Police Station of Mumbai, the complainant has accused Salman Khan of snatching his phone while he was trying to record his video. According to complainant, he took Salman Khan’s bodyguard’s permission before doing so.\nBut this isn’t all.\nTwitter\nDon't Miss 812 SHARES 3 K SHARES 449 SHARES 12.5 K SHARES 5.5 K SHARES\nSalman Khan's bodyguard has submitted a cross complaint stating that the person was following the actor and was trying to shoot the video without his consent.\nOn the other hand, complainant has accused Salman Khan and his bodyguards of misbehaving with him.", "title": "Police Complaint Filed Against Salman Khan For Misbehaving And Snatching A Fan’s Mobile Phone", "date_publish": "25/04/2019, 16:54:43", "description": "police complaint has been lodged against the star who is behind the Being Human initiate. In the complaint filed against DN Nagar Police Station of Mumbai, the complainant has accused Salman Khan of snatching his phone while he was trying to record his video. According to complainant, he took Salman Khan’s bodyguard’s permission before doing so.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/police-complaint-filed-against-salman-khan-for-misbehaving-and-snatching-a-fan-s-mobile-phone-366096.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/salman_khan_snatches_fans_phone_while_cycling_on_mumbai_streets_complaint_filed_1556190709_800x420.jpg"}