{"text": "Giving her two cents on #MeToo movement, actor-filmmaker Pooja Bhatt says she is happy that #MeToo movement has helped women come out with their stories of harassment but believes allegations need to be followed up with serious action instead of \"ranting on public platform\".\nJust to jog your memory a little, after Tanushree Dutta opened up about her ordeal, there were multiple women who came out and spoke about their similar stories of sexual harassment at work.\n#MeToo chapter paved a way for itself in India last year in September, with women from all walks of life coming forward to demand a safer work environment.\nTalking about #MeToo, Pooja Bhatt told PTI,\nTwitter\n\"One should take names. One should file a case and take the person to court. Just ranting on a public platform with no thought towards the consequences, I think, is a bit too much,\" Pooja told PTI.\nShe contends that the movement should not be limited to social media and rather be dealt properly with the help of law.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"If a man has made an overture at you and is harassing you, there is a law that protects you. Ranting on Twitter and not backing it up with a police complaint (does not help)... I am not interested in a media trial,\" she adds.\nShe added that she too has been a victim of sexual harassment. She added, \"It's a fallacy, I have had my share. Which woman has not dealt with somebody putting their hand on the butt? When I used to go to school by train, I have got my butt pinched. But we were trained to take on that person.\"\nIn 2002, Pooja had confessed that she was in an abusive relationship with an actor. She says she was then accused of washing her \"dirty linen in public\" by the industry.\n\"I felt I must talk about it as I represent courage and strength to the world. That time it was not considered fashionable to talk about it. I got a lot of flak for it. Saif Ali Khan and John Abraham were couple of few people who stood up for me. Everyone from Shekhar Suman to Ruby Bhatia said, 'How can I talk about all this in public?' For me, it was not about him or me, it was about something larger. We need to empower our women to speak.\"\nShe says, both as an actor and a producer, she has never worked in an uncomfortable work environment. She added,\n\"Ninety percent of the crew that works with me are there since my childhood and which is why I do not want to work too much outside because the people I work with are as important for me as my role. \"For no amount of money or love will I work with people I do not trust. Casting couch does exist and it exists everywhere when there is an exchange of power. If two adults decide to consent, who are we to judge that? It comes down to women's will.\"\nShe says 90 percent of sexual abuse cases are domestic in nature but no one talks about it fearing its adverse effects on the family system.\n\"You are often told by people, 'Let it be. Why talk about it as it will unnecessarily upset the power structure?' You are afraid of being ostracised. When you speak the truth, you find yourself in a minority. If you are not willing to be a lone wolf, keep your truth to yourself. If you want acceptance and your truths to be spoken, it is a slippery slope,\" she adds.\nShe added that it is really wrong to assume that men are not harassed. She added,\n\"Women can be equally vile, big bullies. It is unfair to paint every man with the same brush. There are decent men as well.\"\nShe says that both men and women need to work together for creating a safer environment. \"If we have to win this war, we have to do it with men. It is not about women against men.\"\nPooja is all set to return to movies with \"Sadak 2\" and she will also be seen in web series based on Abheek Barua's book, \"A City of Death\".\n(With PTI inputs)", "title": "Pooja Bhatt Explains Why She Doesn't Believe In Social Media Outrage & Media Trials For #MeToo!", "date_publish": "13/01/2019, 15:06:09", "description": "\"One should take names. One should file a case and take the person to court. Just ranting on a public platform with no thought towards the consequences, I think, is a bit too much,\" Pooja told PTI. She contends that the movement should not be limited to social media and rather be dealt properly with the help of law.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pooja-bhatt-explains-why-she-doesn-t-believe-in-social-media-outrage-media-trials-for-metoo-360340.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/pooja_bhatt_1547375802_800x420.jpg"}