{"text": "Posh Spice A.K.A. Victoria Beckham Sends Love To Her Bandmates Of Spice Girls For Their Reunion\nPosh Spice A.K.A. Victoria Beckham Sends Love To Her Bandmates Of Spice Girls For Their Reunion\nAfter more than seven years, Spice Girls announced that they will be making a comeback. They shared the concert dates and made all their fans happy. Victoria Beckham, who won't be a part of it, has sent the rest of her former bandmates love and luck for the shows.\n\"I won't be joining my girls on stage again but being in the Spice Girls was a hugely important part of my life and I wish them so much love and fun as they go back on tour next year,\" Beckham posted on Instagram, reported eonline.com.\n\"I know they will put on an amazing show and the fantastic fans past and present are going to have a wonderful time! Spice Girls, friendship never ends,\" she added.\nManager Simon Fuller, who developed the group, and his XiX Entertainment are bringing four of the girls together - minus Victoria Beckham, aka 'Posh Spice'.\nSpice Girls Emma Bunton, Geri Horner, Melanie Brown and Melanie Chisholm will kick off a tour with stadium performances in their native U starting in the spring of 2019.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nreuters\n\"Because of her business commitments Victoria won't be joining the girls on tour, but (she) will always be one of the Spice Girls and remains aligned with Emma, Mel B, Melanie C and Geri in preserving their unique legacy,\" the announcement read.\nThe performers are excited to be back together on stage and \"to spice things up all over again\", said Bunton.\nInputs From IANS", "title": "Posh Spice A.K.A. Victoria Beckham Sends Love To Her Bandmates Of Spice Girls For Their Reunion", "date_publish": "07/11/2018, 09:56:06", "description": "Manager Simon Fuller, who developed the group, and his XiX Entertainment are bringing four of the girls together - minus Victoria Beckham, aka 'Posh Spice'. Spice Girls Emma Bunton, Geri Horner, Melanie Brown and Melanie Chisholm will kick off a tour with stadium performances in their native U starting in the spring of 2019.", "authors": [], "url": "https://www.indiatimes.com/entertainment/posh-spice-a-k-a-victoria-beckham-sends-love-to-her-bandmates-of-spice-girls-for-their-reunion-356198.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/spicegirls_1541565823_800x420.jpg"}