{"text": "2018 was one great year for Ranveer Singh. From beginning the year with Padmaavat to ending it with Simmba, the actor was on a roll. Apart from this, he made headlines for his marriage with his girlfriend of six years Deepika Padukone.\nAgencies\nIn a recent interview, Ranveer Singh opened up about being aware of how this fame can affect a person’s outlook.\nTalking to PTI, he said,\nAgencies\n“When this happens around you, there are two possibilities – you either believe it or you are simply aware of it. While I am aware of it, I don’t start believing in my own hype. My experiences have shaped me to be the kind of person I am.\"\nRanveer added that he keeps himself grounded by constantly reminding himself of his struggle period. He adds,\nAgencies\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n“I had a proper struggle period of three and half years, so today when opportunities come my way, I value them tremendously. I never lose sight because I have a vivid memory of the times when I had none of this.\"\nThe film industry is one of the most volatile places and an actor’s sense of security is challenged every Friday, something that Ranveer says he has learned to deal with. He adds,\nAgencies\n“I try and adopt the middle path – don’t get too carried away with the success and don’t get bogged down by failures. I feel happy when I succeed, you must do that. But then quickly immerse yourself in the current moment again. Filmmaking is a collaborative effort, so if it failed, it’s not entirely your doing. I find this middle approach very healthy.\"\nThe 33-year-old actor says the child in him still considers his journey to success in Bollywood as a “fairy tale.”\n“This one kid, out of nowhere, had a dream and he’s now living it. Every day my heart is filled with gratitude. I pray before I go to work and always say thank you because I value it. It is surreal what is happening to me, or around me. This love keeps me grounded and humbled. When fans ask me to get clicked with them, what I am actually thinking is ‘What? Me? Do they really want to be clicked with me!'”\n2019 also looks promising for the actor as he is gearing up for the release of Zoya Akhtar’s Gully Boy. The poster of the film starring Alia Bhatt was released on Wednesday.\n(With agency inputs)", "title": "Ranveer Singh Simmba:Post Success Of Simmba, Ranveer Singh Talks About His 'Surreal' Stardom & How He Stays Grounded", "date_publish": "03/01/2019, 16:42:46", "description": "Post Success Of Simmba, Ranveer Singh Talks About His 'Surreal' Stardom & How He Stays GroundedPost Success Of Simmba, Ranveer Singh Talks About His 'Surreal' Stardom & How He Stays GroundedPost Success Of Simmba, Ranveer Singh Talks About His 'Surreal' Stardom & How He Stays Grounded", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/post-success-of-simmba-ranveer-singh-talks-about-his-surreal-stardom-how-he-stays-grounded-359787.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_1546515643_800x420.jpg"}