{"text": "The Accidental Prime Minister which is based on our former PM Manmohan Singh ran into troubled waters during the release of the film. Even though the movie saw the day of release, the film was called out for its inaccuracies and the fact that BJP was out-rightly promoting the film.\nyoutube/screengrab\nAnd now Muzaffarpur police has lodged an FIR against actors Anupam Kher, Akshaye Khanna and 12 others in connection with the movie ‘The Accidental Prime Minister’. As per reports in PTI, the FIR was lodged at the Kanti police station on Tuesday after the court took objection to non-compliance of its January 8 order in this regard.\nyoutube/screengrab\nThe court had on January 8 ordered police to lodge an FIR against the actors and 12 others on a complaint filed by advocate Sudhir Kumar Ojha with a plea that the movie presented Manmohan Singh and a number of other public figures in bad light.\nOjha said he had moved the court of sub-divisional judicial magistrate Saba Alam on February 4 to mention that its order was not complied with by the police.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n“On this, the court issued show-cause notice to Kanti police station through the Muzaffarpur senior superintendent of police after which police lodged an FIR yesterday (Tuesday),” Ojha told reporters Wednesday.\nTwitter\nIn his complaint, Ojha named Kher (who plays the character of Manmohan Singh), as well as Akshaye Khanna, who plays the role Singh’s media adviser Sanjaya Baru, on whose book the movie is said to be based upon.\nThe movie was released on January 11, 2019.", "title": "Post Controversies, FIR Filed Against Akshaye Khanna & Anupam Kher Over 'The Accidental PM'", "date_publish": "14/02/2019, 18:18:01", "description": "And now Muzaffarpur police has lodged an FIR against actors Anupam Kher, Akshaye Khanna and 12 others in connection with the movie ‘The Accidental Prime Minister’. As per reports in PTI, the FIR was lodged at the Kanti police station on Tuesday after the court took objection to non-compliance of its January 8 order in this regard.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/post-controversies-fir-filed-against-akshaye-khanna-anupam-kher-over-the-accidental-pm-362185.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/akshay_1550147565_800x420.jpg"}