{"text": "After putting up a brave fight against cancer in London, Irrfan Khan is back home in Mumbai. The actor returned from London last month after undergoing treatment for neuroendocrine tumour. His illness kept him away from his work for about a year but the actor has finally returned to the film sets and it's a sight to behold for all his fans and well-wishers who were praying for his recovery.\nThe actor has started shooting for the sequel to Hindi Medium, titled Angrezi Medium in Udaipur. The team shared the first mahurat pictures from the sets in Udaipur and people are delighted to see Irrfan Khan back in full-form.\nTwitter\nTwitter\nDirected by Homi Adajania, the film will be produced by Dinesh Vijan. If reports are to be believed, the second part of Irrfan's hit film will revolve around his on-screen daughter who grows up and decides to go to London for higher studies.\nDon't Miss 291 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nWhile Kareena Kapoor might play Irrfan's wife and a cop in the film, Pataakha and Mard Ko Dard Nahi Hota actor Radhika Madan will be playing the role of his grown-up daughter in the film. The film will be majorly shot in Udaipur and London.\nJust a few days ago, Irrfan Khan took to his social media accounts to thank all his fans for constantly keeping him in their prayers. In his note, he had written,\n“Maybe somewhere in the pursuit of winning, we forget how much it means to be loved. In our vulnerability, we are reminded. As I leave my footprints onto these steps of my life, I want to pause to be grateful for receiving your immense love and support, it soothed me in my process of healing. So I travel back to you, thanking you from the bottom of my heart.”", "title": "Post Cancer-Treatment, Irrfan Khan Finally Begins Shooting For 'Angrezi Medium' In Udaipur", "date_publish": "05/04/2019, 11:36:32", "description": "After putting up a brave fight against cancer in London, Irrfan Khan is back home in Mumbai. The actor returned form London last month after undergoing treatment for neuroendocrine tumour. After staying away from the film sets and films, the actor has finally returned to the film sets and it's a sight to behold for all his fans and well-wishers who were praying for his recovery.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/post-cancer-treatment-irrfan-khan-finally-begins-shooting-for-angrezi-medium-in-udaipur-364911.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/irrfan_khan_1554444550_800x420.jpg"}