{"text": "Post-Wedding Celebrations Begin For DeepVeer, First Reception To Take Place In Bangalore Today\nPost-Wedding Celebrations Begin For DeepVeer, First Reception To Take Place In Bangalore Today\nNewly-Weds Ranveer and Deepika are back in India after tying the knot at Lake Cosmo in Italy. The five-day celebration in Italy was all about love and joy and the wedding pictures have been a big enough proof.\nInstagram/Ranveer Singh\nBut if you think that the celebrations have ended for DeepVeer, you are mistaken. The second round of celebrations begin for Ranveer Singh and Deepika Padukone, who flew down to Bangalore from Mumbai yesterday.\nViral Bhayani\nA Filmfare report claims that the families have booked Leela Palace and Deepika’s mother, Ujjala has taken the responsibility of overseeing the arrangements for food.\nThis celebration will be restricted only to Deepika’s side of the family and Deepika's father, badminton star Prakash Padukone’s friends.\nInstagram/Ranveer\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nThe couple will be seen in Sabyasachi outfits, who is also the designated designer for them and the entire family. From her Mehendi to Sangeet to the Konkani ceremony, DeepVeer chose Sabyasachi for all their functions.\n(Also read: 12 Endearing Things About Ranveer-Deepika's Fairytale Wedding That Will Make You Swoon!)", "title": "Post-Wedding Celebrations Begin For DeepVeer, First Reception To Take Place In Bangalore Today", "date_publish": "21/11/2018, 12:01:53", "description": "Ranveer Singh, Deepika Padukone, DeepVeer wedding, Deepika Padukone and Ranveer Singh Pictures, Ranveer photographsRanveer Singh, Deepika Padukone, DeepVeer wedding, Deepika Padukone and Ranveer Singh Pictures, Ranveer photographsRanveer Singh, Deepika Padukone, DeepVeer wedding, Deepika Padukone and Ranveer Singh Pictures, Ranveer photographs", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/post-wedding-celebrations-begin-for-deepveer-first-reception-to-take-place-in-bangalore-today-357070.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542780471_800x420.jpg"}