{"text": "Prabhas & Rana Daggubati Dance Their Hearts Out At Rajamouli's Son's Sangeet & Fans Can’t Stop Gushing\nPrabhas & Rana Daggubati Dance Their Hearts Out At Rajamouli's Son's Sangeet & Fans Can’t Stop Gushing\n2018 was the year of celebrity weddings. From Priyanka Chopra-Nick Jonas and Deepika Padukone-Ranveer Singh to Kapil Sharma and Bharti Singh, a lot of celebrities tied the knot this year.\nIf you thought that the wedding season is over, you may be wrong. Baahubali director SS Rajamouli’s son Karthikeya tied the knot to his longtime girlfriend Pooja Prasad on Dec 30 in Jaipur.\nRam Charan, Rana, Prabhas at Rajamouli event pic.twitter.com/NCBQMxrAjU — Nitish Shekhar (@nitzrulzx412) December 31, 2018\nIt was a star-studded affair. From Ram Charan and Jr NTR to Baahubali stars Prabhas and Rana Dagubbati, everyone graced the occasion. Everyone danced, laughed and enjoyed together making our hearts all mushy.\nAlso Read: 9 Times Onscreen Enemies Rana Daggubati & Prabhas Made Us Jealous Of Their Unbreakable Bond\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nkannepettaro kannukottaro🕺💃\nTarak, Nagarjuna garu and pranathi 😌😍😍🕺💃 with Rama rajamouli garu#BangaramSaysSS pic.twitter.com/Ov633Lal5C — Butterfly 🦋 (@KajPriya) December 29, 2018\nIragakodthunaru dance floor ni\nSSR Tarak Ramcharan😍😍🕺💃\nIt's RRR dancing at #BangaramSaysSS pic.twitter.com/flmAhOqcy0 — Butterfly 🦋 (@KajPriya) December 29, 2018\nAlso Read: 15 Interesting Facts About Prabhas You Should Know Before Calling Yourself His Biggest Fan!", "title": "Prabhas & Rana Daggubati Dance Their Hearts Out At Rajamouli's Son's Sangeet & Fans Can’t Stop Gushing", "date_publish": "31/12/2018, 16:59:58", "description": "If you thought that the wedding season is over, you may be wrong. Baahubali director SS Rajamouli’s son Karthikeya tied the knot to the his longtime girlfriend Pooja Prasad on Dec 30 in Jaipur. It was a star-studded affair. From Ram Charan and Jr NTR to Baahubali stars Prabhas and Rana Dagubbati, everyone graced the occasion.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/prabhas-rana-daggubati-dance-their-hearts-out-at-rajamouli-s-son-s-sangeet-fans-can-t-stop-gushing-359589.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/prabhas__rana_daggubati_dance_their_hearts_out_at_rajamoulis_sons_karthikeyas_sangeet_1546254553_800x420.png"}