{"text": "Prakash Raj Gets Nostalgic As He Casts His Vote In The Same Classroom He Sat ‘41 Years’ Ago!\nPrakash Raj Gets Nostalgic As He Casts His Vote In The Same Classroom He Sat ‘41 Years’ Ago!\nWe all drift apart with our lives as we grow up. We sometimes even change the cities and eventually move on in life. But don’t we all secretly wish to go back in time?\nflickr.com\nHow many of you have visited your school in the recent times? Doesn’t it send you into fits of nostalgia seeing the changes that have taken place in the past so many years? The same happened with Prakash Raj recently.\nbhindibazaar.asia\nActor Prakash Raj recently went to cast his vote during the second phase of Lok Sabha elections in Bengaluru. He was taken by surprise when he got to vote in the same very classroom in which he sat 41 years ago.\nTwitter\nDon't Miss 638 SHARES 183 SHARES 185 SHARES 791 SHARES\nSharing a photograph, Prakash Raj wrote on Twitter, “I got to VOTE in my school and in the very class room I sat 41 years ago ..NOSTALGIC.. a NEW JOURNEY.. a NEW HORIZON.. feeling blessed by LIFE.”\nI got to VOTE in my school and in the very class room I sat 41 years ago ..NOSTALGIC.. a NEW JOURNEY.. a NEW HORIZON.. feeling blessed by LIFE. pic.twitter.com/CVWlZ7XOJv — Prakash Raj (@prakashraaj) April 18, 2019\nPrakash Raj is fighting as an independent candidate from Bengaluru Central constituency. He calls himself a political activist and says that he is fighting the elections for the people and not against any political leader or party.", "title": "Prakash Raj Gets Nostalgic As He Casts His Vote In The Same Classroom He Sat ‘41 Years’ Ago!", "date_publish": "18/04/2019, 17:33:58", "description": "Actor Prakash Raj recently went to cast his vote during the second phase of Lok Sabha elections in Bengaluru. He was taken by surprise when he got to vote in the same very classroom in which he sat 41 years ago. Sharing a photograph, Prakash Raj wrote on Twitter, “I got to VOTE in my school and in the very class room I sat 41 years ago ..NOSTALGIC.. a NEW JOURNEY.. a NEW HORIZON.. feeling blessed", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/prakash-raj-gets-nostalgic-as-he-casts-his-vote-in-the-same-classroom-he-sat-41-years-ago-365709.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/prakash_raj_gets_nostalgic_as_he_casts_his_vote_in_the_same_classroom_he_sat_41_years_ago_1555588134_800x420.png"}