{"text": "Singer Selena Gomez is going through a rough phase of her life. Ever since her kidney transplant, Selena has been keeping unwell. As per reports, the actress, singer and producer has entered a mental health facility twice in two weeks.\nTwitter\nThe reason for admission is cited to be an emotional breakdown.\nAccording to a source close to TMZ, the 26-year-old singer was at Studio City during the last week of September when the first emergency hit her. Selena got emotional after a drip in her white blood cell count, which happened due to the kidney transplant which she underwent. It was a family member who took Selena to Cedars-Sinai Medical Center in Los Angeles.\nTMZ also reports that, weeks later the singer had to be re-admitted as her low blood cell count persisted. She is currently being treated at East Coast psychiatric facility.\nDon't Miss 106 SHARES 153 SHARES 5.1 K SHARES\nSources close to the website reveal, the singer wished to leave after she was admitted. But, the doctors advised her not to do so. She even tried to rip off IV's off her arm.\nEver since the news of her health broke out, social media has been praying for the singer. #PrayForSelena has been trending since and fans are wishing her a speedy recovery.\nim crying so hard, please stop sending so much hate to selena because she doesn't deserve it, please pray for her health, it's a little angel made of glass that can be broken at any time. #PrayForSelena ❤️ pic.twitter.com/B8nxZzAQeR — elena #PrayForSelena 🥀 (@tropicoflaws) October 11, 2018\nyou're a strong woman and you'll be fine soon, we love you ♥#PrayForSelena pic.twitter.com/o1fmSyZZzu — nick 🌹 (@jadwethirwall) October 11, 2018\nit doesn’t matter if you don’t like her, nor stan her, but know mental breakdowns and being hospitalized effects many people, just a little prayer would be great. Get well soon. #PrayForSelena 💙 pic.twitter.com/HTFkKRDot6 — Dawyne (@tastelikegrande) October 11, 2018\nI hope I never lose that smile. #PrayForSelena pic.twitter.com/4NnUWnzX8j — bests pics (@arquivofavs) October 11, 2018\nOur girl is a fucking fighter!! She will get through this! #PrayForSelena and also pray for others who struggle with physical and mental health. pic.twitter.com/9AgfvV4hbF — SJ🖤 (@capigirlx) October 11, 2018\nWe are sending our prayers and love to Selena Gomez and her friends and family. Swifties are here with you! 💜 #PrayForSelena pic.twitter.com/x2adKICO9s — Taylor Paraguay (@TSUpdatesPY) October 11, 2018\nget well soon baby .I hope your smile will back on your beautiful face soon and will be shine like a sun.☀💚! #PrayForSelena pic.twitter.com/puU8TiqrjI — Paulina ♡ (@selenasgff) October 11, 2018\nyou are never alone we are all together and we love you and we will all fight together.#PrayForSelena pic.twitter.com/eEO3BOXcpH — kostas (@moonlightgomezs) October 11, 2018\nGet well soon, Selena Gomez!", "title": "#PrayForSelena! Singer Selena Gomez Reportedly Hospitalised For Mental Health Treatment", "date_publish": "11/10/2018, 18:36:25", "description": "Singer Selena Gomez is going through a rough phase of her life. Ever since her kidney transplant, Selena has been keeping unwell. As per reports, the actress, singer and producer has entered a mental health facility twice in two weeks. #PrayForSelena! Singer Selena Gomez Reportedly Hospitalised For Mental Health Treatment", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/prayforselena-singer-selena-gomez-reportedly-hospitalised-for-mental-health-treatment-354597.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/selena_1539248237_800x420.jpg"}