{"text": "Priyanka Chopra and Nick Jonas are all set to tie the knot in December this year and the preps are already on in full swing. PC's mother Madhu Chopra did a recce of the location a few days back and now, PC and Nick will personally go and handle all the arrangements, claim reports.\nFresh reports claim that Priyanka Chopra and Nick Jonas’ wedding will be followed by two receptions, one in Mumbai and another in Delhi. The celebrations will begin for the couple from November 29. The couple will tie the knot at the Umaid Bhawan Palace in Jodhpur on December 2 as per Hindu traditions, which will reportedly be followed by a Christian wedding on December 3.\nDon't Miss 186 SHARES 10.9 K SHARES\nIshaan Khatter confirmed the news by saying, “Yes, I will be a part of the show with Shahid Kapoor. I am extremely excited. Come on, did you see the hamper. Who would not be excited for that?” He also hinted that the two might shake a leg on the show and said, “Don’t be surprised if we do. There is no such plan but yes, you never know.”\nThe director Jon Favreau’s all-new The Lion King journeys to the African savanna where a future king must overcome betrayal and tragedy to assume his rightful place on Pride Rock. The minute the trailer hit the screens, it managed to break the internet. Social media has been buzzing about cute Simba is looking. Take a look at the roaring reactions on Twitter.\nFor Sunny, it is a matter of choice that he avoids reading scripts as he believes he might look at them with a \"certain mindset\" and hence prefers to hear them straight from the writers. \"I am a very instinctive person. I hear an idea, a thought and if it is good and I like it, I just jump for it. I don't go into the detailings of it. Right now, you need to do that but back then filmmaking was different.\"", "title": "Preps For Priyanka-Nick's Royal Wedding In Jodhpur Begins And More From The Ent World!", "date_publish": "23/11/2018, 17:37:29", "description": "Priyanka Chopra and Nick Jonas are all set to tie the knot in December this year and the preps are already on in full swing. PC's mother Madhu Chopra did a recce of the location a few days back and now, PC and Nick will personally go and handle all the arrangements, claim reports.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/preps-for-priyanka-nick-s-royal-wedding-in-jodhpur-begins-and-more-from-the-ent-world-357268.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_1542974967_800x420.jpg"}