{"text": "Priyanka & Deepika Make It To Forbes Top 100, Anil Kapoor Told DP To Never Leave Ranveer & More From Ent.\nPriyanka & Deepika Make It To Forbes Top 100, Anil Kapoor Told DP To Never Leave Ranveer & More From Ent.\nAfter they made their relationship public with official ceremonies, Anil Kapoor seems to be elated. Speaking on Neha Dhupia's podcast, he revealed how Deepika especially visited Ranveer on the sets of Dil Dhadakne Do. Calling their relationship adorable, he recalls telling Deepika in reference to Ranveer, “Chhodna mat isko, mera ye ladka superb hai (Never leave this guy. My boy is superb). Perfect choice. You can’t get a better boy.”\nThis year too Forbes recently released the list of 100 Most Powerful Women in the world and four Indian women made it to the list.\nIn case you are also a Kapil Sharma fan, here are all the deets.\n1. The episode, which will be aired on Sony Entertainment Television, will also feature Salman's brothers Sohail Khan and Arbaaz Khan as well as their father Salim Khan, read a statement.\n“On a scale of 1 to 10 in happiness, I’m on 12,” she told IANS at her wedding reception party at the Taj Palace Hotel in New Delhi yesterday.\nNow, according to a report on Mid-day, Alok Nath AKA Babuji is missing. He is untraceable, says a source at Oshiwara police station. Summons were issued to him last week, according to the report, but he was not at home. “We don't know where he is,” added the source.\nDon't Miss 862 SHARES 346 SHARES", "title": "Priyanka & Deepika Make It To Forbes Top 100, Anil Kapoor Told DP To Never Leave Ranveer & More From Ent.", "date_publish": "05/12/2018, 17:59:14", "description": "After they made their relationship public with official ceremonies, Anil Kapoor seems to be elated. Speaking on Neha Dhupia's podcast, he revealed how Deepika especially visited Ranveer on the sets of Dil Dhadakne Do. Calling their relationship adorable, he recalls telling Deepika in reference to Ranveer, “Chhodna mat isko, mera ye ladka superb hai (Never leave this guy. My boy is superb). Perfect", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-deepika-make-it-to-forbes-top-100-anil-kapoor-told-dp-to-never-leave-ranveer-more-from-ent-358021.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wrap_1544013435_800x420.jpg"}