{"text": "Priyanka Chopra's Style Diary After Her Engagement Proves She's At The Top Of Her Fashion Game\nPriyanka Chopra's Style Diary After Her Engagement Proves She's At The Top Of Her Fashion Game\nShe began as a model, then became a Bollywood star and went onto become a global phenomenon. Priyanka Chopra is someone who we look up-to and are absolutely proud of.\nShe is one of the few actors who travelled the globe and whatever she touched turned into pure gold. Whether it's acting or singing, Priyanka knows she's a stayer and a slayer.\nEver since, the leggy lass got engaged to singer-actor Nick Jonas, things have been turning even more bright and fun for her. Infact, her style diary too is oozing like never before. She's become fearless in her fashion choices and we're totally loving it.\nAs per reports, Priyanka may tie the knot later this year and she has been giving complete fashion goals and inspiring to be brides to rock it like a boss. Yes, the style diva is only upping her game.\nDon't Miss 161 SHARES 862 SHARES\nSo here's taking a look at Priyanka Chopra's her newest looks which proves she is only getting better at her fashion game.\n1. The Quantico star wore a daring puffy jacket with a dress giving it a fashionable twist\n2. In this one, Priyanka turns up in a fiery red suit, teaming with stunning heels, hair tied in a bun and chic sunglasses. #BecauseOnlySheCan\nInstagram/ Priyanka Chopra\n3. Priyanka wore a strapless off-white number at her bridal shower giving bride-to-be's serious pre-wedding goals\nTwitter\n4. Priyanka never misses a moment to look like sunshine\n5. Because only she can carry a blue suede dress with so much ease and still rock it flawlessly\n6. The woman just never disappoints, Priyanka looks lovely in a sheer black shirt with a grey blazer during a fun JBL event\n7. PC channeling her inner cow girl in this one\n8. Priyanka looking gorgeous in a black Longchamp dress and orange heels during New York Fashion week is a sign that she loves to experiment\n9. Because when Priyanka dons a saree, it is a sight to behold\nInstagram/Manish Malhotra\nPriyanka Chopra is at the top of her fashion game right now giving inspiration to a million girls out there. Now, we can't wait to see the style diva in her wedding outfits!", "title": "Priyanka Chopra's Style Diary After Her Engagement Proves She's At The Top Of Her Fashion Game", "date_publish": "03/11/2018, 16:39:09", "description": "bollywood, priyanka chopra, celebs, stars, nick jonas, moviesbollywood, priyanka chopra, celebs, stars, nick jonas, moviesbollywood, priyanka chopra, celebs, stars, nick jonas, moviesbollywood, priyanka chopra, celebs, stars, nick jonas, moviesbollywood, priyanka chopra, celebs, stars, nick jonas, moviesbollywood, priyanka chopra, celebs, stars, nick jonas, movies", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-s-style-diary-after-her-engagement-proves-she-s-at-the-top-of-her-fashion-game-355812.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/priyanka_1540984878_800x420.jpg"}