{"text": "It’s party time for Priyanka Chopra and Nick Jonas. As PC’s first wedding guests arrived in Mumbai for their Band Baaja Baaraat, she threw a party to welcome them last night. It was a star-studded affair! Celebs including Alia Bhatt and Parineeti Chopra were also spotted at the bash.\n2. After 'Thugs Of Hindostan' Debacle, Aamir Khan Extends A Sincere Apology To All His Fans\n\"I would like to say that I take full responsibility for Thugs Of Hindostan not working with the audience. I think we went wrong. I would like to take full responsibility for that. You can be sure we tried our level best.\"\n3. Akshay Kumar Doesn't Want To Pressurise His Son Into Entering Films Like Other Star Kids\n“He is just 16 years old, I would like to let him live his life rather than put pressure on him and ask whether he is interested in films. I am not that kind of a father, I will let him live, he is right now interested to be with his friends, enjoy life and study. Like every youngster, he is very much interested in technology, so I think I will let him live”.\nDon't Miss 106 SHARES 365 SHARES\n4. Aamir Chooses Mahabharat Over Saare Jahan Se Accha, Says He’s Happy SRK Is A Part Of It\n“I think it’s a great and wonderful script. I am a huge fan of Rakesh (Sharma) and it’s a wonderful story. I feel sad that I am not able to do it, which is why I actually called up Shah Rukh and said that it’s a wonderful story and you should hear it’. I am really happy that he liked it and he is doing it so, all my best wishes for their project.”\n5. Kalinga Sena's Claim Falls Flat As They Withdraw Their Threat To Throw Ink At SRK\n“We have decided to withdraw our pledge following the request by Hockey India President. Since it is an international event and Shah Rukh Khan is a promoter, we don’t want to protest, as that would give a bad name to Odisha,” Kalinga Sena chief Hemant Rath said.", "title": "Priyanka Chopra Throws Party For Sophie Tuner & Joe Jonas, Aamir Khan Apologises To His Fans & More From Ent", "date_publish": "27/11/2018, 18:22:07", "description": "From Priyanka Chopra throwing a party for Nick Jonas, Sophie Turner and Joe Jonas ahead of their wedding at Jodhpur’s Umaid Bhawan on Dec 2, to Aamir Khan taking responsibility for Thugs Of Hindostan failure and apologising to his fans, here is all that rocked the world of entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-throws-party-for-sophie-tuner-joe-jonas-aamir-khan-apologises-to-his-fans-more-from-ent-357495.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_throws_party_for_sophie_tuner__joe_jonas_aamir_apologises_to_his_fans__more_from_ent_1543323370_800x420.png"}