{"text": "Priyanka Chopra Lets Her Hair Down Along With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super Jealous\nPriyanka Chopra Lets Her Hair Down Along With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super Jealous\nShe's a global phenomena who is nailing with her career choices everyday. Whether overseas or India, this one knows her priorities way too well. She juggles between work and love, LA and Mumbai and is very good at it.\nYes, no surprises there. We're talking about Priyanka Chopra, the queen has been reigning in every field. She has been in the country shooting for The Sky Is Pink. In the midst of her shoot, she took out time to attend Akash Ambani and Shloka Mehta's wedding.\nLooking gorgeous in a silver sheer saree, Priyanka made heads turn with her traditional look. For those who didn't notice, PC even wore a little sindoor on her forehead which completed her stunning look.\nMissing her core gang, Priyanka went to her friend Rohini Iyer's house next day for a dinner party which turned out to be quite a mega event. And because she doesn't get to hang out with her Bollywood friends, she decided to call them over too.\nDon't Miss 161 SHARES 862 SHARES 346 SHARES\nYes, her Bollywood besties were there in full swing and the mini reunion has been the talk since then. The big Bollywood selfie made its way to the internet and it surely did look like a fun night.\nFrom Jacqueline Fernandez, Huma Qureshi, Janhvi Kapoor, Sushant Singh Rajput, Mustafa Sheikh and Ishaan Khatter, all took out time to meet their inspiration. The dinner party reportedly went onto till the wee hours of the morning.\nWe sure are jealous as it's amazing to Priyanka's roots still intact and her love for Bollywood. And who doesn't want to be a part of this mad Bollywood selfie! What do you think?", "title": "Priyanka Chopra Lets Her Hair Down Along With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super Jealous", "date_publish": "11/03/2019, 17:51:38", "description": "Priyanka Chopra Lets Her Hair Down With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super JealousPriyanka Chopra Lets Her Hair Down With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super JealousPriyanka Chopra Lets Her Hair Down With Her Bollywood Troupe Jacqueline, Sushant & Janhnvi And We're Super JealousPriyanka Chopra Lets Her Hair Down With Her Bollywood Trou", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-lets-her-hair-down-along-with-her-bollywood-troupe-jacqueline-sushant-janhnvi-and-we-re-super-jealous-363537.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/priyanka_1552307293_800x420.jpg"}