{"text": "Priyanka Chopra Changes Her Name After Wedding, Excited To Be Part Of Forbes Top 100 List\nPriyanka Chopra Changes Her Name After Wedding, Excited To Be Part Of Forbes Top 100 List\nPriyanka Chopra has had quite an eventful year. From becoming an investor with Bumble, appearing on Vogue, America, featuring on Forbes Top 100, to finding the love of her life in Nick Jonas, Priyanka Chopra has been rising in love and at work.\nTwitter\nThe 36-year-old tied the knot in a lavish ceremony at Umaid Bhavan and took the internet by storm with her super elated pictures.\nFrom her candid poses during mehendi functions to her graceful Hindi and Christian weddings , Priyanka loooked every bit royal and more. The Chopra girl always wanted a fairytale kind of a wedding and she sure did. Meeting the man of her dreams, Nick Jonas, PC didn't waste her time dating him and settling down.\nDon't Miss 527 SHARES 365 SHARES 161 SHARES 862 SHARES\nInfact, the actress was quick enough to officially announce that she is now Mrs. Priyanka Chopra Jonas. In the midst of her wedding receptions and work invites, Priyanka did manage to take some time off to change her name on Instagram and take up Nick's family name. She has close to 32.3 million followers on the same.\nInstagram/Priyanka Chopra Jonas\nSince then, PC has been appearing on chat shows talking about how, going forward, she will manage her work-life balance. Giving advice to newly weds, PC said,\n“It is basically choosing your life, the way you want to and being the best version of it – whether that is in love, whether that is in business, whether that is in your friendships or the kind of network you want around you and the people you want around you.”\nShe also said it's okay to take a break, not work, relax, or even work right after your wedding because the idea should be able to choose.\nShe even posted a picture of her featuring on Forbes top 100. Thanking them, she wrote,\n\"Thank you @forbes! Honoured to be a part of such an exclusive and illustrious list of #PowerWomen in the world for the second time.. It's a reminder to stay hungry, keep pushing the status quo and continuing to do what I love. And on that note...#backtowork #ForbesTop100MostPowerfulWomen\"\nMore power to Priyanka Chopra. Continue to stay and slay.", "title": "Priyanka Chopra Changes Her Name After Wedding, Excited To Be Part Of Forbes Top 100 List", "date_publish": "07/12/2018, 11:08:34", "description": "Priyanka Chopra has had quite an eventful year. From becoming an investor with Bumble, appearing on Vogue, America, featuring on Forbes Top 100, to finding the love of her life in Nick Jonas, Priyanka Chopra has been rising in love and at work.Priyanka Chopra has had quite an eventful year. From becoming an investor with Bumble, appearing on Vogue, America, featuring on Forbes Top 100.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-changes-her-name-after-wedding-excited-to-be-part-of-forbes-top-100-list-358100.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_1544162342_800x420.jpg"}