{"text": "Will people stop talking about Priyanka Chopra and Nick Jonas? Not anytime soon. The couple who tied the knot in a lavish yet hush-hush affair has everyone’s eyes glued upon them. Every now and then, they make some sensational revelation about themselves that leaves fans hooked. So, this time, Priyanka Chopra has spilled some of her bedroom secrets.\nTwitter\nWe know that Priyanka Chopra and Nick Jonas are in a long-distance marriage. Our desi girl has work commitments in India and the videshi boy is busy with his own work abroad. Opening up about the ‘heat’ quotient, Priyanka Chopra admitted to FaceTime sex as well as sexting.\nTwitter\nShe appeared on Watch What Happens Live when she made the confession. When host Andy Cohen asked her if she believes in sexting or FaceTime sex during long stints apart, she replied, “for sure.”\nScreengrab\nDon't Miss 159 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nWhat’s more? She also confessed that she helped her better half with his ‘manscaping’ but only on the back of his head. “Once, I did once. Just his fade, back there.”\nScreengrab\nPriyanka Chopra also talked about her grand wedding and revealed the two moments when Nick Jonas cried during their wedding. When host Andy Cohen asked as to who cried the most during the vow exchanges, she said, “Nick” and added that when he saw her in the wedding dress, “he cried… I cried, he cried, it was just like...it happened so fast.”\nPriyanka Chopra has finally found the one, and she is happily in love with him too!\nWith inputs from IANS", "title": "Priyanka Chopra Shares Her Bedroom Secrets, Admits To FaceTime Sex & Sexting With Husband Nick", "date_publish": "23/03/2019, 14:44:11", "description": "We know that Priyanka Chopra and Nick Jonas are in a long-distance marriage. Our desi girl has work commitments in India and the videshi boy is busy with his own work abroad. Opening up about the ‘heat’ quotient, Priyanka Chopra admitted to FaceTime sex as well as sexting.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-shares-her-bedroom-secrets-admits-to-facetime-sex-sexting-with-husband-nick-364177.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/priyanka_chopra_opens_up_about_her_sex_life_with_nick_jonas_admits_to_facetime_sex_and_sexting_1553330670_800x420.png"}