{"text": "Did you know that Priyanka Chopra’s mother wasn’t happy with the idea of her getting married at Jodhpur’s Umaid Bhawan? Because that meant inviting only 200 guests at the wedding!\n“For an Indian family and an Indian wedding, [it was small] for sure. My mother was so upset with me the whole time. She was like, ‘I need to have another wedding for the other 150,000 people that I know! How can I not invite my jeweller? How can I not invite my hairdresser?’ So it was a whole conversation,” she quipped as she made the revelation at The Ellen DeGeneres Show.\nOpening about her mesmerizing love story, Priyanka Chopra couldn’t stop gushing how much she loves Nick Jonas for reasons more than one. She said she didn’t know much about each other’s career when they had started dating.\n“We showed each other our work from when we were younger — the embarrassing stuff, like, the horrible stuff. It was great. That’s how we got to know each other’s careers.”\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nShe was surprised to know that he is so family-driven.\n“It shocks me how he’s not been corrupted. We know when you’re in entertainment for such a long time … He’s so family-driven, he’s all about his parents. And he’s just nice and sweet,” she added.\nAlso Read: Priyanka Chopra's Bags Her Fourth Hollywood Project, To Play Osho's Disciple Ma Anand Sheela", "title": "Priyanka Chopra Gushes About How Her Husband Nick Jonas Is Family Driven & Not 'Corrupted'", "date_publish": "31/01/2019, 18:27:31", "description": "Opening about her mesmerizing love story, Priyanka Chopra couldn’t stop gushing how much she loves Nick Jonas for reasons more than one. She said she didn’t know much about each other’s career when they had started dating. She was surprised to know that he is so family-driven.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-gushes-about-how-her-husband-nick-jonas-is-family-driven-not-corrupted-361391.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/priyanka_chopra_is_head_over_heels_in_love_with_nick_jonas_1548938663_800x420.jpg"}