{"text": "Actress Priya Prakash Varrier, who became an overnight sensation after the teaser of her debut movie Oru Adaar Love became viral, seems to have a knack for hitting the headlines.\nThis time, however, the news in the aftermath of the release of the trailer of her debut Bollywood movie, Sridevi Bunglow directed by Prashanth Mambully, is not entirely positive.\nPriya plays a lonely actress in the movie and the trailer has visual of her in a bath tub. Netizens did not miss the similarities in the plot to the life and death of veteran Bollywood actress Sridevi.\nscreen grab/youtube\nSoon followed news that Sridevi’s husband Boney Kapoor had sent a legal notice to the makers of the film, demanding that they remove the late actress’ name from the title and other resemblances to her life in the film.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nConfirming this and explaining his position, director Prashanth tells us, “In the notice, Boney Kapoor has raised a few objections against our film including the usage of the name and doing a biopic of the actress.\nHe wanted us to alter the name of our movie within 24 hours. We sent him a reply explaining that Sridevi was a common name and there was no logic in objecting to it. It is just coincidence that my movie tells the tale of an actress named Sridevi,” insists Prashanth who has also scripted the film.\nbccl\nPriya Prakash Varrier echoes the director’s views when she says, “Sridevi is just the name of my character in the movie. Who would want to create such controversies? I think the curiosity surrounding the trailer is good and we have to leave it to the audience to judge if the film is based on the veteran actress Sridevi ma’m.”\nWhile she is happy about the trailer getting released and generating interest, it is unfortunate, in her opinion, that it has courted controversy.\nIs the story really about the late actress or is the 1-minute, 49-second trailer only trying to cash in on Sridevi’s untimely death? “Like Priya said, we would like to leave it to the audience to decide.\nThe film is a crime thriller and it is important to maintain the suspense of the story. I cannot walk around and reveal the plot to all. I am a hardcore fan of actress Sridevi and I respect and admire her a lot. But just because she died in a bath tub doesn’t mean nobody else won’t. Allow us to release the movie and let the people decide,” says the director.\nscreen grab/youtube\nPrashanth adds that he is ready to screen the film at the court if things get worse. “I am ready to face it as I am very well aware that a biopic cannot be made without permission.\nIt is a story that came to my mind about an actress named Sridevi and certain situations that she faces in London,” he says. The film which will resume its shoot at UK next month, he says, is expected to hit the theatres in April.\nPrashanth lets on that Priya has showcased a fabulous performance in the movie. “We had planned to rope in Kangana Ranaut for the role but opted for Priya as she is popular in the South as well,” he sums up.\nInputs From TNN", "title": "Priya Varrier Defends 'Sridevi Bungalow' Post Legal Notice, Says It’s Just Her Character’s Name", "date_publish": "17/01/2019, 15:38:14", "description": "Actress Priya Prakash Varrier, who became an overnight sensation after the teaser of her debut movie Oru Adaar Love became viral, seems to have a knack for hitting the headlines. This time, however, the news in the aftermath of the release of the trailer of her debut Bollywood movie, Sridevi Bunglow directed by Prashanth Mambully, is not entirely positive. Priya plays a lonely actress in the movi", "authors": [], "url": "https://www.indiatimes.com/entertainment/priya-varrier-defends-sridevi-bungalow-post-legal-notice-says-it-s-just-her-character-s-name-360582.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/actress_priya_prakash_varrier_who_became_an_overnight_sensation_after_the_teaser_of_her_debut_movie_1547719882_800x420.jpg"}