{"text": "Priyanka Chopra-Nick Jonas' Wedding Video Shows It's All About Meeting The Right Person At The Right Time\nPriyanka Chopra-Nick Jonas' Wedding Video Shows It's All About Meeting The Right Person At The Right Time\nLove conquers all. This phrase fits in perfectly in Priyanka Chopra and Nick Jonas' life. They met, sparks happened, fell in love and there was no looking back. The way the couple embraced each other and each other's traditions is what speaks volumes about their love and bond.\nInstagram\nThe couple tied the knot in Jodhpur, amidst close friends and family and the five-day wedding affair was as perfect as it could be. Their first official wedding photos were posted by Hello! Magazine and the photographs look straight out of a dream.\nPeople Magazine\nWhile PC chose a stunning red Sabyasachi lehenga for their Hindu-wedding, PC wore white Ralph Lauren gown decorated with TWO MILLION pearl sequins and a 75ft veil.\nScreengrab/People Magazine\nIn case you want a closer glimpse of their wedding celebrations, have a look at this beautiful video right now!\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES", "title": "Priyanka Chopra-Nick Jonas' Wedding Video Shows It's All About Meeting The Right Person At The Right Time", "date_publish": "04/12/2018, 17:18:04", "description": "Priyanka Chopra, Nick Jonas, Nick and Priyanka Chopra, PC an Nick wedding, Wedding Video PC and Nick, Nickyanka Wedding, Jodhpur Wedding PC and NickPriyanka Chopra, Nick Jonas, Nick and Priyanka Chopra, PC an Nick wedding, Wedding Video PC and Nick, Nickyanka Wedding, Jodhpur Wedding PC and NickPriyanka Chopra, Nick Jonas, Nick and Priyanka Chopra, PC an Nick wedding, Wedding Video PC and Nick, Ni", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-nick-jonas-wedding-video-shows-it-s-all-about-meeting-the-right-person-at-the-right-time-357940.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/pc_and_nick_jonas_1543924225_800x420.jpg"}