{"text": "With Sindoor on her head, choodha on her hands and donning a saree, Priyanka Chopra finally made her first appearance as a married woman after tying the knot with Nick Jonas at Jodhpur airport.\nAfter getting married twice in Hindu and Christian ceremonies, Nick Jonas and Priyanka Chopra are officially man and wife now.\nThey flew out of Jodhpur on Monday afternoon, and at the airport they were greeted by the fans and paparazzi. And their couple swag is still intact. Priyanka and Nick greeted the paparazzi with a Namaste.\nAlso Read: With Song & Dance Competition, PC-Nick Celebrate Their Sangeet In ‘Hum Saath Saath Hain’ Style\n#1\nViral Bhayani\n#2\nViral Bhayani\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n#3\nViral Bhayani\n#4\nViral Bhayani\nPriyanka Chopra and Nick Jonas’ wedding ceremonies happened in typical desi style. With song and dance competition during Sangeet and groom arriving on a horse-drawn carriage, it must have been a fun-affair for all the guests.\nIt is said that the Nick Jonas and Priyanka Chopra got each other’s name written on their hands with Mehendi. What’s more? Rumours suggest that Priyanka Chopra got emotional during the festivities missing her father.", "title": "Priyanka Chopra & Nick Jonas Make Their First Appearance As Married Couple, Greet Fans With ‘Namaste’", "date_publish": "03/12/2018, 16:34:10", "description": "With Sindoor in her head and Choodha in her hands, donning a saree Priyanka Chopra finally made her first appearance after tying the knot to Nick Jonas at Jodhpur airport. After getting married twice in Hindu and Christian ceremonies, Nick Jonas and Priyanka Chopra are man and wife now.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-nick-jonas-make-their-first-appearance-as-a-married-couple-greet-fans-with-a-namaste-357840.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_chopra__nick_jonas_make_their_first_appearance_as_married_couple_greet_fans_with_namaste_1543834091_800x420.png"}