{"text": "Global actress Priyanka Chopra has been working towards social causes. Whether its working for UNICEF or her latest venture with Facebook, PC sure is putting her brand image to good use.\nYes, the Baywatch actress Priyanka Chopra has partnered with Facebook India for a live event called #SocialForGood to spread awareness on issues like mental health, cyber bullying and women entrepreneurship.\n#SocialForGood will be a four hour long live event, which will take place on November 27 on Facebook.\nInstagram\nTalking about the event and influence of social media on social issues, Priyanka said in a statement: \"There is no denying the power of social media. It is a force which once unleashed, is difficult to control or stop. Its force comes from the huge influence it wields and recognising that means, using it well, to do some good.\nDon't Miss 837 SHARES 3.6 K SHARES\n\"I have personally witnessed the positive effects of social media in bringing awareness and action to many of the causes I hold dear to my heart. The right content can make all the difference.\"\nThe actress feels the idea to use \"it to bring awareness to causes that matter, celebrate some real-life stories and also inspire people to do their bit for the community, is fantastic\" idea.\nBCCL\n\"I am looking forward to this partnership with Facebook. May the Force to spread the good, be with all of us #SocialForGood,\" she added. Apart from the \"Baywatch\" actress, the event will also witness other big names from the industry who have been active on social media in spreading awareness and education among people. The names are yet to be announced.\n\"Social Media has been playing a pivotal role in recent times to bring awareness to issues that affect minorities, local communities and even matters of national importance.\n\"With #SocialForGood, our endeavour is to shine a spotlight on some of the fantastic work our community of public figures and socially-responsible volunteers have been doing to bring positive change, not just on the internet but our everyday lives, \" said Saket Jha Saurabh - Head of Entertainment Partnerships, Facebook India.\nInputs from IANS", "title": "Priyanka Joins Hands With Facebook", "date_publish": "15/11/2018, 17:41:59", "description": "Actress Priyanka Chopra has partnered with Facebook India for a live event called #SocialForGood to spread awareness on issues like mental health, cyber bullying and women entrepreneurship. #SocialForGood will be a four hour long live event, which will take place on November 27 on Facebook.", "authors": [], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-joins-hands-with-facebook-to-spead-awareness-on-mental-health-and-women-entrepreneurship-356740.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_1542280587_800x420.jpg"}