{"text": "Now we all know the unbreakable camaraderie between Priyanka Chopra and Sophie Turner. After all, who can forget PC’s extravaganza spinster parties where Sophie had so much fun.\nTwitter\nIn fact, when Priyanka was labelled as a global scamster by a daily, it was sister in law Sophie who first raised her voice against that publication. Clearly, their bond has just grown over a period of time. Sophie, who has been stunning her fans in the latest season of Game Of Thrones did a hush hush wedding with the love of her life Joe Jonas at Las Vegas. Clearly here's what happens at Vegas is not staying in Vegas.\nTwitter\nSophie and Joe did a simple wedding where their entire family was present. Priyanka was throughout cheering for her bride, in fact she was right sitting next to Sophie if at all she needed any help. But looks like Nick wanted to be the best man for both Sophie and Joe.\nDon't Miss 842 SHARES\nIf you see the video clearly, while Sophie was taking her wedding vows, she looked for a flower bouquet around soon PC rushed to pick it up but Nick won the cake and handed over to her. Priyanka and Nick both looked supremely happy at Sophie and Joe’s wedding, PC was even seen donning white floral headgear which clearly screamed she is ladkiwale.\nAlso, the entire Jonas family was in Las Vegas for Billboard Music Awards on Wednesday, in fact the Jonas brothers even performed at the music night while their respective wives cheered for them.", "title": "Priyanka Chopra Is A Perfect Bridesmaid At Sophie Turner & Joe Jonas' Wedding In Vegas", "date_publish": "03/05/2019, 11:57:18", "description": "Now we all have the unbreakable camaraderie between Priyanka Chopra and Sophie Turner, who can forget PC’s extravaganza spinster parties where Sophie had all the fun. In fact, when Priyanka was labeled as a global scamster after her wedding with Nick Jonas, it was Sophie who first raised her voice against that publication. Their bond has just grown over the time. Sophie who stunned her fans in t", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-is-a-perfect-bridesmaid-at-sophie-turner-joe-jonas-wedding-in-vegas-366537.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/priyanka_chopra_1556865232_800x420.jpg"}