{"text": "Priyanka Chopra Had No 'Aitraaz' And Took Just 45 Seconds To Say Yes To Nick's Proposal!\nPriyanka Chopra Had No 'Aitraaz' And Took Just 45 Seconds To Say Yes To Nick's Proposal!\nWhen it comes to love and romance, the universe conspires in mysterious ways. For Priyanka Chopra and Nick Jonas, Cupid stuck when they had least expected it to.\nPC and Jonas met at the Met Gala 2017 but nothing sparked between them. However, a year and a half later, after the exchange of texts and a date night, they both knew that there is something more to it.\nAgencies\nThe couple started dating and there was no looking back. While many of us have already heard their proposal story, looks like there was more to it.\nGetty Images\nJonas proposed in Crete. According to Vogue magazine's January cover issue, Jonas revealed how he waited till the midnight to make sure the proposal doesn't coincide with her birthday in the future.\nDon't Miss 186 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\nAgencies\n“I got down on one knee, again, and I said: Will you make me the happiest man in the world and marry me?” says Nick Jonas.\nIn the interview, Nick says,\nAgencies\n\"No joke—she took about 45 seconds. Forty-five seconds of silence.” Jonas pressed on, “I’m going to put this ring on your finger now unless you have any objections.”\nNot many know that just after the third date, Nick was sure that PC was indeed the 'one'. No, I am not crying. You're! Also, me right now:\nPC and Nick will tie the knot at Taj Umaid Bhawan Palace in Jodhpur, India. The couple will have a traditional Indian wedding and a Christian wedding service officiated by Nick’s father.\n(Also read: From The Met Gala To Shaadi Ka Mandap, Here's A Timeline Of PC & Nick Jonas' Whirlwind Romance. )", "title": "Priyanka Chopra Had No 'Aitraaz' And Took Just 45 Seconds To Say Yes To Nick's Proposal!", "date_publish": "30/11/2018, 17:59:04", "description": "The couple started dating and there was no looking back. While many of us have already heard their proposal story, looks like there was more to it. Jonas proposed in Crete. According to Vogue magazine's January cover issue, Jonas revealed how he waited till the midnight to make sure the proposal doesn't coincide with her birthday in the future.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-had-no-aitraaz-and-took-just-45-seconds-to-say-yes-to-nick-s-proposal-357677.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_1543581221_800x420.jpg"}