{"text": "Priyanka Chopra Calls India Nick Jonas' 'Second Home', Says He Liked It In Just Three Visits\nPriyanka Chopra Calls India Nick Jonas' 'Second Home', Says He Liked It In Just Three Visits\nThe wedding preps for Nick Jonas and Priyanka Chopra are on! Currently, the couple is enjoying their courtship period as they are spending time together by traveling and exploring places. The couple got engaged in Mumbai in August and everyone was pleasantly surprised how Nick Jonas was seen taking part in the Puja that happened with the Roka ceremony.\nInstagram/PC\nNick was all involved in the traditional ceremony. But wait, that's not all! According to PC, Nick is already in love with India. In a recent interview to extratv.com, PC mentioned their India trips and how after his third trip, Nick was quite comfortable and could move around the city and even socialize with her friends here.\nAgencies\nPC was quoted as saying,\n“By trip three, he was fine. When I was doing my meetings, he was meeting friends, he was going out. He’s fine now. Now, it’s his other home.”\nShe went on to talk more about Nick and how he is very involved with her.\nViral Bhayani\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n“I’m not someone who likes to go out too much. I’m someone who’ll, like, call friends in and stay in and he loves experiences... He does know where to go and what’s happening (in India),” she added.\nA lot of people are very excited about what PC will wear for her wedding and she spoke about the same thing while talking to Entertainment Weekly. She said that will be wearing something “cute and comfortable”. She said,\nAgencies\n“I always believed that anything and everything that I wear, I have to be comfortable and cute. So it’s going to be cute and comfortable.”\nAccording to recent reports, Priyanka and Nick are all set to tie the knot in Jodhpur in December. PC will be hosting a special bridal shower in New York in October, which will be followed by nuptials in Umaid Bhawan in Jodhpur. An estimated guest list of 200 people has been confirmed.", "title": "Priyanka Chopra Calls India Nick Jonas' 'Second Home', Says He Liked It In Just Three Visits", "date_publish": "23/10/2018, 17:03:42", "description": "According to recent reports, Priyanka and Nick are all set to tie the knot in Jodhpur in December. PC will be hosting a special bridal shower in New York in October, which will be followed by nuptials in Umaid Bhawan in Jodhpur. An estimated guest list of 200 people has been confirmed.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-calls-india-nick-jonas-second-home-says-he-liked-it-in-just-three-visits-355310.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/nick_and_pc_1540295019_800x420.jpg"}