{"text": "Priyanka Chopra Throws A Pre-Wedding Party To Welcome Sophie Turner & Joe Jonas In India\nPriyanka Chopra Throws A Pre-Wedding Party To Welcome Sophie Turner & Joe Jonas In India\nAfter Bajirao (Ranveer Singh) and Leela (Deepika Padukone), it’s time for Kashibai AKA Priyanka Chopra to get married to the love of her life Nick Jonas.\nThe groom has arrived in India for the wedding which is scheduled to take place at Jodhpur’s Umaid Bhavan. The Baraatis including Joe Jonas and Sophie Turner also landed in Mumbai yesterday.\nIt’s party time for Priyanka Chopra and Nick Jonas. As PC’s first wedding guests arrived in Mumbai for their Band Baaja Baaraat, she threw a party to welcome them last night. It was a star-studded affair! Celebs including Alia Bhatt and Parineeti Chopra were also spotted at the bash. Take a look!\n#1\nViral Bhayani\n#2\nViral Bhayani\n#3\nViral Bhayani\n#4\nViral Bhayani\nDon't Miss 365 SHARES\n#5\nViral Bhayani\n#6\nViral Bhayani\n#7\nViral Bhayani\nNick Jonas looks quite comfortable visiting India now. In fact, Priyanka Chopra says it’s his second home. “By trip three, he was fine. When I was doing my meetings, he was meeting friends, he was going out. He’s fine now. Now, it’s his other home,” she told Cosmopolitan in an interview adding that he has also made friends here.\nPriyanka Chopra and Nick Jonas will tie the knot twice in Hindu and Christian ceremonies on Dec 2 and Dec 3, reportedly.", "title": "Priyanka Chopra Throws A Pre-Wedding Party To Welcome Sophie Turner & Joe Jonas In India", "date_publish": "27/11/2018, 11:20:02", "description": "It’s party time for Priyanka Chopra and Nick Jonas. As PC’s first wedding guests arrived in Mumbai for their Band Baaja Baaraat, she threw a party to welcome them last time. It was a star-studded affair! Celebs including Alia Bhatt and Parineeti Chopra were also spotted at the bash. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-throws-a-pre-wedding-party-to-welcome-sophie-turner-joe-jonas-in-india-357442.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_chopra_throws_a_prewedding_party_to_welcome_sophie_turner__joe_jonas_in_india_1543297935_800x420.png"}