{"text": "After the wedding festivities, honeymoon, receptions and get togethers, Priyanka Chopra is back to work. The diva has already bagged her fourth Hollywood project with an Oscar-winning director Barry Levinson. In the movie, our desi girl will be seen playing the role of spiritual leader Osho's disciple and closest aide Ma Anand Sheela.\nIn case you didn’t know it already, Ma Anand Sheela is the former right-hand woman to godman Osho. Her popularity grew further after Netflix’s documentary series titled Wild Wild Country released.\nConfirming the news, Priyanka Chopra spilled the beans about the project when she recently appeared on Ellen Degeneres show.\nwweek.com\n“We’re developing it as the character of Sheela, who was this guru who originated from India, his right-hand woman. And she was just devious and created a whole cult in America, brought people here,” she said.\nPriyanka Chopra developing a movie with academy award nominee Berry Levinson. PRODUCING AND STARRING TAKE ALL MY MONEY @priyankachopra pic.twitter.com/lrBfgqcnyN — #jess (@hipslikePC) January 30, 2019\nTo know more about Ma Anand Sheela, watch her hilarious interview below.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nPriyanka Chopra will nail this role, don’t you agree?", "title": "Priyanka Chopra:Priyanka Chopra Bags Her Fourth Hollywood Project, To Play Osho's Disciple Ma Anand Sheela", "date_publish": "31/01/2019, 11:30:32", "description": "After having done with the wedding festivities, honeymoon, receptions and get together, Priyanka Chopra is back to work. The diva has already bagged her fourth Hollywood project with an Oscar-winning director Barry Levinson. In the movie, our desi girl will be seen playing the role of spiritual leader Osho's closet aid Ma Anand Sheela.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-s-bags-her-fourth-hollywood-project-to-play-osho-s-disciple-ma-anand-sheela-361345.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/priyanka_chopra_will_play_godman_oshos_closet_aid_ma_anand_sheela_1548913707_800x420.png"}