{"text": "Priyanka Chopra Is In A Happy Place At The Moment & Doesn’t Feel The Need To React To 'Scam Artist' Story\nPriyanka Chopra Is In A Happy Place At The Moment & Doesn’t Feel The Need To React To 'Scam Artist' Story\nPriyanka Chopra and Nick Jonas had a fairytale wedding, everything about their wedding was just beautiful. The entire world showered their, love and blessings to the newlywed.\nHowever, one online entertainment portal wasted no time in spewing venom on PC and Nick’s wedding as it labeled our desi girl - a global scam artist. No points for guessing, that this piece of writing obviously didn’t go down well with all her fans and near and dear ones. The racist and sexist article on Priyanka went viral and received a lot of backlash. So much so, the portal was forced to take down the article and even apologize for their blunder, as they were receiving so much hatred from people all around the globe.\nTwitter\nPriyanka, who soon after her marriage hosted an event of an app launch along with hubby Nick was asked about the viral article on her, she took it sportingly and answered like a true diva,\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n\"I don't even want to react or comment. It's not even in my stratosphere. I'm in a happy place at this moment. These kinds of random things can't disturb it.\"\nPC’s brother-in-law Joe Jonas and his fiancée and Games Of Thrones star Sophie Turner also slammed the portal.\nTwitter\nTwitter\nEven Sonam Kapoor and Arjun Kapoor showed support to Priyanka.\nTwitter\nTwitter\nThe best thing is Priyanka is least affected by it. Kudos to her!", "title": "Priyanka Chopra Says She Is In A Happy Place At The Moment & Doesn’t Want To React On Random Things", "date_publish": "06/12/2018, 14:58:27", "description": "Priyanka Chopra and Nick Jonas had a fairytale wedding, everything about Pri and Nick’s wedding was just beautiful. The entire world showered their, love and blessings to the newly wed, except one. One online entertainment portal spewed venoms on PC and Nick’s wedding, they labeled our desi girl as a global scam artist, which obviously didn’t go well with all her fans and near and dear ones. The r", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-is-in-a-happy-place-at-the-moment-doesn-t-feel-the-need-to-react-to-scam-artist-story-358063.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/priyanka_1544088648_800x420.png"}