{"text": "It's time we get ready for yet another lavish celebrity wedding. Priyanka Chopra and Nick Jonas are all set to solemnize their affair of eight months by exchanging vows in Umaid Bhawan, Jodhpur.\nThe couple got engaged in August in Mumbai and they will take the second step towards their happy forever amidst close ones in Jodhpur. Jonas and Chopra have reportedly booked Umaid Bhawan Palace for five days.\n(Also read: Priyanka Chopra Throws A Pre-Wedding Party To Welcome Sophie Turner & Joe Jonas In India)\nThis was confirmed by a media portal who quoted a source as saying,\n“None of the rooms are available on these dates. We have rooms till November 28 and again starting from December 4. We are completely booked for the five days in between.”\nThat's not all. This wedding is going to be one royal affair and in every sense of the word. Can you guess how much money the couple is shelling out for this palace wedding? Just FYI,\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nInstagram\nUmaid Bhawan Palace has 64 luxurious rooms and suites i.e. 22 palace rooms and 42 suites which are further divided into four types - 24 historical suites, 10 royal suites, 6 grand royal suites, and 2 presidential suites.\nThe per night prices (exclusive of taxes) for each room is Rs 47,300 for palace rooms, Rs 65,300 for historical suites, Rs 1.45 lakh for royal suites, Rs 2.30 lakh for grand royal suites and Rs 5.04 lakh for presidential suites.\nSo, the total cost to book the entire hotel sums up to approximately Rs 64.40 lakh per night. Considering the fact that Priyanka and Nick have booked the entire property for five days, the accommodation will reportedly cost around Rs 3.2 crore.\nAgencies\nThat's not all. A special helipad has been made inside Umaid Bhawan to ferry guests in and out of the property! This wedding is surely going down in the history of most stylish and royal celebrity weddings in India. Agree?", "title": "Priyanka Chopra-Nick Jonas' Lavish Four-Day Jodhpur Wedding To Cost Them Approx Rs 64 Lacs Per Day", "date_publish": "27/11/2018, 18:23:11", "description": "The couple got engaged in August in Mumbai and they will take the second step towards their happy forever amidst close ones in Jodhpur. Jonas and Chopra have reportedly booked Umaid Bhawan Palace for five days.That's not all. This wedding is going to be one royal affair and in every sense of the word. Can you guess how much money the couple is shelling out for this palace wedding?", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-nick-jonas-lavish-four-day-jodhpur-wedding-to-cost-them-approx-rs-64-lacs-per-day-357494.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_1543323368_800x420.jpg"}