{"text": "Priyanka Chopra-Nick Jonas Take The DeepVeer Route, Will Marry Twice In Hindu & Christian Ceremonies\nPriyanka Chopra-Nick Jonas Take The DeepVeer Route, Will Marry Twice In Hindu & Christian Ceremonies\n“When are you getting married?” – This is perhaps the most annoying question that people get asked in their 20/30s, don’t you agree?\nBut celebrities, on the other hand, are pitted against this question, perhaps thousands of time. “When is Bhai getting married?” is a million dollar question, but why do we even care?!\nSome things are better left alone to personal discretion – like what you’re wearing on your wedding day and where exactly you are getting married.\nBut celebrities often find it hard to keep their personal life private. Fame and stardom comes with a downside, after all.\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 12.5 K SHARES 186 SHARES\nSo, Deepika Padukone and Ranveer Singh got married in Italy, several failed attempts were made to catch glimpses of their private affair. Finally, they shared some pictures from the wedding festivities yesterday.\nNow that the frenzy over Deepika-Ranveer’s wedding has calmed down, it’s time for Priyanka Chopra and Nick Jonas’ wedding, which will take place in Jodhpur’s Umaid Bhavan, as confirmed by PC’s mother Madhu Chopra.\nNow, if reports are to be believed, they will tie the knot twice. On Dec 2, the duo will have Hindu ceremony, which will then be followed by a Christian wedding on Dec 3.\nNick will be in Jodhpur on Nov 28, it is said, and PC will arrive on Nov 25 or 26, after wrapping the shoot of The Sky Is Pink.\nMeanwhile, the guests are already getting macaroons along with invitations.\nIt’s not a secret anymore – and nothing can be, when you’re a celebrity.", "title": "Priyanka Chopra-Nick Jonas Take The DeepVeer Route, To Marry Twice In Hindu & Christian Ceremonies", "date_publish": "21/11/2018, 16:39:24", "description": "Now that the frenzy over Deepika-Ranveer’s wedding is about to die down, it’s time for Priyanka Chopra and Nick Jonas’ wedding, which will take place in Jodhpur’s Umaid Bhavan, as confirmed by PC’s mother Madhu Chopra. Now that the frenzy over Deepika-Ranveer’s wedding is about to die down, it’s time for Priyanka Chopra and Nick Jonas’ wedding, which will take place in Jodhpur’s Umaid Bhavan, as c", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/priyanka-chopra-nick-jonas-take-the-deepveer-route-will-marry-twice-in-hindu-christian-ceremonies-357109.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyankanick_jonas_take_the_deepveer_route_to_marry_twice_in_hindu__christian_ceremonies_1542795671_800x420.png"}