{"text": "If there is one celebrity, who is making everyone envious and for all the right reasons, it's Priyanka Chopra. Come on! She's living her best life with love of her life Nick Jonas and her life looks like an exotic vacation.\nAgencies\nJust about yesterday, she shared pictures with ‘Jonas sisters’ Danielle Jonas, Sophie Turner, and herself, all posing together. Sharing the picture on Instagram Friday, Priyanka wrote, “The #Jsisters are finally together.”\nInstagram\nAnd this comes just about a week after pictures and videos of the Jonas family in Miami paved its way on the internet. The pictures were all over the internet and every picture looked like some leaked footage from some film sets!\nTwitter\nDon't Miss 159 SHARES 12.5 K SHARES 186 SHARES 161 SHARES\nWait. There is more to be envious about.\nRight after Jonas Brothers’ comeback single Sucker reached the #1 spot on the Billboard Hot 100, Nick Jonas gifted his wife a brand new car and Priyanka couldn’t be happier. Sharing a celebratory post, she wrote,\n“When the hubby goes number one.. the wifey gets a @maybach !! Introducing.. Extra Chopra Jonas.. haha .. I love you baby!! Yaaay! Best husband ever.\"\nBut for all those who think that Priyanka Chopra's life doesn't exist beyond Nick Jonas and the family, you're mistaken. She's juggling between her professional and personal commitments like a Queen and we have proof. For all those who have been thinking that ambitions have taken a back seat for PC, she might just be seen in one of the upcoming Marvel movies.\nAvengers: Endgame\" co-director Joe Russo on Monday revealed that he is in talks with Indian star Priyanka Chopra for a project. The 47-year-old filmmaker, who is known for giving Marvel Cinematic Universe (MCU) a grounded tone along with his brother Anthony Russo, finds Priyanka 'fantastic' and would love to work with her. Confirming the news, he said,\n\"Priyanka is transitioning into global status now. She is fantastic... (I would) Love to work with her... I am potentially talking to Priyanka for something. I am not going to say what it is.\"\nThat's not all. While she might be sipping her next mimosa on her vacation, the news of the fourth wax statue of being unveiled at Madame Tussaud’s Sydney is making her fans happy.\nAgencies\nAfter three wax statues in New York, London, and Singapore, PC has also become the first Indian actress ever to have four statues in Madame Tussauds.\nSo all those who are judging her for changing her priorities or keeping her professional ambitions at the back seat for her marriage and life, she is doing much more than what you see on social media. She is having the best time of her life and that's just one part of her life that is glorious in every sense of the word.", "title": "Priyanka Chopra Is Living The Best Time Of Her life With Everyone She Loves But Mind You, She's Doing Much More!", "date_publish": "06/04/2019, 12:52:08", "description": "Priyanka Chopra Might Just Be Chilling In Life But Mind You, She's Doing Much More!Priyanka Chopra Might Just Be Chilling In Life But Mind You, She's Doing Much More!Priyanka Chopra Might Just Be Chilling In Life But Mind You, She's Doing Much More!Priyanka Chopra Might Just Be Chilling In Life But Mind You, She's Doing Much More!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/priyanka-chopra-is-living-the-best-time-of-her-life-with-everyone-she-loves-but-mind-you-she-s-doing-much-more-364982.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/priyanka_chopra_1554536500_800x420.jpg"}