{"text": "Proud Parents Abhishek Bachchan And Aishwarya Rai Cheer For Little Aaradhya As She Nails Her Performance In School\nProud Parents Abhishek Bachchan And Aishwarya Rai Cheer For Little Aaradhya As She Nails Her Performance In School\nBollywood actress Aishwarya Rai is one of the few actresses who knows the art of work-life balance. She has starred in some of the most phenomenal projects like Jodha-Akbar, Devdas, Ae Dil Hai Mushkil, Guru but she still manages to give time to her family.\nTwitter/Aish FC\nThe actress is also the face of Loreal and attends the Cannes Film Festival every year but that doesn't give her an excuse to give up on her responsibilities. She's an inspiration to many working mothers, who are always looking at how to juggle work and kids.\nTwitter/Abhishek\nAishwarya Rai is a mother to a 7-year-old, and whether it's her own red carpet event or Aaradhya's annual event, Aishwarya ensures she's giving proper time to her tiny tot. This time around, her daughter had a function in school. Aishwarya, just like most mothers, turned up along with her husband Abhishek Bachchan.\nDon't Miss 862 SHARES 346 SHARES\nThe duo were seen cheering loudly for their baby girl and making videos of her. Take a look.\nPart 2 of Aaradhya’s performance from the night pic.twitter.com/SK01n0aZ5Z — Bewitching Bachchans (@TasnimaKTastic) December 20, 2018\nPart 3 of Aaradhya’s performance pic.twitter.com/l81HPVMQE3 — Bewitching Bachchans (@TasnimaKTastic) December 20, 2018\nPart 5 from Aaradhya’s performance pic.twitter.com/mf69TqDaJS — Bewitching Bachchans (@TasnimaKTastic) December 20, 2018\nAB is literally me at programmes 🙈 pic.twitter.com/QyLor4yVtd — Bewitching Bachchans (@TasnimaKTastic) December 20, 2018\nAishwarya Rai was last seen in Fanney Khan which did not perform too well at the box office. On the other hand, Abhishek Bachchan will be seen next in Housefull 4. And on the personal front as we can all see, the parents continue to be doting and shower love to their baby daughter.", "title": "Proud Parents Abhishek Bachchan And Aishwarya Rai Cheer For Little Aaradhya As She Nails Her Performance In School", "date_publish": "22/12/2018, 14:55:36", "description": "Whether it's her own red carpet event or Aaradhya's annual event, Aishwarya ensures she's giving proper time to her tiny tot. Bollywood actress Aishwarya Rai is one of the few actresses who knows the art of work-life balance. She has starred in some of the most phenomenal projects like Jodha-Akbar, Devdas, Ae Dil Hai Mushkil, Guru but she still manages to give time to her family.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/proud-parents-abhishek-bachchan-and-aishwarya-rai-cheer-for-little-aaradhya-as-she-nails-her-performance-in-school-359090.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/abhishek_1545471911_800x420.jpg"}