{"text": "Proud To Be Associated With The Magnum Opus, Rana Daggubati Compares 'Baahubali' To 'Star Wars'\nProud To Be Associated With The Magnum Opus, Rana Daggubati Compares 'Baahubali' To 'Star Wars'\nSS Rajamouli’s two-part magnum opus Baahubali was indeed a game changer for Indian cinema. The south Indian venture became a rage abroad. Recently, Rana Dagubbati who found out that Sigapore comicbook store had sold a large number of copies of a comic based on the movie, compared the magnum opus with Star Wars.\nBCCL\nActor Rana Daggubati says he is proud to be associated with superhit Indian film franchise Baahubali, which is now making an impact internationally in the form of a comic book.\nRana had gone to Singapore for a professional commitment when he went to a book store. He found that the store had sold a large number of copies of a comic based on the film Baahubali series. The comic book in Japanese language is getting a positive response in the Asian market.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Trans media of films as comics/graphic novels and reliving all of that through merchandise for films like 'Star Wars', 'Jurassic Park' or titles in the DC/Marvel cinematic universe is what I grew up on,\" Rana said in a statement.\n\"Having been part of probably the first Indian film that broke boundaries not only nationally but on all platforms available as book comics, soon as a show and going all the way to Japan as Manga comics really makes me feel fortunate... Just to be a part of something so special and open up potential of where Indian storytelling can go in the future.\n\"'Baahubali' has done to Indian cinema what 'Star Wars' has done to America. I really feel we are in our best time now,\" he added.\nBaahubali: The Beginning and Baahubali 2: The Conclusion stars Prabhas and Rana as the male protagonists. The film's story is about the battle for the ownership of an ancient kingdom between two brothers. The story is woven together in two parts with dance, music, emotion and drama.\nWith inputs from IANS", "title": "Proud To Be Associated With The Magnum Opus, Rana Daggubati Compares 'Baahubali' To 'Star Wars'", "date_publish": "24/10/2018, 17:16:02", "description": "Actor Rana Daggubati says he is proud to be associated with superhit Indian film franchise \"Baahubali\", which is now making an impact internationally in the form of a comic book. Rana had gone to Singapore for a professional commitment when he went to a book store. He found that the store had sold a large number of copies of a comic based on the film \"Baahubali\" series.", "authors": [], "url": "https://www.indiatimes.com/entertainment/proud-to-be-associated-with-the-magnum-opus-rana-daggubati-compares-baahubali-to-star-wars-355380.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/proud_to_be_associated_with_the_magnum_opus_rana_daggubati_compares_baahubali_with_star_wars_1540384399_800x420.jpg"}