{"text": "The terror attack in Pulwama of Jammu and Kashmir has left the entire nation in a state of shock. On 14 February 2019, a convoy of vehicles carrying security personnel on the Jammu Srinagar National Highway was attacked by a vehicle-borne suicide bomber at Lethpora (near Awantipora) in the Pulwama district, Jammu and Kashmir, India.\nThe attack resulted in the death of 40 Central Reserve Police Force (CRPF) personnel and the attacker.\nBCCL\nWhile the nation is still grieving and mourning the loss of our brave soldiers, there are people who are coming together during this tough time to stand in solidarity with the families of the deceased soldiers.\nAgencies\nReacting to the news, many Bollywood actors including Aamir Khan, Salman Khan, Shah Rukh Khan, Alia Bhatt, Priyanka Chopra, Akshay Kumar, Shabana Azmi, Javed Akhtar and Amitabh Bachchan have condemned the attack.\n(Also read: Amitabh Bachchan To Donate Rs 5 Lakh Each To Families Of 49 CRPF Martyrs Of Pulwama Attack )\nMany have also extended monetary help in favor of these grieving families. And after Big B, the team of Uri: The Surgical Strike, too, in collaboration with their production house RSVP, have donated to the families of Uri attack/Army Welfare Fund.\nRSVP Films\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe news was announced on social media by UTV head honcho Ronnie Screwvala. Apart from tagging PM Narendra Modi and brands like PayTM, Ola Cabs, Flipkart, Amazon, he wrote:\nAgencies\n“RSVP &Team URI committed Rs. 1 Cr to families of URI attack /Army Welfare Fund -will ensure part goes to victims #Pulwama ..but urge more to respond -in small lots - and also our Indian “Unicorns” to donate graciously.”\nRSVP &Team URI committed Rs. 1 Cr to families of URI attack /Army Welfare Fund -will ensure part goes to victims #Pulwama ..but urge more to respond -in small lots - and also our Indian “Unicorns” to donate graciously @Paytm @Olacabs @Flipkart @amazon @narendramodi @anandmahindra — Ronnie Screwvala (@RonnieScrewvala) February 16, 2019", "title": "Pulwama Terror Attack: Uri Makers Donate Rs 1 Crore To The Army Welfare Fund", "date_publish": "17/02/2019, 10:57:43", "description": "Pulwama Attack, Pulwama Attack India,Pulwama Attack Army india, Donation Pulwama Attack, army Welfare FundPulwama Attack, Pulwama Attack India,Pulwama Attack Army india, Donation Pulwama Attack, army Welfare FundPulwama Attack, Pulwama Attack India,Pulwama Attack Army india, Donation Pulwama Attack, army Welfare Fund", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pulwama-terror-attack-uri-makers-generously-donate-rs-1-cr-to-the-army-welfare-fund-362292.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/uri_pulwama_1550381594_800x420.jpg"}