{"text": "American electronic music producer and DJ Marshmello made Pune swing to his foot tapping numbers at the Vh1 Supersonic 2019 last weekend. But before kick-starting his concert, the artist observed two-minute silence for the CRPF troopers who were killed in the Pulwama terror attack.\nTwitter\nWith the Indian flag projected in the background, DJ Marshmello said on Sunday: \"Two minutes silence for the Indian soldiers who lost their lives in a terrorist attack.\"\nBefore arriving to India, Marshmello has expressed his immense love for the country. \"India is so special to me. This is my third time here (in India) and I love it even more each time I come back,\" Marshmello said in a statement.\nTwitter\nThe concert was a spectacular one and people went gaga over his performance and look. In fact, Kartik Aaryan too made an appearance at the concert and promoted his upcoming film, Lukka Chuppi. He made Marshmello groove to Coca Cola, one of the songs from his film.\nDon't Miss 106 SHARES\nBut looks like it didn't go down well with a certain section of the society. The Right Wing outfits have raised objection over this festival concert and are appalled as to why this was not cancelled in the first place after the news of Pulwama attack.\n\"Musical shows are meant for celebration, not when there is sadness across the country. This is not acceptable,\" said Rajiv Mittal of the Akhil Bhartiya Hindu Kranti Dal.\nTwitter\nAs per reports, a criminal case has been filed against the organiser of the show. IANS reports that Bharat Tibet Sahyog Manch, Vishva Hindu Parishad (VHP), Bajrang Dal, Hindu Kranti Dal, Hindu Jagran Manch, Hindu Sena and Shiv Sena had threatened to disrupt the event if it was not cancelled. However, they could not do so because of heavy police deployment.", "title": "Pulwama Attack: Right Wing Outfits To File A Case Against DJ Marshmello Concert's Organiser", "date_publish": "20/02/2019, 12:17:07", "description": "\"Musical shows are meant for celebration, not when there is sadness across the country. This is not acceptable,\" said Rajiv Mittal of the Akhil Bhartiya Hindu Kranti Dal.\"Musical shows are meant for celebration, not when there is sadness across the country. This is not acceptable,\" said Rajiv Mittal of the Akhil Bhartiya Hindu Kranti Dal.\"Musical shows are meant for celebration, not when there is", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/pulwama-attack-right-wing-outfits-to-file-a-case-against-dj-marshmello-concert-s-organiser-362455.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/marshmello_1550643059_800x420.jpg"}