{"text": "Yes, we are angry. Our hearts are aching because they killed our men. India has faced repeated terrorist attacks, and the list of terrorists is only growing longer.\nPakistan PM Imran Khan finally addressed the issue making all of us angrier. He denied his country’s involvement in Thursday’s attack. “I have an offer for the Indian government: if you have any actionable evidence, share it with us and we will take action,” he said.\nTwitter\nNot only that, he also warned us of a war and said Pakistan would strike back if India launched an attack after last week’s suicide bombing case.\nReacting to this, Javed Akhtar, who along with wife Shabana Azmi had cancelled an event in Pakistan following the Pulwama attack, said Imran Khan has thrown a no ball.\nTwitter\nDon't Miss 837 SHARES 2.4 K SHARES 1.1 K SHARES 763 SHARES 2.1 K SHARES\n“Imran has thrown a no ball .Every time they ask what makes you think its our doing . After the mumbai terrorist attack a pak TV anchor asked me why you are so sure it is Pakistan it can be any country I said fine I will give you 3 you choose one .Brazil , Sweden and Pakistan,” he tweeted.\nImran has thrown a no ball .Every time they ask what makes you think its our doing . After the mumbai terrorist attack a pak TV anchor asked me why you are so sure it is Pakistan it can be any country I said fine I will give you 3 you choose one .Brazil , Sweden and Pakistan . — Javed Akhtar (@Javedakhtarjadu) February 19, 2019\nPakistan-based terrorist group Jaish-E-Mohammed earlier claimed responsibility for Pulwama attack by releasing a video.", "title": "Pulwama Terror Attack: Javed Akhtar Slams Pakistan's PM Imran Khan, Says He's Thrown A No Ball", "date_publish": "20/02/2019, 11:40:50", "description": "After killing 49 jawans, Pakistan PM Imran Khan finally addressed the issue making all of us angrier. He denied his country’s involvement in Thursday’s attack. Reacting to this, Javed Akhtar, who along with wife Shabana Azmi had cancelled an event in Pakistan following the Pulwama attack, said Imran Khan had thrown a no ball.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/pulwama-terror-attack-javed-akhtar-slams-pakistan-s-pm-imran-khan-says-he-s-thrown-a-no-ball-362453.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/javed_akhtar_slams_pakistan_prime_minister_imran_khan_says_he_has_thrown_a_no_ball_1550642343_800x420.png"}