{"text": "The film industry is not as happy a place that you see on Instagram or Twitter. While filmy parties and bromance/sisterhood are the concepts that look good in pictures but reality is very different. From nepotism to casting couch to asking the actors to go under the knife, the reality is dark and bitter.\nThrowing light on the same, Sonnalli Seygall, the actor who gained popularity after she appeared in Luv Ranjan's Pyaar Ka Punchnama franchise, recently opened up on her recent experiences.\nTwitter\nIn her interview, she revealed that she had to turn down a role with a heavy heart after a famous director from Bollywood requested her to 'make some changes on her body, unnaturally'.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn a media statement, Sonnalli said,\n\"It was recently when I tested for a well-known casting director for a fantastic role. I was very excited for this audition and prepared myself really well because I really wanted to bag it! And I did! But on meeting the director, there I was asked to make some changes on my body, unnaturally! It was a no brainer for me to say no, even though my heart broke... But I would never put my body under the knife!\"\nShe also confessed that she would never name or shame the director. She adds,\n\"I can't name the director as it was his vision, [but it] just doesn't work for me,\" she said.The incident left Sonnalli batting 'emotional trauma'. I am an emotional person, so I did cry, but purely because I lost a great work opportunity. But on the other hand, I gave myself a silent pat on my back for not succumbing to the pressures around me.\"\nShe also gave an important lesson for every woman- never succumb under society's idealistic way of looking at you or the beauty standards that they set. She said,\n\"I think beauty and sex appeal is something very raw and natural, and it is sad that so many women feel the pressure to look a certain way just to feel and look sexy! But times are definitely getting better now and a lot of actors in our country are breaking that stereotype and I hope we continue that way!\"\nOn the professional front, Sonnalli Seygall will be seen with her Pyaar Ka Punchanama 2 co-star Sunny Singh in the film Jai Mummy Di and she will also appear in Aftab Shivdassani's film Setters, that is all set to release on May 3.", "title": "Pyaar Ka Punchnama Star Sonnalli Seygall Sheds Light On Unrealistic Beauty Standards Of The Film Industry", "date_publish": "25/04/2019, 11:48:44", "description": "Throwing light on the same, Sonnalli Seygall, the actor who gained popularity after she appeared in Luv Ranjan's Pyaar Ka Punchnama franchise, recently opened up on her recent experiences.In her interview, she revealed that she had to turn down a role with a heavy heart after a famous director from Bollywood requested her to 'make some changes on her body, unnaturally'.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/pyaar-ka-punchnama-star-sonnalli-seygall-sheds-light-on-unrealistic-beauty-standards-of-the-film-industry-366051.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sonnalli_seygall_1556172489_800x420.jpg"}