{"text": "Quentin Tarantino’s Kill Bill Will Get A Desi Twist, Anurag Kashyap To Pen Down The Script\nQuentin Tarantino’s Kill Bill Will Get A Desi Twist, Anurag Kashyap To Pen Down The Script\n“It’s mercy, compassion and forgiveness I lack. Not rationality.” – Vengeance couldn’t have been colder than this. That’s what Kill Bill was all about.\nKill Bill is simply one of the best films of Quentin Tarantino, and now it will apparently be getting a desi twist. Actor-turned-producer Nikhil Dwivedi is collaborating with Anurag Kashyap to pay a homage to the cult classic Kill Bill.\nTwitter\nSaffron Broadcast and Media has acquired the rights to the Hindi remake of Uma Thurman-starrer revenge movie, and Anurag Kashyap will be writing the script of the movie.\nInstagram\nAfter Bhavesh Joshi Superhero, Anurag Kashyap is excited to pen down the script of this women-centric film. The movie is expected to roll in the middle of the year. The shooting will reportedly take place in Japan, Bhutan, Sikkim as well as Mumbai.\nThe cast of the movie hasn’t been decided as of yet. Who do you think should be cast in the movie? Tell us in the comments section below.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Quentin Tarantino’s Kill Bill Will Get A Desi Twist, Anurag Kashyap To Pen Down The Script", "date_publish": "18/01/2019, 18:54:39", "description": "Kill Bill is simply one of the best films of Quentin Tarantino, and now it will apparently be getting a desi twist. Actor-turned-producer Nikhil Dwivedi is collaborating with Anurag Kashyap to pay a homage to the cult classic Kill Bill. Saffron Broadcast and Media has acquired the rights to the Hindi remake of Uma Thurman-starrer revenge movie, and Anurag Kashyap will be writing the script of the", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/quentin-tarantino-s-kill-bill-will-get-a-desi-twist-anurag-kashyap-to-pen-down-the-script-360670.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/quentin_tarantinos_kill_bill_gets_a_desi_twist_anurag_kashyap_to_pen_down_the_script_1547817228_800x420.png"}