{"text": "It’s has been long that we have been complaining about several things, sitting behind our computer screens. Now is the time to make a difference and cast a vote – for whosoever we think deserves. Polling for the first phase of Lok Sabha elections has begun today. It’s time to pick your leader. It’s time to go ahead and vote.\nIn an attempt to urge people to come out and vote, R Madhavan shared a strong message via his Twitter handle. “This is you COUNTRY.. you owe it to yourself .. your Next generation and this Nation,” he said. “Time to MAKE YOUR INTENT CLEAR,” he wrote on Twitter.\n“Vote Kar.. This is you COUNTRY.. you owe it to yourself .. your Next generation and this Nation.. THINK Hard and long and FINALLY HAVE YOUR SAY. YOU KNOW WHAT HAS TO BE DONE. So go do it . Do not think the others will do it for you. Many A worthy battle has been lost to complacency,\" he wrote in the caption on Instagram.\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 275 SHARES\nApart from Madhavan, here are several other stars who took to Twitter to urge fans to go out and vote.\nFirst phase ! Go vote people! — TheRichaChadha (@RichaChadha) April 11, 2019\nVoting is a constitutional right that we are privileged to have. Let’s not take it for granted. Our Constitution has given us this right to elect who we want running our great country . Go cast your vote.\nGood luck India.\n🇮🇳 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳\n#VoteDo — Gul Panag (@GulPanag) April 11, 2019\nThe largest democracy in the world goes to vote ! #IncredibleIndia — rahul dholakia (@rahuldholakia) April 10, 2019\nIf you don’t go out and cast your vote, you’ll lose the right to complain in future.", "title": "R Madhavan Shares A Powerful Message Urging People To Vote, Says ‘You Owe It To Yourself’", "date_publish": "11/04/2019, 14:11:52", "description": "In an attempt to urge people to come out and vote, R Madhavan shared a strong message via his Twitter handle. “This is you COUNTRY.. you owe it to yourself .. your Next generation and this Nation,” he said. “Time to MAKE YOUR INTENT CLEAR,” he wrote on Twitter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/r-madhavan-shares-a-powerful-message-urging-people-to-vote-says-you-owe-it-to-yourself-365243.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/r_madhavan_urges_people_to_cast_vote_tells_them_its_time_to_make_their_intent_clear_1554971057_800x420.png"}