{"text": "If you thought the #MeToo movement made a buzz for a few months and got lost into oblivion, you’re wrong. In the new year, it’s like the beginning of a new chapter.\nIn shocking news, Bollywood’s most sought after and most favourite director Rajkumar Hirani was accused of sexual harassment. That’s the first allegation against a Bollywood A-lister star.\nTwitter\nIf reports are to be believed, he allegedly sexually abused the woman multiple times over a period of six months during the shooting of Sanju. The woman apparently wrote emails to Anupama Chopra, Abhijat Joshi and Vidhu Vinod Chopra.\nWhile Hirani has denied the claims, the industry remains mum on the issue. Hirani’s most prominent associates have maintained their silence. However, Sharman Joshi, Dia Mirza, Boney Kapoor and Arshad Warsi are among the few who spoke to extend support to him.\nDon't Miss 1.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nAccording to Raageshwari Loomba Swaroop, who’s Indian pop singer, actress, model, and a motivational speaker too, Rajkumar Hirani is the “most cultured, refined and peerless man” in the industry.\n“After knowing Raju for almost 20 years, I can safely say that he is amongst the most cultured, refined and peerless man I have met in the film industry. I’m not speaking as an actress cementing bonds, hence I speak with utmost honesty and with zero agenda here. I speak as a family friend and most importantly, as a woman,” she was quoted as saying by TOI.\nTwitter\nJaved Akhtar also sided Rajkumar Hirani and said that he is the most decent person.\nI had come to the film industry in 1965. After so many years if I am asked who are the most decent people you met in this industry over almost 5 decades, perhaps the first name that will come to my mind is RAJU HIRANI. G.B Shaw has said . “ it is too dangerous to be too good” — Javed Akhtar (@Javedakhtarjadu) January 16, 2019\nIt’s time for Bollywood to speak up!", "title": "Raageshwari Supports Rajkumar Hirani After Sexual Assault Allegations, Calls Him The Most Cultured Man", "date_publish": "16/01/2019, 15:53:02", "description": "In shocking news, Bollywood’s most sought after and most favourite director Rajkumar Hirani was accused of sexual harassment. That’s the first allegation against a Bollywood A-list star. If reports are to be believed, he allegedly sexually abused the woman multiple times over a period of six months. The woman apparently wrote emails to Anupama Chopra, Abhijat Joshi and Vidhu Vinod Chopra.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/raageshwari-supports-rajkumar-hirani-after-sexual-assault-allegations-calls-him-the-most-cultured-man-360516.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/raageshwari_supports_rajkumar_hirani_after_sexual_assault_allegations_calls_him_most_cultured_man_1547634213_800x420.png"}