{"text": "Radhika Apte Leaves The Global Audience & Critics Amazed With Her Outstanding Performance In The Wedding Guest\nRadhika Apte Leaves The Global Audience & Critics Amazed With Her Outstanding Performance In The Wedding Guest\nRadhika Apte has proved her mettle of acting with every film. In fact, the ace director Vikram Aditya Motwane has given her the title of female Rajkummar Rao and she obliged his compliment. And now after impressing the Indian audience with the terrific talent, she is winning global applause for her outstanding performance in The Wedding Guest.\nTwitter\nThe film was released internationally where everyone is praising Radhika for her talent.\nTwitter\nThe Wedding Guest is a Hollywood film featuring 'Slumdog Millionaire' star Dev Patel and Radhika Apte in pivotal roles. Both the actors have done a fabulous job, but Radhika has won the hearts of the critics and audiences.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHuge raise from prominent publications like The New York Times, New York Post, APN News, The Young Folks, Indie wire, Radhika has only made her fans back home very proud.\nTake a look at what New York Post said Radhika’s performance:\nThe Wedding Guest by Michael Winterbottom, feat. Dev Patel, @radhika_apte, @jimSarbh, and @theHarishKhanna, opens in Los Angeles and New York on March 1st, and in other cities on March 8th.\nTrailer: https://t.co/qkdjHPBMBT@IFCFilms pic.twitter.com/sNVDoPIpsb — CinemaRare (@CinemaRareIN) February 2, 2019\nStars @radhika_apte and #DevPatel share a laugh after world premiere of Michael Winterbottom's \"The Wedding Guest\". This thriller takes them (and us) thru Pakistan and India, and a woman's path to control and freedom. #TiFF2018 pic.twitter.com/ZoMD0cnT8u — Julia Deans (@juliadeans) September 8, 2018\nRadhika has had a phenomenal 2018 and looks like 2019 is even brighter for her.", "title": "Radhika Apte Leaves The Global Audience & Critics Amazed With Her Outstanding Performance In The Wedding Guest", "date_publish": "08/03/2019, 12:18:50", "description": "Radhika Apte has proved her mettle of acting with every film. In fact, the ace director Vikram Aditya Motwane has given her the title of female Rajkummar Rao and she obliged his compliment. And now after impressing the Indian audience with the terrific talent, she is winning global applause for her outstanding performance in The Wedding Guest. The film has released internationally where everyone i", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/radhika-apte-leaves-the-global-audience-critics-amazed-with-her-outstanding-performance-in-the-wedding-guest-363370.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/radhika_apte_1552028114_800x420.jpg"}