{"text": "Day after day, more women are braving the storm and coming out to share their sexual harassment stories on social media. It’s not easy for them. People are harrowed by these stories and allegations against the Bollywood biggies. Is Bollywood safe for women? Perhaps, it wasn’t until now but it will now be.\nAs more women are speaking against the sexual predators in the industry, Radhika Apte and Soni Razdan have also extended their support to the movement in hope that it will bring a positive change in the society.\n“All I can say is that, as an industry, we are trying to come together and find a way of constructively making a system where we all have a safe environment and it’s going on. I am part of that and I hope that we come up with a constructive system which is equal and genderless for every human being,” Radhika Apte had said in a statement to IANS.\nBCCL\nOn the other hand, Soni Razdan feels that women who haven’t yet shared their #MeToo stories shouldn’t be judged as it could be about their job necessity and survival. At the same time, she feels that women who have opened up should be encouraged.\n\"Living in a patriarchal society I know that such a thing is horrifying for any girl and that is why the movement is a positive sign, where people are coming up with their stories. It is easy to say that if such harassment happens, walk out of your job. But people depend on that job, it is about their livelihood, a question of survival. So while we must encourage victims for coming up with their #MeToo stories, we should not judge women for not sharing their stories.”\nDon't Miss 837 SHARES 3.6 K SHARES\nBCCL\nShe added that every company should have zero tolerance policy.\n“When someone is humiliating and harassing a woman, he must be knowing that the victim is needy and left with no option but to tolerate such harassment to save the job. It is about livelihood. Every company should have zero tolerance on sexual harassment so that victims feel secure while taking a stand.”\nWith inputs from IANS", "title": "Radhika Apte & Soni Razdan Support #MeToo, Root For A Positive Change Against Sexual Harassment", "date_publish": "18/10/2018, 17:49:47", "description": "As more women are speaking against the sexual predators in the industry, Radhika Apte and Soni Razdan are also extending their full support to the movement in hope that it will bring a positive change in the society. Soni Razdan feels that women who haven’t yet shared their #MeToo stories shouldn’t be judged as it could be about their job necessity and survival. At the same time, she feels that wo", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/radhika-apte-soni-razdan-support-metoo-root-for-a-positive-change-against-sexual-harassment-355048.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/radhika_apte__soni_razdan_support_metoo_root_for_a_positive_change_against_sexual_harassment_1539864818_800x420.png"}