{"text": "He's one of the most amazing musicians based out of Pakistan. He has been a popular playback singer in Bollywood and rose to fame with Jiya Dhadak Dhadak. He is known for his beautiful ghazals and qawwalis.\nTwitter\nThe nephew of Nusrat Fateh Ali Khan, Rahat was upset when India banned Pakistani artists and so were we. But currently he's in news not for his music but for all the wrong reasons. As per the report on ABP News, Khan has allegedly smuggled foreign currency. He had got $340,000 (Rs 2.42 crore) through illegal means of which he reportedly smuggled $225,000 (Rs 1.6 crore).\nTwitter\nIt is interesting to notice because this is not the first time, Khan has been embroiled in a controversy related to illegal currency. Yes, way back in 2011, he was found with undocumented $125,000 (Rs 89.1 lakh) at Delhi’s Indira Gandhi International Airport.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES 151 SHARES 185 SHARES\nBut speaking with Rahat about the same, he denied any such allegations on him. Rahat's manager got in touch with Times Of India and clarified that no notice has been issued yet.\nYoutube/screengrab\nHe has been quoted as saying they have \"no information of this show cause notice as of yet.\" The report also added that Khan's lawyers in India \"are known to the relevant authorities and as of now they have not received any notice either.\"\nThe statement has further been reported as, \"It would have been better if the authorities would have served the notice first if any and then publicized it. We will address it if and when we get any notices. Our law firm in Delhi will look into this if there's any notice.\"", "title": "Rahat Fateh Ali Khan Denies Getting Show-Cause Notice For Allegedly Smuggling Foreign Currency", "date_publish": "31/01/2019, 11:41:43", "description": "He's one of the most amazing musicians based out of Pakistan. He has been a popular playback singer in Bollywood and for the Pakistani film industry. He is known for his beautiful ghazals and qawalis.He's one of the most amazing musicians based out of Pakistan. He has been a popular playback singer in Bollywood and for the Pakistani film industry. He is known for his beautiful ghazals and qawalis.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/rahat-fateh-ali-khan-denies-getting-show-cause-notice-for-allegedly-smuggling-foreign-currency-361346.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rahat_1548913928_800x420.jpeg"}