{"text": "Rajinikanth's 2.0 Breaking Box Office, Sara Ali Khan Explains Why She Chose To Become An Actor & More From Ent.\nRajinikanth's 2.0 Breaking Box Office, Sara Ali Khan Explains Why She Chose To Become An Actor & More From Ent.\nIn just one day of its release, the film is dominating the box office. Reports claim that the Hindi dubbed version of the movie has earned Rs 38.25 crore after two days.\nSara, who is all set for the release of her debut Kedarnath, is enjoying all the attention during promotions, unlike other actors. Indiatimes met Sara for an interview and it was refreshing because she is a charmer, for sure.\nDon't Miss 106 SHARES 7.6 K SHARES\nFrom the helipad that has been made especially to ferry guests in and out to the wedding guests that the planners have customized for the guests, the preps for the wedding are on point.\nThe Royal Albert Hall in London, England is all set to play one of India’s biggest blockbuster, Baahubali The Beginning starring Prabhas and Rana Daggubati. Royal Philharmonic Concert Orchestra’s conductor Ludwig Wicki announced through a statement on their official website.\nCalling it a ‘wonderful experience’, he conveyed his good wishes to the other members of the cast, calling their acts ‘exceptional’.", "title": "Rajinikanth's 2.0 Breaking Box Office, Sara Ali Khan Explains Why She Chose To Become An Actor & More From Ent.", "date_publish": "01/12/2018, 17:16:10", "description": "In just one day of its release, the film is dominating the box office. Reports claim that the Hindi dubbed version of the movie has earned Rs 38.25 crore after two days.In just one day of its release, the film is dominating the box office. Reports claim that the Hindi dubbed version of the movie has earned Rs 38.25 crore after two days.In just one day of its release, the film is dominating the box", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/rajinikanth-s-2-0-breaking-box-office-sara-ali-khan-explains-why-she-chose-to-become-an-actor-more-from-ent-357753.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/wrap_1543666102_800x420.jpg"}