{"text": "Rajinikanth's 2.0 Reviews Take Internet By Storm, Cinema Halls Filled To The Brim By Frenzied Fans\nRajinikanth's 2.0 Reviews Take Internet By Storm, Cinema Halls Filled To The Brim By Frenzied Fans\nThe day is here when Rajinikanth's magnum opus 2.0 has released worldwide. Needless to say, just like his previous movies, this one too has create a rage and uproar in the market.\nTwitter\nThis movie is only bigger as Akshay Kumar also features in the film alongside Amy Jackson. People from across the nation came together to watch the first day, first show which saw massive hysteria inside the cinema halls.\nThe movie has taken the internet by storm as audiences are blown away by the most promising performances by the lead stars.\nDon't Miss 282 SHARES 862 SHARES\n#2point0\nMIND FCUKKKK\nno one can match shankar vision\nHUGGGGEEEEEE\n2.0 entry\n3.0 entry\nracha racha\nfeast for chitti fans 🤘 — Car Ka Sarkar 🤘🚗 (@Nenorakam) November 29, 2018\nChitti entry\nAkshay flashback\nAmy character\n2.0 entry\n3.0 entry and The Best Vfx made #2Point Blockbuster 🔥🔥 — Vinay (@Coolest_Vinay) November 29, 2018\nTo sum it up - #2point0 is a typical Marvel kinda superhero story with Superstar #RAJINIKANTH, racy screenplay, amazing visuals, excellent social message & special mention #AkshayKumar, man he nailed it!\nSatisfies all sections of audience, enjoy it in 3D😊\n🔥My rating - 9/10🔥 — Srikanth - Reloaded Version 2.0 (@srikanthkaran33) November 29, 2018\nWhile some complimented director Shankar's vision, others were mesmerized looking at Rajini's entry. Fans were spotted celebrating Rajini's yet another release. Dancing and chanting his name in unison, the fans proved there ain't no one like Rajinikanth.\nHere are some of the videos that show the superstar Rajini is.Take a look\n#2Point0 our celebration time starts 🎉 🎁 🎊 waiting for Thalaiavar pic.twitter.com/6IQupiS3nD — ΛПGЯY ЯӨBӨƬ 2.0 (@IamAngryFellow) November 28, 2018\n#Thalaivar mania at Vijayawada. Sailaja theatre with full of #Thalaivar banners. Huge crowd with blockbusterrr talk. Definitely Telugu box-office will be on fireeee\nSuperstar @rajinikanth 🤘🤘 pic.twitter.com/kTdHv3RmyU — Telugu Rajni Fans 2.0 (@andhrarajnifans) November 29, 2018\nThe sci-fi thriller is collectively being praised on Twitter. Yes, the minute reviews were out, it created an explosion on the internet and halls alike. Film critics are hoping the film will break all records.\n#OneWordReview…#2Point0: BLOCKBUSTER.\nRating: ⭐️⭐️⭐️⭐️⭐️#2Point0 is a cinematic marvel... This has style with substance... Director Shankar is a visionary... He hits the ball out of the park this time... Akshay Kumar is FANTASTIC, while Rajinikanth is THE BOSS... SALUTE! pic.twitter.com/cPFZxhjsph — taran adarsh (@taran_adarsh) November 29, 2018", "title": "Rajinikanth's 2.0 Reviews Take Internet By Storm, Hysteria Created Outside Cinema Halls Too", "date_publish": "29/11/2018, 16:11:43", "description": "rajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0, bollywood, south indiarajnikanth, akshay kumar, 2.0", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/rajinikanth-s-2-0-reviews-take-internet-by-storm-cinema-halls-filled-to-the-brim-by-frenzied-fans-357602.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/20_1543483369_800x420.jpg"}