{"text": "Rajkummar Rao is elated with all the love that he has been receiving. He expressed that he is able to entertain audiences globally. The actor also said he is honored to win Performer of the Year award at the Filmfare Middle East Awards 2019 ceremony held in Oman.\nBCCL\n“It’s a great honour to receive this award. I also feel gratified in a way to know that my films not only entertain audiences in India but globally,” Rajkummar said in a statement. “I’ve had very distinguished films in 2018 and this win certifies that the audiences are also open to experimentation and watching something new and interesting,” he added. At the function in Oman, Rajkummar also performed to his hit song Kamariya from Stree with Nora Fatehi.\nTweeting about his win and sharing a picture, he wrote: “Won the #FilmfareMiddleEast performer of the year award in Oman last night for my work in #Stree and #Omerta. GRATITUDE.”\nA couple of days back he had tweeted about Kangana Ranaut and their upcoming film Mental Hai Kya. He had written: “Just watched #Manikarnika. An amazing film that chronicles the life of the queen of Jhansi. Kangana,as always, was phenomenol as Rani Laxmi bai. Now can’t wait for you guys to watch #MentalHaiKya.” He was obviously impressed with her work in Manikarnika.\nJust watched #Manikarnika. An amazing film that chronicles the life of the queen of Jhansi. Kangana,as always, was phenomenol as Rani Laxmi bai. Now can’t wait for you guys to watch #MentalHaiKya. — Rajkummar Rao (@RajkummarRao) March 27, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe Stree actor is looking forward to this year’s anticipated films, including Mental Hai Kya, Turram Khan, Imli and Made In China.\n(With agency inputs)", "title": "Rajkummar Rao Wins Award In Oman, Says Win Certifies That Audience Are Open To Experimentation", "date_publish": "31/03/2019, 15:58:38", "description": "Rajkummar Rao is elated with all the love that he has been receiving. He expressed that he is able to entertain audiences globally. The actor also said he is honored to win Performer of the Year award at the Filmfare Middle East Awards 2019 ceremony held in Oman.", "authors": [], "url": "https://www.indiatimes.com/entertainment/rajkummar-rao-wins-award-in-oman-says-win-certifies-that-audience-are-open-to-experimentation-364635.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/rajkummar_rao_1554030309_800x420.jpg"}