{"text": "It took many years to get the right platform to prove his talent, but Rajkummar Rao’s dream to become an actor indeed became true. He is one of the finest actors that the industry has currently.\nRight from his first film Shahid to Ek Ladki Ko Dekha Toh Aisa Laga, no matter what character he is playing or how big is his role in the movie, he always leaves a long-lasting impact on his audiences.\nTwitter\nLast year was all about talented young stars of Bollywood like Ayushmann Khurrana, Vicky Kaushal and Rajkummar Rao among others. While Rajkummar Rao believes that it’s unfair to compare him with superstars like Aamir Khan, Shah Rukh Khan and Salman Khan, he also feels that the era of superstardom has now come to an end.\n“I don't think we can compare superstars and actors like me. The kind of films Aamir sir, Shah Rukh sir and Salman sir have done are amazing. You can't say they are not good just because one of their films did not work,” he said.\nTwitter\nDon't Miss 812 SHARES 468 SHARES 343 SHARES 3 K SHARES 555 SHARES\n\"They are superstars for some reason and we all love them. I am myself a fan of Khans. We should not compare. We are very new and we have a long way to prove ourselves. I don't think the kind of superstardom that these superstars have seen will ever come back again,\" Rajkummar Rao told PTI.\nTwitter\nHe says that this kind of superstardom is what all actors yearn, but at the same time he feels it cannot be replicated now.\n“Audience loved these stories more than anything else. Today people are more concerned about the content they are seeing. I always try to offer new things. Since my debut film Love Sex Aur Dhokha, I am trying to experiment and push boundaries as an actor. I am happy people are accepting that. It is a feeling of validation as these are the kind of films I was doing earlier and today they are doing great numbers. Rajkummar Rao added.\nTalking about Ek Ladki Ko Dekha Toh Aisa Laga, Rajkummar Rao says he loved the concept of the movie.\n“More than the role, the story was unique, so I did the film. It talks about things that are relevant in our society. I liked the role as well. It is the story that I look at first and then comes my role.”\nEk Ladki Ko Dekha Toh Aisa Laga was released yesterday, and Bollywood stars are in awe of the Sonam Kapoor, Anil Kapoor, Rajkummar Rao and Juhi Chawla starrer.\nWith inputs from PTI", "title": "Rajkummar Rao Feels The Era Of Superstardom That SRK, Salman & Aamir Enjoyed Isn't Coming Back", "date_publish": "02/02/2019, 11:30:07", "description": "Rajkummar Rao is one of the finest actors that the industry has currently. While Rajkummar Rao believes that it’s unfair to compare him with superstars like Aamir Khan, Shah Rukh Khan and Salman Khan, he also feels that the era of superstardom has now come to its end.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rajkummar-rao-feels-the-kind-of-superstardom-that-srk-salman-aamir-enjoyed-is-over-for-good-361445.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/rajkummar_rao_says_its_the_end_of_superstardom_era_of_shah_rukh_salman__aamir_isnt_coming_back_1549086027_800x420.png"}