{"text": "\"Begum, ishq ka mazaa hi chupke chupke se karne mein hai...\"\nEven if you're a 90's kid, this line will ring a bell and teleport you into the good old days of Hindi Cinema when love stories were simple and heartwarming.\nTwitter\nHrishikesh Mukherjee’s iconic comedy Chupke Chupke, starring Dharmendra, Amitabh Bachchan, Sharmila Tagore and Jaya Bachchan in lead roles is a film that is still remembered by everyone. Be it their performances or the dialogues, the film turned out to be a cult hit.\nThe film also completed 44 years of release on 11th April this year.\nAnd now, the film is getting rebooted for a solid remake which will be backed by producers Bhushan Kumar and Luv Ranjan. According to a Mumbai Mirror report, Rajkummar Rao is in talks with the production house to reprise Dharmendra's role in the film.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nJust to jog your memory a little, Dharmendra essayed the role of Parimal Tripathi, a professor of Botany, who bluffs everyone as he fools everyone by pretending to be a chauffeur Pyare Mohan to outwit his wife Sharmila’s brother-in-law while on their honeymoon.\nSpilling the beans on the project, a source spoke to Mumbai Mirror and said,\nShemaroo\n“Chupke Chupke is one of Rajkummar Rao’s favourite films. He is very excited about the idea of remaking this iconic gem and has agreed to come on board. Rajkummar will play the dual roles of Dharmendra. The director and the rest of the cast have to be locked in.\"\nHowever, Rajkummar Rao's confirmation is making us excited and curious on who will play Amitabh Bachchan's role in the film. Who do you think should play Big B's role in the film? Tell us in the comments below.", "title": "Rajkummar Rao To Play Dharmendra's Role In 'Chupke Chupke' Remake & We're Wondering Who Will Nail Big B's Role!", "date_publish": "20/04/2019, 11:35:58", "description": "the film is getting rebooted for a solid remake which will be backed by producers Bhushan Kumar and Luv Ranjan. According to a Mumbai Mirror report, Rajkummar Rao is in talks with the production house to reprise Dharmendra's role in the film. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/rajkummar-rao-to-play-dharmendra-s-role-in-chupke-chupke-remake-we-re-wondering-who-will-nail-big-b-s-role-365791.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/chupke_chupke_1555742477_800x420.jpg"}