{"text": "If you didn’t know it already, just like most of us, Rajkummar Rao is a true blue Shah Rukh Khan too. In fact, he took up acting only because of him.\nTwitter\nFor the uninitiated, Rajkummar Rao’s inspiration in the industry has been Shah Rukh Khan. He once said that he would stare at his posters and think that as an outsider if he made it big, he can too.\nTwitter\nSome time after Queen, when he finally got the opportunity to meet Shah Rukh Khan, he was extremely nervous and in awe of him at the same time. For Rajkummar Rao, SRK is an idol, and recently when he shook a leg with him on Chaiyya Chaiyya, his dream came true.\nAt the Filmfare Awards 2019, Rajkummar Rao danced with Shah Rukh Khan and it was an epic moment. Take a look!\nI got the opportunity to perform with my idol @iamsrk. I love you sir. One must believe and work hard towards their dreams because they do come true 😇🙏❤️ https://t.co/Gv0vzYlumy — Rajkummar Rao (@RajkummarRao) April 13, 2019\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 612 SHARES\nShah Rukh Khan showered his upon him!\nNo no yaar. The fun was all mine. You were so cool to work with & so talented. https://t.co/xqjLC0CRIS — Shah Rukh Khan (@iamsrk) April 13, 2019\nWouldn’t it be nice if they are both cast in a movie together? Eagerly waiting for this to happen!", "title": "Rajkummar Rao Performs On ‘Chaiyya Chaiyya’ With ‘Idol’ Shah Rukh Khan, Calls It A Dream Come True Moment", "date_publish": "14/04/2019, 17:50:56", "description": "At the Filmfare Awards 2019, Rajkummar Rao danced with Shah Rukh Khan and it was an epic moment. SRK, for Rajkummar Rao, is an idol, and recently when he shook a leg with him on Chaiyya Chaiyya, his dream came true. If you didn’t know it already, just like most of us, Rajkummar Rao is a true blue Shah Rukh Khan too. In fact, he took up acting only because of him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rajkummar-rao-performs-on-chaiyya-chaiyya-with-idol-shah-rukh-khan-calls-it-a-dream-come-true-moment-365441.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/rajkummar_rao_dancing_on_chaiyya_chaiyya_with_shah_rukh_khan_at_filmfare_awards_2019_1555243358_800x420.png"}