{"text": "After Gully Boy, if there’s another movie trailer that has hooked the entire nation, then it’s the trailer of Rakeysh Omprakash Mehra’s Mere Pyare Prime Minister, which is both heartwarming as well as tear-jerking at the same.\nTwitter\nThe trailer shows the story of a young boy named Kanhaiya who lives in a slum where there are no toilets. Just like every other kid, he is bound by his love for mother Sargam. One fine day, when Sargam is on her way back from relieving herself, she is raped. The little boy is, of course, heartbroken. He writes a letter to the prime minister and decides to travel to the national capital with his friends in order to make his voice heard.\nWatch the deep and intense trailer of Rakeysh Omprakash Mehra’s Mere Pyaare Prime Minister below.\nThe movie is slated to release on March 15. Ask Rakeysh Omprakash Mehra if he will show the movie to the prime minister, and he says, he won’t follow the trend by organising a special screening for him.\nDon't Miss 6.8 K SHARES 828 SHARES\n“No, not at all. We don't have any such plans, yet. It has become very fashionable, I would rather want to stay away from it.”\nHowever, he says, if he wishes to watch it on his own will, it will be a matter of great honour for him.\n“I feel the film is made for the people of the country and somewhere I don’t want to dilute that by using such a big office. He is a very busy man and is running the country...To take three hours of his time which he could devote to some national and international interest. Just because I want to promote, it doesn't suit me. But, If he wants to watch the film, it'll be an honour,” he told PTI.\nMere Pyaare Prime Minister stars Anjali Patil, Om Kanujiya and Atul Kulkarni among others.", "title": "Rakeysh Omprakash Mehra Won’t Organise A Special Screening Of ‘Mere Pyaare Prime Minister’ For PM Modi", "date_publish": "13/02/2019, 11:55:30", "description": "After Gully Boy, if there’s another movie trailer that has hooked the entire nation, then it’s the trailer of Rakeysh Omprakash Mehra’s Mere Pyare Prime Minister, which is both heartwarming as well as tear-jerking at the same. Ask Rakeysh Omprakash Mehra if he will show the movie to the prime minister, and he says, he won’t follow the trend by organising a special screening for him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rakeysh-omprakash-mehra-won-t-organise-a-special-screening-of-mere-pyaare-prime-minister-for-pm-modi-362055.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/rakeysh_omprakash_mehra_wont_organise_a_special_screening_of_mere_pyaare_prime_minister_for_pm_mo_1550038961_800x420.jpg"}