{"text": "Rakhi Sawant Accuses Tanushree Of Paying The Wrestler To Injure Her So She Can’t Dance Again!\nRakhi Sawant Accuses Tanushree Of Paying The Wrestler To Injure Her So She Can’t Dance Again!\n“India, America and pura world I request you to stand with me”\nRakhi Sawant, the woman who never fails to entertain us, is appealing to you all to stand with her and support her. She is the source of your weekly entertainment. So, will you stand by her?\nYouTube\nRakhi Sawant, the internet sensation and the ultimate item girl of Bollywood, has never let us all down. Every other day, she makes an attempt to make headlines and indeed she does. She is popular because of her sheer stupidity.\nMany like her have come and gone. Dhinchak Pooja, for instance, couldn’t survive for long. However, Rakhi has never failed us.\nDon't Miss 120 SHARES 544 SHARES 3 K SHARES 925 SHARES\nWondering what has she done now? To give you a bit of context, she was at a Continental Wrestling Entertainment (CWE) match in Panchkula, Haryana. She was supposed to perform there but she waged a war.\nShe challenged a wrestler and got knocked out so bad that she landed in a hospital soon after. It is said that she suffered a lumbar injury in the tailbone area. But has that put a stop to the motor mouth that she is? Of course, NOT!\nAfter having posted the videos from the fight, and then lying on a bed in pain, she has now accused Tanushree Dutta of paying the wrestler in order to injure her, so that she could never dance ever again.\nYes, she stated that in the post that you can read below.\nIf you want Rakhi Sawant to be banned from social media, then join the club! *rolling eyes*", "title": "Rakhi Sawant Accuses Tanushree Of Paying The Wrestler To Injure Her So She Can’t Dance Again!", "date_publish": "14/11/2018, 17:11:16", "description": "Rakhi Sawant challenged a wrestler and got knocked out so bad that she landed in a hospital soon after that. Now, she has now accused Tanushree Dutta of paying the wrestler in order to injure her, so that she could never dance ever again. It is said that she suffered a lumbar injury in the in the tailbone area. But has that put a stop to the motor mouth that she is?", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rakhi-sawant-accuses-tanushree-of-paying-the-wrestler-to-injure-her-so-she-can-t-dance-again-356673.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/rakhi_sawant_accuses_tanushree_dutta_of_paying_the_wrestler_to_injure_her_so_that_she_can_never_danc_1542194089_800x420.png"}