{"text": "For the uninitiated, filmmaker Ram Gopal Varma has been trying to find Andhra CM Chandrababu Naidu’s look-alike. What for? He plans to feature his look-alike in his forthcoming film on legendary actor-politician N.T. Rama Rao.\nRam Gopal Varma has finally been able to find Andhra CM Chandrababu Naidu’s doppelganger. The filmmaker has now announced that he will reward the man named Rohit Mutyala who helped him find Naidu’s look-alike with Rs. 1 lakh. Not only that, he even asked for his bank details to credit the reward amount.\nAnybody who can track him can give his contact details via email at Laksmisntr@gmail.com ..The reward of 1 lak will be given to the first person who does that #NTRTRUESTORY pic.twitter.com/ShBakNJgEY — Ram Gopal Varma (@RGVzoomin) October 13, 2018\nIn a social media post, Ram Gopal Varma thanked Rohit Mutyala.\nCheck out the video of this unknown man who looks like Andhra CM Chandrababu Naidu’s doppelganger.\nHey Rohit, thank u very much for gifting CBN to the unit of LAKSHMI’s NTR ..I will also put a credit thanking u in the beginning of the film ..For now please msg me ur account details for me to send you,your reward of 1 lakh #NTRTRUESTORY pic.twitter.com/EFRlWssG2A — Ram Gopal Varma (@RGVzoomin) October 13, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe details about who this man in the video is have not been revealed. The man can be seen serving food in what looks like a canteen.", "title": "Ram Gopal Varma To Pay Rs 1 Lakh To The Man Who Found Andhra CM Chandrababu Naidu's Lookalike", "date_publish": "15/10/2018, 17:05:46", "description": "For the uninitiated, filmmaker Ram Gopal Varma has been trying to find Andhra CM Chandrababu Naidu’s look-alike. What for? He plans to feature his look-alike in his forthcoming film on legendary actor-politician N.T. Rama Rao. For the uninitiated, filmmaker Ram Gopal Varma has been trying to find Andhra CM Chandrababu Naidu’s look-alike. What for? He plans to feature his look-alike in his forthcom", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ram-gopal-varma-to-pay-rs-1-lakh-to-the-man-who-found-andhra-cm-chandrababu-naidu-s-lookalike-354823.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ram_gopal_varma_to_pay_rs_1_lakh_to_the_man_who_found_andhra_cm_chandrababu_naidus_lookalike_1539599820_800x420.png"}