{"text": "Have you ever waved at somebody to say ‘Hi’ and got ignored while everybody else noticed it? That’s the most awkward moment, right? You immediately want to crawl into a hole and bury yourself into it.\nvia GIPHY\nNow, just imagine you being a star as big as Rami Malek standing on the stage of a prestigious award show like the Golden Globes, to collect the award for Best Picture - Drama trophy, and you move to greet Nicole Kidman, who’s presenting you the award, but she turns her back at you, leaving you awkwardly embarrassed!\nThis isn’t a cooked up story. This actually happened on the stage of Golden Globe awards and made headlines. The video went viral on social media too. If you have checked it out as of yet, watch what unfolded on the stage of Golden Globes 2019 in the video below.\nRami Malek can’t stop cringing as he watches himself on this viral clip. Take a look!\nRami Malek trying to talk to Nicole Kidman is like me trying to talk to my crush #goldenglobes pic.twitter.com/WYS4fs6zTd — Abby Cadabby (@1AbbyRoad) January 7, 2019\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nRecalling the incident on Jimmy Kimmel Live, Rami Malek jokingly said that the moment will haunt him for the rest of his life.\n“I had not seen that,” he said after the host played the video for him.\nscreengrab\n“I've known her for many years, despite what it may seem in that video, so I thought I could easily go up and say hi but in a moment like that... it was very awkward. I have a feel this is probably haunting me on the internet now”, he added.\nNothing, indeed, nothing is more awkward then not knowing when to go for a handshake or a hug, right?\nAt the Golden Globes 2019, Malek had won the Best Actor - Drama for the Bohemian Rhapsody.", "title": "Rami Malek Explains Awkward Nicole Kidman ‘Snub’ At Golden Globes, Says It’ll Haunt Him Forever", "date_publish": "11/01/2019, 17:37:33", "description": "Recalling the incident on Jimmy Kimmel Live, Rami Malek jokingly said that the moment will haunt him for the rest of his life. “I had not seen that,” he said after the host played the video for him. “I've known her for many years, despite what it may seem in that video, so I thought I could easily go up and say hi but in a moment like that... it was very awkward. I have a feel this is probably hau", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rami-malek-explains-awkward-nicole-kidman-snub-at-golden-globes-says-it-ll-haunt-him-forever-360258.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rami_malek_explains_awkward_nicole_kidman_snub_at_golden_globes_says_itll_haunt_him_forever_1547208502_800x420.png"}