{"text": "Rana Daggubati ‘Off Into The Jungles Of Kerala’ To Shoot For Haathi Mere Saathi\nRana Daggubati ‘Off Into The Jungles Of Kerala’ To Shoot For Haathi Mere Saathi\nRana Daggubati has flown away to the jungles of Kerala for the shoot of his upcoming film Haathi Mere Saathi. Daggubati took to Twitter to inform all his fans and friends about the shoot. Rana on Tuesday tweeted, “Morning... Off into the jungles of Kerala for filming Haathi Mere Saathi.”\nHaathi Mere Saathi is a multilingual film and the plot revolves around wildlife conservation. While the Hindi version features Pulkit Samrat, the Tamil and Telugu version will have Vishnu Vishal playing the same role. Zoya Hussein and Kalki Koechlin will also play a pivotal role in the film.\nThe Eros International’s movie is titled Kaadan in Tamil and Aranya in Telugu. Helmed by Prabhu Solomon, the trilingual is being shot simultaneously in Hindi, Telugu and Tamil.\ntwitter\nThe movie will highlight man-animal relationship and is a story inspired by true events. The tile is a tribute to 1971 classic film Haathi Mere Saathi -- starring Rajesh Khanna and Tanuja, but the plot is completely different. The music has been composed by Shantanu Moitra and sound designed by Resul Pookutty.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nMorning....Off into the jungles of Kerala for filming #HaathiMereSaathi — Rana Daggubati (@RanaDaggubati) January 7, 2019\nSpeaking about his role to Mumbai Mirror, Rana had earlier said, “Yes, I’ll need to do more for this film. I’ll be taking 15-20 days before the shoot to stay with the elephants in the jungle and get familiar with them before I start filming.\nbccl\nAt the same time, we are also doing a bunch of workshops because the story is inspired by two events, so we are trying to get as authentic as we can in the filming process.”\nInputs From IANS", "title": "Rana Daggubati ‘Off Into The Jungles Of Kerala’ To Shoot For Haathi Mere Saathi", "date_publish": "08/01/2019, 15:34:33", "description": "Actor Rana Daggubati has jetted off to the jungles of Kerala for the shoot of his upcoming film Haathi Mere Saathi. Rana on Tuesday tweeted, “Morning... Off into the jungles of Kerala for filming Haathi Mere Saathi.”Rana on Tuesday tweeted, “Morning... Off into the jungles of Kerala for filming Haathi Mere Saathi.”", "authors": [], "url": "https://www.indiatimes.com/entertainment/rana-daggubati-off-into-the-jungles-of-kerala-to-shoot-for-haathi-mere-saathi-360044.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rana_1546944677_800x420.jpg"}