{"text": "Ranbir Kapoor To Share Screen Space With His 'Cine Idol' Sanjay Dutt In ‘Shamshera’\nRanbir Kapoor To Share Screen Space With His 'Cine Idol' Sanjay Dutt In ‘Shamshera’\nBecoming Sanjay Dutt was like a “a fan trying to play his icon on-screen” – that’s what Ranbir Kapoor had said on playing Sanjay Dutt in his biopic Sanju.\nHe said that the fanboy in him was scared to play the role onscreen but he couldn’t let go of the opportunity because the screenplay was \"sent from heaven\".\nTwitter\nHaving grown up watching Sanjay Dutt’s films, Ranbir Kapoor is a great fan of Sanjay Dutt. He is so mesmerised by his aura that during his teens he had a poster of him on the walls of his room.\nRanbir Kapoor has often shared that Sanjay Dutt is his idol, and he wishes to share screen space with him one day. And looks like the day has arrived sooner than he expected.\nAlthough, the duo came together for a song in Sanju, this one is extra special for Ranbir.\nIn his next action-adventure film Shamshera, Ranbir Kapoor is playing the role of a dacoit, and Sanjay Dutt is also playing a small role in it.\nDon't Miss 1.8 K SHARES 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES\n“Sanjay Dutt has a chock-a-block schedule as he wrapped up his portions of Shamshera two weeks ago,” reads a Deccan Chronicle report.\nIt’s a dream come true for Ranbir Kapoor.", "title": "Ranbir Kapoor To Share Screen Space With His 'Cine Idol' Sanjay Dutt In ‘Shamshera’", "date_publish": "11/01/2019, 18:17:02", "description": "Ranbir Kapoor has often shared that Sanjay Dutt is his idol, and he wishes to share screen space with him one day. And looks like the day has arrived sooner than he expected. In his next action-adventure film Shamshera, Ranbir Kapoor is playing the role of a dacoit, and Sanjay Dutt is also playing a small role in it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranbir-kapoor-to-share-screen-space-with-his-cine-idol-sanjay-dutt-in-shamshera-360262.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/dream_come_true_ranbir_kapoor_to_share_screen_space_with_his_idol_sanjay_dutt_in_shamshera_1547210861_800x420.png"}