{"text": "Ranbir Kapoor Turns Bodyguard For Girlfriend Alia Bhatt After They Get Mobbed At The Airport\nRanbir Kapoor Turns Bodyguard For Girlfriend Alia Bhatt After They Get Mobbed At The Airport\nRanbir Kapoor is a thorough charmer. RK is a ladies man and once again he has proved it. Well, Alia Bhatt and Ranbir Kapoor were in Delhi along with other Bollywood actors to meet the Prime Minister Narendra Modi.\nAfter the meeting, they were heading back to Mumbai but got mobbed by the fans. The fans obviously went berserk to see their favorite celebs in their town and insisted of clicking pictures.\nRanbir was seen extremely protective for girlfriend Alia; he was guarding her and wrapped his arm around her and walked her through the car. Well, chivalry should be his middle name.\nInstagram\nDon't Miss 336 SHARES 460 SHARES 247 SHARES 699 SHARES 1.7 K SHARES\nNot only Ranbir, even our Gully Boy Ranveer Singh is overprotective for his wifey Deepika. He has time and again happily turned bodyguard for her.. Our B-Town men are cheer gentlemen. Agree?\nTalking about the new IT couple Ranbir and Alia, there are rumours that they might get engaged after finishing their shooting for their first film Brahamstra. Alia seemed to have won all the hearts of the Kapoor family; she has been spotted hanging with the Kapoor family quite often.\nEven Alia’s parents are super happy with their relationship. Mahesh Bhatt in an interview had said, they are lovers and are deeply in love. Now we are waiting for the couple to take their relationship to the next level.", "title": "Ranbir Kapoor Turns Bodyguard For Girlfriend Alia Bhatt After They Get Mobbed At The Airport", "date_publish": "11/01/2019, 12:40:15", "description": "Ranbir Kapoor is a thorough charmer. RK is a ladies man and once again he has proved it. Well, Alia Bhatt and Ranbir Kapoor were in Delhi along with other Bollywood actors to meet the Prime Minister Narendra Modi.After the meeting, they were heading back to Mumbai but got mobbed by the fans. The fans obviously went berserk to see their favorite celebs in their town and insisted of clicking picture", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ranbir-kapoor-turns-bodyguard-for-girlfriend-alia-bhatt-after-they-get-mobbed-at-the-airport-360222.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranbir_kapoor_1547208725_800x420.jpg"}