{"text": "In the last few years, one of the most satisfying changes that we have seen as cine-goers is how filmmakers have become more experimental. Be it with their content or the stars they rope in, the change that we are witnessing is positive.\nThe films are not just driven by big A-listers or Khans anymore. You rope in good actors and have a solid script and you're sorted. This is the reason how films like Tummbad and Death In The Gunj are managing to entertain the audience.\nWhile a film like Thugs OF Hindostan that was backed by one India's leading banners failed to leave an impression, a film like Tummbad managed to rake in numbers purely on the basis of its script and the actors.\nThese changes prove that it's not just the best time to make films but it's also the best time to watch films.\nGoing ahead, the line up of films again looks promising and what we are really looking forward to is how producers are casting new faces and experimenting with some unconventional pairings.\nWho would have thought that Manav Kaul and Nandita Das would be roped in for the remake of an old classic? It's a win-win situation for both the actors and the audience.\nDon't Miss 7.9 K SHARES 158 SHARES 638 SHARES\nScreengrab\nTo give you a closer glimpse of the whole scenario, we made a list of nine on-screen couples we are really excited about. Read on and mark your calendars already!\n1. Ranbir Kapoor and Alia Bhatt | Film: Bharamastra\nBharamastra is one of the most eagerly-awaited films of the year and we have an ample amount of reasons to gauge the hype. Apart from it being lovebirds Ranbir-Alia's first film together, it is also Dharma and Ayan Mukerji's most-ambitious project till date. Ayan Mukerji's latest Instagram post hints at the fact that the plot is majorly driven with love.\nSharing a throwback picture from London 2016, he wrote, “Ranbir and Alia needed to work as one unit and that relationship was more important than their individual characters because, at its heart, our movie is a love story. There has been a lot of love since then.\" While Alia plays Isha, Ranbir will play the role of Shiva in the movie and it will hit the screens in December 2019.\n2. Kartik Aaryan and Sara Ali Khan | Movie: Imtiaz Ali's Next (Untitled)\nWhat began as a silly confession by Sara Ali Khan on Karan Johar's popular chat-show turned out to be a reality. Well, what began as a crush later went on to become a super-solid Jodi for Imtiaz Ali's next film. Considering what has been happening for the last three months, it's not surprising to see that Imtiaz Ali saw his potential couple in Sara and Kartik. Both Sara and Kartik are currently shooting for Imtiaz' next film 'Aaj Kal' and the film will hit the theaters in February next year.\n3. Deepika Padukone and Vikrant Massey | Film: Chhapaak\nWho would have thought that a TV actor who began his journey with a show called 'Balika Vadhu' will go on to become every filmmaker's dream? Well, Vikrant Massey's journey proves that if your dream has a heart, it will definitely turn into a reality. Vikrant began his journey with TV shows but later on, he transitioned into films and got a lot of love and adulation. From Dil Dhadakne Do to Konkona's directorial debut- A Death In The Gunj, Massey has never failed to move the audience with his screen presence.\nAnd it didn't come as a surprise when Meghna Gulzar announced the final cast last year. Talking about Vikrant’s role, Meghna told media:\n“The cast is slowly coming together. Vikrant is somebody I’ve wanted to work with since Raazi, after seeing him in A Death in the Gunj. In the film, he plays a North Indian boy who used to be a professional before he decided to become an actor, then, started a campaign against acid violence which is how he came to meet Laxmi in real life. I speak for both Deepika and myself when I say that we are both really excited to have Vikrant play this part.” The film will release next year.\n4. Manav Kaul and Nandita Das | Movie: Albert Pinto Ko Gussa Kyun Aata Hai\nThe original Albert Pinto Ko Gussa Kyun Aata Hai starred some brilliant actors including Naseeruddin Shah, Shabana Azmi, Smita Patil, and Om Puri. The film’s plot revolved around a young Christian man named Albert Pinto who is constantly angry with his colleagues and is always willing to fight with anyone and everyone. And now after years, the film is being revived for a remake and again, the team of actors is brilliant. Both Manav Kaul and Nandita, Das are kicked up for the project and it's like a breath of fresh air to watch two unconventional faces together. Talking to PTI, Nandita Das had said,\n“The earlier Albert Pinto… was made during a critical time in our history. It was the post-Emergency era. The Jayaprakash Narayan movement had failed to provide a stable government at the centre. We were at crossroads. Today, we are in a similar predicament, where politics and conversations, have all become so polarised. Divisive forces are distracting us from the real problems of unemployment, poverty, and inequity. There is anger simmering among the youth, the farmers, the marginalized, and that is the political undertone that the film has.\"\nThe remake has been written and directed by Soumitra Ranade and will release on 12th April.\n5. Priyanka Chopra and Farhan Akhtar | Film: The Sky Is Pink\nPriyanka Chopra and Farhan Akhtar collaborated for Zoya Akhtar's Dil Dhadakne Do in 2015 but since they didn't have many scenes together, it did leave us wanting for more. PC and Farhan will now be seen in Shonali Bose's 'The Sky Is Pink'.\nThe film is based on the life of Aisha Chaudhary, a motivational speaker with the book 'My Little Epiphanies' to her name. Aisha had immune deficiency disorder and at age of 13, she was diagnosed with Pulmonary Fibrosis. Apart from fighting bravely with the disorder, she even wrote the book. Unfortunately, Ayesha passed away hours after the launch of her book at a literature festival. PC and Akhtar will be playing the role of Aisha's parents while Zaira Wasim, who was last seen in Secret Superstar will be essaying the role of the young author.\n6. Sonam Kapoor and Dulquer Salman | Movie: Zoya Factor\nAs cine-goers and Bollywood fans, we are always up for fresh pairings and this one for sure is something we are looking forward to. Sonam Kapoor and Dulquer Salmaan will be seen in Zoya Factor, which is a cinematic adaptation of Anuja Chauhan’s 2008 novel 'The Zoya Factor'. This rom-com will revolve around cricket and Dulquer will play Nikhil Khoda, the captain of the Indian Cricket Team and Sonam playing Zoya Singh Solanki, an advertising agent. Helmed by Abhishek Sharma, the film has been written by Neha Rakesh Sharma and Pradhuman Singh.\n7. Shahid Kapoor and Kiara Advani | Film: Kabir Singh\nActor Kiara Advani will be seen with Shahid Kapoor in the Hindi remake of Telugu blockbuster Arjun Reddy. She will essay the role of Shahid’s love interest. Talking to a news agency, Kiara said, “‘Arjun Reddy’ has always been one of my favorite films. There are so many shades to the heroine’s character; I’m very excited about it. For the uninitiated, he original film revolves around an alcoholic surgeon who goes on a self-destructive path after his ex-lover marries someone else in the film. Kiara will be seen as Shalini Pandey for Hindi remake. Talking to media, she said, \"I love my de-glam look in the film. You don’t have to bother about touch up and there’s no headache of taking off your make-up. In real life too I rarely check the mirror and trust my team to ensure I look presentable on the screen so it is good to continue the same on the set.\"\nBoth Shahid and Kiara were also seen in a music video a few months ago. The remake of Urvashi went viral in no time and for all those who were left wanting for more and wanted to watch them together, you better get excited for this one!\n8. Arjun Kapoor and Kriti Sanon | Film: Panipat\nAshutosh Gowarikar announced his project Panipat and later on, Arjun Kapoor and Kriti Sanon were finalized as the lead cast. In an interview, Gowariker had said, “What impresses me most about Arjun, apart from his fine performances - is his dynamism. He has played double roles twice, and he has portrayed an action hero as well as a lover boy.”\nThe film is based on the third battle of Panipat between the Maratha forces and the invading army of the King of Afghanistan, Ahmad Shah Abdali, supported by two Indian allies - the Rohilla Afghans of the Doab and Shuja-ud Daula, the Nawab of Awadh.\nA Filmfare report had claimed that Arjun will be playing the role of Maratha commander-in-chief Sadashiv Rao Bhau while Kriti Sanon will play his wife, Parvati Bai. Reports have hinted that Arjun will be seen in a bald avatar for the film.\n9. Janhvi Kapoor and Rajkummar Rao | Film: Rooh-Afza\nShe might be just one film old but it looks like she is one of the most promising newbies. After Dhadak, she has already signed two more projects and one of them includes 'Rooh-Afza'. The news was shared by the team just a few days ago and in the film, she will be sharing the screen space with Rajkummar Rao and Varun Sharma. While it's too early to comment on the fate of the film, our expectations with the project are high because, in Rao, we trust!", "title": "Ranbir Kapoor-Alia Bhatt To Sara Ali-Kartik Aaryan, 9 On-Screen Couples We Are Damn Excited About!", "date_publish": "06/04/2019, 12:12:39", "description": "Who would have thought that Manav Kaul and Nandita Das would be roped in for the remake of an old classic? It's a win-win situation for both the actors and the audience. To give you a closer glimpse of the whole scenario, we made a list of nine on-screen couples we are really excited about. Read on and mark your calendars already!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranbir-kapoor-alia-bhatt-to-sara-ali-kartik-aaryan-9-on-screen-couples-we-are-damn-excited-about-364841.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sara_onscreen_1554380926_800x420.jpg"}