{"text": "Kangana Ranaut and sister Rangoli Chandel are on a mission. From calling out nepotism to targeting Alia Bhatt and her family, things have been rough between the two families. While Alia has always given dignified responses, her mother Soni Razdan finally responded to the allegations in her own way.\nRazdan responded to allegations made by Kangana Ranaut’s sister Rangoli Chandel, that she has no right to discuss Indian politics because she isn’t a citizen of the country. However, she questioned Kangana’s agenda and reminded Rangoli that it was Mahesh Bhatt who gave Kangana her big break in Bollywood.\nThese non Indians who are living off this land, using and abusing its people and its resources, lying about intolerance and spreading hatred, time to think about their agenda and not to get carried away with their provocations. https://t.co/FAwHChqopC — Rangoli Chandel (@Rangoli_A) April 14, 2019\nIn a tweet that has now been deleted, Soni Razdan had responded to Rangoli Chandel saying,\nTwitter\nDon't Miss 126 SHARES 336 SHARES 542 SHARES 12.5 K SHARES\n“Mahesh Bhatt is the man who has given her a break … she goes on to attack his wife and daughter. Daughter over and over again. What is left to be said then about abusing and hatred I wonder. Apart from character of course. Agenda ? What’s hers … ?”\nAnd to respond to the tweet, Rangoli posted a series of tweets, where she dug out Kangana's past sour experiences with Mahesh Bhatt.\nTwitter\nShe further accused Bhatt of 'throwing' a chappal at her at a film screening. Read the tweets here:\nDear Soni ji, Mahesh Bhatt never gave her a break, Anurag Basu did, Mahesh Bhatt ji works as a creative director in his brothers production house....(contd) @Soni_Razdan https://t.co/SD22ztrQ29 — Rangoli Chandel (@Rangoli_A) April 16, 2019\n(Contd).... please note that he doesn’t own that production house, after Woh Lamhe when Kangana refused to do a film written by him called ‘Dhokha where he wanted her to play a suicide bomber he got so upset that he not only shouted at her in his office..... (contd) @Soni_Razdan — Rangoli Chandel (@Rangoli_A) April 16, 2019\n.... but later when she went for Woh Lamhe preview to a theatre he threw chappal on her, he didn’t allow her to see her own film, she cried whole night .... and she was just 19years old . @Soni_Razdan — Rangoli Chandel (@Rangoli_A) April 16, 2019\nOf course Kangana is jealous of Alia’s super model looks and fashion sense, remarkable multiple national awards winning acting skills along with superhuman action style, Her exceptional IQ and speeches along with refreshing writings, directorial skills....(contd) @nina11_arora https://t.co/3aFeYanrN3 — Rangoli Chandel (@Rangoli_A) April 16, 2019\nWell, that's not all. Yesterday, Twitter was all about fireworks and that included a heated argument between Randeep Hooda and Rangoli. It all began with Hooda's tweet, where he appreciated Alia for her way of handling the mess with Kangana. After reading Randeep Hooda's tweets, a furious Rangoli responded on Twitter with series of tweets. Read on!\nDearest @aliaa08 I’m so glad you are not letting the opinions of very occasional actors and chronic victims affect you and your work .. kudos to you for your continued efforts to outdo yourself 🤗 — Randeep Hooda (@RandeepHooda) April 16, 2019\nAlia baby ko bachane ko nepotism gang ki khud ki himmat nahin toh tujhko aage kiya, I know during film Ungli what u did, kitna harass kiya tune Kangana ko aur kitna bada chatukar hai tu Karan Johar ka....(contd) @RandeepHooda — Rangoli Chandel (@Rangoli_A) April 16, 2019\n(Contd).....magar phir bhi tera kuch nahin hua, at least people like Alia are successful because of chamchagiri, bhai tu to permanent failure hai 🙏 @RandeepHooda — Rangoli Chandel (@Rangoli_A) April 16, 2019\nWe don't know about their films but the drama that these people are sparking on Twitter is surely entertaining! We wonder what Kangana has to say now.", "title": "Rangoli Attacks Soni Razdan, Accuses Mahesh Bhatt Of Physically Harassing Her Sister Kangana", "date_publish": "17/04/2019, 11:55:04", "description": "Kangana Ranaut and sister Rangoli Chandel are on a mission. From calling out nepotism to targeting Alia Bhatt and her family, things have been rough between the two parties. While Alia has always given dignified responses, her mother Soni Razdan finally responded to the allegations in her own way.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/rangoli-attacks-soni-razdan-accuses-mahesh-bhatt-of-physically-harassing-her-sister-kangana-365599.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/mahesh_bhatt_1555481551_800x420.jpg"}