{"text": "Rani Mukerji's First Look From Mardaani 2, Biopic On Asaram Is On Cards & More From Ent.\nRani Mukerji's First Look From Mardaani 2, Biopic On Asaram Is On Cards & More From Ent.\nAnd now, in the upcoming film Mardaani 2, Rani will again be seen putting up a brave fight with the child traffickers. It is being reported that Rani Mukerji will be seen going on a hunt for her 21-year-old nemesis in Rajasthan. Today, the first look of Rani Mukerji from the cop-drama was unveiled and she looks impressive!\nNow, a biopic based on the novel God of Sin: The Cult, Clout and Downfall of Asaram Bapu, Asaram Bapu’s journey to spiritual godhood, his massive fan following, downfall and rape conviction is in the works.\nGame of Thrones season 8 is finally happening – it has officially begun. After 595 days, if anything says it’s worth it, then it was the epic battle of Winterfell. The Long Night finally came and the Night King and his army of dead are no more. There are three more episodes left but one more epic battle that will decide who finally sits on the Iron throne.\nDon't Miss 862 SHARES 346 SHARES\n\"Each day of the voting, in a different part of the country, is the day you are selected for the voting, is an important day. It is very important for each and every Indian to be a part of it. So, cast your vote. Both Kiran and I are here to do that today. We have just done that,\" he said while speaking to media here.\nWhile a lot of other actors were clicked while they turned up for casting their votes, there was something special that people noticed about his pictures. In some of the pictures, he was seen helping an elderly woman climb the steps of the polling station.", "title": "Rani Mukerji's First Look From Mardaani 2, Biopic On Asaram Is On Cards & More From Ent.", "date_publish": "30/04/2019, 18:07:53", "description": "And now, in the upcoming film Mardaani 2, Rani will again be seen putting up a brave fight with the child traffickers. It is being reported that Rani Mukerji will be seen going on a hunt for her 21-year-old nemesis in Rajasthan. Today, the first look of Rani Mukerji from the cop-drama was unveiled and she looks impressive!", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/rani-mukerji-s-first-look-from-mardaani-2-biopic-on-asaram-is-on-cards-more-from-ent-366368.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/wrap_1556628558_800x420.jpg"}