{"text": "Ranveer Singh Is So Obsessed With Taimur That He Can't Wait To Work With Him In The Future\nRanveer Singh Is So Obsessed With Taimur That He Can't Wait To Work With Him In The Future\nFor god’s sake just leave Taimur Ali Khan alone – that is exactly what you all feel, right? People’s obsession with that little munchkin is almost disturbing. But for a lot of people, seeing his cute pictures is a guilty pleasure.\nTwitter\nIf you love the adorable goofball that Taimur Ali Khan is, you’re not alone. Even Ranveer Singh quite obsessed with the tiny tot. So much so, that he wants to work with him in future.\nTwitter\nAfter Deepika Padukone in the last episode, Ranveer Singh will appear on Karan Johar’s chat show Koffee With Karan along with Akshay Kumar. Both the actors are known for their epic sense of humour and to watch them on the show together, is going to be a laughter riot. Here’s a teaser!\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 707 SHARES\nIt is on the show that Ranveer Singh will talk about his obsession with Taimur Ali Khan and how he wishes to work with him one day. So now you know, Taimur is not attracting media attention but even the film fraternity can’t get enough of him.", "title": "Ranveer Singh Is So Obsessed With Taimur That He Can't Wait To Work With Him In The Future", "date_publish": "28/10/2018, 16:00:55", "description": "If you love the adorable goofball that Taimur Ali Khan is, you’re not alone. Even Ranveer Singh quite obsessed with the tiny tot. So much so, that he wants to work with him in future. Ranveer Singh made this confession on Koffee With Karan. He will appear on the show along with Akshay Kumar.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-is-so-obsessed-with-taimur-that-he-can-t-wait-to-work-with-him-in-the-future-355599.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ranveer_singh_is_so_obsessed_with_taimur_ali_khan_that_he_wants_to_work_with_him_in_future_1540719906_800x420.png"}