{"text": "Ranveer Singh Believes He Was Born To Do Gully Boy, Would Have Been Jealous If Somebody Else Did The Film\nRanveer Singh Believes He Was Born To Do Gully Boy, Would Have Been Jealous If Somebody Else Did The Film\n“Aag hai re baba” – that’s what Ranveer Singh’s fans have been saying since the time the trailer of his upcoming film Gully Boy has been released. They just can’t keep calm over the versatile man that he is. Is there anything he can’t do? We doubt that too!\nYour time has come. This is beyond beautiful 🔥 — Aashna ♡ (@_aashnaa__) January 9, 2019\nCatchy dialogues, electrifying music, stellar performances and an intriguing storyline, Gully Boy trailer has hit the right notes among fans and is making buzz for all the right reasons.\nAFP\nRanveer Singh is so good and apt in the role of a street rapper that even before we watch the entire film, we can say that it’s hard to imagine someone else in those shoes, right? Well, Ranveer Singh thinks the same too. He thinks he was born to do Gully Boy, and if somebody else would have done this role, he would have been jealous.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nAFP\n“When somebody told me about the script of Gully Boy, I told them that it is my film. If any other actor would have been a part of this film instead of me then I would have got burnt with jealousy. I was born to do Gully Boy and I knew only I can pull off this character,” he was quoted as saying by IANS.\nRanveer said it is a special film for him for too many reasons. “It’s a coming together of too many things that are very dear to me. It has rap, hip-hop music which I loved since I was a kid and it is set in my motherland Mumbai.”\nAlso starring Alia Bhatt, Kalki Koechlin, Vijay Raaz, Amruta Subhash and Siddhant Chaturvedi in prominent roles, Gully Boy is inspired by the life of Divine and Naezy (Naved Shaikh), underground rappers from Mumbai. Mark the date – the movie is releasing on Feb 14.", "title": "Ranveer Singh:Ranveer Singh Says He Was Born To Do Gully Boy, Would Have Been Jealous If Somebody Else Did The Film", "date_publish": "10/01/2019, 11:39:20", "description": "“Aag hai re baba” – that’s what Ranveer Singh’s fans have been saying since the time the trailer of his forthcoming film Gully Boy has been released. Ranveer Singh thinks he was born to do Gully Boy, and if somebody else would have done this role, he would have been jealous.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-believes-he-was-born-to-do-gully-boy-would-have-been-jealous-if-somebody-else-did-the-film-360133.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_says_he_was_born_to_do_gully_boy_would_have_been_jealous_if_somebody_else_did_the_fil_1547099591_800x420.jpg"}