{"text": "Ranveer Singh Sings ‘Tum Toh Thehre Pardesi’ With Team 83 In A Bus, Reminds Us Of School Picnics!\nRanveer Singh Sings ‘Tum Toh Thehre Pardesi’ With Team 83 In A Bus, Reminds Us Of School Picnics!\nWe have seen Ranveer Singh playing totally different kind of roles in every film. From Alauddin Khilji, Simmba to Gully Boy, Ranveer has proved that he is here for the long haul. In his next, however, he has taken up the biggest professional challenge, which is to master Kapil Dev’s bowling action for his biopic titled 83.\nThe shooting of the film has begun. The man is training with legendary cricketer Kapil Dev himself.\nTeam 83 is currently in Dharamshala brushing up their cricket skills. No brownie points for guessing how excited Ranveer Singh is for the movie. For this one as well, his energy quotient is higher than ever and looks like the energy bug has bitten others too.\nIn one of the videos doing the rounds, team 83 can be seen singing ‘tum toh thehre pardesi’ on top of their voice. Take a look!\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nThey are in a bus, perhaps post their practice session. Doesn’t it remind you of the everyday bus ride from school? We all have done this during picnics, for sure.\nBut that’s not all. How can Ranveer Singh not sing Apna Time Ayega, right? Once again, he rapped like a pro!\nThese are all memories that they are making. Deepika Padukone thinks exactly the same. She left an adorable comment on one of the pictures that Ranveer Singh had posted.\nBut how did you all manage to save so much energy post training session?", "title": "Ranveer Singh:Ranveer Singh Singing ‘Tum To Thehre Pardesi’ With Team 83 In A Bus Reminds Us Of Every Picnic Ever", "date_publish": "07/04/2019, 11:54:18", "description": "The team 83 is currently in Dharamshala brushing up their cricket skills. No brownie points for guessing how excited Ranveer Singh is for the movie. In one of the videos doing the rounds, team 83 can be seen singing ‘tum to thehre pardesi’ on top of their voice. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-sings-tum-toh-thehre-pardesi-with-team-83-in-a-bus-reminds-us-of-school-picnics-365014.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_singh_singing_tum_to_thehre_pardesi_with_team_83_in_a_bus_reminds_us_of_every_picnic_ever_1554616848_800x420.png"}