{"text": "Ranveer Singh Praises Co-Star Alia Bhatt, Feels She Could Be The Best Part Of 'Gully Boy'\nRanveer Singh Praises Co-Star Alia Bhatt, Feels She Could Be The Best Part Of 'Gully Boy'\nYou are surely living under the rock if you're unaware of who Tutu and Lulu in Bollywood are. Well, Ranveer Singh and Alia Bhatt have coined special names for each other.\nAfter collaborating for brand endorsements, the duo was roped in by Zoya Akhtar for her film Gully Boy. The film is slated for its release on 14th February and the promotions have already begun.\nScreengrab\nDuring his recent interview with IANS, Singh was in praises of his co-star Alia Bhatt. In an e-mail interview from Mumbai, Singh said,\nTwitter\n\"Before working on 'Gully Boy', I did some ads with Alia and they were really fun. She has lovely energy about her. But when I worked with her on 'Gully Boy', I realized what a powerhouse of a talent she is.\"\nRanveer is supremely fond of Alia Bhatt as he calls her \"immensely talented, expressive, full of emotion, very intelligent\" and that her emotional quotient is \"very high.\"\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTalking about Alia and how fond he has been of her work, Singh added,\nYouTube\n\"She has evolved as a person far beyond her years. She is on her way to greatness. She was really brilliant in 'Raazi'. I have been an admirer of her work and craft ever since 'Highway'.\"\nRanveer proudly says Alia \"could very well be the best part of 'Gully Boy'\". He adds,\n\"She plays the character, that on the script level, is my favourite character. She has really made it her own, and I'm very happy for her.\"\nStarring Kalki Koechlin, Zoya Akhtar-directed \"Gully Boy\" is a film about Indian street rappers and their struggles.\n(Also read: Ranveer Shows What 'Asli' Hip-Hop Is In Gully Boy Teaser & Fans Are Already Bobbing Their Heads)\n(With IANS inputs)", "title": "Ranveer Singh Praises Co-Star Alia Bhatt, Feels She Could Be The Best Part Of 'Gully Boy'", "date_publish": "06/01/2019, 11:47:20", "description": "You are surely living under the rock if you're unaware of who Tutu and Lulu in Bollywood are. Well, Ranveer Singh and Alia Bhatt have coined special names for each other. After collaborating for brand endorsements, the duo was roped in by Zoya Akhtar for her film Gully Boy. The film is slated for its release on 14th February and the promotions have already begun.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-praises-co-star-alia-bhatt-feels-she-could-be-the-best-part-of-gully-boy-359926.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_and_alia_1546756138_800x420.jpg"}