{"text": "Ranveer Singh & Sara Ali Khan’s Crackling Chemistry In These Pics Is Making Us Excited For 'Simmba'\nRanveer Singh & Sara Ali Khan’s Crackling Chemistry In These Pics Is Making Us Excited For 'Simmba'\nHe’s quirky, crazy and fabulous. Ranveer Singh is one heartthrob of Bollywood, and almost every actress wishes to share screen space with the talented man that he is. Even Kareena Kapoor was excited to be finally getting the opportunity to work with Ranveer Singh after Karan Jahar’s multi-starrer film Takht was announced.\nTwitter\nRanveer Singh has such an energetic persona that no one can ever get bored with him. His chemistry with all his co-stars has been spectacular. In his next titled Simmba, he will be seen sharing screen space with Saif Ali Khan and Amrita Arora’s daughter Sara Ali Khan, and looks like they share a crackling chemistry.\nTwitter\nSome of the behind-the-scenes pictures from the sets of Rohit Shetty’s Simmba are going viral on social media. Ranveer Singh and Sara Ali Khan can be seen rehearsing for a song and they look marvellous together, don’t they? Check out the pictures below.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES\n#1\nInstagram\n#2\nInstagram\n#3\nInstagram\n#4\nInstagram\nRanveer Singh and Sara Ali Khan also shot for the peppy number with Golmaal stars including Kunal Kemmu, Tusshar, Shreyas & Arshad Warsi.\nHere are some of the more BTS pictures.\nOn Koffee With Karan recently, Ranveer Singh revealed a secret about Sara Ali Khan. He said she makes up a lot of stories, and hence, he will never believe her no matter what she says.\nIt would be interesting to see them both together, don’t you think? Simmba is expected to hit the screens on December 28.", "title": "Ranveer Singh & Sara Ali Khan’s Crackling Chemistry In These Pics Is Making Us Excited For 'Simmba'", "date_publish": "31/10/2018, 13:06:48", "description": "Ranveer Singh has such an energetic persona that no one can ever get bored with him. His chemistry with all his co-stars have been spectacular. In his next titled Simmba, he will be seen sharing screen space with Saif Ali Khan and Amrita Arora’s daughter Sara Ali Khan, and looks like they share a crackling chemistry.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-sara-ali-khan-s-crackling-chemistry-in-these-pics-is-making-us-excited-for-simmba-355775.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ranveer__saras_crackling_chemistry_in_these_pics_from_simmba_1540970334_800x420.png"}