{"text": "During the time of distress, every single act of kindness counts. The film fraternity in India definitely stands in solidarity during toughest of times and with Pulwama, they have again united.\nAfter Amitabh Bachchan and Uri Team's generous donations for the martyred soldiers of Pulwama attack, there are other celebrities who are following the footsteps and making contribution in their own way.\nWhile Ayushmann's poetic tribute to our soldiers is commendable, Ranveer Singh dedicated his speech at an award function in Dubai to the soldiers and observed a minute of silence.\nHere's how Bollywood celebrities are paying respect to the soldiers who lost their life in the ghastly Pulwama attack.\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n1. Ranveer Singh on Saturday was felicitated at an award show in Dubai, where he dedicated his speech to the martyred soldiers.\nDuring his speech, Ranveer remembered the CRPF soldiers and observe a minute's silence. In his speech, Ranveer said,\nBollywood actor @RanveerOfficial urges audience to observe a one minute silence for the martyred Indian soldiers in Kashmir. pic.twitter.com/uKwq6qOpwH — Manjusha (@ManjushaRK) February 16, 2019\n\"Like every other India, my thoughts and prayers are with our brave jawans who lost their lives in the line of service, our real heroes. May I request everyone present here to join me in observing a minute of silence for our martyred jawans. Please rise from your seats. Let us all please observe a minute of silence for our heroes.\"\n2. Ayushmann Khurrana penned down a heart-warming poem\nदेश का हर जवान बहुत ख़ास है,\nहै लड़ता जब तक श्वास है,\nपरिवारों के सुखों का कारावास है,\nशहीदों की माओं का अनंत उपवास है,\nउनके बच्चों को कहते सुना है -\nपापा अभी भी हमारे पास हैं!\n-आयुष्मान #Pulwama — Ayushmann Khurrana (@ayushmannk) February 16, 2019\nIn his poem, Khurrana salutes the courage and sacrifice of soldiers. This heartfelt dedication in form of a poem is beautiful and heartbreaking.\nHe wrote,\nदेश का हर जवान बहुत ख़ास है,\nहै लड़ता जब तक श्वास है,\nपरिवारों के सुखों का कारावास है,\nशहीदों की माओं का अनंत उपवास है,\nउनके बच्चों को कहते सुना है -\nपापा अभी भी हमारे पास हैं!\n-आयुष्मान #Pulwama\n3. Salman Khan donates for the families of Pulwama Martyrs through his Being Human foundation\nThe news was shared by Kiren Rijiju, Minister of State for Home Affairs. Thanking Salman and appreciating him for his the contribution, he wrote, “Thank you @BeingSalmanKhan on offering to contribute for Pulwama Martyrs through BEING HUMAN FOUNDATION. I'll work out for handing over of the cheques in the account of #BharatKeVeer @BharatKeVeer.”\n4. Diljit Dosanjh donates 3 Lakh rupees\nActor-singer Diljit Dosanjh also took to Instagram and penned down an inspiring note for his fans to donate via Paytm. He also shared a receipt of his donation worth Rs 3 lakhs to the CRPF Wives Welfare Association.", "title": "Ranveer Observes A Minute Of Silence, Ayushmann Pens Down Poem, Bollywood Celebs Pay Respect To Pulwama Martyrs", "date_publish": "17/02/2019, 14:44:16", "description": "After Amitabh Bachchan and Uri Team's generous donations for the martyred soldiers of Pulwama attack, there are other celebrities who are following the footsteps and making contribution in their own way. While Ayushmann's poetic tribute to our soldiers is commendable, Ranveer Singh dedicated his speech at an award function in Dubai to the soldiers and observed a minute of silence. Here's how Bol", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-observes-a-minute-of-silence-ayushmann-pens-down-poem-bollywood-celebs-pay-respect-to-pulwama-martyrs-362306.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/pulwama_attack_1550396291_800x420.jpg"}