{"text": "1. Ranveer Singh Sings ‘Tum Toh Thehre Pardesi’ With Team 83 In A Bus, Reminds Us Of School Picnics!\nWe have seen Ranveer Singh playing totally different kind of roles in every film. From Alauddin Khilji, Simmba to Gully Boy, Ranveer has proved that he is here for the long haul. In his next, however, he has taken up the biggest professional challenge, which is to master Kapil Dev’s bowling action for his biopic titled 83.\n2. For The First Time Ever, Rihanna Is Coming To India For A Concert & We Just Can’t Keep Calm!\nThis time, however, it seems the grapevine is substantial because the date has been locked apparently. It is said that Riri will perform in Mumbai on October 19. “Yes, Rihanna will be coming to India for the first time this year and will be performing in Mumbai,” an insider was quoted a source as saying by Pinkvilla.\n3. Marvel Officially Screened 10 Minutes Of Avengers: Endgame & Internet Is Brimming With Spoilers\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 185 SHARES\nWhat will happen in the movie, everyone is wondering, but some of the people have already watched it. Not entirely, of course, but just 10 minutes of it. No, it hasn’t been leaked. Ten minutes of Avengers: Endgame was screened for the press head of the film’s Los Angeles press junket on Friday.\n4. Fan Creates A Scene Outside Varun Dhawan's Home, Threatens To Kill His Girlfriend Natasha Dalal\nThis time, a crazy Varun Dhawan fan first stalked him outside his home. She was taking rounds of the house when the guards spotted her. She wanted to meet Varun Dhawan. However, since he is busy with Kalank promotions, he came home tired but the fan was in no mood to go home without meeting him. The situation got out of hands and she soon started shouting “I will kill Natasha.” The security guards had no option but to call the police.\n5. Irrfan Khan's Wife Pens An Emotional Note About Their 'Longest Year' As He Finally Resumes Work\nAfter his treatment in London, he is back in India and has even begun shooting for Hindi Medium’s sequel titled Angrezi Medium. As he began shooting for the film, he penned down a note for his fans in order to thank them for sending so much love and prayers.", "title": "Ranveer Sings ‘Tum Toh Thehre Pardesi’, Rihanna Is Coming To India & More From Entertainment", "date_publish": "07/04/2019, 18:03:03", "description": "Unless you have been living under a rock, you must have heard about the crazy fandom for Marvel’s Avengers: Endgame, the movie which will conclude about 20 movies of Marvel Cinematic Universe. It’s hard and stupid to miss this one, to be honest. The frenzy of the Avengers: Endgame is such that the pre-ticket sales have set a record already. People are re-selling the tickets on eBay for almost Rs 6", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-sings-tum-toh-thehre-pardesi-rihanna-is-coming-to-india-more-from-entertainment-365040.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_sings_tum_toh_thehre_pardesi_rihanna_is_coming_to_india__more_from_ent_1554639845_800x420.png"}