{"text": "Ranveer Singh & Deepika Padukone’s Wedding Preparations Have Begun At Lake Como & Everyone Looks Excited\nRanveer Singh & Deepika Padukone’s Wedding Preparations Have Begun At Lake Como & Everyone Looks Excited\nIt’s going to be the wedding of the year! Ranveer Singh and Deepika Padukone, the much in love couple of the B-Town, is all set to tie the knot in Italy on Nov 14-15. It’s going to be a private ceremony of course but details about what’s happening have already started to emerge.\nRanveer Singh and Deepika Padukone left for Italy a couple of days back. Ranveer Singh was all excited quite evidently. Not only did he thank fans for wishing him Shaadi Mubarak, he was also listening to Mehendi Lagage Rakhna.\nWhat’s more? It is said that Ranveer Singh will dance on Govinda, Anil Kapoor and Akshay Kumar’s songs on his own wedding. It’s going to be a crazy night. Considering how energetic he always is, we know he will surely drag all his friends and family members on the dance floor as well.\nMeanwhile, the wedding preparations in Italy have already begun.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES\nWhat’s more? While Deepika Padukone’s team has already reached Milan, Ranveer Singh’s team including his stylist and manager left for Italy earlier today. With smiles on their faces and excitement in their aura, everyone looked all set for #RanveerKiShaadi.\nAlso, this video from Ranveer Singh and Deepika Padukone’s hotel is also doing the rounds.", "title": "Ranveer Singh & Deepika Padukone’s Wedding Preparations Have Begun At Lake Como & Everyone Looks Excited", "date_publish": "12/11/2018, 11:35:48", "description": "It’s going to be the wedding of the year! Ranveer Singh and Deepika Padukone, the much in love couple of the B-Town, is all set to tie the knot in Italy on Nov 14-15. It’s going to be a private ceremony of course but details as to what’s happening have already started to emerge.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-deepika-padukone-s-wedding-preparations-have-begun-at-lake-como-everyone-looks-excited-356478.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_sigh__deepika_padukones_wedding_preparations_have_begin_at_lake_combo__everyone_looks_exc_1542001796_800x420.png"}