{"text": "Give him the Husband Of The Millennium tag already. We are proud to declare that Ranveer Singh is the best husband in the world or in Bollywood at least. There's nothing he doesn’t do for the love of his life.\nTwitter\nHe can fly halfway across the world just to spend minutes with her. No, Deepika doesn’t force him to do that. He does it because he “just has to see her.”\nsocialsamosa.com\nYou want to know more? He is in awe of Deepika Padukone’s beauty. He wonders how can she be so beautiful always. “When she wakes up she's gorgeous, middle of the day she's gorgeous. She's just gorgeous every way. My god I wake up next to her and I can't believe it.” Ranveer Singh just can’t stop gushing, can he?\nInstagram\nRecently, Ranveer Singh and Deepika Padukone were clicked after a dinner date, and they both left us in awe of their love, again. With all the love, Ranveer Singh wiped dust off Deepika Padukone’s pants and then gave a peck on her cheeks, while she had the biggest smile on her face. There was so much love – just take a look at these pictures and videos.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 257 SHARES\nTwitter\nTwitter\nTwitter\nRanveer Singh and Deepika Padukone, you need to stop this PDA. There are a lot of single people out there, who just can’t take so much of love. You both are just adorable! We just can’t stop aww-ing.", "title": "Ranveer Wiping Dust Off Deepika’s Pant & Kissing Her Will Make Single People Pine For A Lover!", "date_publish": "01/02/2019, 12:05:59", "description": "Ranveer Singh and Deepika Padukone were clicked after a dinner date, and they both left us in awe of their love, again. With all the love, Ranveer Singh wiped dust off Deepika Padukone’s pants and then gave a peck on her cheeks, while she had the biggest smile on her face. There was so much love – just take a look at these pictures and videos.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-wiping-dust-off-deepika-s-pant-kissing-her-will-make-single-people-pine-for-a-lover-361400.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_and_deepikas_pda_at_a_dinner_date_is_making_our_hearts_melt_1549002047_800x420.png"}