{"text": "Ranveer Singh and Deepika Padukone are truly a match made in heaven. Do you believe in fairytales? Well, after seeing Ranveer and Deepika high on happiness together, we sure do. It’s been two months since they tied the knot, and the lovebirds are having the best time of life.\nBCCL\nDeepVeer fans were waiting for Deepika Padukone to change her surname to Singh, just like Priyanka Chopra, Sonam Kapoor and Neha Dhupia did shortly after their wedding. When she was asked about the same in one of her interviews, she joked and said Ranveer Singh will change his name to Ranveer Singh Padukone.\nPTI\nIn fact, she also admitted that she has never even discussed changing surnames with Ranveer.\n“After that interview, I realized that it’s a conversation Ranveer and I’ve never even had. So, we haven’t been like, ‘oh, do you think you should change your surname?’... It has never crossed either of our minds. When I was asked about it, I was like, ‘oh, we haven’t even thought about it,” she was quoted as saying by India TV.\nTwitter\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nSpilling the beans on how life is after his wedding, Ranveer Singh said he is loving it all. Now, Ranveer Singh is not supposed to miss any calls, and he never leaves home without eating. The craziest thing he has ever done for Deepika Padukone is flying across the world to spend just a few minutes with the love of his life.\nInstagram\nWhen Ranveer Singh was asked about how Deepika joked that he is getting a new surname, he laughed it off saying, “Since I have dropped my surname, I need a new one, so why not! It’s a legendary surname.”\nAren’t they both just adorable!\nAlso Read: Meet Real Life Gully Boys Divine & Naezy Who Went From Raps To Riches & Inspired Ranveer’s Film", "title": "Ranveer Singh Jokes About Taking His Wife Deepika Padukone’s Last Name, Calls It A 'Legendary Surname'", "date_publish": "16/01/2019, 13:27:04", "description": "Spilling the beans on how life is after his wedding, Ranveer Singh said he is loving it all. Now, Ranveer Singh is not supposed to miss any calls, and he never leaves home without eating. The craziest thing he has ever done for Deepika Padukone is flying across the world to spend just a few minutes with the love of his life.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-jokes-about-taking-his-wife-deepika-padukone-s-last-name-calls-it-a-legendary-surname-360496.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_jokes_hes_ready_to_take_wife_deepika_padukones_name_calls_it_a_legendary_surname_1547628181_800x420.jpg"}