{"text": "Padmaavat was one of the most successful films of 2018 but it had to go through a lot of roadblocks.\nFrom Karni Sena protests to reports of a personal tiff between Shahid and Ranveer, there were several reports that made news before the release of Padmaavat. After a year of its release, both Shahid Kapoor and Ranveer Singh opened up about their working equation during the shoot of the film.\nShahid had a lukewarm response around his equation with his co-stars Deepika and Ranveer. He was on Koffee With Karan when he said,\n“My relationship status with most of the industry is zilch. Honestly, Deepika, Ranveer and Sanjay sir never became a part of my friend circle as such. I think it was more a professional thing. And it’s not the status was different and it’s changed in any manner. We connected when we were working and now we don’t have any connection. It was really a big film and the stakes were very high for everybody. So everybody wanted to have their A-game on. Everybody was doing everything it takes to kind of be in the center of the limelight. I’m sure everybody felt a bit threatened by each other at some level, it’s natural”.\nHowever, Ranveer had an entirely different way of putting it across. He was on Famously Filmfare where he admitted that there were no issues. He added,\nTwitter\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n\"We were very good together, yaar. I think we had a good time shooting for the film. Creatively fulfilling.\"\nIt was during the shoot of Padmaavat when Shahid had expressed his displeasure on working with Ranveer and Deepika. He had admitted to media that he felt \"like an outsider\" on the sets of Padmaavat.\nEven then, Ranveer handled it gracefully and had responded in another interview admitting that he did everything possible to make him feel at home.", "title": "Ranveer Singh Recalls His Working Equation With Shahid Kapoor During The Shoot Of Padmaavat", "date_publish": "16/01/2019, 16:06:23", "description": "Padmaavat was one of the most successful films of 2018 but it had to go through a lot of roadblocks. From Karni Sena protests to reports of a personal tiff between Shahid and Ranveer, there were several reports that made news before the release of Padmaavat. After a year of its release, both Shahid Kapoor and Ranveer Singh opened up about their working equation during the shoot of the film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-rubbishes-rumour-of-tiff-with-shahid-kapoor-during-the-shoot-of-padmaavat-360519.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_1547638042_800x420.jpg"}