{"text": "Karan Johar who is known for making multi-starrer films and for the very first time, he is attempting a historical drama with his upcoming directorial venture.\nWhat’s even more exciting about this film is the ensemble cast that includes Ranveer Singh, Kareena Kapoor, Alia Bhatt, Vicky Kaushal, Bhumi Pednekar, Anil Kapoor and Janhvi Kapoor. That’s half of the Bollywood’s most sought-after actors right there.\nIt’s going to be a period drama. While earlier it was revealed that Anil Kapoor will essay the role of Shah Jahan in the multi-starrer Dharma Productions film, now it has been revealed that Ranveer Singh will play the role of Dara Shikoh and Vicky Kaushal will portray Aurangzeb in Takht, in a recent appearance on journalist Rajeev Masand’s annual actors’ roundtable.\nIf this was not enough to amp up your excitement level, Karan Johar had earlier said that Takht will be like his iconic film Kabhi Khushi Kabhi Gham, but it will be set in the Mughal era. Well, that sounds exciting, doesn't it?\nDon't Miss 233 SHARES 185 SHARES 870 SHARES 544 SHARES 411 SHARES\nWhat is the story about? “It’s about two warring brothers and it’s based on facts. It’s like the K3G of the Mughal era. But it’s more extreme, there is more betrayal. It has the tropes of court politics. It’s so rich in texture,” Karan Johar had earlier told Film Companion.\nAlso Read: Anil Kapoor To Play Shah Jahan In Karan Johar’s Multi-Starrer ‘Takht’ & He’ll Bulk Up For The Role", "title": "Ranveer Singh To Play Dara Shikoh, Vicky Kaushal Will Portray Aurangzeb In Karan Johar’s Takht", "date_publish": "25/12/2018, 16:28:05", "description": "While earlier it was revealed that Anil Kapoor will essay the role of hah Jahan in the multi-starrer Dharma Productions film, now it has been revealed that Ranveer Singh will play the role of Dara Shikoh and Vicky Kaushal will portray Aurangzeb in Takht, in a recent appearance on journalist Rajeev Masand’s annual actors’ roundtable.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood/ranveer-singh-to-play-dara-shikoh-vicky-kaushal-will-portray-aurangzeb-in-karan-johar-s-takht-359252.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_singh_to_play_dara_shikoh_vicky_kaushal_will_portray_aurangzeb_in_karan_johars_takht_1545734368_800x420.png"}