{"text": "Ranveer Wants To Collaborate With Ranbir For ‘Andaz Apna Apna 2’ & We Just Can't Keep Calm!\nRanveer Wants To Collaborate With Ranbir For ‘Andaz Apna Apna 2’ & We Just Can't Keep Calm!\nNot all great films make money. The classic example of this is Andaz Apna Apna, the epic comedy film that gave Bollywood iconic characters like Amar, Prem and Crime Master Gogo. The film, after all these years, still makes us roll with laughter each time we watch it.\nThe film brought together two of the most sought after Khans – Aamir Khan and Salman Khan – way back in 1994, and managed to cast an impact over the entire generation, which grew up on its zany sense of humour.\nNow, just imagine Ranveer Singh in the sequel of this movie. It’s going to be a screwball comedy yet again, don’t you think?\nWell, Ranveer Singh apparently wants to star in Andaz Apna Apna 2, and here’s proof.\nhoping for something crackling to come along! very much looking forward to something in that space! Andaz Apna Apna 2?! ;) https://t.co/WucZft7mVh — Ranveer Singh (@RanveerOfficial) December 22, 2018\nDon't Miss 185 SHARES 544 SHARES 247 SHARES 699 SHARES 1.7 K SHARES\nHe is apparently very excited about it too. After this twitter conversation with a fan, when Ranveer Singh was asked about the possibility of starring in a sequel, here’s what he had said.\n“I think it's a cult film and I think it's going to be difficult to live up to it. If you are planning to make the sequel of Andaz Apna Apna, you have got a big responsibility as it's one of those timeless comedies.”\nWhat’s more? Rohit Shetty in an interview had said that he would want to cast Ranbir Kapoor and Ranveer Singh, if he had to remake Andaz Apna Apna. Ranveer is all game for that!\n“And yes, I would love to collaborate with Ranbir as he is one of my favourite actors. There have been several opportunities and I hope one of them in near future materializes. It will be a very enriching experience working with Ranbir,” he added.\nWell, we can’t wait to seem them together, can you?", "title": "Ranveer Wants To Collaborate With Ranbir For ‘Andaz Apna Apna 2’ & We Just Can't Keep Calm!", "date_publish": "30/12/2018, 17:08:44", "description": "Not all great films make money. The classic example of this is Andaz Apna Apna, the epic comedy film that gave Bollywood iconic characters like Amar, Prem and Crime Master Gogo. The film, after all these years, still makes us roll with laughter each time we watch. Now, just imagine Ranveer Singh is the sequel of this movie. It’s going to be a screwball comedy yet again, don’t you think.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-wants-to-collaborate-with-ranbir-for-andaz-apna-apna-2-we-can-t-keep-calm-359521.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranbir_kapoor_and_ranveer_singh_andaz_apna_apna_2_1546168173_800x420.png"}