{"text": "1. Ranveer Singh's New Year Resolution Involves 'Loads Of Snuggling' With Wifey Deepika Padukone\nSoon enough, the actor tied the knot with Deepika Padukone. And the love on social media, on shutterbugs still continues. Recently, Ranveer Singh made a special New Year resolution. Taking to Instagram, the actor wrote, \"New year resolution, loads of snuggling\"\n2. Simmba Becomes Rohit Shetty’s 8th Consecutive Film To Cross Rs 100 Crore, Sequel Maybe On Cards\nSimmba is Rohit Shetty’s eighth consecutive hit film (after Golmaal 3, Singham, Bol Bachchan, Chennai Express, Singham Returns, Dilwale and Golmaal Again) which has crossed Rs 100 crore mark at the box office. And he is the only Bollywood filmmaker who has achieved this landmark. Simmba has made more than Rs 124 crore in just five days.\n3. Abhishek Bachchan Proposed Aishwarya On Jodha Akbar Sets & Hrithik Roshan’s Reaction Was Epic!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“Ashutosh is like ‘you are engaged’ and I am like ‘yeah,’” Aishwarya said revealing that Hrithik Roshan too gave her an excited thumbs up. “We’re doing Khawja Mere Khwaja, sitting as a bride, and I am like, oh my god this is surreal, all happening on-screen, off-screen, this is bizarre,” she said.\n4. Kader Khan’s Son Slams Govinda, Asks ‘How Many Times He Inquired About His Father Figure's Health’?\n“Please ask Govinda how many times he inquired about his father figure's health. Has he even bothered to call us even once after my father's passing away? This is the way our film industry has become. There are no real feelings for those who have contributed to Indian cinema when they're no longer active...\"\n5. Anupam Kher Was Reluctant To Play Manmohan Singh Initially Because He Knew It Was Controversial\n“I think so far there is not any film made like this, realistically on the politics of our country. And there is a first account film made on Former Prime Minister Manmohan Singh, in the form of the book with the same name. And when I read the script as an audience I wanted to watch the film, it’s been 70 years we are independent so we should know what is happening in the PMO and yet it is not the political course that I got attracted to, it’s a relationship course between this media advisor and the Prime Minister.\"", "title": "Ranveer Singh’s New Year Resolution, Rohit Shetty Likely To Make Simmba’s Sequel & More From Ent", "date_publish": "03/01/2019, 17:42:16", "description": "It is safe to call Ranveer Singh the most energetic person in Bollywood. From giving his 100% to the movies or his relationship, Ranveer has established a different kind of relationship with his fans. It's the one where people love him on-screen and off-screen in equal measure.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-s-new-year-resolution-rohit-shetty-likely-to-make-simmba-s-sequel-more-from-ent-359803.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singhs_new_year_resolution_rohit_shetty_likely_to_make_simmbas_sequel__more_from_ent_1546517598_800x420.png"}