{"text": "He said, “I feel like I am flying, Marriage is like the best thing that’s ever happened to me. Wow, I feel some kind of magic, some kind of power, I feel invincible, you know in superhero movies, that moment when the suit comes on, I feel like marriage has done that to me. I feel like I’ve grown up now, finally, I am a man. I feel grounded, I feel secure. I’m really loving it, it’s been only 10 or 15 days, it’s so nice, it’s so lovely. I would highly recommend it.”\nEvery character was sketched to perfect with the right mix of drama, emotions and humor. Today, as the film completes 17 years of its release, let's take you on a nostalgia trip.\nThe film helmed by Zoya Akhtar is loosely inspired by the life of rapper Divine, has been selected as part of the Berlinale Special programme.\nNothing much has changed for either of the two and their marriage looks easy-breezy as they juggle between partying, chilling, having fun and enjoying their lives as a married couple.\nDon't Miss 10.9 K SHARES\n5. Ranveer Singh's Take On The Success Of #MeToo In India & The Concept Of Consent Is A Must-Read!\nRanveer said, \"The #MeToo movement was historic, revolutionary. It has made guys take stock and think and, that itself, is a big thing. It has been hugely impactful and significant.\"", "title": "Ranveer Talks About Marriage, K3G Completes 17 Years Of Release And More From Ent World", "date_publish": "14/12/2018, 18:21:58", "description": "He said, “I feel like I am flying, Marriage is like the best thing that’s ever happened to me. Wow, I feel some kind of magic, some kind of power, I feel invincible, you know in superhero movies, that moment when the suit comes on, I feel like marriage has done that to me. I feel like I’ve grown up now, finally, I am a man. I feel grounded, I feel secure. I’m really loving it, it’s been only 10 or", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-talks-about-marriage-k3g-completes-17-years-of-release-and-more-from-ent-world-358626.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/trending_1544792125_800x420.jpg"}