{"text": "1. Ranveer Singh Gatecrashes A Wedding During Simmba Promotions, Congratulates The Bride & Groom!\nThe actor was promoting the film at a hotel in Mumbai when he got to know about a wedding ceremony that was taking place. Without thinking twice, he went ahead and gatecrashed the wedding. After meeting the guests, the family and the bride-groom, Ranveer Singh even posed for the paps. The crowd present there was star-struck but the bride and groom were the happiest to see a superstar like Singh gatecrash and attend their wedding ceremony. He even clicked selfies with the guests.\n2. T-Pain Accused Of Plagiarising Aashiqui 2 Song Tum Hi Ho, Gets Trolled By 'Brown Twitter'\nWhat happened recently is definitely a rarity. American rapper T-Pain has been accused of plagiarising a recurring flute melody from Arijit Singh’s popular song from Aashiqui 2, Tum Hi Ho.\n3. Talking About His Struggling Phase, Shah Rukh Khan Says He Was Called 'Ugly' By A Director\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES 185 SHARES\n\"I was practical and knew that I didn’t look the hero type, nor couldn’t I dance like one. In fact, a director once told me that he could use me anywhere because I was so ugly and not the hero-type.\"\n4. Naseeruddin Shah Calls Virat Kohli 'Worst Behaved Player’, Stirs Up A Storm On The Internet\nJust to jog your memory a little, a few weeks ago, Kohli was trolled for a video where the Indian skipper asked a fan to leave India. Kohli reacted to a fan comment during a promotional video, when the fan confessed that he liked English and Australian batsmen more than the current Indian players.\n5. Kapil Sharma Donates Leftover Food From His Wedding, Wins Hearts With This Kind Gesture\nKapil Sharma is making headlines and thankfully for all the right reasons. A press release by Kapil Sharma's team states that when the NGO got to know about Kapil's wedding, the officials approached him as they knew it would be a big fat Punjabi wedding and there will not only be a lavish spread of food but also in excess quantity.", "title": "Ranveer Gatecrashes Wedding, T-Pain Accused Of Plagiarising Aashiqui 2 Song & More From Ent", "date_publish": "18/12/2018, 18:07:24", "description": "From Ranveer Singh gatecrashing a wedding to promote Simmba to T-Pain being accused of plagiarising his latest single from Aashiqui 2 song Tum Hi Ho and getting savagely trolled by Indian fans, here’s all that rocked the world of entertainment and Bollywood today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-gatecrashes-wedding-t-pain-accused-of-plagiarising-aashiqui-2-song-more-from-ent-358844.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_gatecrashes_wedding_tpain_accused_of_plagiarising_aashiqui_2_song__more_from_ent_1545131950_800x420.png"}