{"text": "1. Ranveer Wins Best Actor For Padmaavat, Leaves Wife Deepika Teary-Eyed With His Emotional Speech\n“Film main mujhe Rani nahi mili ( I did not get the Queen in the film), but in real life, I have got my Queen… Baby, I love you, pichhle 6 saal main maine kuch bhi achieve kiya hai, kyunki aap ne mujhe grounded rakha, centered rakha, thank you for everything and I love you.”\n2. Nawazuddin Siddiqui Looks Uncannily Similar To Bal Thackeray In This New Leaked Video & We’re Excited\nWrapped in a saffron shawl, Nawazuddin Siddiqui as Bal Thackeray can be seen walking out of an airport to sit inside his car in this new leaked video. Nawazuddin’s get up as Thackeray is indeed uncanny.\nMeanwhile, Sunil Grover who did a lot of live shows and also featured in movies like Patakha, is also back on TV with another show called Kanpur Wale Khuranas, which has already made its debut on Dec 15.\nDon't Miss 185 SHARES 460 SHARES 174 SHARES\n4. Aamir Khan Said Sorry, Katrina Kaif Is Hurt – Thugs Of Hindostan Cast Addresses Film's Failure\n“I know Aamir has spoken on the matter and it has really hurt deeply and personally. Disappointment is always good as it wakes you up little bit again. In case of 'Thugs…' it was not for lack of trying, something just went wrong in case of 'Thugs of Hindostan'. You need to have guts and urge to try things and be prepared it may or may not work,” she was quoted as saying by PTI.\n\"A film like this not only requires complete creative freedom but also the belief and support of its producer, and I got that abundantly from Sanjay Routray and Matchbox Pictures. Looking forward to more such collaborations.\"", "title": "Ranveer’s Emotional Speech For Deepika, Nawazuddin’s New Video As Bal Thackeray & More From Ent", "date_publish": "17/12/2018, 19:07:21", "description": "After acting in the role of Mumbai's most legendary crime lord, Ganesh Gaitonde in Sacred Games and also impressing us with his role as writer-poet Saadat Hasan Manto in Nandita Das’ masterpiece, Nawazuddin Siddiqui will next be seen donning another remarkable character of Shiv Sena’s founder Bal Keshav Thackeray.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-s-emotional-speech-for-deepika-nawazuddin-s-new-video-as-bal-thackeray-more-from-ent-358777.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveers_emotional_speech_for_deepika_nawazuddins_new_video_as_bal_thackeray__more_from_ent_1545046804_800x420.png"}