{"text": "Ranveer Singh Gets Emotional As He Talks About The Criticism He Receives For His Enthusiasm\nRanveer Singh Gets Emotional As He Talks About The Criticism He Receives For His Enthusiasm\nRanveer Singh isn't just an actor. He is a force. A brand in himself. He can convince you as Khilji, Simmba and now, with Gully Boy, he has just established yet another benchmark for himself as an actor. Currently, there is a lot going on for Singh as an actor.\nAgencies\nHe is busy promoting Gully Boy and also gearing up for Kabir Khan’s ’83, in which he will be seen playing Indian skipper Kapil Dev.\n(Also read: From Skirts To Street-Style, Ranveer Singh Couldn't Care Any Less About The Fashion Police!)\nAgencies\nIn a recent interview with BBC Asian Network, Ranveer Singh was asked how he maintains a healthy work-life balance. To which he said, “It’s difficult. It’s not easy.\"\nIn a first, he also addressed the criticism that comes his way for being too 'enthusiastic'. He said,\nAgencies\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n“It’s particularly difficult when you get brickbats for just giving. People saying that it’s too much, ‘Why don’t you just curb your enthusiasm.’ It hurts. But it’s okay. People have their own way of perceiving. Every person is wired differently and has their own life experiences that predispose them to perceive certain things in a certain way.”\nHowever, he admitted that there is a certain part of him that he wishes to ‘conserve.’ He adds,\nAgencies\n“But yes, there is one part of me that wants to conserve. But I am not the kind of person that can hold back. I am just a giver.”\nAlso starring Alia Bhatt, the film helmed by Zoya Akhtar has hits the screens today.\n(Also read: Ranveer Singh Recalls The Fear Of Not Making It Big In Bollywood Because Of No 'Filmy Connections')", "title": "Ranveer Singh Gets Emotional As He Talks About The Criticism He Receives For His Enthusiasm", "date_publish": "14/02/2019, 12:07:14", "description": "Ranveer Singh isn't just an actor. He is a force. A brand in himself. He can convince you as Khilji, Simmba and now, with Gully Boy, he has just established yet another benchmark for himself as an actor. Currently, there is a lot going on for Singh as an actor.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-gets-emotional-as-he-talks-about-the-criticism-he-receives-for-his-enthusiasm-362133.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1550126562_800x420.jpg"}