{"text": "Ranveer Singh Recalls The Fear Of Not Making It Big In Bollywood Because Of No 'Filmy Connections'\nRanveer Singh Recalls The Fear Of Not Making It Big In Bollywood Because Of No 'Filmy Connections'\nHe entered the world of films with Band Baaja Baraat and in less than a decade of his presence in the Hindi Film Industry, Ranveer Singh has established himself as an irreplaceable asset.\nHe made his debut in 2010 with the film Band Baaja Baaraat as a raw Delhi boy, proved his mettle in the various roles in films like Ladies vs Ricky Bahl, Lootera, Goliyon Ki Rasleela Ram-Leela, Gunday, Dil Dhadakne Do and Bajirao Mastani.\nThe actor's career graph is at an all time high. After mega-hits like Padmaavat and Simmba, his movie Gully Boy received a great response at the Berlin premiere. While he is gearing up for Kabir Khan's 83, he is also promoting Zoya Akhtar's Gully Boy.\nAgencies\nDuring the promotions of the film, he spoke to media and recalled how there was a time when he thought he would never make it big in Bollywood as he had no filmy connections.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n\"I had a struggle period, my first realisation of becoming a mainstream actor was perhaps a bit far-fetched. It was in the 10th standard. I sort of realised that my dream - after all - may not come true because most of the people around me were from a filmy lineage,\" Ranveer said.\nThe actor looked back at his struggle in his initial days in his acting career during an episode of Starry Nights 2. Oh!. The episode will air on Zee Cafe on Sunday, read a statement.\n\"I thought to settle for something which seems within my reach. So, I decided to join a university in America for further studies and I was late to register for classes due to procrastination only to find out that the acting class for non-majors had a slot empty, so I enrolled myself in,\" he added.\nHe was elated with the response to his debut film Band Baaja Baraat. He said,\n\"I was told to perform on my first day by my instructor and everybody loved the performance, and that is when I realised I am a performer.\"\n(With IANS inputs)", "title": "Ranveer Singh Recalls The Fear Of Not Making It Big In Bollywood Because Of No 'Filmy Connections'", "date_publish": "10/02/2019, 13:01:27", "description": "He entered the world of films with Band Baaja Baraat and in less than a decade of his presence in the Hindi Film Industry, Ranveer Singh has established himself as an irreplaceable asset. He made his debut in 2010 with the film Band Baaja Baaraat as a raw Delhi boy, proved his mettle in the various roles in films.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-recalls-the-fear-of-not-making-it-big-in-bollywood-because-of-no-filmy-connections-361882.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1549785070_800x420.jpg"}