{"text": "Is there anything this man can’t do? The man of all seasons Ranveer Singh is winning everyone’s hearts ever since he stepped into the world of movies.\nTwitter\nThe Gully Boy star is back again with his unique dance form on Will Smith’s Men In black, and he did so in full on Bollywood style and you just cannot let your eyes off him. He is just uber cool in the video, it’s a must watch.\nWe all are aware of how Ranveer is an ardent fan of Will, he has always expressed his admiration for the Hollywood star. And of late, he even managed to grab Will's attention with his outstanding performance in Gully Boy. The exchange of words showed their admiration for each other.\nTwitter\nDon't Miss 185 SHARES 544 SHARES 2.4 K SHARES 411 SHARES\nIf you thought this video of Ranveer is a visual treat, then hold on, you will soon see him shaking a leg with the man in question. Will, who is on a quest to fulfill his Bollywood dream is seen having a gala time with Ranveer. Have a look at it right here. The camaraderie between these two stars is definitely a visual treat.\nAlso read: Just Like The Rest Of Us, Will Smith Can't Get Enough Of Ranveer, Is All Praises For Gully Boy!\nWe won’t be surprised if Will makes a special appearance in Ranveer’s upcoming film.", "title": "Ranveer Gives 'Men In Black' A Bollywood Twist, Shows Uber Cool Moves On The Will Smith Number", "date_publish": "04/04/2019, 16:29:12", "description": "Is there anything this man can’t do? Well looks likes, NO! The man of the moment Ranveer Singh is winning anyone and everyone’s hearts right now. The hip hop star is back again with his unique dance form on Will Smith’s Men In black, he is swaying to Will Smith’s Men In Black in Bollywood style and you just cannot let your eyes off him. He is just uber cool in the video, it’s a must watch.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ranveer-gives-men-in-black-a-bollywood-twist-shows-uber-cool-moves-on-the-will-smith-number-364879.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_singh_1554373661_800x420.jpg"}