{"text": "It's safe to call Ranveer Singh as the new king of box office. The actor has been picking up interesting projects which has given him credibility of a superstar. Ranveer Singh is also one of the few actors who loves to meet and greet his fans.\nSimmba/Screengrab\nEver since his massy film Simmba released, Ranveer Singh has left no stone unturned in promoting it. He was honoured to be associated with Rohit Shetty in an action drama set up and ensured he gives his 200% in flaunting his love for the genre.\nTwitter\nThe actor has been secretly watching his latest release with the fans at some of the favourite cinema spots. The newly married star also made recordings of the crazy reactions after every punch and every song from the film.\nDon't Miss 862 SHARES\nTake a look.\nThe actor disguised himself in a hoodie and dark sunglasses. The actor reached Gaiety cinema on Week 2 and was thrilled to see the crowd cheering for some of the fun scenes.\nThis is not the first time, Ranveer crashed a movie screening. Last week of December too, Ranveer arrived in full swag and got on to the top of Gaiety theatre grooving to Aankh Maarey.\nHis connect with the audience real time is the main reason why the man is being loved by millions in the country. Ranveer Singh's next is Gully Boy which is slated to release on 14th February, 2019. He is starring alongside Alia Bhatt and the movie is directed by Zoya Akhtar.", "title": "Ranveer Singh Continues To Crash Simmba Movie Screenings In Disguise, Records Fans' Reactions", "date_publish": "10/01/2019, 14:41:05", "description": "ranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, moviesranveer singh, bollywood, fans, simmba, movies", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-continues-to-crash-simmba-movie-screenings-in-disguise-records-fans-reactions-360147.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_1547111051_800x420.jpg"}