{"text": "Ranveer Singh Wants To Keep Evolving As An Actor, Is Thankful Simmba Ended The Year On A High Note\nRanveer Singh Wants To Keep Evolving As An Actor, Is Thankful Simmba Ended The Year On A High Note\nEver since he made a debut in Bollywood, Ranveer Singh has only seen success. Except a few misses like Gunday and Befikre, the actor has his vision in place. From choosing the right script to putting his sweat and blood into the film, we have seen Ranveer Singh transforming into stunning characters.\nAnd with every passing film, Ranveer promises to keep evolving as an actor. Basking in the success of Simmba, Ranveer said,\n\"As an artiste, I have always wanted to entertain audiences, at the same time offering something new to them with every film, with a constant endeavour to push myself to evolve as an actor,\" Ranveer said in a statement.\nLast year, Ranveer garnered applause for essaying the role of villainous Delhi Sultan Alauddin Khilji in \"Padmaavat\". At the moment, his latest release has crossed the Rs 100 crore mark in 5 days and he's overwhelmed.\nScreengrab\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nRanveer's performance as the corrupt police officer Simmba, who has a moral turnaround to become the saviour of justice, has been getting positive response from critics and audiences.\nRohit Shetty's \"Simmba\", an action-comedy drama, revolves around a corrupt police officer who eventually stands up against rapist. Also starring Sara Ali Khan, the film opened on December 28 last year.\nTalking about the film, Ranveer said: \"I had never done this kind of out and out masala entertainer -- a kind of movie I had always wanted to do. I'm extremely grateful to the audience for the love they have showered on my performance and on the film. It is encouraging and truly humbling. It has been an absolutely incredible year for me, and the success of 'Simmba' makes it an ideal way to end the year -- on a huge, huge high.\"\nRanveer credits the success of \"Simmba\" to Shetty's vision.\n\"I want to thank Rohit Shetty for believing in me and making me his hero. Rohit's vision propelled by the collective effort of his entire team has been the sole reason behind 'Simmba' hitting the bullseye. It has been an absolute honour to work with him and his stellar team. Their large-hearted mentoring and exemplary work ethic has spurred a tremendous growth in me as a performer.\nThe actor will next be seen in Zoya AKhtar's Gully Boy which is slated to release on 14th February, 2018.\nInputs from IANS", "title": "Ranveer Singh Wants To Keep Evolving As An Actor, Thankful Simmba Ended The Year On A Huge High", "date_publish": "03/01/2019, 14:01:43", "description": "Ranveer's performance as the corrupt police officer Simmba, who has a moral turnaround to become the saviour of justice, has been getting positive response from critics and audiences. Rohit Shetty's \"Simmba\", an action-comedy drama, revolves around a corrupt police officer who eventually stands up against rapist. Also starring Sara Ali Khan, the film opened on December 28 last year.", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-wants-to-keep-evolving-as-an-actor-is-thankful-simmba-ended-the-year-on-a-high-note-359760.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_1546502196_800x420.jpg"}