{"text": "1. With Smile On Faces & Happiness In Their Hearts, Ranveer & Deepika Land In India As A Married Couple\nThe much-in-love couple got married in Italy and it was quite an emotional affair, as per reports. Ranveer Singh and Deepika Padukone are man and wife finally. Holding each other's hands, they have returned to Mumbai. Look how they are smiling! They are happy in love quite evidently.\n2. Actress Nafisa Ali Reveals She Has Stage 3 Cancer By Sharing A Pic With Friend Sonia Gandhi\nPost a smiling picture with her politician fiend Sonia Gandhi, Nafisa Ali made the revelation. “Just met my precious friend who wished me luck & to get well from my just diagnosed stage 3 cancer. 😍,” she wrote in the caption. \"\n3. Juhi Chawla Calls Fantastic Beasts A ‘Terrible Movie’, Thinks Jude Law Looks Like Aamir Khan\nJust watched a terrible movie, Fantastic Beasts .. Jude Law was so nice .. and something about his features ... so like Aamir Khan 🧐🧐...😀😀 @aamir_khan pic.twitter.com/8evNZKc4Ql — Juhi Chawla (@iam_juhi) November 17, 2018\nDon't Miss 862 SHARES 346 SHARES\nJuhi Chawla is apparently in London where she watched Fantastic Beasts: The Crimes of Grindelwald. Looks like she didn’t quite like the movie. Taking it to Twitter, the actress called the movie a terrible film.\n4. AbRam Is Convinced That Amitabh Bachchan Is His Grandfather, Keeps Wondering Why He Doesn't Live With Him\nSharing a picture in which AbRam with his starry-eyed is looking at him, Amitabh Bachchan revealed that he is “convinced beyond any doubt” that he is his grandfather. So much so, that he even wonders why Amitabh Bachchan doesn’t like with him.\n5. Jim Carrey Blasts Facebook CEO Mark Zuckerberg Again, Tweets ‘F**k You’ To Him In Binary Code\nHey #Zuckerborg. We know who you are. And we saw what you did: https://t.co/44UvMceSLm\nHere’s a little message from me in your native language: 01000110 01110101 01100011 01101011 00100000 01111001 01101111 01110101 00101110 00100000 00001101 00001010 pic.twitter.com/EEc6ocdvBM — Jim Carrey (@JimCarrey) November 15, 2018\nThis came after The New York Times report accused Facebook of running a lobbying campaign to promote negative stories against its rivals Apple and Google.", "title": "Ranveer-Deepika Return To Mumbai, Nafisa Ali Diagnosed With Stage 3 Cancer & More From Ent", "date_publish": "18/11/2018, 18:05:40", "description": "From newly-weds Ranveer Singh and Deepika Padukone returning to India after their wedding in Italy to Nafisa Ali posting a happy picture with Sonia Gandhi to reveal that she has Stage 3 cancer, here’s all that rocked the world of entertainment today.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-deepika-return-to-mumbai-nafisa-ali-diagnosed-with-stage-3-cancer-more-from-ent-356916.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveerdeepika_return_to_mumbai_nafisa_ali_diagnosed_with_stage_3_cancer__more_from_ent_1542544588_800x420.png"}