{"text": "A lot of us have a similar perception of marriage. For millennials like you and me, marriage is something that eventually makes the relationship monotonous and boring. Well, this definitely is not true in case of Ranveer Singh and Deepika Padukone.\nAgencies\nThe two superstars solemnized their six-year-long relationship by tying the knot at Villa Del Balbianello at Lake Como in Italy.\nAgencies\nIt's been a month since their wedding and looks like both DP and Ranveer are loving their new phase of life.\nAgencies\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nAt a recent event in Mumbai, when Singh was asked about marrying Padukone, he had a wide grin on his face. He went on to describe how 'magical' it is to marry the person you love. While this might just make you feel a little more #ForeverAlone, it might also give you a completely new perspective on marriage.\nRanveer said,\nAgencies\n“I feel like I am flying, Marriage is like the best thing that’s ever happened to me. Wow, I feel some kind of magic, some kind of power, I feel invincible, you know in superhero movies, that moment when the suit comes on, I feel like marriage has done that to me. I feel like I’ve grown up now, finally, I am a man. I feel grounded, I feel secure. I’m really loving it, it’s been only 10 or 15 days, it’s so nice, it’s so lovely. I would highly recommend it.”\nThat's not all. In his latest interview with Filmfare magazine, Singh opened up about his relationship with Deepika and confessed that he was ready for marriage three years ago but he was waiting for her to be ready and give a final nod.\nAgencies\nThese two are goals and not just #CoupleGoals but also redefining #MarriageGoals. Watch the video as Ranveer goes gaga while talking about making the best decision of life-marrying lady of his dreams-Deepika Padukone.\n“Marriage is like the best thing ever happen to me, Wow I feel like some kind of magic & power I feel like superhero, u know that moment when the suit comes on I feel like Marriage done that to I feel like I am grown up finally I am a man I feel grounded & secure“ - Ranveer Singh pic.twitter.com/cpu6k9Q83j — RanveerSingh TBT💗 (@RanveerSinghtbt) December 13, 2018\nWell, he is definitely a gentleman and knows how to keep his lady love happy.", "title": "Ranveer Singh 'Highly Recommends' Marriage To Everyone, Says It Has Changed His Life Forever!", "date_publish": "14/12/2018, 11:03:32", "description": "A lot of us have a similar perception of marriage. For millennials like you and me, marriage is something that eventually makes the relationship monotonous and boring. Well, this is definitely is not true in case of Ranveer Singh and Deepika Padukone.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-highly-recommends-marriage-to-everyone-says-it-has-changed-his-life-forever-358547.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_singh_1544766371_800x420.jpg"}