{"text": "Twitter\n‘ I am very cognisant that there is this school of thought that one should not mix art and sport with it, they are two different realms. But at the same time, us as artists and sportsmen, we are not sacrificing the same way that some of our compatriots are. Art and sports are different realms. The boundaries should be different.\nTwitter\nOur Bollywood celebrities too welcomed the pilot with their generous words and emotions. While Deepika Padukone and Katrina Kaif welcomed him with the National Flag, others couldn't help but express how proud they are of him.\nTwitter\nDon't Miss 161 SHARES 842 SHARES\nIt’s difficult to digest the fact that Game Of Thrones is coming to an end, right? Just imagine, in less than two months, you will be watching the ending of your favourite TV show. Sitting on the edge of your seat, tears will roll down your eyes. It will leave a void in your heart.\nTwitter\nTiger Shroff and Disha Patani are the hottest and fittest couple in tinsel town. The couple leaves their fans in awe whenever they step out together. In fact, their last movie together Baaghi 2 was a massive hit, all thanks to their magical chemistry.\n@Trevornoah @ComedyCentral a not racist & cruel version of this joke (IF Ur Writers was diverse)- India & Pak thankfully walking back from brink of war. Meanwhile, Bollywood looking to see how many dance numbers they can fit in2 movie version of this episode! Thanks @vedashastri pic.twitter.com/cjG3CBAVrd — Swara Bhasker (@ReallySwara) March 1, 2019\nTrevor joked about how Indian military must be fighting with Pakistan in Bollywood style and even sang a few Hindi songs. Swara called his joke cruel and racist and blasted him.", "title": "Ranveer’s Take On Pak Actors' Ban, Swara Slams Trevor For Insensitive Jokes & More From Ent", "date_publish": "02/03/2019, 18:35:32", "description": "1.Ranveer Singh Will Follow The Pakistani Actors' Ban, Says If One Soldier's Mother Supports It, We Should Too ‘ I am very cognisant that there is this school of thought that one should not mix art and sport with it, they are two different realms. But at the same time, us as artists and sportsmen, we are not sacrificing the same way that some of our compatriots are. Art and sports are different", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ranveer-s-take-on-pak-actors-ban-swara-slams-trevor-for-insensitive-jokes-more-from-ent-363057.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranveer_singh_1551531397_800x420.jpg"}