{"text": "When these two are together, they need no one else. Ranveer Singh and Deepika Padukone are not just life partners and each other's best friend but the level of respect and admiration they have for each other is what makes their relationship just perfect.\nAgencies\nAfter dating for over six years, the couple tied the knot at Lake Como in Italy. After their five-day celebrations in Italy, they returned to India and hosted three wedding receptions for their friends, family and the media.\n(Also read: Bhabhi Mat Bulao Na', Deepika Padukone Blushes As She Requests Paparazzi To Not Call Her That! )\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nAgencies\nThe couple is back to the normal grind and has resumed their work-commitments. While Ranveer is promoting Simmba, Deepika is fulfilling her endorsements and other professional commitments.\nAgencies\nOne thing that has been consistent in all the promotional appearances that Ranveer has done is- He could not stop himself from talking about his 'Dharampatni Deepika'. Ranveer was promoting his film on a reality show when he divulged into the details of preparations for his wedding receptions.\nHe shared a very interesting detail about the food menu and how the couple juggled between hogging and hitting the gym. He said,\n\"My dharampatni (Deepika Padukone), her planning is too detailed. We did some 22 tastings and kept eating and hitting the gym for various receptions.\"\nJust a few days ago, in an interview with Filmfare, Ranveer had spoken about his grand Italy wedding and how it was Deepika's call to choose the location. He had said,\nAgencies\n\"Whatever she wished, I wanted her to have it. That’s the first step in being the husband of the millennium. Whatever her vision of getting married, I wanted her to realise it. Whatever she wanted, it was done exactly in that manner. She deserves every bit of it. I too deserve happiness and my happiness comes from her happiness. It’s that simple.\"\nRanveer surely knows how to keep his lady-love happy!", "title": "Ranveer Praises 'Dharampatni' Deepika, Says They Did 22 Tastings For The Wedding Receptions", "date_publish": "12/12/2018, 11:40:11", "description": "When they two are together, they need no one else. Ranveer Singh and Deepika Padukone are not just life partners and each other's best friend but the level of respect and admiration they have for each other is what makes their relationship just about perfect.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-praises-dharampatni-deepika-says-they-did-22-tastings-for-the-wedding-receptions-358398.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_and_deepika_1544594502_800x420.jpg"}