{"text": "Ranveer Has ‘Deepika’ Written On His Mehendi, Saif-Sara Made Koffee With Karan A Fun Watch & More From Ent\nRanveer Has ‘Deepika’ Written On His Mehendi, Saif-Sara Made Koffee With Karan A Fun Watch & More From Ent\n1. As If We Didn't Have Enough Reasons Already, Ranveer Makes Us Swoon With His 'Deepika' Mehendi\nOf course, she’ll light up his life forever! Ranveer Singh and Deepika Padukone, congratulations. Lots of love to you both!\nSaif Ali Khan and Sara Ali Khan bared their heart out on their “quintessential modern beautiful family”, as Karan said on the show. From revealing about the friendly relationship she shares with her “father’s wife” Kareena Kapoor to talking about the bond she shares with her mother and father, despite their separation, Sara Ali Khan made quite some revelations on the show.\n3. Shah Rukh Khan Requests Amitabh Bachchan To Visit AbRam On Saturdays Because He Thinks He’s His Grandfather\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES\nShah Rukh Khan’s little one – AbRam – is so innocent that he thinks Amitabh Bachchan is his grandfather. So much so, that he often wonders why Big B doesn’t stay with him at his place.\n4. Alia Bhatt Is Excited For Priyanka Chopra-Nick Jonas’ Marriage, Can’t Wait To See Her In The Wedding Attire\n“I am very happy and excited about the wedding. I am also very eager to see Priyanka in her wedding attire,” she was quoted as saying by ANI.\n5. After Dhadak, Karan Johar Ropes In Janhvi Kapoor To Play The Role Of IAF Pilot Gunjan Saxena In His Next\nAccording to a source cited by Bollywood Hungama, “Karan Johar thinks Janhvi has the right posture and attitude to play Gunjan Saxena. No, Janhvi won’t actually fly a helicopter in the film. But she is going to learn how the helicopter works”.", "title": "Ranveer's Mehendi Has Deepika’s Name, Saif-Sara's Fun Koffee With Karan Episode & More From Ent", "date_publish": "19/11/2018, 18:17:46", "description": "From Ranveer Singh and Deepika Padukone making headlines days after their wedding in Italy, especially because of Ranveer’s Mehendi that had Deepika written on it, to Saif Ali Khan and Sara Ali Khan’s fun banter on Karan Johar’s chat show Koffee With Karan, here is all that rocked the world of entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-s-mehendi-has-deepika-s-name-saif-sara-s-fun-koffee-with-karan-episode-more-from-ent-356969.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_had_deepika_written_on_his_mehendi_saifsara_made_kwk_a_fun_watch__more_from_ent_1542627913_800x420.png"}