{"text": "Ranveer Singh Does It Again, Raps 'Apna Time Aayega' At The LFW 2019 Ramp With His Team!\nRanveer Singh Does It Again, Raps 'Apna Time Aayega' At The LFW 2019 Ramp With His Team!\nNo one does promotions better than Ranveer Singh and for Gully Boy, his enthusiasm remains absolutely unmatched.\nLiving up to the expectations of his fans, Ranveer Singh brought to the closing day of a fashion extravaganza here by amalgamating his reel avatar as a rapper from his forthcoming film \"Gully Boy\" with his real exuberant self.\nAgencies\nRanveer rapped live while walking the ramp with his \"Gully Boys\" gang to showcase a unique fashion line, GullyGen. Ranveer was present with his team and rapper Naezy and other artistes, sang \"Asli hip hop\" and \"Apna time aayega\" from the yet to release film.\nAgencies\nThe audience obviously was excited and enthralled to watch Ranveer rap live. Talking to a news agency, Singh said,\nAgencies\n\"Our film is closely connected to the music and the music was the heart of our show. There were unique performances, a live music show... The entire gang has authentic rappers and they contributed to the film, dialogues and music of the film. It was a unique show and a unique experience for me.\"\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nApart from Singh was in full form , he once again jumped into the crowd, attempting a crowdsurfing of sorts, much to the delight of his fans.\nWatch Ranveer Singh in full form in these pictures and videos.\nAgencies\nRanveer was also accompanied by \"Gully Boy\" director Zoya Akhtar and producer Ritesh Sidhwani. Helmed by Zoya Akhtar, Gully Boy is all set to release on February 14.\n(With agency inputs)", "title": "Ranveer Singh Does It Again, Raps 'Apna Time Aayega' At The LFW 2019 Ramp With His Team!", "date_publish": "04/02/2019, 10:53:09", "description": "Apart from Singh was in full form , he once again jumped into the crowd, attempting a crowdsurfing of sorts, much to the delight of his fans. Watch Ranveer Singh in full form in these pictures and videos. Ranveer was also accompanied by \"Gully Boy\" director Zoya Akhtar and producer Ritesh Sidhwani. Helmed by Zoya Akhtar, Gully Boy is all set to release on February 14.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-does-it-again-raps-apna-time-aayega-at-the-lfw-2019-ramp-with-his-team-361532.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_1549258166_800x420.jpg"}