{"text": "Deepika Padukone is one lucky girl! After all, she is married to the man of every woman’s dream – Ranveer Singh. After a heartbreak that turned into depression, she has finally found the love of her life. By just seeing the way Ranveer Singh looks at Deepika Padukone, we want to give him the title of the best husband!\nRanveer Singh is the most sought after and bankable actors in the industry. From playing a serious role like Khilji to going all mad in Simmba, he has proved his mettle as an actor. In his next, Gully Boy, he is playing an underground rapper, and fans are already showering praises upon him. Is there something he can’t do? We doubt!\nPTI\nBut did you know that rumours are afloat that Ranveer Singh’s father paid Rs 10 lakh to Aditya Chopra for his debut? Rubbishing the rumours and revealing how deeply that hurt him, here’s what Ranveer Singh said on Famously Filmfare.\n“There were rumours that my father gave Rs 10 lakh to Aditya Chopra, to get me launched. That really hurt me, it brought my whole upbringing into question. How can you write something so false that I had never said? I had genuinely struggled and proud of what I achieved. Young actors will message me and ask, ‘Yo bro, I can cough up the money, tell me what I have to do.’ And I have to say that these rumours are not true, stop believing that!”\nTwitter\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nAnother revelation that Ranveer Singh made on the show was that he has been offered Hollywood projects several times, but because of prior commitment, he couldn’t accept them.\nAlso Read: Ranveer Singh Jokes About Taking His Wife Deepika Padukone’s Last Name, Calls It A 'Legendary Surname'", "title": "Ranveer Singh Reacts To Rumours Of His Father Paying Rs 10 Lakh For His Debut, Says He’s Deeply Hurt", "date_publish": "16/01/2019, 17:35:33", "description": "But did you know that rumours are afloat that Ranveer Singh’s father paid Rs 10 lakh to Aditya Chopra for his debut? Rubbishing the rumours and revealing how deeply that hurt him, here’s what Ranveer Singh said on Famously Filmfare. Another revelation that Ranveer Singh made on the show was that he has been offered Hollywood projects several times, but because of prior commitment, he couldn’t acce", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-reacts-to-rumours-of-his-father-paying-rs-10-lakh-for-his-debut-says-he-s-deeply-hurt-360534.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_reacts_to_rumours_of_his_father_paying_rs_10_lakh_for_his_debut_says_hes_deeply_hurt_1547642601_800x420.jpg"}