{"text": "Ranveer-Deepika's Wedding Date Is Out & The Couple Will Make An Official Announcement Soon\nRanveer-Deepika's Wedding Date Is Out & The Couple Will Make An Official Announcement Soon\nBefore this year ends, we will witness two of India's most grand weddings. Apart from PC and Nick, Deepika-Ranveer too are all set to tie the knot.\nFresh reports hint that Deepika Padukone and Ranveer Singh want to end all speculations around their 'rumored' wedding. The couple will issue a joint statement, revealing their wedding dates.\nViral Bhayani\nAccording to a DNA report, Ranveer and Deepika's wedding ceremonies will take place between November 12 to 16 and they will exchange vows on November 13.\nPinterest\nThe details around the destination of the wedding are being kept under wraps but Lake Como in Italy remains one of the rumored destinations of their wedding.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAgencies\nCurrently, Deepika-Ranveer are busy wrapping their professional commitments before they get busy with their wedding preps. A source close to the couple informed us that both Ranveer and Deepika have informed their staff and team to be available in November for the wedding.\nWe hope DP-Ranveer officially seal the deal and end all speculations so that fans can start celebrating!", "title": "Ranveer-Deepika's Wedding Date Is Out & The Couple Will Make An Official Announcement Soon", "date_publish": "17/10/2018, 13:58:50", "description": "Before this year ends, we all will witness two of India's most grand weddings. Apart from PC and Nick, DP-Ranveer too are all set set to tie the knot. Fresh reports hint that Deepika Padukone and Ranveer Singh want to end all speculations around their 'rumored' wedding. The couple will be passing out a joint statement, revealing their wedding dates.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-deepika-s-wedding-date-is-out-the-couple-will-make-an-official-announcement-soon-354940.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/ranveer_and_deepika_1539760775_800x420.jpg"}