{"text": "Ranveer Shows What 'Asli' Hip-Hop Is In Gully Boy Teaser & Fans Are Already Bobbing Their Heads\nRanveer Shows What 'Asli' Hip-Hop Is In Gully Boy Teaser & Fans Are Already Bobbing Their Heads\nIs there something that Ranveer Singh can’t do? – that’s one question that fans have been asking since the time the first teaser of Gully Boy is out. In this upcoming film he is playing a street rapper!\nBe it doing a tough role of Alauddin Khalji or a masala entertainer like Simmba, Ranveer Singh can easily get into the shoes of any character, don’t you agree?\nIn this Zoya Akhtar film which also stars Alia Bhatt alongside him, he is playing the role of a rapper. And just like you may have expected, he will be seen rapping in his own voice.\nGiving us a sneak peek of that, before the trailer is released, the makers have unveiled a teaser in which Ranveer Singh introduces fans to Asli Hip Hop rap. He stuns his fans further as he romances Alia Bhatt and Kalki Koechlin.\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES\nScreengrab\nWithout further ado, watch the teaser below.\nAnd fans are left enthralled.\nThis one is insane Guruji!!! Fire on fire ! Singh is King :) — Lada Guruden Singh (@ladasingh) January 4, 2019\nWooaaaah!! Its a masterpiece @RanveerOfficial I can't believe that you have sung it!!!\nSachmein#AsliHipHop se mila diya hindostan ko👌👌👌 — 💗Armaan's Choco girl💗 (@kessiechauhan22) January 4, 2019\nI am so DEAD !!.... 🤪🤪🤪😇😇😇... AAaAaaaaaaa...#Merawala CHAMP !!... Rappingggg bhiii aur Acting Bhiii !!! — Atikin_Hgnis (@Atikin_Hgnis) January 4, 2019\nBrilliant is the word for this one baba 😍😍😍😍😍😍😍😍😍😍 — Nitya lamba (@Nityalamba44) January 4, 2019\nI’m actually living for the vibe of this movie. Can’t wait to see more 😭😍 — Aashna ♡ (@_aashnaa__) January 4, 2019\nRanveer i cannot even articulate my feelings or reaction RN 😭🔥😭🔥🔥🔥 #GullyBoyTeaser is everything and more than I imagined — Kalai💕|芸術| シ GULLY BOY FEB14 (@mynameisKalai) January 4, 2019\nApna Din aayega nhi bhauu tumhara din aa gaya 🔥🔥🔥🔥\nAaj dekho asli hip hop india ko tum ❤️💯🎤 @RanveerOfficial\nThis teaser increased my excitement for the movie baba😘😘😘 — Bhavika❤ #Simmba 🦁👮🏻‍♂️💪🏽🔥 (@RanveerianBhavo) January 4, 2019\nAwesome Ranveer KING , amazing is the word. You rule this trailer , lovely to see Kalki Back . 2 great actors together 👍 — Beena (@Bina94475085) January 4, 2019\nOMG!!!!!!! This is damn cool.....Can't wait. Bring it on 🙌👍✊❤ — Suzar (@Shreeyajoshi8) January 4, 2019\nSo, is there something that Ranveer Singh can’t do? We’re still trying to figure out! Meanwhile, if you're excited for this one, Gully Boy is hitting the screens on Feb 14. Mark the date!", "title": "Ranveer Shows What 'Asli' Hip-Hop Is In Gully Boy Teaser & Fans Are Already Bobbing Their Heads", "date_publish": "04/01/2019, 13:35:06", "description": "Is there something that Ranveer Singh can’t do? – that’s one question that fans have been asking since the time the first teaser of Gully Boy, his upcoming film in which he is playing a street rapper, is out. And rightly so! In his next, a Zoya Akhtar film, which stars Alia Bhatt alongside him, he is playing the role of a rapper. And just like you may have expected, he will be seen rapping in his", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-shows-what-asli-hip-hop-is-in-gully-boy-teaser-fans-are-already-bobbing-their-heads-359832.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singhs_stunning_rap_in_the_first_teaser_of_gully_boy_has_left_fans_enthralled_and_wanting_f_1546588467_800x420.png"}