{"text": "1. Whacky Outfits To Mushy Speech, Deepika Padukone-Ranveer Singh Gave Marital Bliss A Whole New Definition Last Night!\n“Ladies and gentlemen, I married the most beautiful girl in the world!” – that’s what Ranveer Singh said as he introduced the love of his life Deepika Padukone, amid cheers and claps.\n2. Mary Kom’s 6th World Title Win Leaves Everyone Beaming With Pride Including B-Town Celebs\nShe sat on the ringside steps, huddled with her coaches and shed down tears of joy. The crowd cheered louder and more tears flowed out of champion’s eyes. That’s how Mary Kom celebrated her historic victory at the World Championships yesterday.\n3. Guru Randhawa Goes International With Mr Worldwide, Collaborates With Pitbull For A New Single\nMy first international collaboration with Mr.Worldwide sir @pitbull will be out in 2019.@itsBhushanKumar sir and our team @TSeries are proud to do this great collaboration and we thank @pitbull sir and his whole team for making this happen.\n🙏🙏😊😊\nGod is kind ❤️ pic.twitter.com/Zej7ovyhW7 — Guru Randhawa (@GuruOfficial) November 23, 2018\nAnd now he is all set to win hearts abroad. So, after Priyanka Chopra’s Exotic, Guru Randhawa is collaborating with American Rapper Pitbull for his song Slowly Slowly and fans are hailing ‘Let it rain over me’.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n4. After Partying Together, Priyanka Chopra & Nick Jonas Arrive In Mumbai Ahead Of Their Grand Wedding\nPriyanka Chopra and Nick Jonas are getting married in Jodhpur on Dec 2 and Dec 3, in Hindu and Christian ceremonies, reportedly. The groom has already arrived in India and he is having a gala time.\n“I don’t know if my character will be a main one in the next season. I got a call last night that I have to meet Varun Grover (the writer), so the team is trying to get our busy schedules matched. We may be in the clear about the role by next week, hopefully.”", "title": "Videos From Ranveer-Deepika’s Mumbai Party, Bollywood Applauds Mary Kom & More From Ent", "date_publish": "25/11/2018, 18:31:38", "description": "From video and pictures leaking from Ranveer Singh and Deepika Padukone’s Mumbai party which was thrown by Ranveer’s sister Ritika Bhavnani, to Bollywood celebrities applauding Mary Kom for her historic win at World Championships, here is all that rocked the world of entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-deepika-s-fun-wedding-bash-bollywood-applauds-mary-kom-s-epic-win-more-from-ent-357370.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/videos_from_ranveerdeepikas_mumbai_party_bollywood_applauds_mary_kom__more_from_ent_1543150934_800x420.png"}