{"text": "Raveena Tandon Is Furious Over The Death Of Two Tiger Cubs In Maharashtra, Says It Could Have Been Prevented\nRaveena Tandon Is Furious Over The Death Of Two Tiger Cubs In Maharashtra, Says It Could Have Been Prevented\nNot long ago, Avni, a tigress and a mother of two, was given a death sentence even when the charges of being a man-eater weren’t proven conclusively. Yesterday, two tiger cubs died after being run over by a train in Chandrapur, Maharashtra. The cubs were reportedly just six months old. And so the number of tigers continues to dwindle and disappointment continues to prevail across the nation.\nMaharashtra: Two tiger cubs killed by train near Lohara forest area in Chandrapur pic.twitter.com/zs76VSvfR2 — ANI (@ANI) November 15, 2018\nAmong other people who were left angered, Bollywood actress Raveena Tandon also expressed her anger on Twitter. The actress, who is the brand ambassador of Sanjay Gandhi National Park and has been working with the Maharashtra government in conserving a sustainable habitat for wildlife in the state, angrily tweeted on how the government wants to build more highways and give away forest land.\nFurthermore, in a series of tweets, she also wrote that if this continues to happen, more such disasters will happen.\nCould’ve been prevented if these ways are built but fenced off and underpasses are built for wildlife to move from forest to forest. Metro shed in Aarey forest will show us more such disasters . @saveaarey https://t.co/7o78D1IZlO — Raveena Tandon (@TandonRaveena) November 15, 2018\nYes these are underpasses . Simple but effective , elevated highways like the metro elevation corridors through forests can also help . https://t.co/O8Z0mHDPJZ — Raveena Tandon (@TandonRaveena) November 15, 2018\nDon't Miss 2.1 K SHARES 764 SHARES 468 SHARES 2.1 K SHARES 370 SHARES\nWish this was implemented with each highway development plan. Doesn’t hamper development and progress and our wildlife also taken care care off. @CMOMaharashtra @Dev_Fadnavis @wti_org_india @SMungantiwar @anishandheria https://t.co/mTsSzJuGL4 — Raveena Tandon (@TandonRaveena) November 15, 2018\n“Wildlife is my passion and capturing moments on camera is sheer thrill. The excitement and love for the forest and to conserve what we have on our beautiful planet with it's beautiful creatures, which man is slowly destroying,” Raveena had earlier told IANS in a statement.", "title": "Raveena Tandon Is Furious Over The Death Of Two Tiger Cubs In Maharashtra, Says It Could Have Been Prevented", "date_publish": "15/11/2018, 18:25:52", "description": "Among other people who were left angered, Bollywood actress Raveena Tandon also fumed on Twitter. The actress, who is the brand ambassador of Sanjay Gandhi National Park and has been working with the Maharashtra government in conserving a sustainable habitat for wildlife in the state, angrily tweeted on how the government want to build more highways and give away forest land.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveena-tandon-is-furious-over-the-death-of-two-tiger-cubs-in-maharashtra-says-it-could-have-been-prevented-356762.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveena_tandon_is_angry_on_2_tiger_cubs_death_in_maharashtra_says_couldve_been_prevented_1542285622_800x420.png"}