{"text": "Ranveer Singh Rapping On ‘Apna Time Aayega’ At A Shaadi In Delhi Proves He Is ‘Bohot Hard’\nRanveer Singh Rapping On ‘Apna Time Aayega’ At A Shaadi In Delhi Proves He Is ‘Bohot Hard’\nAfter Gully Boy, it is a proven fact that Ranveer Singh “jaisa koi hard-ich nahi hai”. Don’t you agree? The man is on a roll. Is there something that he can’t do? From acing a role like Alauddin Khilji in Padmaavat to showcasing his rapping skills in Apna Time Aayega, Ranveer Singh is flawless in every role.\nAfter displaying his rapping skills at promotional events of Gully Boy, Ranveer Singh is not yet done. He is still in the Gully Boy mode, and we have proof.\nthelocal.de\nRecently, the man who is known for his quirky avatar and crazy infectious energy, was spotted at a wedding in Delhi. Donning a kurta and a pyjama, Ranveer Singh performed Apna Time Ayega with all his energy.\n#apnaTimeAyega 🎧🕺🏻\n-\n🎥| Ranveer Singh at a wedding in Delhi , tonight💖 pic.twitter.com/0c5LZJqUTx — RanveerSingh TBT💗 (@RanveerSinghtbt) February 23, 2019\n🎥| Ranveer Singh at a wedding in Delhi , tonight💖 #meregullymein 🎧\n-\nHAWT🤤 pic.twitter.com/0VRoHUO9Ft — RanveerSingh TBT💗 (@RanveerSinghtbt) February 23, 2019\nMakeup artist Elton Fernandez also shared a few pictures on the Instagram. “I’m not usually shy around moviestars, but this is one incredible actor whose performances constantly awe and inspire. So happy to meet @ranveersingh tonite in Delhi... I’m shy and blushing,” he wrote.\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES 185 SHARES\nMeanwhile, Gully Boy is doing a great business at the box office. The movie has already minted Rs 104 crore at the domestic box office. Did you like the Zoya Akhtar directorial? Let us know in the comments section below.", "title": "Ranveer Singh Rapping On ‘Apna Time Aayega’ At A Shaadi In Delhi Proves He Is ‘Bohot Hard’", "date_publish": "24/02/2019, 11:22:07", "description": "Recently, Ranveer Singh who is known for his quirky avatar and crazy infectious energy, was spotted at a wedding in Delhi. Donning a kurta and a pyjama, Ranveer Singh performed Apna Time Ayega with all his energy. Makeup artist Elton Fernandez also shared a few pictures on the Instagram. “I’m not usually shy around moviestars, but this is one incredible actor whose performances constantly awe and", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-rapping-on-apna-time-aayega-at-a-shaadi-in-delhi-proves-he-is-bohot-hard-362678.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_rapping_on_apna_time_aayega_at_a_shaadi_in_delhi_proves_he_is_bohot_hard_1550987601_800x420.png"}