{"text": "1. Priyanka Chopra-Nick Jonas’ Wedding Pic Gets Caricatured As Simpsons' Characters & Fans Are Loving It\nAmid this, Priyanka Chopra recently shared her wedding pictures caricatured as Simpsons' characters, and fans are loving them.\n2. From Dancing To Serenading Her With ‘Main Tera Hero’, Ranveer Has Eyes Only For Wifey Deepika!\nThe two, once again, stole all the limelight. They hugged, sang and danced together and their fans couldn’t help but gush over their PDA.\n3. First Films To Enter 100-200 Crore Club, Ghajini & 3 Idiots Clocks 10 & 9 Years Respectively\nAamir Khan’s Thugs of Hindostan might have miserably failed at the box office this year, but how can we forget the fact that Aamir Khan is the first member of the 100 crore club (Ghajini), 200 hundred crore film (3 Idiots) and also the 300 crore club (PK) at the domestic box office.\n4. Ranveer Singh To Play Dara Shikoh, Vicky Kaushal Will Portray Aurangzeb In Karan Johar’s Takht\nIt’s going to be a period drama. While earlier it was revealed that Anil Kapoor will essay the role of Shah Jahan in the multi-starrer Dharma Productions film, now it has been revealed that Ranveer Singh will play the role of Dara Shikoh and Vicky Kaushal will portray Aurangzeb in Takht, in a recent appearance on journalist Rajeev Masand’s annual actors’ roundtable.\n5. Kevin Spacey Charged With Sexual Assault, Posts A Cryptic Video Statement As Frank Underwood\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 185 SHARES 460 SHARES\nIn the three-minute-long video, titled 'Let Me Be Frank', the 59-year-old appears to be portraying his 'House of Cards' character, Frank Underwood. Spacey acknowledges the charges which have been made against him and suggests he will overcome them and revive his career.", "title": "Ranveer-Deepika’s PDA, Priyanka-Nick Jonas Enter Simpsons Universe & More From Ent", "date_publish": "25/12/2018, 17:50:51", "description": "Christmas has arrived and New Year is around the corner, but for Bollywood celebs, the wedding season isn’t over yet. After Deepika-Ranveer and Priyanka-Nick, it was Kapil Sharma and Ginni Chatrath’s wedding reception yesterday, which sought the presence of many stars including Anil Kapoor, Honey Singh and Mika Singh.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-deepika-s-pda-priyanka-nick-jonas-enter-simpsons-universe-more-from-ent-359260.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveerdeepikas_pda_priyankanick_jonas_enter_simpsons_universe__more_from_ent_1545738751_800x420.png"}