{"text": "1. Ranveer-Deepika’s PDA To Ranbir-Alia’s Gully Boy Date, Love Is In The Air On Valentine's Day\nLast night, apart from the Valentine fever, the Gully Boy fever was also high among the stars. While Ranveer Singh organised a special screening of Gully Boy for wife Deepika Padukone and her family, Alia Bhatt was also seen attending special screening of Gully Boy with beau Ranbir Kapoor.\n2. People Have Found Peter Dinklage AKA Tyrion Lannister’s Look Alike In Pakistan & The Resemblance Is Striking\nRemember Imtiaz Ali had found Peter Dinklage’s look-alike in Kashmir? Now, another one has been spotted in Peshawar, Pakistan.\n3. After Battling A Rare Tumour, 'Hindi Medium' Actor Irrfan Khan Finally Returns To Mumbai\nBut now as per a close source in a leading daily, the Hindi Medium actor is back in town. While some are saying he's getting treated at a hospital in Mumbai, some are thinking Irrfan is returning back to movies and starting with the shooting of Hindi Medium's sequel.\nDon't Miss 185 SHARES 763 SHARES 460 SHARES\n4. Happy Birthday, Madhubala! Internet Showers Love For The Finest Actress Of Indian Cinema\nSo, on the auspicious occasion of her 86th birthday anniversary, Google India made the day extra special by making the most beautiful Doodle on her. Bollywood celebrity Madhuri Dixit recreated her performances and posted a stunning picture looking like the diva.\nAnd now Muzaffarpur police has lodged an FIR against actors Anupam Kher, Akshaye Khanna and 12 others in connection with the movie ‘The Accidental Prime Minister’. As per reports in PTI, the FIR was lodged at the Kanti police station on Tuesday after the court took objection to non-compliance of its January 8 order in this regard.", "title": "Ranveer-Deepika’s PDA, Peter Dinklage’s Look-Alike Spotted In Pakistan & More From Ent", "date_publish": "14/02/2019, 18:27:58", "description": "From Ranveer Singh and Deepika Padukone’s PDA at Gully Boy premiere to Game Of Thrones star Peter Dinklage AKA Tyrion Lannister’a look-alike being spotted in Peshawar (Pakistan), here is all that rocked the world of Bollywood and entertainment today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-deepika-s-pda-peter-dinklage-s-look-alike-spotted-in-pakistan-more-from-ent-362191.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveerdeepikas_pda_peter_dinklages_lookalike_spotted_in_pakistan__more_from_ent_1550148687_800x420.png"}