{"text": "It is safe to call Ranveer Singh the most energetic person in Bollywood. From giving his 100% to the movies or his relationship, Ranveer has established a different kind of relationship with his fans. It's the one where people love him on-screen and off-screen in equal measure.\nTwitter\nDespite playing a negative character in Padmaavat as Khilji, Ranveer ended up winning hearts of the audience. Knowing the female attention, the actor gets, he has still been vocal about his feelings for Deepika Padukone from day 1.\nWhether award shows or press screenings, Ranveer Singh was always seen as a doting boyfriend which every girl craves for. Ranveer Singh instantly became the man of our dreams, who was crowned as the boyfriend of the year by social media. Yes, he loves commenting on her snaps. From giving her kisses to calling her his infinite sky, Ranveer leaves no stone unturned in making his woman special.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nSoon enough, the actor tied the knot with Deepika Padukone. And the love on social media, on shutterbugs still continues. Recently, Ranveer Singh made a special New Year resolution.\nTaking to Instagram, the actor wrote, \"New year resolution, loads of snuggling\"\nGear up, single people or even committed ones, Ranveer Singh is all set to create new benchmarks in Love-o-logy!!", "title": "Ranveer Singh's New Year Resolution Involves 'Loads Of Snuggling' With Wifey Deepika Padukone", "date_publish": "03/01/2019, 12:35:14", "description": "It is safe to call Ranveer Singh the most energetic person in Bollywood. From giving his 100% in his movies or his relationship, Ranveer has established a different kind of relationship with his fans. It's the one where people love him on-screen and off-screen in equal measure.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-s-new-year-resolution-involves-loads-of-snuggling-with-wifey-deepika-padukone-359746.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_1546495864_800x420.jpg"}