{"text": "Ranveer Singh Raps His Way Into Your Heart: Gully Boy's First Song 'Apna Time Aayega' Is Out!\nRanveer Singh Raps His Way Into Your Heart: Gully Boy's First Song 'Apna Time Aayega' Is Out!\nAfter a smashing trailer of Gully Boy, fans have a new anthem to obsess over. The first rap song from the film Apna Time Aayega was unveiled today and it already looks like a hit!\nThe video of the song Apna Time Aayega reveals the story and struggles of Ranveer Singh and Alia Bhatt's character in the film.\nExcel Entertainment\nThe song has been written by rapper Divine and Ankur Tewari and it surely has the potential to be India's new anthem!\n(Also read: 9 Reasons Why We Are Eagerly Waiting For The Release Of Ranveer Singh - Alia Bhatt's Gully Boy)\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nThe lyrics of the song are both poignant and hard-hitting. One of the lines from the song reads: “Ye shabdon ka jwala meri bediyaan pighlayega, jitna tune boya hai tu utna hi to khayega” (This torrent of words will drown my shackles, your return depends on how much you are willing to give away of yourself).\nRanveer and Alia Bhatt took to their social media handles to share the song.\n(also read: This Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together)", "title": "Ranveer Singh Raps His Way Into Your Heart: Gully Boy's First Song 'Apna Time Aayega' Is Out!", "date_publish": "14/01/2019, 18:22:39", "description": "After a smashing trailer of Gully Boy, fans have a new anthem to obsess over. The first rap song from the film Apna Time Aayega was unveiled today and it already looks like a hit! The video of the song Apna Time Aayega reveals the story and struggles of Ranveer Singh and Alia Bhatt's character in the film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-raps-his-way-into-your-heart-gully-boy-s-first-song-apna-time-aayega-is-out-360409.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/gully_boy_rap_1547470545_800x420.jpg"}