{"text": "Ranveer-Deepika look happy and content in these pictures. If you're single, we advise you to sulk a little less because these photographs define perfection in every sense of the word.\nToday, the couple took to Instagram to share some more inside pictures from the wedding and made our social media feeds look like a place where only love and happiness exists.\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nNot that we haven't seen them together before but the 'after-wedding' glow and happiness of starting their journey together is well evident. The couple has started making their public appearance in India after returning from Italy and people can't help but gush and adore all these pictures.\n\"I personally believe that there is no point making documentary films on social issues. I am sorry to say that but I have seen it often that nobody reacts to documentary films in villages,\" Akshay said while speaking at the panel discussion titled as 'Universal access to sanitation'.\nPreity Zinta's comments didn't go down too well with people. Slamming her for mocking the movement and putting across 'regressive' views, here is what Netizens had to say.", "title": "Ranveer-Deepika Spam Our Social Media Feeds With Their Wedding Pics And More From Ent World", "date_publish": "20/11/2018, 17:53:24", "description": "Ranveer-Deepika look happy and content in these pictures. If you're single, we advise you to sulk a little less because these photographs define perfection in every sense of the word. Today, the couple took to Instagram to share some more inside pictures from the wedding and made our social media feeds look like a place where only love and happiness exists.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-deepika-spam-our-social-media-feeds-with-their-wedding-pics-and-more-from-ent-world-357054.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542716946_800x420.jpg"}