{"text": "Ranveer Singh's Prep Video For '83' From Dharamshala Will Make You All Excited For The Film\nRanveer Singh's Prep Video For '83' From Dharamshala Will Make You All Excited For The Film\nKabir Khan's upcoming film 83 will be based on Indian team's iconic win at Cricket World Cup 1983. Ranveer, who does a lot of hard work to get into the skin of his characters is preparing for the sports drama. The team is currently attended a training session in Dharamshala.\nTo give all his fans a closer look at the preparations, Ranveer Singh took to social media to share a behind-the-scenes clip. In the clip, Ranveer Singh, along with the ensemble cast is training for the film.\nRanveer shared the video captioning it as,\n\"The incredible untold story of India’s greatest victory! 10th April 2020- Good Friday #Relive83 @83thefilm @kabirkhankk.\"\nApart from Former cricketers and members of the World Cup winning team, Kapil Dev and Mohinder Amarnath also feature in Ranveer's video. Ranveer had shared the first look of the film few weeks ago and the film is scheduled to release on April 10, 2020.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nApart from Ranveer, the film also stars R Badree, Harrdy Sandhu, Chirag Patil, Saqib Saleem, Pankaj Tripathi, Tahir Bhasin, Ammy Virk and Saahil Khattar in pivotal roles.", "title": "Ranveer Singh's Prep Video For '83' From Dharamshala Will Make You All Excited For The Film", "date_publish": "19/04/2019, 12:38:28", "description": "Kabir Khan's upcoming film 83 will be based on Indian team's iconic win at Cricket World Cup 1983. Ranveer, who does a lot of hard work to get into the skin of his characters is preparing for the sports drama. The team is currently attended a training session in Dharamshala. To give all his fans a closer look at the preparations, Ranveer Singh took to social media to share a behind-the-scenes cl", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-s-prep-video-for-83-from-dharamshala-will-make-you-all-excited-for-the-film-365736.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_singh_1555657838_800x420.jpg"}