{"text": "Ranveer Singh Performing On ‘Mere Do Anmol Ratan’ For Rappers Divine & Naezy Will Crack You Up\nRanveer Singh Performing On ‘Mere Do Anmol Ratan’ For Rappers Divine & Naezy Will Crack You Up\nRanveer Singh is currently the most sought after and loved actor of the tinsel town. Among other reasons why we love him, one is his crazy vibe and energy which he carries wherever he goes – even on social media. His posts often leave us splits, right?\nNow that he is gearing up for the release of Gully Boy, a Zoya Akhtar film inspired from the real-life of rappers Divine and Naezy, he is making all efforts to promote the movie. After impressing us all with his rapping skills in the song Apna Time Ayega, he was recently spotted hanging out with Divine and Naezy.\nRanveer Singh took to social media to introduce his fans to his ‘Do Anmol Ratan’ AKA Divine and Naezy by performing the song, and the video, we are sure, will leave you in splits.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nAlso starring Alia Bhatt and Kalki Koechlin, Gully Boy is slated to hit the screens on Feb 14. We are excited for this one, what about you? Tell us in the comments section below.", "title": "Ranveer Singh Performing On ‘Mere Do Anmol Ratan’ For Rappers Divine & Naezy Will Crack You Up", "date_publish": "18/01/2019, 11:34:33", "description": "Ranveer Singh took to social media to introduce his fans to his 'Do Anmol Ratan’ AKA Divine and Naezy by performing the song, and the video, we are sure, will leave you in splits. Now that he is gearing up for the release of Gully Boy, a Zoya Akhtar film inspired from the real-life of rappers Divine and Naezy, he is making all efforts to promote the movie. After impressing us all with his rappin", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-performing-on-mere-do-anmol-ratan-for-rappers-divine-naezy-will-crack-you-up-360620.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singhs_performance_on_mere_do_anmol_ratan_with_rappers_divine__naezy_will_crack_you_up_1547790937_800x420.png"}