{"text": "Ranveer Singh-Deepika Padukone Were All Smiles As They Left For Italy For Their Wedding!\nRanveer Singh-Deepika Padukone Were All Smiles As They Left For Italy For Their Wedding!\nThey met. They fell in love. And here they are, after six years of dating, all set to take the final plunge to spend their rest of the lives together.\nHe is Bollywood's Bajirao and she is Bollywood's Mastaani. Two of Bollywood's most loved celebrities are all set to solemnize their steady-relationship of six years. Confirming the reports of their destination wedding in Italy, the couple made an appearance at the airport in the wee hours of the morning as they headed to Italy via Dubai.\nTwinning in white, the couple was all smiles as they met and posed for the paps and crowd that was gathered to cheer for the couple.\nInstagram\nThe couple was accompanied by Ranveer's Singh family that included his mother Anju Bhavnani, father Jagjit Singh Bhavnani, and sister Ritika Bhavnani.\nInstagram\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nAs per reports, the couple will exchange wedding vows in Italy’s Villa Del Balbianello in Lake Como. Take a look at their airport pictures that prove how loved Deepika and Ranveer are two of most loved celebrities in the industry.\n#1\nInstagram/Ranveer Fan Clubs\n#2\nInstagram/Ranveer Fan Clubs\n#3\nInstagram/Ranveer Fan Clubs\n#4\nInstagram/Ranveer Fan Clubs\n#5\nTwitter\n#6\n#7\n#8\n#9\n#10\n#11\n#12\n#13\n#14\n#15\nOn 21st October, Deepika, and Ranveer took to their social media accounts to make an official announcement of their wedding. They wrote,\nInstagram/Ranveer-Deepika\n“With the blessings of our families, it gives us immense joy in sharing that our wedding is set to take place on the 14th and 15th of November, 2018. We thank you for all the love you have showered upon us over the years and seek your blessings as we embark on this incredible journey of love, loyalty, friendship and togetherness. Lots of love, Deepika and Ranveer.\"", "title": "Ranveer Singh-Deepika Padukone Were All Smiles As They Left For Italy For Their Wedding!", "date_publish": "10/11/2018, 10:41:28", "description": "He is Bollywood's Bajirao and she is Bollywood's Mastaani. Two of Bollywood's most loved celebrities are all set to solemnize their steady-relationship of six years. Confirming the reports of their destination wedding in Italy, the couple made an appearance at the airport in the wee hours of the mornings as they headed to Italy via Dubai.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ranveer-singh-deepika-padukone-were-all-smiles-as-they-left-for-italy-for-their-wedding-356377.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1541827538_800x420.jpg"}