{"text": "Ranveer Singh And Deepika Padukone Were Spotted At A Wedding In Mumbai & Their Chemistry Was Crackling As Always\nRanveer Singh And Deepika Padukone Were Spotted At A Wedding In Mumbai & Their Chemistry Was Crackling As Always\nIt has been quite some long that Ranveer Singh and Deepika Padukone painted the town red with their love-filled photos, right? Perhaps both of them were busy with their respective films – 83 and Chhapaak. However, they are back to leave you all swooning with their ever-growing romance.\nRanveer Singh and Deepika Padukone were spotted at a wedding in Mumbai recently. The pictures of the elegant and much-in-love couple since then have been going viral on social media.\nMr and Mrs Bhavnani were accompanied by Deepika's sister Anisha and mother Ujjala Padukone. So, looks like the wedding was a family affair.\nEver since her wedding, Deepika has been donning gorgeous sarees and looking like an elegant queen in all her appearance. So, this time as well, she donned a white saree with red floral print and looked absolutely magnificent.\nDon't Miss 460 SHARES 870 SHARES 132 SHARES\nRanveer, on the other hand, looked dapper as always in black bandhgala.\nJust look these two and their crackling chemistry.\nThey are setting couple goals again, right?", "title": "Ranveer Singh And Deepika Padukone Were Spotted At A Wedding In Mumbai & Their Chemistry Was Crackling As Always", "date_publish": "22/04/2019, 12:30:27", "description": "Ranveer Singh and Deepika Padukone were spotted a wedding in Mumbai recently. The pictures of the elegant and much-in-love couple since then have been going viral on social media. Ranveer Singh and Deepika Padukone were spotted a wedding in Mumbai recently. The pictures of the elegant and much-in-love couple since then have been going viral on social media.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-and-deepika-padukone-were-spotted-at-a-wedding-in-mumbai-their-chemistry-was-crackling-as-always-365870.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ranveer_deepika_at_a_wedding_in_mumbai_1555914408_800x420.png"}