{"text": "Ranveer Singh Claims KJo’s Takht Is Quite Similar To His Superhit ‘K3G’ & We Are Super Excited!\nRanveer Singh Claims KJo’s Takht Is Quite Similar To His Superhit ‘K3G’ & We Are Super Excited!\nAfter basking in back to back hits, Ranveer is doing Karan Johar ‘s Takht next and he is damn thrilled about the project.\nIn fact, he even claimed the film’s core is as similar as Karan Johar’s first family drama film Kabhi Khushi Kabhie Gham. Well yes!\nIn an interview with Deccan Chronicle, Ranveer compared K3G and Takht and explained that the two films are have different dynamics but the crux of both the films is same.\n“People don’t understand that K3G is a family film and it’s about internal dynamics of family and Takht is the same at its core. What period it’s set in? And what costumes they are wearing? The world is just a decoration.\nAt the core, it’s a family drama about love, greed, ambition, betrayal, brotherhood, and dynamics between father, son, brothers, and sisters; all this compiles the essence of the story”.\nWell, the casting of this film too has fascinated the audiences; the film has a stellar cast right from Vicky Kaushal, Kareena, Janhvi Kapoor to Alia Bhatt.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nRanveer too is intrigued by the star cast of the film, he says, “The story is on such delicious scale and there’s so much meat in it. It’s going to be special because he has a stellar cast…It’s crazy and this is damn exciting”.\nApart from Takht, Ranveer will soon start prepping up for 83, the film which is based on India’s first World Cup win in Cricket. He also has Gully Boys releasing next year along with Alia Bhatt.", "title": "Ranveer Singh Claims KJo’s Takht Is Quite Similar To His Superhit ‘K3G’ & We Are Damn Excited!", "date_publish": "31/12/2018, 14:15:35", "description": "“People don’t understand that K3G is a family film and it’s about internal dynamics of family and Takht is the same at its core. What period it’s set in? And what costumes they are wearing? The world is just a decoration. At the core, it’s a family drama about love, greed, ambition, betrayal, brotherhood, and dynamics between father, son, brothers, and sisters; all this compiles the essence of the", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-claims-kjo-s-takht-is-quite-similar-to-his-superhit-k3g-we-are-super-excited-359567.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_1546246173_800x420.jpg"}