{"text": "1. DeepVeer Pre-Wedding Rituals Are In Full Swing As Ranveer Singh Shines Bright At His Haldi Ceremony\nfgvbdfj,\n2. On Failing To Meet Him, Die-Hard Shah Rukh Khan Fan Slits His Throat Outside The Actor’s House\nThis insane fan of Shah Rukh Khan took craziness to new heights. All the way from Kolkata, he came to Mumbai to meet his favourite star Shah Rukh Khan. He stood outside of his house Mannat, but failing to meet him, he slit his throat there and then.a\n3. From Aamir Khan To Kareena Kapoor, Celebs Upped The Glamourous Quotient At Shah Rukh Khan’s Diwali Bash\nLast night, Shah Rukh Khan, the Badshah of Bollywood, who celebrated his birthday recently, hosted a Diwali bash at his residence and it was full of fun and frolic, going by the pictures.\n4. Game Of Thrones Season 8 Premiere Plot Has Been Disclosed & It’s Not What You May Have Expected\nDon't Miss 185 SHARES 343 SHARES 460 SHARES\n“Season 8 opens at Winterfell with an episode that contains plenty of callbacks to the show’s pilot. Instead of King Robert’s procession arriving, it’s Daenerys and her army. What follows is a thrilling and tense intermingling of characters—some of whom have never previously met, many who have messy histories—as they all prepare to face the inevitable invasion of the Army of the Dead.”\n5. Most-Loved Star Of The Nation, Shah Rukh Khan Says He Feels Like A Loser Sometimes!\n“I feel like a loser all the time. I met Aamir Khan a few days back and he asked me why I keep thinking like that. After conversing (with him), I realised he thinks in the same way.”", "title": "Ranveer Singh’s Haldi Ceremony, Die-Hard Shah Rukh Khan Fan Slits His Throat & More From Ent", "date_publish": "04/11/2018, 18:19:26", "description": "From Ranveer Singh haldi ceremony to Shah Rukh Khan’s die-hard fan slitting his throat outside his house, here is all that rocked the world of entertainment today. this insane fan of Shah Rukh Khan took craziness to new heights. All the way from Kolkata, he came to Mumbai to meet his favourite star Shah Rukh Khan. He stood outside of his house Mannat, but failing to meet him, he slit his throat th", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-s-haldi-ceremony-die-hard-shah-rukh-khan-fan-slits-his-throat-more-from-ent-356045.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singhs_haldi_ceremony_diehard_shah_rukh_khan_fan_slits_his_throat__more_from_ent_1541334956_800x420.png"}