{"text": "1. Ranveer Shows What 'Asli' Hip-Hop Is In Gully Boy Teaser & Fans Are Already Bobbing Their Heads\nGiving us a sneak peek of that, before the trailer is released, the makers have unveiled a teaser in which Ranveer Singh introduces fans to Asli Hip Hop rap. He stuns his fans further as he romances Alia Bhatt and Kalki Koechlin.\n2. Kader Khan’s Funeral Held In Canada, Son Sarfaraz & Fans Pay Their Last Respects\n“My father was laid to rest on Wednesday at the Meadowvale Cemetery in Mississauga (Canada). It was attended by us -- his family of three sons, relatives and fans who got to know of his passing,” Sarfaraz told IANS.\n3. While Simmba Surpasses Rs 150 Crore, SRK’s Zero Is Struggling To Even Touch Rs 100 Crore Mark\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nAfter two weeks of release, Anand L Rai’s Zero has only managed to score about Rs 90 crores at the box office in India. With release of Rohit Shetty’s Simmba, which has already minted about Rs 150 crores, there seems like no scope of improvement.\n4. These Spoofs Of The Accidental Prime Minister Trailer Ft Game Of Thrones & Avengers Are Too Epic To Miss\nThis spoof of The Accidental Prime Minister featuring Game of Thrones is too epic to be missed.\n5. From Wedding Date To Nick’s Name, These Pics Show Everything That Was Embroidered On PC’s Gown!\nThe lovebirds tied the knot in Jodhpur’s Umaid Bhawan. It was a hush-hush affair, but still, people got to see glimpses from the wedding. But we haven’t seen it all. Some unseen pictures are doing the rounds on social media. Take a look!", "title": "Ranveer Shows What Asli Hip-Hop Is, Kader Khan’s Funeral Takes Place In Canada & More From Ent", "date_publish": "04/01/2019, 18:13:13", "description": "From Ranveer Singh’s Gully boy teaser taking the social media by storm and fans gushing over his rapping skills as he showcases what Asli Hip Hop is while romancing Alia Bhatt and Kalki Koechlin to Kader Khan’s son confirming that he was buried on Wednesday, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/ranveer-shows-what-asli-hip-hop-is-kader-khan-s-funeral-takes-place-in-canada-more-from-ent-359864.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_shows_what_asli_hiphop_is_kader_khans_funeral_takes_place_in_canada__more_from_ent_1546604562_800x420.png"}