{"text": "Ranveer Singh and Alia Bhatt are really excited for their upcoming film Gully Boy. The duo is currently busy with the promotions of their film. They recently flew to Germany for the special screening of Gully Boy at Berlin Film Festival.\nRanveer and Alia will also bring their Gully Boy energy on the sets of The Kapil Sharma Show, and we’re sure the episode is going to be fun.\nDid you know that Ranveer Singh wanted to be rapper when he was a kid? On the show, he shared he was always inclined towards rapping. He said he was grateful that Zoya Akhtar decided to make this film, and he had an opportunity to star in it and rap as well.\n\"I think I was in Class 3 or 4 when I first got into hip-hop. I loved listening to Snoop Dogg, Tupac Shakur, The Notorious B.I.G, while growing up and I have been into that kind of music ever since. I used to watch a lot of MTV and that's where I first experienced it. There is a cousin of mine who migrated to the US and whenever he used to come down for summer holidays, he used to bring this music and we used to sit and hear it all the time,\" Ranveer had earlier told IANS.\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES\nAlia Bhatt also revealed her childhood obsession on The Kapil Sharma Show. She said she was obsessed about Dil Toh Paagal Hai’s song Le gayi le gayi. So much so, that she used to take the CD of the album to all the parties she would attend so that she could dance on it.\nWhat is your crazy childhood memory? Tell us about it in the comments section below.", "title": "Ranveer Singh, Alia Bhatt Share Their Childhood Memories And They Are Super Relatable!", "date_publish": "09/02/2019, 18:06:37", "description": "Did you know that Ranveer Singh wanted to be rapper when he was a kid? On the show, he shared he was always inclined towards rapping. He said he was greatful that Zoya Akhtar decided to make this film, and he had an opportunity to star in it and rap as well.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/ranveer-singh-alia-bhatt-share-their-childhood-memories-and-they-are-super-relatable-361860.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh__alia_bhatt_share_their_childhood_memories__obsessions__theyre_relatable_1549710993_800x420.png"}