{"text": "Rapper Divine Is Thankful For A Great Push But Won't Be Dependent On The Film Gully Boy Anymore\nRapper Divine Is Thankful For A Great Push But Won't Be Dependent On The Film Gully Boy Anymore\nGully Boy is one of the most critically acclaimed films this year. The film showed asli hip hop and asli gully of Mumbai featuring Ranveer Singh as Gully Boy. The film exploded at the box office and blew the audience's minds.\nTwitter\nZoya Akhtar’s directorial is based on the story of real Gully Boys Divine and Naezy. This film definitely bought them fame. However, Divine is not ready to rely on that film anymore.\nTwitter\nDivine is grateful to Zoya Akhtar as nobody considers them as aliens anymore but he wants to push himself more. Talking to PTI, Divine said,\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\n“The movie was a great push for us but we should not be dependent on the movie anymore. We should do our own thing. A mainstream movie came about us and now everybody knows about this scene in Mumbai”.\nDivine who is a hip hop star and a well-known face all over the world wants that there should be a Gully Boy from every city and not only Mumbai, “ Now every city should be pushing and putting themselves out there because now there is an audience who is ready to listen”.\nThe rapper was even quizzed about the sequel of Gully Boy which Zoya had already confirmed she is doing, he said, “I didn't have a word with her (Zoya) yet. If she's doing one then all the best to her. She has my love already”.\nTwitter\nAfter Gully Boy, the fans surely cannot contain their excitement for the sequel. Kya bolti Hai Public!", "title": "Rapper Divine Is Thankful For A Great Push But Won't Be Dependent On The Film Gully Boy Anymore", "date_publish": "22/03/2019, 18:07:43", "description": "Gully Boy was one of the most critically acclaimed films this year. The film showed asli hip hop and asli gully of Mumbai featuring Ranveer Singh as Gully Boy. The film exploded at the box office and blew the audience's mind. Zoya Akhtar’s directorial is based on the story of real Gully Boys Divine and Naezy. This film definitely bought them fame which they never dreamt off. However Divine is", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/rapper-divine-is-thankful-for-a-great-push-but-won-t-be-dependent-on-the-film-gully-boy-anymore-364155.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/divine_1553259053_800x420.jpg"}