{"text": "Ratna Pathak Shah is perhaps one of the few actresses in her generation who has experimented with Indian cinema. Despite doing a variety of roles, every one recognises her for her phenomenal portrayal of the sophisticated Maya Sarabhai. Whether it was Golmaal 3 or a black comedy like Lipstick Under my Burkha, Ratna sure is progressing with her movie choices and in some ways reviving parallel cinema for all of us.\nTwitter\nSpeaking exclusively to Indiatimes, Ratna is glad that a bunch of younger people who have watched various films in different kinds of format are changing the way Indian cinema is now being perceived.\n\"Internet opened out the world for everyone in India. Suddenly, films from all over the world are accessible. Earlier, we used to get only three and a half films from Hollywood and rest was local stuff that you had to see. Internet has given us various ways of looking at the world, especially to Indians which is why now young filmmakers also want to think out of the box. Now, will they be able to sustain novel cinema, that remains to be seen. Unfortunately, after a couple of interesting films from these directors, people lose interest. So we need to wait and watch.\"\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nRatna had, in earlier interviews, mentioned how filmmakers have a poor habit of spoon feeding audiences and not giving them room for imagination. But now she's glad that things gradually changed this year, as smaller films, story oriented and content driven films succeeded in comparison to bigger movies.\nHaving said that, she also said this approach may not last long. \"In India, you know, you can't hold your breath. We always do one step forward and ten steps back. Woh toh purana kissa hai, chalta rahega.\"\nTwitter\nBut the actress is satisfied that now content is being given the credit for success. \"This is something that should have happened 50 years ago that content is what makes a project work or fail, not the person involved in it, not the actor. We have given so much focus to one or two actors in a project, it's ridiculous. Unless that changes, intrinsically, yes, it needs to change and it will happen.\nScreengrab/Selection Day\nRatna concluded by saying that she only looks forward to a good story that is told by intelligence and with interest so that people want to watch it and she also agrees that it's not an easy job.\nHer upcoming web show Selection Day will premiere on 28th December, 2018 where she plays the role of a principal.", "title": "Ratna Pathak Is Glad The Internet Has Opened Out The World For Indian Filmmakers", "date_publish": "20/12/2018, 11:49:23", "description": "Whether it was Golmaal 3 or a black comedy like Lipstick Under my Burkha, Ratna sure is progressing with her movie choices and in some ways reviving parallel cinema for all of us.Whether it was Golmaal 3 or a black comedy like Lipstick Under my Burkha, Ratna sure is progressing with her movie choices and in some ways reviving parallel cinema for all of us.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/ratna-pathak-is-glad-the-internet-has-opened-doors-for-indian-filmmakers-to-showcase-their-work-358956.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ratna_1545290955_800x420.jpg"}