{"text": "Ranveer Singh is one actor who is not just loved by his fans but also his critics, co-actors and all the filmmakers he works with. Everyone has only good things to say about him. From Band Baaja Baraat to Gully Boy, Ranveer Singh's film journey has been a roller coaster that has only gone up.\nWith two smashing hits including Padmaavat and Simmba, the actor is all geared up for the release of Zoya Akhtar's upcoming film Gully Boy, which is loosely based on the lives of Mumbai's underground rappers Vivian Fernandes aka Divine and Naved Shaikh aka Naezy.\nFrom showing the struggles of street rappers of Mumbai to showcasing their inspiring story, Gully Boy is one of the most awaited releases of the year. The trailer of the film has already managed to create a lot of buzz.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nIn a recent interview with Mid-day Naezy praised Ranveer Singh for his hard work and effort in pulling off the character that is hugely inspired by him and his life. He said,\nInstagram\n“We would constantly speak about the indie scene in India. Ranveer has rapped earlier, so that made things easier for him. Apart from that, he is a great observer. He would study us — from our body language, to how we create lyrics for our songs and the kind of language we use in them. When you look at him in the film, it feels as if he has become one of us.\"\nNaezy added that to get into the skin of his character, Ranveer used to listen to his track Aane De, on loop. Well, he is a method actor and in no way can we ignore the hard work he puts in, in all his roles.", "title": "Real Gully Boy Naezy Praises Reel Gully Boy Ranveer Singh, Appreciates His Hard Work", "date_publish": "27/01/2019, 11:14:48", "description": "With two smashing hits including Padmaavat and Simmba, the actor is all geared up for the release of Zoya Akhtar's upcoming film Gully Boy, which is loosely based on the lives of Mumbai's underground rappers Vivian Fernandes aka Divine and Naved Shaikh aka Naezy.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/real-gully-boy-naezy-praises-reel-gully-boy-ranveer-singh-appreciates-his-hard-work-361109.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/ranveer_singh_1548568524_800x420.jpg"}