{"text": "Inspired by the British series, the show is about giving justice to criminals who may or may not have committed the crime. The buzz around the Indian version proves Criminal Justice will see many more episodes. But before that, here's taking a look at why this should be your show for this season.\nRecently at a panel discussion, Priyanka admitted that she wasn’t sure if she wanted to get married to Nick, but clearly, it turned out to be the best decision of her life. The actress said, “I’ve known him for two years. I didn’t think that this is what it [would’ve] turned out to be, and that’s maybe that’s my fault, I judged a book by its cover”. PC taught us - what not be next time when you meet a guy.\nDon't Miss 10.9 K SHARES\nCondoling Colonel Raj Kapoor, Shah Rukh Khan wrote a heartwarming message. Thanking him for making 'Fauji' out of a normal boy, Shah Rukh Khan's message proves that Kapoor played a crucial role in making his career.\nIn a recent interview with DNA, the 51-year-old star said, “I’m surviving on mediocre talent and luck. Actually, I don’t know what I’m surviving on, but I’m surviving”.\nAlia said, “I have always been a great admirer of his craft. He is an honest actor who extracts the best from himself when in front of the camera. There are no trappings, and even if he has a process, it is an internal one (which translates) on camera.”", "title": "Reasons To Watch Vikrant Massey's Criminal Justice, PC Talks About Nick And More From Ent", "date_publish": "12/04/2019, 18:18:11", "description": "Inspired by the British series, the show is about giving justice to criminals who may or may not have committed the crime. The buzz around the Indian version proves Criminal Justice will see many more episodes. But before that, here's taking a look at why this should be your show for this season.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/reasons-to-watch-vikrant-massey-s-criminal-justice-pc-talks-about-nick-and-more-from-ent-365358.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_bollywood_news_1555073386_800x420.jpg"}