{"text": "You don't have to be a fan or believer of true love to love and gush over Ranveer Singh and Deepika Padukone's wedding and after-wedding pictures. Even if you are someone who is cynical about love, your heart will melt at the love and affection that reeks from their photographs.\nViral Bhayani\nNot that we haven't seen them together before but the 'after-wedding' glow and happiness of starting their journey together is well evident. The couple has started making their public appearance in India after returning from Italy and people can't help but gush and adore all these pictures.\nFrom Ranveer being a protective 'boyfriend turned husband' to Deepika Padukone laughing when paps address them as 'Baba and Bhabhiji', looks like their love will make them rule on the internet for weeks.\nApart from the pictures from their private wedding that found its way on the internet, the ones where their teams have posted with them remain the sweetest ones. Everyone had great things to share about the couple and the wedding.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n(Also read: All Set For Their Wedding Reception, Ranveer-Deepika Beam With Joy As They Leave For Bengaluru)\nConsidering how the couple made sure that they have all these special people around them is a fact that their love and respect for people who work for them is uncompromising.\nAnother group photo that was shared two days ago was by DeepVeer's wedding planning team.\nThe head of the company, Vandana took to her Instagram to share the unadulterated feeling of joy and ecstasy that she felt while handling this project and then seeing the couple exchange vows and tie the knot.\nIn another post from Italy, Vandana wrote,\n\"They looked unreal, for time stood still. The first glimpse of them was as though they had walked out from the realms of a historical land towards their future together... Amidst us all, they stole a moment for themselves and when they both looked at each other and smiled, one knew it was as pure as any emotion could be : LOVE ❤️\"\nAfter making their public appearance at the Mumbai airport and Ranveer's home in Bandra, the couple has landed in Bengaluru today, where they are all set to host their first wedding reception.\n(Also read: As If We Didn't Have Enough Reasons Already, Ranveer Makes Us Swoon With His 'Deepika' Mehendi)", "title": "Recalling The Ceremonies In Italy, DeepVeer's Wedding Planner Shares Her 'Unreal' Experience", "date_publish": "20/11/2018, 13:37:07", "description": "You don't have to be a fan or believer of true love to love and gush over Ranveer Singh and Deepika Padukone's wedding and after-wedding pictures. Even if you are someone who is cynical about love, your heart will melt at the love and affection that reeks from their photographs. Not that we haven't seen them together before but the 'after-wedding' glow and happiness of starting their journey toget", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/recalling-the-ceremonies-in-italy-deepveer-s-wedding-planner-shares-her-unreal-experience-357019.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1542701809_800x420.jpg"}