{"text": "Almost every day, we read about a case of rape, sexual harassment or assault in the newspaper. These incidences have become so common that all of us, as a society, have normalised rape culture. So much so, that often when a woman is harassed, it takes years for her to realise that it was nothing normal or casual but it was actually harassment.\nThat’s what Swara Bhasker said recently. Recounting an incident from the past when she was sexually harassed by a director, Swara Bhasker said that it took her six-eight years to realise that it was actually workplace harassment.\nBCCL\n“It took me six to eight years to realise when I heard someone else talk about their experience of harassment at a panel discussion like this. I was like God, what happened to me three years ago was actually sexual harassment at workplace! I never realised it because like you said, I escaped. Because the person did not touch me and I managed to ward it off,” Swara Bhasker was quoted as saying by PTI.\nBCCL\n“I would just tell myself that this director is being... whatever, but that is not the full truth. The director was not being an idiot or... he was being a predator,” she added.\nTalking about why she was not able to recognise the pattern or the behaviour, Swara Bhasker said that it was because as a culture \"we do not teach our girl children to recognise predatory behaviour for what it is.\"\nDon't Miss 193 SHARES 1.1 K SHARES 174 SHARES 3.1 K SHARES 263 SHARES\nBCCL\n\"There is so much of culture of silence, around sexuality in India, around the issue of sexual harassment, actually not just In India, everywhere around the world that we are just going through are lives without recognising it properly. We just recognise the discomfort.\"\nbccl\nBefore moving to Mumbai, Swara lived with her parents in Delhi, who had a university background, and so was very aware of things, but she said \"the real world is the world.\" She said she came to the film industry thinking if someone dares to proposition her, she will show them her \"upbringing and values\" but nothing of this sort had happened.\n\"It is really sad, because then slowly I began to realise that I am just not recognising it. Because we are so endured to handle and manage things. Since childhood, if anything happens there is no one to tell you that this is sexual harassment,\" she said.\ntwitter\nThe Veere Di Wedding actress said women avoid taking legal route because they face a hostile society.\n\"First of these things is completely inhospitable and hostile society and a culture that actively or sub-consciously enables predators... We should use this moment to not just talk about the one predator that got caught and got glamourised.”\ntwitter\n\"But we should also talk about the culture that enables these predators to reach the position of power they do. So, it's also a question of making ourselves aware of many things that go into legitimising predatory behaviour,\" added Swara Bhasker.\nWith inputs from PTI", "title": "Recounting Sexual Harassment By A Director, Swara Bhasker Says It Took Her Years To Realise It", "date_publish": "19/01/2019, 12:31:23", "description": "Recounting an incident from the past when she was sexually harassed by a director, Swara Bhasker said that it took her six-eight years to realise about it. “It took me six to eight years to realise when I heard someone else talk about their experience of harassment at a panel discussion like this. I was like God, what happened to me three years ago was actually sexual harassment at workplace! I ne", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/recounting-sexual-harassment-by-a-director-swara-bhasker-says-it-took-her-years-to-realise-it-360685.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/swara_bhasker_was_sexually_harassed_by_a_director_but_she_realised_it_after_68_years_1547879323_800x420.jpg"}