{"text": "Talking in reference to the Bulandshahr violence, lynchings and religion, Naseeruddin Shah expressed his concern over how “the death of a cow has more significant than that of a police officer”. He says he doesn’t see “the situation improving anytime soon”. He also expressed fears over children’s response to facing a similar situation.\nIn an apparent reference to the recent mob violence, actor Naseeruddin Shah said at many places the death of a cow is being given more importance than the killing of a policeman. The veteran actor also expressed anxiety over the well-being of his children, who he said have not been brought up as followers of any particular religion. Shah made the comments in a video interview with Karwan-e-Mohabbat India and the organisation shared it on its YouTube channel on Monday.\nBCCL\nThe actor said the \"poison has already spread\" and it will be now difficult to contain it.\n\"It will be very difficult to capture this djinn back into the bottle again. There is complete impunity for those who take law into their own hands. In many areas we are witnessing that the death of a cow is more significance than that of a police officer,\" he added.\nShah, who is married to actor Ratna Pathak Shah, said they chose not to give any religious education to their children -- Imaad and Vivaan -- as he believes \"being good or evil has nothing to do with religion\". His fear for his children's safety is reminiscent of Aamir Khan's comments on intolerance in 2015 that had sparked a major controversy.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nBCCL\n\"I had received religious education as a child. Ratna (his wife) was from a liberal household so she received next to none. And we chose not to give religious education to our children because I believe being good or evil has nothing to do with religion.\n\"We taught them about good and bad, what our beliefs are. I did make them learn a few verses from the Quran Sharif, as I believe reciting them improves one's articulation. Just like one's articulation improves reading from the Ramayana or Mahabharata from its original...\" Shah added.\nThe actor is worried that the situation would not improve \"anytime soon\" and said he is angry, not scared.\nBCCL\n\"I feel anxious for my children because tomorrow if a mob surrounds them and asks, 'Are you a Hindu or a Muslim?' they will have no answer. It worries me that I don't see the situation improving anytime soon.\n\"These matters don't scare me, they make me angry. And I feel every right-thinking man should feel angry, not scared. This is our home, who dare evict us from here?\" he said.\nOn December 3, a mob, including right-wing activists, attacked a police station over alleged cow slaughter in the areas. The incident led to the deaths of Inspector Subodh Kumar Singh and another man.\nWith inputs from PTI", "title": "Referring To Bulandshahr Violence, Naseeruddin Shah Says He Feels Anxious For His Children", "date_publish": "20/12/2018, 17:19:04", "description": "Talking in reference to the Bulandshahr violence, lynchings and religion, Naseeruddin Shah expressed his concern over how “the death of a cow has more significant than that of a police officer”. He says he doesn’t see “the situation improving anytime soon”. He also expressed fears over children’s response on facing a similar situation.", "authors": [], "url": "https://www.indiatimes.com/entertainment/referring-to-bulandshahr-violence-naseeruddin-shah-says-he-feels-anxious-for-his-children-359010.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/referring_to_bulandshahr_violence_naseeruddin_shah_says_he_feels_anxious_for_his_children_1545309327_800x420.jpg"}