{"text": "Sonam Kapoor’s next film is with her father Anil Kapoor and she's totally looking forward to it. Yes, the trailer of the film Ek Ladki Ko Dekha Toh Aisa Laga dropped yesterday on the internet and it has created a huge excitement, for all the right reasons.\nTwitter\nThe trailer shows love has no boundaries and one should let love be. From the looks of it, Sonam reportedly plays a gay character in the film who is fighting her demons inside against her over-enthusiastic family who wants her to get married to a man.\nThe trailer will immediately give you goosebumps and will make you want to watch the movie ASAP.\nEvery character in the trailer shines right from Anil Kapoor, Rajkummar Rao, Sonam Kapoor and Juhi Chawla, but one character that is kept hidden is Sonam’s alleged on-screen girlfriend. There are a couple of glimpses of hers shown in the trailer.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nInstagram\nNeedless to say, everyone is curious to know about the girl. And now as per reports in Bollywoodlife, the girl who is playing Sonam’s girlfriend is a famous South actress, Regina Cassandra.\nThis gorgeous South actress was in news early this year for bagging a prominent role in Bollywood. Interestingly, Regina was a part of a Tollywood film based on homosexuality Awe, however, she played a straight character in the film. If you see the trailer of Ek Ladki Ko Dekha Toh Aisa Laga closely you will find a glimpse of Regina in it.\nTwitter\nA source quoted to BollywoodLife says,\n“In EK Ladki Ko Dekha Toh Aisa Laga, Regina plays Kuku, who will apparently fall in love with Sweety (Sonam Kapoor)”.\nThis film will definitely create a new revolution in Bollywood. Kudos to Sonam and the entire star cast of the film for being the part of this beautiful rendition.\nInstagram\nThe movie is slated to release on February 1, 2019 and is directed by Shelly Chopra Dhar.", "title": "Regina Cassandra To Play The Role Of Sonam Kapoor’s Girlfriend In Ek Ladki Ko Dekha Toh Aisa Laga", "date_publish": "28/12/2018, 15:28:54", "description": "Sonam Kapoor’s next film trailer Ek Ladki Ko Dekha Toh Aisa Laga dropped yesterday on the internet and it created a huge stir.The trailer shows love has no boundaries and one should let love be. Sonam plays a lesbian in the film who is fighting her demons inside against her over-enthusiastic family who wants her to get married to a man. The trailer will immediately give you goosebumps and will mak", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/regina-cassandra-to-play-the-role-of-sonam-kapoor-s-girlfriend-in-ek-ladki-ko-dekha-toh-aisa-laga-359426.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonam_kapoor_1545992035_800x420.jpg"}