{"text": "Rejoice! 'Made In Heaven' Is Being Renewed For Season 2 & We Can't Wait To Witness More Weddings\nRejoice! 'Made In Heaven' Is Being Renewed For Season 2 & We Can't Wait To Witness More Weddings\nZoya Akhtar and Reema Kagti's web-series Made In Heaven went on to become one of the most popular and widely-discussed shows and for all the right reasons. Finally, India could boast about a show on weddings, that depicted the harsh realities that lie behind the glitzy wedding albums that we adore.\nThe show revolved around two main characters Tara and Karan but the show revolved around some real-life scenarios that persist in the Indian society.\n(Also read: 'Made In Heaven' Is A Show Every Aunty Who Wants You To Get Married & Settle Down Must Watch!)\nAmazon Prime\nThe show was loved by a lot of people and now we have a piece of news that will make a lot of you people happy.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAmazon Prime\nThe second season of the show is already in the pipeline and a Spotboye report has confirmed it. A source confirmed the news and was quoted in the same report as saying:\nTiger Baby and Excel\n“Now, that's natural. You can't have the exact cast. But as things stand today, we are making Made In Heaven 2.”\nThe web series released on March 8 and starred Arjun Mathur, Sobhita Dhulipala, Kalki Koechlin, Jim Sarbh, Shashank Arora, and Shivani Raghuvanshi in pivotal roles.\n(Also read- Made In Heaven: Finally A Show That's Much More Than Just Crazy Rich Indians Getting Married!)", "title": "Made in heaven:For All Those Who Loved 'Made In Heaven'-The Web Series Is Being Renewed For Season 2!", "date_publish": "03/04/2019, 14:03:44", "description": "Zoya Akhtar and Reema Kagti's web-series Made In Heaven went on to become one of the most popular and widely-discussed shows and for all the right reasons. Finally, India could boast about a show about weddings, that depicted the harsh realities that lie behind the glitzy wedding albums that we adore.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/rejoice-made-in-heaven-is-being-renewed-for-season-2-we-can-t-wait-to-witness-more-weddings-364793.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/made_in_heaven_1554276775_800x420.jpg"}