{"text": "#1 EC Bans Vivek Oberoi's Modi Biopic One Day Before Its Release & The Internet Is Celebrating!\nSoon the movie shifted to 11th April but now in a fresh set of events, EC has banned the biopic citing 'disturbs level-playing field' They have mentioned there will be no biopic till the polls end.\n#2 Deepika Padukone & Vikrant Massey Spotted Filming 'Chhapaak' On The Streets Of Delhi And She's Unrecognisable\nThis marks DP's debut as a producer and this is an important project for her. The actress is currently shooting with Vikrant Massey in Delhi. With the prosthetic make up, no one could recognise the leggy lass. Take a look at the photos that resurfaced.\nDon't Miss 6.8 K SHARES 460 SHARES 828 SHARES 1.7 K SHARES\nThe frenzy has already begun. Avengers: Endgame is hitting the screens on April 26 in India. Joe Russo, the co-director of the movie came to India to promote the film. All details regarding the plot of the movie are being kept under wraps. Meanwhile, Marvel fans are just counting days to experience the one-of-a-kind movie. Even before its release, Avengers: Endgame has already taken the world by storm.\n#4 Malaika Arora Slams Trolls In An Epic Way, Posts A Bikini Pic With Caption ‘Spare Me Your Crap’\n“Being happy is a choice and I choose to be happy... also I think happiness looks good on me... so, keep your opinions and your negativity to yourself and spare me your c**p.\" She also added these hashtags to her caption: \"#notinterested\", \"#toobusybeinghappy,” she wrote.\n#5 Emilia Clarke AKA Khaleesi Shares Unseen Pics From Her Brain Surgeries & They'll Shake You Up\nEarlier this year, the star opened up about how she suffered and survived two brain aneurysms while filming the fantasy drama, the second of which nearly killed her. And this time she shared images from her hospital stay.", "title": "Release Of PM Modi Biopic Stalled, Deepika-Vikrant Spotted Filming For Chhapaak & More From Ent", "date_publish": "10/04/2019, 18:22:20", "description": "From Deepika Padukone and Vikrant Massey shooting for Chhapaak to PM Narendra Modi’s biopic’s release getting stalled, here is all that rocked the world of entertainment today. Deepika Padukone has taken a one year break after her marriage to fully get into the skin of acid attack survivor for her upcoming film, Chaapaak. Yes, we won't be seeing any of her releases this year as the actress is prep", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/release-of-pm-modi-biopic-stalled-deepika-vikrant-spotted-filming-for-chhapaak-more-from-ent-365211.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/release_of_pm_modi_biopic_stalled_deepikavikrant_spotted_filming_for_chhapaak__more_from_ent_1554899177_800x420.png"}