{"text": "Nowadays, we take pictures for granted. Our phones are flooding with so many selfies and tons of pictures from the same party or trip. Things were a little different when not everyone had a camera on their phones. Those pictures captured something special that people cherish for a lifetime. You know the feeling of looking at old printed photos, don’t you?\nvia GIPHY\nBrining in a wave of nostalgia, Amitabh Bachchan recently shared a rare picture of himself with late actress Sridevi, Aamir Khan and Salman Khan, and it’s pure gold.\nRare pic - Amitabh Bachchan with SriDevi ji , Aamir Khan and Salman Khan During rehearsals for 'Jhumma Chumma' concert in London-Wembley Stadium~ 70,000 audience .. @SrBachchan pic.twitter.com/nxtnErLgKR — Moses Sapir (@MosesSapir) February 5, 2019\nThe picture was apparently clicked during the rehearsals for Jhumma Chumma concert in London’s Wembley Stadium. “Those were the days .. never before a concert at Wembley Stadium from India .. and on my insistence took Salman and Aamir for their first one ..” wrote Amitabh Bachchan in the caption.\nthose were the days .. never before a concert at Wembley Stadium from India .. and on my insistence took Salman and Aamir for their first one .. https://t.co/YBoAKNP6Ht — Amitabh Bachchan (@SrBachchan) February 5, 2019\nSalman is all smiles with a glint in his eyes. Perhaps, that was his fanboy moment with Amitabh Bachchan.\nFans were left nostalgic.\nSir itna purana suit abhi tak rakhe hai aap pic.twitter.com/e99qfnXgn5 — भाईसाहब (@Bhai_saheb) February 5, 2019\nDon't Miss 812 SHARES 468 SHARES 343 SHARES 814 SHARES 3 K SHARES\nI was there that night Sir...15.09.90..11 years old! Will never forget it! Thank you for inspiring me all my life..continue to follow the principles of Agneepath! Love you! — Dr Abhinav Singh (@AbhinavSinghINR) February 6, 2019\nAll look so young and innocent — Silvano (@Desouza9S) February 6, 2019\nWow what a photo! Sri, Amitabh, Salman and Aamir. Brings back good memories 👍👍👍 — Farakh Azad (@farakh140) February 5, 2019\nWe are drowning in nostalgia already.", "title": "Amitabh Bachchan:Bringing In A Wave Of Nostalgia, Amitabh Bachchan Shares A Rare B&W Pic With Sridevi, Salman & Aamir", "date_publish": "06/02/2019, 15:44:49", "description": "Brining in a wave of nostalgia, Amitabh Bachchan recently shared a rare picture of him with late actress Sridevi, Aamir Khan and Salman Khan, and it’s pure gold. The picture was apparently clicked during the rehearsals for Jhumma Chumma concert in London’s Wembley Stadium. Salman is all smiles with a glint in his eyes. Perhaps, that was his fanboy moment with Amitabh Bachchan.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/relive-the-good-old-times-amitabh-bachchan-shares-a-90-s-throwback-pic-with-sridevi-salman-aamir-361691.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/amitabh_bachchan_shares_a_rare_bw_pic_with_sridevi_salman__aamir__everyone_is_nostalgic_1549448118_800x420.png"}