{"text": "Remember The Mystery Teen At The End Of Avengers: Endgame? Here’s Why He Is Super Important!\nRemember The Mystery Teen At The End Of Avengers: Endgame? Here’s Why He Is Super Important!\nThere are a lot of characters in Avengers: Endgame, and true Marvel fans are familiar with them all. But there was one cameo at the end of Avengers: Endgame, which left everyone scratching their heads. Or maybe it went unnoticed by some.\nSpoiler Alert: If you haven’t watched Avengers: Endgame, watch it and come back here right after.\nmeme-arsenal.com\nThe face of a teen that shows up at the end of the Avengers: Endgame, at Tony Stark's/Iron Man's funeral – oh yeah, he is dead – might have been ignored because you were crying, but the adolescent who was seen at the back of the grieving crowd is super important. Here’s why!\nelcomercio.pe\nHe is Harley Keener from Iron Man 3, the kid who the Stark had befriended while he was stranded in Tennessee. He helped Tony Stark repair his suit, and when the Iron Man left, he gave the little one an incredible workshop so that he can keep reinventing.\nDon't Miss 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES 974 SHARES\nTwitter\nAnd then, we didn’t hear from or see Harley Keener until Avengers: Endgame released. Also, if you remember, Harley Keener had told Tony Stark that he hasn’t seen his real dad in six years and he fears that he won’t see Tony for next six years too.\nHarley Keener will become iron man and no one can change my mind pic.twitter.com/r5qcTUGVaY — bre ⎊ saw endgame (@ironstark) April 26, 2019\nAnd guess what! Iron Man 3 and Avengers: Endgame were released exactly six years apart. And now fans think that Harley Keener will take up the Iron Man mantle in future.\nWho is that boy behind scarlet witch,bucky n falcon?..any of u that watched the #endGame must be wondering right?he must be someone important in future avenger?? Well, he turn out to be the kid from iron man 3 Harley Keener..could he be the next ironman??? #AvengersEndGame pic.twitter.com/ILP24HV8xf — Azlan Said ⓥ (@AzlanSaid25) April 27, 2019\nWell, can that be true? We’ll have to wait to see that. But we’ll miss RDJ for sure. BRB! Sobbing!", "title": "Remember The Mystery Teen At The End Of Avengers: Endgame? Here’s Why He Is Super Important!", "date_publish": "01/05/2019, 15:55:55", "description": "The face of a teen that shows up at the end of the Avengers: Endgame (He is Harley Keener from Iron Man 3), at Tony Stark's/Iron Man's, funeral – oh yeah, he is dead and I’ve yet again burst into teasr – might have went ignored because you were crying, but the adolescent who was seen at the back of the grieving crowd is super important. Here’s why.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/remember-the-mystery-teen-at-the-end-of-avengers-endgame-here-s-why-he-is-super-important-366420.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/harley_keener_the_teen_at_the_end_of_avengers_endgame_is_really_important_and_heres_why_1556705144_800x420.png"}