{"text": "Remember The Mountain From 'Game Of Thrones'? He Got Hitched & Announced It In The Sweetest Way\nRemember The Mountain From 'Game Of Thrones'? He Got Hitched & Announced It In The Sweetest Way\nRemember The Moutain from Game of Thrones? The Hound’s brother who is also on the hitlist of Arya Stark for torturing many farmers and their wives at Harrenhal. Hafþór Júlíus Björnsson, who is fondly called Thor, is the World’s strongest man, if you didn’t know.\nGame of Thrones star Thor Bjornsson aka The Mountain, married his long-time girlfriend Kelsey Henson a few days ago. The 29-year-old took to Instagram and announced his wedding among his fans and followers by sharing one of his wedding pictures, reports dailymail.co.uk.\nBjornsson captioned it, \"It is with great pleasure that I now get to call Kelsey Morgan Henson my wife! I get to hold this beautiful woman through thick and thin for the rest of our lives! I'm so excited for all of the future adventures we will tackle side by side. Just married.\"\nIn the black and white photo, The Mountain can be seen wearing dapper suit and tie, while Henson makes the picture perfect bride in a white bridal gown.\nDon't Miss 161 SHARES 842 SHARES\nThe couple has been dating since 2017 and met in Canada in a bar where Kelsey was working as a waitress. It is claimed Henson, who stands at 5'2 while her beau reaches 6'9, asked Bjornsson for a picture and romance quickly blossomed between the pair.\nInputs from IANS", "title": "Remember The Mountain From 'Game Of Thrones'? He Got Hitched & Announced It In The Sweetest Way", "date_publish": "22/10/2018, 17:32:40", "description": "Game of Thrones star Thor Bjornsson aka The Mountain, married his long-time girlfriend Kelsey Henson a few days ago. Remember The Moutain from Game of Thrones? The Hound’s brother who is also on the hitlist of Arya Stark for torturing many farmers and their wives at Harrenhal. Hafþór Júlíus Björnsson, who is fondly called Thor, is the World’s strongest man, if you didn’t know.", "authors": [], "url": "https://www.indiatimes.com/entertainment/remember-the-mountain-from-game-of-thrones-he-got-hitched-announced-it-in-the-sweetest-way-355240.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/the_mountain_from_game_of_thrones_1540210097_800x420.jpg"}