{"text": "Remembering Sridevi, SRK Says She Would Have Been The First Person To Watch Their Film 'Zero'\nRemembering Sridevi, SRK Says She Would Have Been The First Person To Watch Their Film 'Zero'\nSome losses feel heavy for a long time and for Indian Cinema, losing Sridevi is one such loss. The actress passed away in February in Dubai. The last film she did a special cameo for was Shah Rukh Khan, Katrina Kaif and Anushka Sharma starrer Zero. The film is heading towards its official release and SRK couldn't stop himself from sorely missing Sridevi.\nDuring the promotions of Zero, he recalled his collaboration with Sridevi for his 1996 film Army and how Zero will remain a special film because he again got a chance to share the screen space with her.\nKhan was quoted in media reports saying,\nAgencies\n\"Oh, it's a privilege to have had her in the film, because, you know, just the loss is so great. And I hope wherever she is, she makes the world happy like she's done. I kind of started my career when I came and did Army (1996) with her and then she's no more and I have a little scene with her, so it's heartening that way.\"\nHe added that had she been alive, she would definitely have been the first person to watch the first screening of the film.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES", "title": "Remembering Sridevi, SRK Says She Would Have Been The First Person To Watch Their Film 'Zero'", "date_publish": "13/12/2018, 12:43:40", "description": "Some losses feel heavy for a long time and for Indian Cinema, losing Sridevi is one such loss. The actress passed away in February in Dubai after accidental drowning. The last film she did a special cameo for was Shah Rukh Khan, Katrina Kaif and Anushka Sharma starrer Zero. The film is heading towards its official release and SRK couldn't stop himself from sorely missing Sridevi.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/remembering-sridevi-srk-says-she-would-have-been-the-first-person-to-watch-their-film-zero-358485.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/srk_and_sridevi_1544686095_800x420.jpg"}