{"text": "Friends is simply one of the best shows ever made. It’s been almost 25 years since the greatest TV show ever graced our screens, and we still cannot image what our loves would be without it.\nvia GIPHY\nNo matter what mood you’re in, one episode of Friends can make you all delighted, don’t you agree? We might get old, but the show is never getting old for any of us, right? But this little piece of news might actually make you think twice at this.\nvia GIPHY\nWho’s your favourite character on Friends – this is a tricky question, right? From Janice to Joey, each character has taught us a lesson and tickles our funny bones for reasons more than one.\nvia GIPHY\nAs ardent fans of the show, do you remember all the characters from the show? Do you remember Janine, Joey’s brief roommate and girlfriend who was dumped by him because she couldn’t stand Monica and Chandler? Or Mr Treeger, the burly building superintendent of Monica, Rachel, Chandler and Joey's apartment? Or Rachel’s daughter Emma?\nTwitter\nYou would definitely agree that kids grow up fast these days. It just feels like yesterday when we saw Rachel’s cute little daughter Emma Geller-Green. Did you know the role was played by set of twins named Noelle and Cali Sheldon, and they’re both grown up and 16 years old now. Yes, Noelle and Cali Sheldon shared the role as the child of Jennifer Aniston and David Schwimmer's characters from 2003 until the sitcom's end a year later. Take a look at how they look like now!\nDon't Miss 1 K SHARES 738 SHARES 699 SHARES 1.2 K SHARES 16.6 K SHARES\nWhat’s more? They are all set to appear in a horror movie titled Us. “So happy I got to be part of this movie, It looks amazing and terrifying!”, wrote Noelle as she shared the news.\nNoelle and Cali turned 16 on June 17 last year. They have appeared in a few short films as well. Time flies, right?", "title": "Remember Rachel's Daughter 'Emma' From Friends? The Twins Will Soon Turn 17 & Appear In A Movie", "date_publish": "15/01/2019, 11:34:02", "description": "Remember Rachel’s daughter Emma? It just feels like yesterday when we saw Rachel’s cute little daughter Emma Geller-Green, right? Did you know the role was played by set of twins named Noelle and Cali Sheldon, and they’re both grown up and 16 years old now.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/remember-rachel-s-daughter-emma-from-friends-the-twins-will-soon-turn-17-appear-in-a-movie-360420.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/remember_twins_who_played_rachels_baby_in_friends_theyll_soon_turn_17__appear_in_a_movie_1547532289_800x420.png"}