{"text": "When she was a child, she sure was a small wonder. Richa Bhadra tickled our funny bone and shot to fame as Chakki Parekh, Hansa and Parful's daughter in the popular TV show Khichdi. But do you know why she has now quit the TV industry? Because she was propositioned a number of times.\nAfter Khichdi, Richa Bhadra was seen in other TV shows including Baa Bahu aur Baby and Mrs. Tendulkar. But she thinks it was a mindful decision to quit acting and stay away from the limelight.\n“After marriage, I was auditioning at a couple of places and I was asked to compromise. I came across a casting director who said, ‘Keep me happy and I will give you work’… He wanted to meet me at a hotel when I suggested meeting him at a coffee shop,” Richa Bhadra told Timesofindia.com.\n“That was the end to all my aspirations which I had in the industry. I didn’t want to ruin the image which I had built as a child actor,” she added.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAnd this isn’t all. She was body-shamed as well.\n“I have constantly been told, ‘Oh you are too chubby!’ This is how I am, this is my body structure. Often I have been offered roles of a ‘fat girl’ as per the script’s demand. I don’t want that tag. I have been told to lose weight if I want to act. I don’t want to lose weight only to be a part of the industry,” she added.\nRicha Bhadra is now married. She is happily enjoying marital bliss with her husband with whom she works in the corporate sector.", "title": "Remember Richa Bhadra AKA Chakki From ‘Khichdi’? Casting Couch Forced Her To Quit TV Industry", "date_publish": "17/04/2019, 12:50:01", "description": "Richa Bhadra tickled our funny bones and shot to fame as Chakki Parekh post her appearance in popular TV show Khichdi. But do you know why she has now quit the TV industry? Because she faced casting couch and body shaming a number of times. Once a director told her,", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/remember-richa-bhadra-aka-chakki-from-khichdi-casting-couch-forced-her-to-quit-tv-industry-365604.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/khichdi_star_chakki_parekh_aka_richa_bhadra_from_khichdi_faced_casting_couch_and_body_shaming_1555485070_800x420.jpg"}