{"text": "The election commission of India announced a stay on Vivek Oberoi’s Modi biopic stating that it might influence the voters, no biopics on political leaders will be shown until elections. However, this decision of EC was not appreciated by the makers and Vivek as they were hoping for a release today.\nTwitter\nNevertheless, Vivek didn’t stop his fight against the criticism he faced, he even picked on the actors for clicking selfies with PM Modi and not supporting him, while talking to Zoom he said, “I feel we are not a united industry. I feel when a Padmaavat gets stuck and a legend like Sanjay Bhansali is mistreated and misbehaved with, we should all unite together. I feel if My Name Is Khan gets stuck, we should come together to make sure it doesn't get stuck. It's easy to post selfies with Prime Minister and stuff like that. As an industry, we need to stand together”.\nTwitter\nWell, now Vivek should take a breather as Swara and Renuka have come out and reacted on the stay of the film. Swara was asked about her opinion on the EC’s ban on the film, she said, “Same rules should apply to everyone is my only reaction to anything the EC does or says”.\nDon't Miss 1.1 K SHARES 174 SHARES 3.1 K SHARES 776 SHARES 12.5 K SHARES\nTwitter\nWhile Renuka wasn’t in support of the film being stalled, she said, “I think it's sad that the election commission is taking such a call after the film got its censor certificate. I am sure the makers went through the process and got things in place. They could have asked for the stay if the movie was produced by BJP but it's not. It is made by few individuals who are inspired by an individual who happens to be the Prime Minister of the country”.\nTwitter\nDo tell us if stalling the film a day before was a fair or not by Election Commission. Drop your comments in the box below.", "title": "Renuka Backs Vivek Oberoi, Says It's Sad EC Did This After The Film Got Its Censor Certificate", "date_publish": "11/04/2019, 14:09:25", "description": "The election commission of India announced a stall on Vivek Oberoi’s Modi biopic stating that it might influence the voters, no biopics on political leaders will be shown until elections. However this decision of EC was not very much appreciated by the makers and Vivek as they were hoping a release today, but the ban on the film was last time which obviously left them shattered.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/renuka-shahane-backs-vivek-oberoi-says-it-s-sad-ec-did-this-after-the-film-got-its-censor-certificate-365248.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/renuka_shahane_1554969706_800x420.jpg"}