{"text": "Reports Claim 'Breaking Bad' Is All Set To Return As A Film Now And We Can't Keep Calm\nReports Claim 'Breaking Bad' Is All Set To Return As A Film Now And We Can't Keep Calm\nIf you're a fan of 'Breaking Bad', here is a piece of news that will make you really excited. 'Breaking Bad' fans will no longer have to tread lightly, as a film sequel to the iconic television show is in the works.\nThe production is scheduled to start later this month in New Mexico under the title 'Greenbrier', and is said to \"follow the escape of a kidnapped man and his quest for freedom.\"\n\"Yes, there appears to be a movie version of Breaking Bad. It's a great story, and there's a lot of people who felt that they wanted to see some kind of completion to these storylines that were left open, and this idea, from what I'm told, gets into those...at least a couple of the characters who were not completed, as far as their journey,\" Fox news quoted actor Bryan Cranston as saying on The Dan Patrick Show.\nThe film is expected to follow the events in the 'Breaking Bad' series finale which aired in 2013.\nStarring Bryan Cranston, Aaron Paul, Jonathan Banks, Dean Norris, and Giancarlo Esposito, the series revolved around White, a stressed high school chemistry teacher who is diagnosed with lung cancer.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nTo make ends meet - and to leave his family a nest egg following his presumed death - he begins making and selling methamphetamine with Pinkman, his former student.\nInputs From ANI", "title": "Reports Claim 'Breaking Bad' Is All Set To Return As A Film Now And We Can't Keep Calm", "date_publish": "08/11/2018, 10:45:55", "description": "The film is expected to follow the events in the 'Breaking Bad' series finale which aired in 2013. Starring Bryan Cranston, Aaron Paul, Jonathan Banks, Dean Norris, and Giancarlo Esposito, the series revolved around White, a stressed high school chemistry teacher who is diagnosed with lung cancer.", "authors": [], "url": "https://www.indiatimes.com/entertainment/reports-claim-breaking-bad-is-all-set-to-return-as-a-film-now-and-we-can-t-keep-calm-356249.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/breaking_bad_movie_in_the_works_1541654281_800x420.jpg"}