{"text": "During the #MeToo movement that had taken the entire nation by a storm a lot of people, a lot of women braved themselves up and came forward with names to shame the sexual predators. It started off a debate on why these women are not reporting the cases and filing FIRs. While some of them like Vinta Nanda, who registered an FIR against Alok Nath, there were others who didn’t take the legal route.\nOne of them was singer Sona Mohapatra, who had levied sexual harassment charges against Kailash Kher. The singer is quite vocal about her opinions on social media.\nKailash Kher responded to the allegations recently. He said, “Everyone has their own thinking. If I accuse someone only by taking that individual's name over and over again then, nothing will come out of it. If you will take legal recourse against that person, then it becomes another matter altogether.\"\nIn response to Kailash Kher, here’s what Sona Mohapatra said:\n1)The burdened police would die if every woman who was touched, made a pass at or called up to a mans hotel room despite showing no interest decided to file a complaint.\n2) I hope that the other women & minors you have assaulted gather the courage to do so Kailash.@IndiaMeToo https://t.co/x3liRff6TM — SONA (@sonamohapatra) February 8, 2019\nDon't Miss 402 SHARES 449 SHARES 189 SHARES 7.7 K SHARES 6.7 K SHARES\nDear India you decide.After close to 9 women speak up publicly about similar perverted behaviour & many more, some minors, share worse horror stories anonymously for fear of shame in society, trouble with parents, Kailash Kher carries on like nothing has happened. Good?Bad?Ugly? https://t.co/J8yR8EAo8o — SONA (@sonamohapatra) February 8, 2019\nWith inputs from IANS", "title": "Responding To Kailash Kher, Sona Mohapatra Reveals Why She Won't File #MeToo Case Against Him", "date_publish": "08/02/2019, 18:21:54", "description": "One of them was singer Sona Mohapatra, who had levied sexual harassment charges against Kailash Kher. The singer is quite vocal about her opinions on social media. In an interview, she had said that she will not lodge a complaint but make sure that he doesn’t repeat such acts in future.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/responding-to-kailash-kher-sona-mohapatra-reveals-why-she-won-t-file-metoo-case-against-him-361816.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/responding_to_kailash_kher_sona_mohapatra_reveals_why_will_not_file_metoo_case_against_him_1549629312_800x420.png"}