{"text": "Tanushree Dutta has started a fight that is going to last for a really long time. Joining the actress to share their stories of #MeToo, several actors have come up and accused people of harassing them. When Tanushree had shared her story of being harassed, she was asked if MeToo movement will happen in India. Without any hesitation, she had said,\nScreenshot\n“If what happened to me 10 years ago hasn’t been addressed and hasn’t been brought to justice, then how can any movement happen here?”\nTanushree's courage to share her story gave a lot of other women the courage to share their stories.\nThanks to this movement, many offenders like Vikas Bahl, Subash Ghai, Sajid Khan, musicians Kailash Kher and Anu Malik are now under the scanner for harassing women.\nWhile many are on the way to get justice and many had to step down from their respective professional posts for being guilty of harassing women at workplace, Tanushree's fight, on the other hand, is taking a new turn every day.\nAccording to recent reports, Nana Patekar has responded to a complaint filed by actor Tanushree Dutta with the Cine and Television Artistes’ Association (CINTAA). Nana Patekar has called her claims false and baseless.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nJust to jog your memory a little, Tanushree Dutta opened up about her ordeal and accused Nana Patekar of sexually harassing her on the sets of a film in 2008. He had even filed a CINTAA complaint and the association had asked Nana to respond to the allegations.\nReports claim how in his detailed response to the notice from CINTAA, Nana Patekar has added how all the allegations leveled against him are baseless and false.\nIn his response, he added how he is also under the process of adopting legal measures against Tanushree. On the other hand, talking to Reuters, Tanushree said,\nPinterest\n“I knew I had to keep the dialogue going ... and other women would speak out. I was in it deep - there was no way out. I was not going to cow down - not the second time for sure.”", "title": "Responding To CINTAA Notice, Nana Patekar Calls Tanushree Dutta’s Claims Baseless And False!", "date_publish": "19/10/2018, 11:46:16", "description": "While many are on the way to get justice and many had to step down from their respective professional posts for being guilty of harassing women at workplace, Tanushree's fight, on the other hand, is taking a new turn every day. According to recent reports, Nana Patekar has responded to a complaint filed by actor Tanushree Dutta with the Cine and Television Artistes’ Association (CINTAA).", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/responding-to-cintaa-notice-nana-patekar-calls-tanushree-dutta-s-claims-baseless-and-false-355065.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/nana_patekar_and_tanushree_1539929955_800x420.jpg"}