{"text": "One of Bollywood's most commendable comic and writer Kadar Khan breathed his last on Tuesday morning in Canada. The news was confirmed by his son Sarfaraz Khan. Talking to Indian Express, he said,\nPinterest\n“Yes, my dad has left us this morning. He was unwell from last few months and in the hospital from last few days. We tried everything we could, but it was time. He was a very loving man and he loved everyone who was a part of his life.”\nAccording to reports, Kader Khan reported the issue of breathlessness, after which the doctors reportedly transferred him from a regular ventilator to BiPAP ventilator. Khan's contribution to Hindi cinema also includes his writing for 250 movies.\nPinterest\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe film fraternity poured in condolence messages for the actor.\nRIP #KaderKhan saab. One of my inspirations and a truly iconic actor, writer and stage artists. His contribution to my fathers cinema was limitless just like his talent. You will truly be missed by everyone. — Varun Dhawan (@Varun_dvn) January 1, 2019\n#KaderKhan Saab was one of the finest actors of our country. It was a joy and a learning experience to be on the sets with him. His improvisational skills were phenomenal. His humour was eternal and original. He was a wonderful writer. We will miss him & his brilliance.🙏🙏 pic.twitter.com/m9z1yix9HB — Anupam Kher (@AnupamPKher) January 1, 2019\nAn actor and a writer who defined a generation.. You’ve left a void in the industry that cannot be filled..RIP #KaderKhan.. My heartfelt prayers to his family 🙏🏻 — Arjun Kapoor (@arjunk26) January 1, 2019\nRIP kader khan. by far one of the best writers we will ever have.\nkader khan wrote khuddar.\ni live by khuddar. — sujoy ghosh (@sujoy_g) January 1, 2019\nRIP . Kadar Saab . https://t.co/T4TVKx3vgE — Paresh Rawal (@SirPareshRawal) January 1, 2019\nRest in peace Kader khan saheb !! https://t.co/GHSqo0B6z9 — manoj bajpayee (@BajpayeeManoj) January 1, 2019", "title": "#RIPKaderKhan: Film Fraternity Pours In Condolence Messages For The Veteran Actor", "date_publish": "01/01/2019, 13:03:41", "description": "According to reports, Kader Khan reported the issue of breathlessness, after which the doctors reportedly transferred him from a regular ventilator to BiPAP ventilator. Khan's contribution to Hindi cinema also includes his writing for 250 movies. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/ripkaderkhan-film-fraternity-pours-in-condolence-messages-for-the-veteran-actor-359625.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/kader_khan_1546336773_800x420.jpg"}