{"text": "Riteish Deshmukh Wants People To Not Just Name Predators In #MeToo But Also Fight For Justice\nRiteish Deshmukh Wants People To Not Just Name Predators In #MeToo But Also Fight For Justice\nHousefull 4 was the first movie that was embroiled in the #MeToo controversy. It all started after Tanushree Dutta had levied sexual harassment allegations against Nana Patekar. While the entire nation was in shock, Nana Patekar along with the team flew to Jaisalmer to shoot for the movie.\nLater, a lot of other women also accused Sajid Khan of sexual harassment. After which, the shooting of the movie was stalled and Sajid Khan was replaced as the director.\nWhile Baahubali star Rana Daggubati replaced Nana Patekar, Farhad Samji stepped in the shoes of Sajid Khan as the director.\nSpeaking about #MeToo recently, Riteish Deshmukh has said that we need to move beyond naming people and rather take it forward.\nDon't Miss 2.4 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“I just feel that it (the movement) has started, which is fantastic, but I think it also needs to figure out a way so that it can find its way to justice, beyond just naming a person and saying that this is what it is. I think people also get lost as to how to take it forward. Be it court, police or whatever, one needs to figure out a way so that there’s certain justice given,” he was quoted as saying by Indian Express.\nAfter Sajid Khan was accused of sexual harassment, Riteish Deshmukh had tweeted, “Deeply disturbing to hear and read the news of so many women who had to go through these incidents of harassment in various fields. I think it’s extremely brave of every woman to have shared their stories. All need to be heard and not judged. I stand with them today. #MeToo.”", "title": "Riteish Deshmukh Wants People To Not Just Name Predators In #MeToo But Also Fight For Justice", "date_publish": "09/02/2019, 18:27:48", "description": "Speaking about #MeToo recently, Riteish Deshmukh has said that we need to move beyond naming people and rather take it forward. Speaking about #MeToo recently, Riteish Deshmukh has said that we need to move beyond naming people and rather take it forward.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/riteish-deshmukh-wants-people-to-not-just-name-predators-in-metoo-but-also-fight-for-justice-361865.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/riteish_deshmukh_wants_people_to_move_beyond_naming_people_in_metoo__fight_for_justice_1549716553_800x420.png"}