{"text": "1. In A Video Interaction With Indian Fans, Robert Downey Jr Says He's Going To Come To India Soon!\nI went to see the Robert Downey Jr video conference with @swatirish and it was totally awesome! When he appeared on screen, the entire theatre was screaming. It was crazy! Thank you @Marvel_India For making this possible and love you @RobertDowneyJr 💓 pic.twitter.com/NUmZn6uge2 — Rishab Karthik (@rishab_karthik) April 14, 2019\nRobert Downey Jr joined some of the Indian fans at a live-stream event via video conference. The man is currently in South Korea promoting the upcoming Avengers: Endgame there. As soon as he joined the live-stream, he was welcomed with deafening screams of fans that left him speechless, as per PTI.\nIt is said that the two stars of the entertainment industry who barely talk to each other now, were madly in love at one point in time. But because of Salman Khan’s violent behaviour, she called it quits.\n3. Cersei-Jamie Celebrating Rakhi To Jon Snow's Malhari Dance, This Desi GoT Spoof Is Everything!\nDon't Miss 264 SHARES 837 SHARES\nMaking a desi version of Game Of Thrones, Lilly Singh AKA Superwoman has made a hilarious spoof recently. From Cersei & Jamie Lannister celebrating Rakshabandhan to Jon Snow AKA Jatinder Snow dancing on Malhari, this one is will crack you up.\n4. 2019 Is The Year When It All Ends! It’s Time To Say Goodbye To Avengers, Game Of Thrones & Star Wars\nSo, 2019 is a big year on many fronts and there are a lot of things to look forward to. The current mood of the India revolves around Lok Sabha elections that will decide who will rule the largest democracy for next five years. But it’s not only the real-life that we are talking about. There is a lot going on in the world of films and Television as well.\n5. Comedian Ian Cognito Dies Onstage During Performance, Audience Thought It Was A Part Of His Set\nShortly after cracking a joke about having a stroke, Ian Cognito died on the stage, and it took five minutes for people to actually figure that he wasn’t joking as he fell silent. When the paramedics arrived, the comedian who was in his early 60s was pronounced dead.", "title": "Robert Downey Jr To Come To India Soon, Unseen Photo Of Salman-Aishwarya & More From Ent", "date_publish": "14/04/2019, 18:06:16", "description": "From Salman Khan and Aishwarya Rai’s unseen picture going viral social media to Robert Downey Jr saying he will come to India soon in an interaction with India fans ahead of Avengers Endgame release and Game Of Thrones premiering on April 14, here is all that rocked the world of entertainment today.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/robert-downey-jr-to-come-to-india-soon-unseen-photo-of-salman-aishwarya-more-from-ent-365443.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/robert_downey_jr_to_come_to_india_soon_unseen_photo_of_salmanaishwarya__more_from_ent_1555244600_800x420.png"}