{"text": "Robert Downey Jr And Mark Ruffalo Troll Chris Evans For His Struggles With Handling Technology\nRobert Downey Jr And Mark Ruffalo Troll Chris Evans For His Struggles With Handling Technology\nRobert Downey Jr. hilariously trolled his Avengers: Endgame co-star Chris Evans. After Chris Evans shared his dilemma of working with technology, RDJ trolled Chris and suggested he takes help from Iron Man's \"science bro\" Mark Ruffalo aka The Hulk.\nWe all know how Chris's character, throughout the MCU (Marvel Cinematic Universe) movies, has expressed the Grandpa within him when it came to his struggles with technology.\nTwitter\nTaking that similarity into consideration, Robert has teased Chris for being too much like his character in relation to modern technology.\nDear All Technology,\nRemember the 90’s when you just WORKED??? I don’t need a ‘smart’ feature on my TV, thermostat, lights, music, refrigerator, security cameras, and f-ing car. You’re a major pain in all of our asses. You’re not worth it.\nSigned,\nEveryone — Chris Evans (@ChrisEvans) January 7, 2019\nDon't Miss 264 SHARES 4.3 K SHARES 2.5 K SHARES 1.7 K SHARES\nComplaining about technology, Evans tweeted, \"Dear All Technology, Remember the 90's when you just WORKED??? I don't need a 'smart' feature on my TV, thermostat, lights, music, refrigerator, security cameras, and f-ing car. You're a major pain in all of our asses. You're not worth it. Signed, Everyone.\"\nThe funny part about this tweet is how similar Chris is to Captain America, with their inability to understand modern technology.\nhey @MarkRuffalo looks like Cap needs a little tutoring from the science bros. — Robert Downey Jr (@RobertDowneyJr) January 8, 2019\nCall or DM us whenever you need assistance, @ChrisEvans. Also language. — Mark Ruffalo (@MarkRuffalo) January 8, 2019\nIn response to Chris ranting about technology, Robert offered to help and asked Ruffalo to join the forces to help Cap. \"Hey, @MarkRuffalo looks like Cap needs a little tutoring from the science bros,\" he tweeted.\nFor the unversed, Ruffalo plays Bruce Banner aka The Hulk, and 'Science Bros' is an internet meme of his character's relationship with fellow scientist Tony Stark.\nMeanwhile, 'Avengers: Endgame' may be the last time that the audience sees Downey and Evans in an MCU movie as their contracts are over. The fantasy flick is slated to release on April 26.", "title": "Robert Downey Jr And Mark Ruffalo's Troll Chris Evans", "date_publish": "09/01/2019, 18:59:52", "description": "After Chris Evans shared his dilemma of working with technology, his 'Avengers: Endgame' co-star Robert Downey Jr trolled Chris and suggested he takes help from Iron Man's \"science bro\" Mark Ruffalo aka The Hulk. We all know how Chris's character, throughout the MCU (Marvel Cinematic Universe) movies, has expressed the Grandpa within him when it came to his struggles with technology.", "authors": [], "url": "https://www.indiatimes.com/entertainment/robert-downey-jr-and-mark-ruffalo-troll-chris-evans-for-his-struggles-with-handling-technology-360129.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/chris_evans_robert_downey_junior_1547039584_800x420.jpg"}