{"text": "Just like how Robert Downey Jr is witty in the Marvel cinematic universe, he is also known for his jokes in real life as well - -especially on social media. And it is no surprise that he often cracks a joke on his beloved friend Chris Evans.\nAlso Read: Save The Date! Avengers: Endgame Tickets Will Most Likely Go On Sale From April 21st In India\nRecently as well, they had a Marvel-ous Twitter exchange.\nBFFs let you share their umbrellas, right @ChrisEvans ? pic.twitter.com/1nJoJrFkZr — Robert Downey Jr (@RobertDowneyJr) March 13, 2019\nTechnically it’s YOUR umbrella. But I’m happy to hold it. https://t.co/tFqWFqCSv3 — Chris Evans (@ChrisEvans) March 13, 2019\nDon't Miss 264 SHARES 4.3 K SHARES 193 SHARES 8.1 K SHARES\nAlso Read: In A Video Interaction With Indian Fans, Robert Downey Jr Says He's Going To Come To India Soon!\nBut they both love each other to the core, we all know.\nHappy Valentine’s Day to all the shippers out there! ❤️😉 pic.twitter.com/VAVwRLDumo — Robert Downey Jr (@RobertDowneyJr) February 14, 2018\nBut did you know Robert Downey Jr once gifted his pal Chris Evans a customised 1967 Chevrolet Camaro, which features Captain America's shield at the centre of the steering wheel. How cool is that, right?\nWhat’s more? The car’s estimated value is $275,000, which roughly amounts to Rs 2 crores in Indian currency. Chris Evans shared the news when he appeared on Jay Leno’s Garage. He said it was a “a gift from Mr Robert Downey Jr.\"\nAlso, did you know it was Robert Downey Jr who convinced Chris Evans to sign multi-film contract with Marvel when he was almost on the verge of declining it. This friendship is for the keeps, right?\nAlso Read: King Of Spoilers, Mark Ruffalo Was Forced To Film Five Endings For 'Avengers: Endgame'\nTwitter\nWhile Robert Downey Jr gifted an expensive car to his friend Chris Evans, what’s the most expensive thing your BFF gifted you? Tell us in the comments section below.", "title": "Robert Downey Jr Once Gifted Chris Evans An Avengers - Themed Car Worth Rs 2 Crores!", "date_publish": "21/04/2019, 12:17:05", "description": "Did you know Robert Downey Jr once gifted his pal Chris Evans a customised 1967 Chevrolet Camaro, which features Captain America's shield at the centre of the steering wheel. How cool is that, right? The car’s estimated value is $275,000, which roughly amounts to Rs 2 crores in Indian currency. Chris Evans shared the news when he appeared on Jay Leno’s Garage. He said it was a “a gift from Mr Robe", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/robert-downey-jr-once-gifted-chris-evans-an-avengers-themed-car-worth-rs-2-crores-365834.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/robert_downey_jr_gifted_chris_evans_a_customised_1967_chevrolet_camaro_1555827899_800x420.png"}