{"text": "1. Robert Downey Jr Once Gifted Chris Evans An Avengers - Themed Car Worth Rs 2 Crores!\nBut did you know Robert Downey Jr once gifted his pal Chris Evans a customised 1967 Chevrolet Camaro, which features Captain America's shield at the centre of the steering wheel. How cool is that, right?\n2. Actress Saira Khan Of 'Kamasutra 3D' Fame Passes Away Following A Cardiac Arrest!\nActress Saira Khan who played the lead role in Kamasutra 3D is no more. The actress who shot to fame after having replaced Sherlyn Chopra in the controversial 2013 film died following a cardiac arrest on Friday morning, according to reports.\n3. As Avengers: Endgame Tickets Go On Sale In India, Websites Crash Because Of Mass Bookings\nDon't Miss 264 SHARES 4.3 K SHARES\nThe website of Bookmyshow crashed in some areas of the country because lots of people were trying to book their tickets at the same time apparently.\n“Having worked for over a period of 20 years with those experiencing anxiety, I can conclude that among other factors, it is the repetitive and relational nature of programs such as Friends and Big Bang Theory that will be doing the trick,” said linical psychologist, Marc Hekster as quoted by the Metro.\n5. The Most Successful Filmmaker Of Recent Times, KJo Might Witness His Biggest Flop With Kalank!\nA source from multiplex, according to Deccan Chronicle, said that Kalank is going to be another Thugs Of Hindostan, the movie for which Aamir Khan had to apologise to the audiences.", "title": "Robert Downey Jr's Gift To Chris Evans, Actress Saira Khan Passes Away & More From Ent", "date_publish": "21/04/2019, 19:36:25", "description": "From Robert Downey Jr gifting Chris Evans an Avengers-themed car to Kamasutra actress Saira Khan passing away following a cardiac arrest. Here’s all that rocked the world of entertainment. Actress Saira Khan who played the lead role in Kamasutra 3D is no more. The actress who shot to fame after having replaced Sherlyn Chopra in the controversial 2013 film died following a cardiac arrest on Friday", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/robert-downey-jr-s-gift-to-chris-evans-actress-saira-khan-passes-away-more-from-ent-365859.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/robert_downey_jr_gift_to_chris_evans_actress_saira_khan_passes_away__more_from_ent_1555853974_800x420.png"}