{"text": "Rohit Shetty Accepts He Fears Experimenting, Says His Small Films Won’t Be Successful Or Grand\nRohit Shetty Accepts He Fears Experimenting, Says His Small Films Won’t Be Successful Or Grand\nCan you even imagine a Rohit Shetty film without thrilling car chasing scenes, flying cars, expensive vehicles blowing up, and adrenaline pumping action scenes? You can’t right? Neither can we and nor can Rohit Shetty himself.\nHe is hailed as the man with the hit formula. He sure has a recipe for success with which he rules the box office with each of his releases. His films are massy and grand that most of the people in the country love and adore.\nTwitter\nKnown for his flamboyant style of over-the-top comedy and action, Rohit says it would be unfair if tomorrow he decides to make a smaller film \"just to prove a point\".\nTwitter\n“There is a fear of experimenting. I don't want to cheat my audience. When they come for my films, they know there will be songs, 'dialogue baazi', action, comedy. Tomorrow, if I make a small film just to prove my point, I don't want them to feel 'Oh we didn't spend the money to see this'. I am just worried about that,” he told PTI.\nTwitter\nThe man who is behind films including Golmaal and Singham says, “I know if I make a small film it will not be that successful or grand, which is fine, but I don't want anyone to get misguided and spend the money on me.”\nDon't Miss 7.9 K SHARES 2.9 K SHARES 184 SHARES 772 SHARES\nHe might have cracked the formula but he says it takes a lot of hardwork.\n“This is the most difficult genre to make. Great film shot in a room is easier but a mass film shot on a road, with 1800-2000 people shooting action is a lot of hardwork. It is sad that commercial cinema is looked down upon. A lot of hardwork goes into it.”\nYouTube\nRohit Shetty’s debut directorial Zameen (2003) that features Ajay Devgn didn’t work well at the box office. After that, he gave birth to multi-starrer comedy franchise Golmaal, after director Neeraj Vora gave him the idea of a comedy film.\n\"People used to say, 'He has taken an action hero, he himself is an action director and they are making a comedy which will be a disaster'. When 'Golmaal' released, life changed. The whole fear of failure went away from me by a large sense.\"\n“I am aware 20 per cent of the audience don't like this kind of cinema. Earlier, I used to feel 'It's ok' but now I want them by my side too. I would like when even they love my films,” says the director who is gearing up for the release of Simmba that stars Ranveer Singh and Sara Ali Khan.\nAP\n“There were times when I didn't care if a certain section of the audience or even critics didn't like my films. I was young, riding on a high after one or two successful films but then you become mature,” he adds.\nSimmba is scheduled to release on Dec 28.\nWith inputs from PTI", "title": "Rohit Shetty Accepts He Fears Experimenting, Says His Small Films Won’t Be Successful Or Grand", "date_publish": "20/12/2018, 16:20:49", "description": "Can you even imagine a Rohit Shetty film without thrilling car chasing scenes, flying cars, expensive vehicles blowing up, and adrenaline pumping action scenes? You can’t right? Neither can we and nor can Rohit Shetty himself. Can you even imagine a Rohit Shetty film without thrilling car chasing scenes, flying cars, expensive vehicles blowing up, and adrenaline pumping action scenes? You can’t ri", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/rohit-shetty-accepts-he-fears-experimenting-says-his-small-films-won-t-be-successful-or-grand-358977.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/rohit_shetty_accepts_he_fears_experimenting_says_his_small_films_wont_be_successful_or_grand_1545301881_800x420.jpg"}