{"text": "Rohit Shetty Donates Rs 51 Lakh From The Profits Of Simmba To Mumbai Police\nRohit Shetty Donates Rs 51 Lakh From The Profits Of Simmba To Mumbai Police\nWhen it comes to giving it back to the society, the Hindi film fraternity surely has its heart in the right place. Just a few days ago, the makers of Uri extended a donation worth Rs 1 crore towards the welfare fund of Army widows.\nThe makers of Simmba have extended a similar gesture as Rohit Shetty and the team handed over Rs 51 lakh to the Mumbai Police Foundation from the profits of his last film Simmba which was a blockbuster.\nTwitter\nIt was Mumbai Police's annual cultural festival Umang 2019 and the attendees of the prestigious function includes a lot of people from the industry including some of the biggest A-listers.\nInstagram\nRohit Shetty was accompanied by his actors Sangram Bhalerao AKA Simmba Ranveer Singh, Bajirao Singham AKA Ajay Devgn and Sooryavanshi AKA Akshay Kumar.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nThe cheque was handed over on behalf of his production house Rohit Shetty Picturez to the Commissioner of Police. The event was organized at Bandra Kurla Complex in Mumbai on 27th of January.", "title": "Rohit Shetty Donates Rs 51 Lakh From The Profits Of Simmba To Mumbai Police", "date_publish": "29/01/2019, 12:03:49", "description": "The makers of Simmba have extended a similar gesture as Rohit Shetty and the team handed over a Rs 51 lakh to the Mumbai Police Foundation from the profits of his last film Simmba which was a blockbuster. It was Mumbai Police's annual cultural festival Umang 2019 and the attendees of the prestigious function includes a lot of people from the industry including some of the biggest A-listers.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/rohit-shetty-donates-rs-51-lakh-from-the-profits-of-simmba-to-mumbai-police-361207.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/simmba_1548743901_800x420.jpg"}