{"text": "Royal And Intense: The Teaser Of Kalank Is Out And It's All About Grand Sets And Love!\nRoyal And Intense: The Teaser Of Kalank Is Out And It's All About Grand Sets And Love!\nAfter a long wait, Dharma productions dropped the teaser of their period drama Kalank today. In the teaser, the cast of Kalank is introduced in this order:\nFirst arrives Madhuri Dixit as Begum Bahar, then comes Sonakshi Sinha as Satya and Alia Bhatt as Roop is the final character to be introduced from the \"Women Of Kalank\" cast. Varun Dhawan is introduced next as the daredevil Zafar, who plays a bullfighter, followed by Aditya Roy Kapur's Dev Chaudhary and in the end, Sanjay Dutt's character as the \"formidable\" Balraj Chaudhary is introduced.\nThe teaser of Kalank will give you a major SLB Dejavu. Bhansali is someone who is a perfectionist in creating epic period dramas and Kalank looks like a reflection of all the films put together.\nDharma Productions\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe teaser is heavily dominated with two major dialogues: \"Kuchh rishte karzon ke tarah hote hain. Jinhe nibhana nahi, chukana padhta hai,\" and \"Jab kisi aur ki barbaadi jeet jaise laage... toh humse zyada barbaad aur koi nahi hai iss duniya mein,\"- and they speak a lot about the plot.\nWatch the teaser here!\nTrivia\nFor the uninitiated, the film was conceptualized by Johar and his father Yash Johar around fifteen years ago. Initially, Actress Sridevi was supposed to play the character which is now being played by Madhuri Dixit.\nProduction designer Amrita Mahal has worked on the set’s design and structure that represented old Delhi mohalla with a Mahal in Film City, Mumbai. The cost estimate of the set was reportedly ₹15 crore.", "title": "Royal And Intense: The Teaser Of Kalank Is Out And It's All About Grand Sets And Love!", "date_publish": "12/03/2019, 17:11:44", "description": "First arrives Madhuri Dixit as Begum Bahar, then comes Sonakshi Sinha as Satya and Alia Bhatt as Roop is the final character to be introduced from the \"Women Of Kalank\" cast. Varun Dhawan is introduced next as the daredevil Zafar, who plays a bullfighter, followed by Aditya Roy Kapur's Dev Chaudhary and in the end, Sanjay Dutt's character as the \"formidable\" Balraj Chaudhary is introduced.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/royal-and-intense-the-teaser-of-kalank-is-out-and-it-s-all-about-grand-sets-and-love-363598.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kalank_1552391032_800x420.jpg"}