{"text": "Baahubali is one of the most successful franchises of Indian Cinema and this is the reason why the popularity around the film still hasn't fizzled out. You must be living under the rock if you are unaware of the popularity of the franchise. The film broke all box-office records by crossing Rs 1,500 crore at the box office. The film is back in news and for another special reason.\n(Also read: 22 Reasons Why Baahubali Was 2015's Best Movie)\nTwitter\nThe Royal Albert Hall in London, England is all set to play one of India’s biggest blockbuster, Baahubali The Beginning starring Prabhas and Rana Daggubati. Royal Philharmonic Concert Orchestra’s conductor Ludwig Wicki announced through a statement on their official website.\nThis screening is part of their ‘Films in Concert series’.\nScreengrab\nAnother special thing about the screening is how MM Keeravani’s background score will be performed live by a full symphony orchestra. The dubbed Hindi version will be screened with English subtitles. As per the report, the date announced for the screening is October 19, 2019, at 7.30 pm.\nPinterest\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nHow much does one need to pay for the tickets?\nImage for representational purpose only.\nStandard Tickets: 15 to 85 pounds and there are grand tier hospitality which cost 3,108 pounds for 12 tickets.\nKids won't be allowed in the screening as it is strictly for persons above 15 years of age, announced the website.", "title": "Royal Albert Hall, London To Screen Baahubali: The Beginning With Live Orchestra In October 2019", "date_publish": "01/12/2018, 11:41:03", "description": "Baahubali is one of the most successful franchises of Indian Cinema and this is the reason why the popularity around the film still hasn't fizzled out. You must be living under the rock if you are unaware of the popularity of the franchise. The film broke all box-office records by crossing Rs 1,500 crore at the box office. The film is back in news and for another special reason.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/royal-albert-hall-london-to-screen-baahubali-the-beginning-with-live-orchestra-in-october-2019_-357697.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/baahubali_1543644921_800x420.jpg"}