{"text": "If you call yourself the biggest Marvel fan, you won’t cheat and ruin the film for others. Five-minute spoiler-heavy footage from Avengers: Endgame was leaked yesterday, and if you have watched mistakenly or willingly, you would not spread it and ruin it for others.\nThat’s exactly what Russo Brothers want from “the greatest fans in the world”.\nTwitter\nAlso Read: Avengers: Endgame Footage Leaked Online & Fans Are Taking Social Media Detox To Avoid Spoilers!\nFilmmaker duo Anthony and Joe Russo have appealed to the fans, asking them not to reveal spoilers from the upcoming film Avengers: Endgame for other people, hours after five-minute footage of the Marvel tentpole was leaked on social media.\nThe brothers on Wednesday started a campaign, #DontSpoilTheEndgame, on Twitter and posted a letter, addressed to the \"greatest fans in the world\".\nIn the letter, the Russo brothers thanked fans for their support for past 11 years of the Marvel Cinematic Universe. They promised that Endgame, which marks the culmination of the storyline of 22 films, will deliver a \"surprising and emotionally powerful conclusion to the Infinity Saga\".\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 446 SHARES\n\"Because so many of you have invested your time, your hearts, and your souls into these stories, we're once again asking for your help. When you see 'Endgame' in the coming weeks, please don't spoil it for others, the same way you wouldn't want it spoiled for you. Remember, Thanos still demands your silence,\" the letter read.\nLike true fans, stop spreading spoilers, please! Even after you have watched the movie on April 26, don’t ruin it for others.\nWith inputs from IANS", "title": "Russo Brothers Appeal To ‘Greatest Fans In The World’ To Not Spread Avengers: Endgame Spoilers", "date_publish": "17/04/2019, 13:26:53", "description": "If you call yourself the biggest Marvel fan, you won’t cheat and ruin the film for others. Five-minute spoiler-heavy footage from Avengers: Endgame was leaked yesterday, and if you have watched mistakenly or willingly, you would not spread it and ruin it for others. That’s exactly what Russo Brothers want from “the greatest fans in the world”.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/russo-brothers-appeal-to-greatest-fans-in-the-world-to-not-spread-avengers-endgame-spoilers-365611.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/russo_brothers_appeal_fans_to_not_spread_avengers_endgame_spoilers_1555487133_800x420.png"}