{"text": "Saif Ali Khan Wants To Milk Taimur's Popularity For Money, Kareena Asks Him To Stop Being Cheap\nSaif Ali Khan Wants To Milk Taimur's Popularity For Money, Kareena Asks Him To Stop Being Cheap\nKareena Kapoor and Saif Ali Khan’s son Taimur Ali Khan has become nation’s sweetheart. Whatever he does become news, his parents are very much aware of how crazy the world is for their little son.\nIn fact, recently even Ranveer Singh spoke about his obsession for Taimur, he even went on to say that he wants to work with him one day.\nWe have heard Bebo addressing the obsession of the world for his son, but this time Saif spoke about how he has been requested by his producers to use his son for promotions.\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nSaif who is busy with Bazaar promotions jokingly said how he is ready to sell his son Taimur's popularity but is wifey Kareena asked him to stop being cheap.\nIn an interview with RJ and anchor Sidharth Kanan, Saif said,\n“My wife says, ‘Don’t be so cheap. You can’t sell your son (Taimur)’. I am like, ‘Why not? Let’s sell him’. Seriously yaar, he is anyway there on the internet. I am just using this platform to say if anybody has any good nappy ads or anything... at a very reasonable price...it’s not reasonable, it’s quite expensive actually. And, I won’t give him the money also. I’ll give him some cash for his education, I am already giving it to him. And I’ll spend the rest!”.\nOur vote is with Saif.", "title": "Saif Ali Khan Wants To Milk Taimur's Popularity For Money, Kareena Asks Him To Stop Being Cheap", "date_publish": "29/10/2018, 13:35:40", "description": "Kareena Kapoor and Saif Ali Khan’s son Taimur Ali Khan has become nation’s sweetheart. Whatever he does become a news, his parents are very much aware of how crazy the world is for their little son. In fact, recently even Ranveer Singh spoke about his obsession for Taimur, he even went on and said he wants to work with him one day.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/saif-ali-khan-wants-to-milk-taimur-s-popularity-for-money-kareena-asks-him-to-stop-being-cheap-355642.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/taimur_ali_khan_1540800769_800x420.jpg"}