{"text": "Saif Wants To Make Bollywood A Safe Place For Women, Says There Shouldn't Be An Abuse Of Power\nSaif Wants To Make Bollywood A Safe Place For Women, Says There Shouldn't Be An Abuse Of Power\nThe current status of Bollywood is ironical for reasons more than one. While we boast of strong women characters and films that focus on women-led roles, it's heartbreaking to see how several women in the industry are coming up with accounts of facing sexual harassment in the industry.\nFor Actor-producer Saif Ali Khan, the fraternity members should make sure that the place is safe for women to work. Talking to IANS, Saif said,\nAgencies\n“Some ridiculous and inhuman things have happened in the past few years and I know that new talents might fear to step into the industry after knowing those stories of victims. But as a member of the fraternity, we have to make sure that women are treated with the utmost dignity and there is no abuse of power.\"\nHe further went on to share what makes him passionate and contend in his life. He added,\nAgencies\n\"I like my creative job as an actor. Playing a part in a good film, building a character from the scratch for a story to perform... Such an opportunity is rare and a blessing.”\nFor Saif, a life lived well with friends and family is important for him than running behind success. He said,\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nAgencies\n“I like small things in life -- like reading a good book in the evening while sipping the best whiskey and eating some good Chinese food. After a long working schedule, I want to spend time with my best friends and family for dinner and a small trip. Money cannot give the bonding and affection I share with my family.\"\nJust to jog your memory a little, Saif started his career in 1993. He began his journey with roles like Main Khiladi Tu Anari, Hum Saath-Saath Hain, Dil Chahta Hai, Parineeta, Kal Ho Naa Ho, Omkara, and Race. He says over the years his approach towards his craft has changed.\nAgencies\n“I’m reading books on acting too. Most of the time, I get it instinctively, but at times when I am stuck somewhere, the theory really helps to improve my craft. In Baazaar, I can see that my experience and understanding of craft is coming together as a performer. A good film director will direct his actor to the right direction but generally speaking, they cannot teach me how to act. They can give me some idea to execute my performance. I should know how to act. Having said that, I want to mention that discussing things with experienced people helped me to learn a lot about my craft,” he said.\nAs the son of iconic actress Sharmila Tagore, the learning started from home itself for Saif.\nAgencies\n“Ammi taught me to treat the camera like an observant woman who captures every single move very carefully. So as an actor, I do not have to go over-the-top all the time... My subtleness came from that. Mahesh Bhatt told me to keep it simple when in doubt. Sooraj Barjatya advised to let the background music do the work if I am confused as a performer.\"\nSaif, who is currently promoting Baazaar plays the role of a ruthless money-minded man. When Saif was further asked if his approach towards life and money is similar to the character he plays in the film, Saif said,\nAgencies\n“In a way, yes and no. My character in the movie wants money to protect his family and I as an individual believe that money is important to protect my family and to have a good life. But I do not think like him. He thinks that ‘Money is God’, and only money cannot give you happiness. That apart, there are differences between me and my character... I am a much more soft-spoken person.”\nThe film is all set to release on 26th October.", "title": "Saif Wants To Make Bollywood A Safe Place For Women, Says There Shouldn't Be An Abuse Of Power", "date_publish": "17/10/2018, 16:49:39", "description": "Saif Ali Khan says stories of abuse of power in Bollywood could scare newcomers Saif Ali Khan says Bollywood needs to become a safer place for women to work. The recent reports of abuse of power and sexual harassment could mean newer talent fearing stepping into the industry.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/saif-wants-to-make-bollywood-a-safe-place-for-women-says-there-shouldn-t-be-an-abuse-of-power-354974.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/saif_ali_khan_1539776366_800x420.jpg"}