{"text": "Saif Ali Khan Was Sceptical About Doing Sacred Games Because Of Nawazuddin's Character & We're Not Surprised\nSaif Ali Khan Was Sceptical About Doing Sacred Games Because Of Nawazuddin's Character & We're Not Surprised\nRemember the time when the first season of Sacred Games had released? From social media to dining table discussions, India’s Netflix original show that enthralled the audiences was the talk of the town for several weeks. So much so, that those who hadn’t watched the show felt left out and had to eventually give in to the peer pressure.\ndailypioneer.com\nBut can you tell as to who’s your favourite character on the show? Ganesh Gaitonde played by Nawazuddin Siddiqui sure, is the heart and the soul of the show. But you wouldn’t disagree that the supporting characters including that of Bunty or Kukko gave exceptional performances too.\nnypdecider.files.wordpress.com\nAnd that is one thing that Saif Ali Khan, who plays the role of Sartaj Singh on the show, had also realised when he read the script of the show.\nDon't Miss 862 SHARES 183 SHARES 406 SHARES\n“I felt like he (Sartaj Singh) is getting slapped by everybody. What’s happening? Some second rate thug Bunty is jhaaping him. I got irritated. But it takes time. And if you see the show and I saw it much later... I asked him, ‘Are you sure you want me to do this role because this other guy has such a fun colour?’ and I was told that those things are true but we have seen that before.\nHe says he was sceptical about doing this role.\n“So I said to myself that ‘just be confident’. Sartaj is a fascinating character. He’s holding the show forward. Technically, the show is not moving forward without him. He is the soul and grounds it. And then, you need something to believe in otherwise everyone can be immoral.”\nPTI\nSaif Ali Khan agrees that Sartaj Singh has been a very different role for him, especially in terms of responsibility.\n“The idea was not to get tensed that the other guy is seeming to get all the attention but just more attention. And on a deeper level, and enough journalists have said it to me to get my justification -- that it is Sartaj’s show.\nmafab.hu\n“He could have easily been this gun-toting cop but he’s not. He’s screwed on every level in his personal life. He’s trying to commit suicide, maybe by drinking the drain cleaner. Everyone is hitting and punching him, he’s so down. Perhaps that’s what made us feel that he’s different. I think the fact that I did it and did it quite willing to get slapped made a difference.”\nAlso Read: Sacred Games To Baazar, Saif Ali Khan Feels He Is Better Than Ever As An Actor & We Completely Agree\nWith inputs from IANS", "title": "Saif Ali Khan Was Sceptical About Doing Sacred Games Because Of Nawazuddin's Character & We're Not Surprised", "date_publish": "25/10/2018, 12:44:18", "description": "Saif Ali Khan, who plays the role of Sartaj Singh on the show, said that he was doubtful about playing Sartaj Singh in Netflix India's original show Sacred Games. “I felt like he (Sartaj Singh) is getting slapped by everybody. What’s happening? Some second rate thug Bunty is jhaaping him. I got irritated. But it takes time. And if you see the show and I saw it much later... I asked him, ‘Are you s", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/saif-ali-khan-was-sceptical-about-doing-sacred-games-because-of-nawazuddin-s-character-we-re-not-surprised-355416.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/saif_ali_khan_was_doubtful_about_doing_sacred_games_because_of_nawazuddin_siddiquis_character_1540449877_800x420.jpg"}