{"text": "Saif Ali Khan Is Stunned Seeing Taimur’s Doll, Feels He Should Trademark His Son's Name\nSaif Ali Khan Is Stunned Seeing Taimur’s Doll, Feels He Should Trademark His Son's Name\nWhat’s happening around the world? Many are dreading an apocalypse. California wildfires caused immense destruction leaving many homeless and worried. Pollution of all sorts, particularly that in air, is making it difficult for people to even breathe. So much so, that life expectancy has decreased by 10 years! Deadly diseases like Cancer is gripping many people, including celebrities like Nafisa Ali, Irrfan Khan and Sonali Bendre.\nWhile scientists are looking for life on other planets, people in India cannot stop obsessing over Saif Ali Khan and Kareena Kapoor’s son Taimur Ali Khan. He seldom fails to make headlines. This time, the cute little toddler is making news because of the chubby-cheeked, blue-eyed, adorable 54 cm tall doll that is inspired by the tiny tot.\nIf you were living under the rock for past couple of days, a quick Google search is enough to enlighten you on the fact that a doll called ‘Taimur Baba Doll’ is available on First Cry.\nYes, tt’s a crazy, scary and creepy world that you are living in!\nPeople were stunned when this was first pointed out by producer Ashvini Yardi, who shared it from Kerala on her Twitter handle. It left us all creeped out.\nMeanwhile at a toy store in Kerala... pic.twitter.com/J2Bl9UnPdT — Ashvini Yardi (@AshviniYardi) November 19, 2018\nNo dearth of fools in the Country https://t.co/Tm7UysmBMx — Kunal kothari (@kunalchor) November 20, 2018\nDon't Miss 2.4 K SHARES 1.1 K SHARES 263 SHARES 707 SHARES\nSaif Ali Khan has often talked about how he doesn’t understand people’s obsession over Taimur. He has also expressed his worry on wanting him to lead a normal life and childhood. Paparazzi has been requested to not click his photographs, which Saif knows cost Rs 1500 per picture. He is apparently at the top spot in the rate card, Saif had revealed on Koffee With Karan.\nNever liked or supported a single troll on Saif's son Taimur.\nHe s just a baby who doesn't know what's happening around him..\nIts creepy and disgusting to see people making toys of him just for their fun https://t.co/2kf8Wpakjp — Srikar (@cheeku1896) November 20, 2018\nAfter knowing that a doll in the name of Taimur is being sold. He was of course, stunned.\n“Maybe I should trademark his name… The least they could do is send me one!. I am glad people are benefiting from him. I only ask God for his safety and happiness in return,” he told Hindustan Times.\nWhen will this madness come to and end?!", "title": "Saif Ali Khan Is Stunned Seeing Taimur’s Doll, Feels He Should Trademark His Son's Name", "date_publish": "21/11/2018, 12:54:06", "description": "After knowing that a doll in the name of Taimur Ali Khan is being sold. Saif Ali Khan was of course, stunned. He said he is thinking of registering a trademark in his name. Saif Ali Khan has often talked about how he doesn’t understand people’s obsession over Taimur. He has also expressed his worry on wanting him to lead a normal life and childhood. Paparazzi have been requested to not click his p", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/saif-ali-khan-is-stunned-seeing-taimur-s-doll-feels-he-should-trademark-his-son-s-name-357083.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/taimur_ali_khan_doll_1542782984_800x420.png"}