{"text": "In the wake of #MeToo Movement, Sajid Khan too has been accused by three women for sexually harassing them. He was even asked to step down from Houseful 4 as a director. Till now there is no clarification from him about the allegations charged against him.\nTwitter\nBut there is one old interview of the filmmaker that is going viral, where he is seen speaking about how bad he was in his relationships and ill-treated women in his life.\nSajid says,\n“Out of so many relationships that I have learned that I was a big dog in my twenties. I was a very 'kamina' aadmi. I have broken a lot of hearts. I have lied. I have cheated and deceived like most of the guys do. But I was on a television and I was getting successful. I was treating women very badly.\"\nTwitter\nHe even justified himself by saying that filmmaking made him more focused, “All the nice girls in my life, I have treated them very bad in my twenties. In my thirty somewhere, I started concentrating on my film-making. so, when you start making films, you don't mentally start getting attracted to women.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nNow whether Sajid Khan comes out and apologise for what he has done or not, only time will tell.", "title": "Sajid Khan Called Himself A Dog & Admitted He Has Mistreated Women In This Old Interview!", "date_publish": "17/10/2018, 16:59:12", "description": "In the awake of MeToo Movement Sajid Khan too has been accused by three women for sexually harassing them. He was even asked to step down from Houseful 4 as a director. Till now there is no clarification from him about the allegations charged against him. But there is one old interview of the filmmaker that is going viral, where he is seen speaking about how bad he was in his relationships and i", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sajid-khan-called-himself-a-dog-admitted-he-has-mistreated-women-in-this-old-interview-354965.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sajid_1539770959_800x420.jpg"}