{"text": "Speaking about her own mother, yesteryear actress Tanuja, to an online portal, Kajol says, \"I was petrified of her. I wouldn't put one toe out of line if I knew she didn't approve of it.\"\nHe could be seen crying with wife Hailey Baldwin inside the car. In the video, Justin can be seen having an intense conversation with Hailey and continuously rubbing his eyes. While Justin couldn't hold back his tears, Hailey looks calm and stone faced.\nDon't Miss 862 SHARES 346 SHARES\nWhile actresses are sharing their horrific experiences, many actors are supporting the movement. Speaking to a leading publication, Bollywood actor Emraan Hashmi talks about having an open dialogue with his female co-stars, writer and director before doing an intimate scene.\nFinally he goes “listen no one has a problem with these things” (and obviously named people) and that if I could seduce him in 5 mins the role was mine.\nHow this ended was me saying that I didn’t come mentally prepared for this and I left his house! — Rachel White (@whitespeaking) October 11, 2018\nSajid has not personally addressed the issues one by one but has stepped down as the director of Housefull 4. He further says that this in no ways means he admits the charges but has left the mid way as there is immense amount of pressure on his family.\nSpeaking to a leading channel, The Bhabhiji Ghar Par Hai actress said,\n“It's rubbish. You have to take a call that time only, it's simple. You should speak about that matter that time only. Even I got a lesson. Jab hota hai, tabhi bolo - baad mei bolne ka koi faayeda nahi, it's useless. Baad mei aap voice raise karte ho, usko koi nahi sunega, just controversy hogi – nothing else. You have to take a call that time only when it happens and obviously, you need power.”", "title": "Sajid Khan Faces Heat After Sexual Harassment Charges, Justin Bieber Spotted Crying & More From Ent.", "date_publish": "12/10/2018, 18:17:00", "description": "In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.In case you missed it.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sajid-khan-faces-heat-after-sexual-harassment-charges-justin-bieber-spotted-crying-more-from-ent-354675.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/entertainment_1539343483_800x420.jpg"}