{"text": "Ranveer Singh's fan following is expanding massively and his back to back hit films have definitely played a major role. Apart from being everyone's favourite, Singh has found a new fan in Hollywood legend Will Smith.\nInstagram\nPraising his portrayal of the character 'Murad', Will Smith had showered praises on reel Gully Boy, Ranveer Singh.\nSmith took to Instagram to praise Singh's performance in Gully Boy. He said,\n“Yo, Ranveer. Congrats Man. I’m loving what you’re doing with Gully Boy. For me, old school hip hop it is and I’ve seen hip hop all over the world and I’m loving it (Gully Boy) Man. Congrats, Go Get them!.\"\nReacting to these compliments, an elated Ranveer Singh took to his social media accounts to thank him in his own way! Sharing Smith's videos, he wrote, “Shoutout from the original rapper slash actor - BIG WILLY! RESPECT,” he wrote in the first and in the second one, he wrote,\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nScreengrab\nInstagram Screengrab\n“SALAAM TUMKO BADE BHAI! BOHT HARD.”\nWell, Singh definitely deserves all the appreciation coming his way because as Murad, he was indeed 'Bahot hard'!", "title": "Salaam Tumko Bade Bhai! Ranveer Singh Responds To Will Smith's Praises For 'Gully Boy'", "date_publish": "17/02/2019, 11:22:38", "description": "Ranveer Singh's fan following is expanding massively and his back to back hit films have definitely played a major role. Apart from being everyone's favourite, Singh has found a new fan in Hollywood legend Will Smith. Praising his portrayal of the character 'Murad', Will Smith showered praises on reel Gully Boy Ranveer singh.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/salaam-tumko-bade-bhai-ranveer-singh-responds-to-will-smith-s-praises-for-gully-boy-362294.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/ranveer_singh_gully_boy_1550383025_800x420.jpg"}