{"text": "Salim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's Show\nSalim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's Show\nEveryone knows the kind of popularity Bollywood superstar Salman Khan enjoys in our country. When he walks into any red carpet event, wedding or silver screen, his fandom increases by leaps and bounds. Some people watch Bigg Boss year after year only to catch a glimpse of the actor during Weekend Ka Vaar.\nTwitter\nAnd this is exactly what happened when he walked into The Kapil Sharma Show. The first episode that aired on Saturday featured the three Khan brothers - Salman, Arbaaz and Sohail.\nTwitter\nThe trio left the audience in splits with their varied reactions especially when Krushna came to flirt with Salman. But on Sunday's episode, all eyes moved from Salman Khan to his father Salim Khan.\nDon't Miss 862 SHARES 346 SHARES 812 SHARES\nYes, those of you who saw the episode exactly know how hilarious he was with his anecdotes and story telling. So let's take you through the highlights of the episode and how Salim Khan proved he's really the baap of all things COOL.\nTwitter\n1. Salim Khan spilled the beans about how there was a man named Ganesha who was given way more importance than Salim Khan himself. Whenever he walked into his own house, he saw Ganesha being served tea, coffee, snacks, lunch. Wondering what makes him special, he asked his wife if he's related. To his surprise, Salma said, \"He's the man who leaks the question papers for our sons and that's why the special treatment.\"\nTwitter\n2. Salim Khan spoke about how Arbaaz was confused about his profession\". Despite having singing classes, Arbaaz wasn't sure if he wanted to pursue that. After listening to him a couple of times, Arbaaz asked dad, if he should continue with his singing or cricket. To which Salim Khan replied, \"Cricket.\" Surprised Arbaaz asked, \"But have you seen me play the sport\", Salim Khan said, \"No, but I have heard you sing! Needless to say, the audience cracked up!\nTwitter\n3. Salim Khan narrated how he once gave his car keys to a guy thinking he was a driver. After he hit his car and his bus for two days, the man confessed he had come home for a job of a cook. But kyunki Salim saab ne poocha nahi toh usney bataya nahi!\nMan'O'Man @KapilSharmaK9 has really come back with a bang! Last night show was stupendous and now enjoying tonight's show with @BeingSalmanKhan's Khandaan With Kapil Sharma! 😍 pic.twitter.com/nebCWj5br2 — Ravi Kapoor ☯️ (@RaviKapoor) January 6, 2019\n4. Salim saab also revealed how the servants in their house are not on the basis of their qualification but because no one else will give them work outside. The help that his wife Salma Khan got from the time of her marriage continues to be with the Khan family. In fact, he even came to the show.\nIt is safe to say that last night episode was a cracker and Salim Khan proved he's a true legend of the Hindi film industry. And it's not just me, social media too tagged it as the best episode ever.\nTake a look.\nThe Best Episode of KAPIL SHARMA’s Show ! Salim Uncle you are the real legend of Hindi Film Industry. Ye Sunday to Bahut special raha with Khan daan.. @luvsalimkhan @BeingSalmanKhan @KapilSharmaK9 #TheKapilSharmaShow #SalimSahabOnKapilSharmaShow pic.twitter.com/AGCD1mgq0k — 😘Happy Birthday HunK 🍰🎁 (@maskedhammsagar) January 6, 2019\nMere Life। Ka Sabse acha Show\nAaj Ka episode\nLove u Kapil paji @KapilSharmaK9\nLove u Salman sir\nAap 3 Bhai Bollywood k Jan hai@luvsalimkhan @BeingSalmanKhan #TheKapilSharmaShow #SalimSahabOnKapilSharmaShow — Rohit Kumar🗨️ (@Rohitofficial19) January 6, 2019\nThank @KapilSharmaK9 and @SonyTV ... for last night entertaining show ... great show most entertaining show ever.. #SalimSahabOnKapilSharmaShow — Team_Salman Khan (@Team_SalmanKhan) January 7, 2019\nToday saw d beauty of family love n bondness.. the great man with great teaching..\"give luv to ur servants equal to family\" thanks @KapilSharmaK9 sir to bring entire Khandan together.. best ever episode with @luvsalimkhan @BeingSalmanKhan #SalimSahabOnKapilSharmaShow — Rohit (@rosky_hit) January 6, 2019\n@BeingSalmanKhan @KapilSharmaK9 @arbaazSkhan @SohailKhan i cudnt stop my laughter tiday. Wat timing of mr #SalimSahabOnKapilSharmaShow ..mindboggling....wanted to hear him again and again. Plz call him again on ur show..wat sense of timing! Best episode so far....👍👍 — Deepika chaturvedi (@Deepikachatur14) January 6, 2019", "title": "Salim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's Show", "date_publish": "07/01/2019, 11:11:38", "description": "Salim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's ShowSalim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's ShowSalim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's ShowSalim Khan Steals The Show From His Sons Salman, Arbaaz & Sohail In Kapil Sharma's ShowSalim Khan Steals The Show From His Sons Salman, Arb", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/salim-khan-steals-the-show-from-his-sons-salman-arbaaz-sohail-in-kapil-sharma-s-show-359959.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/salim_khan_1546840831_800x420.jpg"}