{"text": "“I mean, are you guys who say Virat is better than Sachin really cricket fans or mere accountants? B***** one straight drive by Sachin is more beautiful and valuable than any shot ever hit by Virat”\nYes, those of you who saw the episode exactly know how hilarious he was with his anecdotes and story telling. So let's take you through the highlights of the episode and how Salim Khan proved he's really the baap of all things COOL.\nHe joked that from here on out, he will be \"cornering the market\" on playing \"charisma-free a**holes,\" adding, \"What do you think, Mitch McConnell (politician) next?\"\n\"Thank you to Satan for giving me inspiration on how to play this role,\" he added.\nAccording to a Deccan Chronicle report, Deepika Padukone has been offered to play the role of Ranveer Singh's onscreen wife in Kapil Dev's biopic 83. Helmed by Kabir Khan, the film will majorly revolve around the 1983 World Cup. A source is quoted in the report as saying,\n\"My only attempt is to keep surprising the audience. I want to be honest to a character that I play. I have started, I might fall, might get up, then again fall and rise and this will continue to happen. But I will never stop trying.\"\nDon't Miss 862 SHARES", "title": "Salim Khan Steals The Spotlight At TKSS, Internet Slams Hardik Pandya For Creepy Comments & More From Ent.", "date_publish": "07/01/2019, 17:49:36", "description": "Salim Khan Steals The Light At TKSS, Twitter Slams Hardik For Creepy Comments & More From Ent.Salim Khan Steals The Light At TKSS, Twitter Slams Hardik For Creepy Comments & More From Ent.Salim Khan Steals The Light At TKSS, Twitter Slams Hardik For Creepy Comments & More From Ent.Salim Khan Steals The Light At TKSS, Twitter Slams Hardik For Creepy Comments & More From Ent.Salim Khan Steals The Li", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/salim-khan-steals-the-spotlight-at-tkss-internet-slams-hardik-pandya-for-creepy-comments-more-from-ent-360007.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/wrap_1546864134_800x420.jpg"}