{"text": "Salman Makes A 'Dabangg' Entry At Akash-Shloka Wedding & Gets A Warm Welcome From Ranveer!\nSalman Makes A 'Dabangg' Entry At Akash-Shloka Wedding & Gets A Warm Welcome From Ranveer!\nAkash Ambani and Shloka Mehta's wedding was no less than a star-studded Bollywood Gala. On March 9, several celebrities walked inside the World Centre in Bandra Kurla Complex to congratulate the couple.\nPresent at the wedding were Shah Rukh Khan, Karan Johar, Alia Bhatt, Ranbir Kapoor, Deepika Padukone, Amitabh Bachchan, Kareena Kapoor Khan, Sachin Tendulkar, Yuvraj Singh, Hardik Pandya, Google CEO Sundar Picchai, Uddhav Thackeray, Aaditya Thackeray and several others.\nAll the celebrities turned into Baraatis to welcome the new bride!\nSalman being Salman arrived late for the ceremonies that evening but something very sweet happened! A video that has resurfaced on the internet has Salman Khan walking in and arriving in his 'Dabangg' style and he is seen being greeted by an excited Ranveer Singh.\nTwitter\nBoth the stars shared pleasantries and hugged each other! The video is winning the internet and we are not surprised.\nWith the kind of popularity that both the actors proudly boast of, we wonder why Bollywood is still not casting them together. They would be a dream team and we are ready to bet our money on them, isn't it?\nDon't Miss 812 SHARES 184 SHARES 544 SHARES 3 K SHARES 403 SHARES", "title": "Salman Makes A 'Dabangg' Entry At Akash-Shloka Wedding & Gets A Warm Welcome From Ranveer!", "date_publish": "11/03/2019, 17:43:17", "description": "Salman being Salman arrived late for the ceremonies that evening but something very sweet happened! A video that has resurfaced on the internet has Salman Khan walking in and arriving in his 'Dabangg' style and he is seen being greeted by an excited Ranveer Singh.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/salman-makes-a-dabangg-entry-at-akash-shloka-wedding-gets-a-warm-welcome-from-ranveer-363536.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/salman_khan_1552306641_800x420.jpg"}