{"text": "Salman Khan’s Doppelganger Spotted In Karachi & His Uncanny Resemblance Will Leave You Stunned!\nSalman Khan’s Doppelganger Spotted In Karachi & His Uncanny Resemblance Will Leave You Stunned!\nWe don’t know whether it would be cool or spooky to meet your own doppelganger, but people often find celebrity doppelgangers amusing. The similarity in their looks never fails to amuse us.\nTwitter\nFrom Priyanka Chopra to a desi Tyrion Lannister, fans have seen it all. Or maybe not. Recently, Salman Khan’s doppelganger was spotted in Karachi, Pakistan, and his uncanny resemblance to the Dabangg Khan has left people dumbfounded.\nMeanwhile on Facebook, Salman Khan in Bolton Market , Karachi 😊 pic.twitter.com/nEsBAexjXF — arshad syed (@arshadsyed001) January 19, 2019\nNot only is he similar in looks but also in his mannerism, right? From hairstyle to clothing, the similarity can’t be ignored.\n@BeingSalmanKhan\nBhai what are you doing in Karachi Bolton Marley. ;) pic.twitter.com/2SxgygdePr — Raza (@sarabidi1) January 19, 2019\nDon't Miss 812 SHARES 763 SHARES 3 K SHARES 4 K SHARES 449 SHARES\nDuplicate Salman Khan in Karachi https://t.co/xfPHMefnvk — Tameezuddin (@imTameez) January 19, 2019\nEarlier, Kit Harington AKA Jon Snow and Jason Momoa’s doppelgangers were also spotted in Pakistan. Well, the resemblance is striking, don’t you agree?", "title": "Salman Khan’s Doppelganger Spotted In Karachi & His Uncanny Resemblance Will Leave You Stunned!", "date_publish": "19/01/2019, 19:02:55", "description": "From Priyanka Chopra to a desi Tyrion Lannister, fans have seen it all. Or maybe not. Recently, Salman Khan’s doppelganger was spotted in Karachi, Pakistan, and his uncanny resemblance to the Dabangg Khan has left people dumbfounded. Not only is he similar in looks but also in his mannerism, right? From hairstyle to clothing, the similarity can’t be ignored.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/salman-khan-s-doppelganger-spotted-in-karachi-his-uncanny-resemblance-will-leave-you-stunned-360720.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/salman_khans_doppelganger_spotted_in_karachi__his_uncanny_resemblance_has_left_people_stunned_1547904121_800x420.png"}