{"text": "1. Salman Khan Mimics Sanjay Dutt To Narrate How He Tried To Convince Him For Marriage & It’s Epic\n“Sanju baba mujhe convince kar rahe the ki Bhaijaan, you should get married, bro. Phone ki ghanta bhi baj rahi thi unki. When you come from shooting, you’re tired, your wife is there to comfort you. His phone again rings. Shaadi na is like the best thing in the world. Bhaijaan, one second my wife is calling me,” he says.\nIf all works out well, we will see Kiara romance Kartik Aaryan in a film directed by Imtiaz Ali and it all sounds perfect, doesn't it?\n3. After Katrina Kaif's Exit, Sara Ali Khan Reportedly Roped In Opposite Varun Dhawan In A Dance Film\nShe won people's hearts during Simmba promotions and proved she's down to earth just like all of us. And then her movies arrived with Kedarnath and Simmba. The actress created fireworks with her performance and the audience has welcomed her into the world of Bollywood.\nDon't Miss 207 SHARES 174 SHARES\n4. 41 Films & A Father-Son Relationship, Govinda Pays A Heartfelt Tribute To His Ustaad Kader Khan\nAmong other actors who grieved the death of the veteran star was Govinda, who has worked with Kader Khan in many films. They shared an amazing camaraderie and together, they tickled our funny bones too. Bidding him goodbye, Govinda paid a heartfelt tribute to Kader Khan.\n5. Janhvi Kapoor Revisits The Time When Lost Her Mother And How Arjun Kapoor Helped Her Cope Up\n“I think, I was still in that state of shock, to be very honest. I think I am still in shock. None of it has been processed. Like, I have no memory of three or four months. You know at the end of the day, we have the same blood in us. I don't remember anything of those four months but I do remember that one day when we were sitting in Harsh (Anil Kapoor's son) Bhaiya's room and Arjun Bhaiya and Anshula (Arjun Kapoor's sister) Didi came in -- I think that was the one day when I felt like, 'Ok maybe we might be okay.\"", "title": "Salman Khan Mimics Sanjay Dutt, Sara Ali Khan Might Star In A Dance Film With Varun Dhawan & More From Ent", "date_publish": "02/01/2019, 18:54:47", "description": "From Salman Khan mimicking Sanjay Dutt to reveal how he tried to convince him to get married, on The Kapil Sharma Show to rumours being afloat that Sara Ali Khan will star alongside Varun Dhawan in a dance film, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/salman-khan-mimics-sanjay-dutt-sara-ali-khan-might-star-in-a-dance-film-with-varun-dhawan-more-from-ent-359722.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/salman_mimics_sanjay_dutt_sara_might_star_in_a_dance_film_with_varun_dhawan__more_from_ent_1546432159_800x420.png"}