{"text": "Salman Khan Begins Shooting For Dabangg 3 And Obviously, Chulbul Pandey Fans Can't Keep Calm!\nSalman Khan Begins Shooting For Dabangg 3 And Obviously, Chulbul Pandey Fans Can't Keep Calm!\n10 years after Wanted, which was a blockbuster, Salman Khan and Prabhu Deva have reunited for another interesting project. The team has begun shooting the third part in the Dabangg film series in Indore today.\nIn one of the pictures, Salman even teased his fans with a picture of his sunglasses positioned in Chulbul Panday's style.\n\"Day1... Dabangg 3,\" Salman Khan captioned the post.\nThe team announced the news of the commencement of the shoot by sharing a video of Salman and Arbaaz Khan from Indore. They captioned the post as:\n\"Back in our birthplace for Dabangg 3 shoot.\"\nIt is reported that Dabangg 3 will be helmed by choreographer and filmmaker Prabhu Dheva. The first installment of the movie series Dabangg, which released in 2010, was directed by Anurag Kashyap while Dabangg \" was directed by Arbaaz Khan.\nDabangg is Salman's hit franchise that revolves around the life of Chulbul Pandey, a police officer who has his own way of dealing with corruption. The franchise also stars Sonakshi Sinha, Arbaaz and Mahie Gill in key roles.\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES\nThe fans are obviously excited for Chulbul Pandey's comeback and here are the first reactions.\n😘😘😘😘 All the best 👍Super 👌👍✌😎 pic.twitter.com/NfkfIXvWBk — RocKy Edwαrd 💙🇮🇳🏏 (@imRockylahariya) March 31, 2019\nOne more Blockbuster INSHA ALLAH #Dabangg3\nJeete Hai Shaan se #SalmanKhan Fan ke naam se\nWe Luv u @BeingSalmanKhan Till Our Lst Brth pic.twitter.com/LNu2cHAKfP — SHAHID Sᴀʟᴍᴀɴɪsᴛᴀɴ (@SSALMANISTAN) March 31, 2019\nGood luck Bhai... and Bade Bhaia... #Dabangg3 — Rohit Jaiswal (@rohitjswl01) March 31, 2019\nWishing you & the team all the very best for this venture. Awaiting the return of Chulbul Pandey :) #Dabangg3 — Deνιℓ (@ibeingdevil) March 31, 2019", "title": "Salman Khan Begins Shooting For Dabangg 3 And Obviously, Chulbul Pandey Fans Can't Keep Calm!", "date_publish": "01/04/2019, 15:12:16", "description": "10 years after Wanted, which was a blockbuster, Salman Khan and Prabhu Deva have reunited for another interesting project. The team has begun shooting the third part in the Dabangg film series in Indore today. In one of the pictures, Salman even teased his fans with a picture of his sunglasses positioned in Chulbul Panday's style.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/salman-khan-begins-shooting-for-dabangg-3-and-obviously-chulbul-pandey-fans-can-t-keep-calm-364676.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/salman_khan_1554111934_800x420.jpg"}