{"text": "Salman Khan is fondly known as Bhai but there are more reasons why he deserves this title. For many, he has been the Bollywood godfather. He has been a launchpad for several star kids. From launching his brother-in-law Aayush Sharma to Suniel Shetty’s daughter Athiya Shetty, Salman Khan has always given preferences to his friends' kids.\nAgencies\nAnd now, Salman's next target is to launch his bodyguard Shera's son Tiger. In an interview with Times of India, Bhai said,\nTwitter\n“Shera’s son Tiger is being groomed right now and he’s already being considered by so many producers and directors. Shera feels I will be the best judge of a script for his son, so I am now sifting through scripts. I am yet to find something worthy.”\nSalman also added that it's not an easy way for the star kids.\nSalman with Shera\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES\nIf he launches someone, he says that there is a lot of hard work and dedication that needs to be shown from their end too. Not many know that before he launched his brother-in-law, he had also assisted him in films like Bajrangi Bhaijaan, Tubelight, and Sultan.\nFrom traveling extensively with them to being actively involved with acting and dance classes, these people have to go through an extensive training process. He added,\nPinterest\n“The thing is, these are the boys I see and meet. They work really hard to get a nod from me. They work on presenting themselves well and everything that goes with it, because it matters. And mind you, I have many friends, but that doesn’t mean I am launching everyone’s kids.\"\nCurrently, Salman is bust promoting Notebook, that stars debutants Zaheer Iqbal, son of Bhai’s builder buddy Iqbal Ratnasi, and Pranutan Bahl, granddaughter of yesteryear actor Nutan. The film is all set to release on 29 March.", "title": "Salman Khan Confirms He'll Be Launching His Bodyguard Shera's Son Tiger Next!", "date_publish": "28/03/2019, 13:49:34", "description": "Salman Khan, Salman Khan's Bodyguard, Salman Khan's son Shera, Shera, Salman Khan's Shera, Shera IndiaSalman Khan, Salman Khan's Bodyguard, Salman Khan's son Shera, Shera, Salman Khan's Shera, Shera IndiaSalman Khan, Salman Khan's Bodyguard, Salman Khan's son Shera, Shera, Salman Khan's Shera, Shera India", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/salman-khan-confirms-he-ll-be-launching-his-bodyguard-shera-s-son-tiger-next-364459.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/salman_khan_1553759311_800x420.jpg"}