{"text": "When it comes to cop-dramas, Bollywood surely has its game up. It's a formula that has hardly failed.\nWith films like Shool, Khakhee and Aan, the trend sort of started picking up and we're in 2019 and it is Rohit Shetty who is exploiting the formula in best of his capacity.\nShemaroo\nBollywood has utilized the cop-formula in films in best of its capacity and apart from a powerful cop, the plot has an extension to accommodate a heroine who falls in love with him. Comic twists in these plots are majorly added by the junior cops. Well, Bollywood!\nWhile cop-dramas before used to be mostly around revenge plot, Rohit Shetty has given dramatic twists in his film, making his franchise Singham one of the most popular franchises.\nAfter Simmba, Rohit Shetty announced a film with Akshay Kumar and the audience couldn't contain their excitement.\nAnd now, we have a piece of news that will surely make you happy. A Mumbai Mirror report claims that Shetty and Salman Khan have been talking about collaboration for a cop-drama that will be helmed by Sajid Ali.\nSources have claimed that the film will release in the second half of 2020 and might be a Christmas release.\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES", "title": "Salman Khan And Rohit Shetty To Come Together For A Cop-Drama: A Formula That Never Fails!", "date_publish": "28/01/2019, 11:36:07", "description": "After Simmba, Rohit Shetty announced a film with Akshay Kumar and the audience couldn't contain their excitement. And now, we have a piece of news that will surely make you happy. A Mumbai Mirror report claims that Shetty and Salman Khan have been talking about collaboration for a cop-drama that will be helmed by Sajid Ali.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/salman-khan-and-rohit-shetty-to-come-together-for-a-cop-drama-a-formula-that-never-fails-361151.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/rohit_shetty_and_salman_khan_1548658462_800x420.jpg"}