{"text": "Salman Khan Comes To Saroj Khan's Rescue, Gives Her Work After She Said She Has No Projects\nSalman Khan Comes To Saroj Khan's Rescue, Gives Her Work After She Said She Has No Projects\nOne of the most popular choreographers of the 90’s, Saroj Khan has won the National Award for best film choreography three times in her career so far. From Madhuri Dixit’s Ek Do Teen and Dhak Dhak Karne Laga to Sridevi’s Kate Nahin Kat Te, the ace choreographer, who is hailed as the epitome of perfect dance moves, expressions and postures has given several hook-steps which make us shake a leg even now.\nHowever, recently when Saroj Khan shared her heartbreaking story revealing how she is out of work and is often replaced in movies, it made headlines.\nTwitter\nNow, Salman Khan has come to her rescue. It is said that when Salman Khan got to know about this, he asked her to meet him. After a meeting on Thursday, he promised to work with her.\nTwitter\n“So I told him honestly that I don't have any work [film offers], and that I am teaching Indian classical dance to young actresses. Upon hearing that, he said, 'Now, you will work with me'. I know he is a man of his word, so he will keep his promise,” she told Mid-Day.\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES\nYouTube\nFor the uninitiated, Saroj Khan and Salman Khan had a fallout during Andaz Apna Apna. It is said that Salman felt that Saroj Khan favoured Aamir over him. It was during the Ganpati celebrations in 2018 that the two let the bygones be bygones and buried the hatchet. Salman even obliged to meet her grandson, an ardent fan of Salman, when he was keeping unwell.\nShe had even said Sanjay Leela Bhansali didn’t pay him for Ram Leela, replaced her and stole her steps. She said that she was told the song was scrapped because Salman Khan didn’t like the song because there was a line from Dabangg in the song. She said she was promised she will be called for the new song, but then she was replaced.", "title": "Salman Khan Comes To Saroj Khan's Rescue, Gives Her Work After She Said She Has No Projects", "date_publish": "30/03/2019, 17:00:51", "description": "However, recently when Saroj Khan shared her heartbreaking story revealing how she is out of work and is often replaced in movies, it made headlines. Now, Salman Khan has come to her rescue. It is said that when Salman Khan got to know about this, he asked her to meet him. After a meeting on Thursday, he promised to work with her.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/salman-khan-comes-to-saroj-khan-s-rescue-gives-her-work-after-she-said-she-has-no-projects-364601.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/salman_khan_comes_to_saroj_khans_rescue_gives_her_work_after_she_said_she_has_none_1553944543_800x420.jpg"}