{"text": "The most honest man in the world award goes to Bollywood actor Salman Khan. Why you ask? Well, his recent interview has made him win this title.\nTwitter\nNo other actor holds stardom as Salman Khan does in Bollywood; he has never been called the actor but definitely a superstar. But it’s very rare when a star admits it but Salman is Salman.\nIn a recent interview with DNA, the 51-year-old star said,\n“I’m surviving on mediocre talent and luck. Actually, I don’t know what I’m surviving on, but I’m surviving”.\nIt won’t be wrong to say that he works very hard for his films and that handwork reflects on his work and so he has earned this massive fan following.\nTwitter\nDon't Miss 812 SHARES 468 SHARES 343 SHARES 3 K SHARES 555 SHARES\nSalman not only called himself a mediocre talent but also praised his contemporaries and friends Shah Rukh Khan and Aamir Khan, he said, “It is not as if Aamir or Shah Rukh are choosing bad or worse films. There are times when the movies I’ve chosen, to the best of my knowledge, haven’t worked. And then one film works and you’re back. SRK is a legend, as is Aamir. A bad movie here or there may happen, but they will always come back.”\nWe are all aware of SRK's recent career graph, from Dilwale to Zero, the box office collections have not been impressive enough but King Khan hasn't lost hope and his friend Salmna Khan too.\nTwitter\nTalking about his failure especially Tubelight, Salman said, “We thought that Tubelight (same combination of Kabir Khan and me) will be a beautiful film, after our much-appreciated super hit, Bajrangi Bhaijaan (2015). But for an Eid release, the public wanted to see something happy. In Tubelight, they all cried. They were like, ‘What the hell! You’ve ruined Eid!’. They went into depression.”\nTwitter\nThe superstar is thankful for having a massive fan following and he totally believes he is here on because of them and luck. Salman will be next seen in Bharat and Dabangg 3.", "title": "Salman Khan Calls Himself A 'Mediocre' Actor, Admits He Is Surviving Purely On Luck", "date_publish": "12/04/2019, 14:15:40", "description": "The most honest man in the world award goes to Salman Khan. Why you ask? Well, his recent interview has made him win this title. No other actor holds stardom as Salman Khan does in Bollywood; he has never been called the actor but definitely a star. But it’s every rarer when a star admits it. But Salman is Salman. In a recent interview, the 51-year-old star said, “I’m surviving on mediocre talen", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/salman-khan-calls-himself-a-mediocre-actor-admits-he-is-surviving-purely-on-luck-365330.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/salman_khan_1555060514_800x420.jpg"}