{"text": "Francois-Henri Pinault, Salmya Hayek's French Billionaire husband has extended a monetary help of almost $113 million to rebuild the Notre Dame Cathedral.\nThe 850-year-old UNESCO world heritage landmark in Paris, the Notre Dame Cathedral was swept by a massive fire as it was undergoing renovations on Monday. Reports claim that the inferno collapsed its spire and threatened one of the world's greatest architectural treasures as tourists and Parisians looked on aghast from the streets below.\nAgencies\nA devastating fire that engulfed the Notre Dame, was brought under control on Tuesday, while the Cathedral's main structure as well as its two towers has been saved, the city's fire brigade has confirmed.\nOn Tuesday, Pinault announced that he would extend a monetary support of almost $113 million in funds from his family’s investment firm, Artemis, “to participate in the effort that will be necessary for the complete reconstruction of Notre-Dame,” the French newspaper Le Figaro reported.\nIn a statement obtained by French newspaper Le Figaro, he was quoted as saying,\nFor Representative Purpose Only\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“My father (Francois Pinault) and myself have decided to release a sum of €100 million from our Artemis funds (the family holding company) to participate in the effort that will be necessary for the complete reconstruction of Notre-Dame.\"\n56 year old businessman Pinault is the CEO of Kering, which owns luxury brands including Gucci, Yves Saint Laurent, Alexander McQueen and Balenciaga.\nWikipedia\nHayek reacted to the cathedral’s fire and she took to Instagram to write,\n“I’m in deep shock and sadness to witness the beauty of Notre-Dame turn into smoke,” she wrote. “I love you Paris.” Hayek and Pinault started dating in March 2007 and tied the knot in Feb. 2009 in Paris.", "title": "Salma Hayek's Billionaire Husband Pledges $113 Million To Rebuild Notre Dame Cathedral", "date_publish": "16/04/2019, 11:27:17", "description": "The 850-year-old UNESCO world heritage landmark in Paris, the Notre Dame Cathedral was swept by a massive fire as it was undergoing renovations on Monday. Reports claim that the inferno collapsed its spire and threatened one of the world's greatest architectural treasures as tourists and Parisians looked on aghast from the streets below.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/hollywood/salma-hayek-s-billionaire-husband-pledges-113-million-to-rebuild-notre-dame-cathedral-365515.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/notre_dame_1555394415_800x420.jpg"}