{"text": "Salman Ali Declared As Indian Idol 10 Winner But The Internet Is Unhappy & Calls It Fixed!\nSalman Ali Declared As Indian Idol 10 Winner But The Internet Is Unhappy & Calls It Fixed!\nSalman Ali was one of the best contestants of Indian Idol 10 and he managed to mesmerize the judges as well the audiences on the show with his powerful voice, every time he performed on stage. Last night was the finale of the show and every contestant gave their best to win the title.\nTwitter\nBut there is always one winner; Salman Ali took the trophy while Ankush Bhardwaj was the second runner-up of the show. However, this win of Salman Ali didn’t go down too well with the internet.\nTwitter\nSoon after Salman Ali was declared as the winner, the internet called his win a fix. In fact, many of them even compared Ankush with Arijit Singh saying he wasn’t the winner of Indian Idol but today rules the hearts of millions of people.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHere’s how the internet expressed their emotions over Salman Ali’s win\nIt's all planned and fixed.. Ankush was well deserved.. — Malvika Pathak (@malvikapathak) December 23, 2018\nArijit Singh was not a winner but rules heart of Indian ... Ankush is also not a winner will rule heart of every indian with melodious voice 😍.. best of luck ankush — Aradhya (@kiransa78) December 23, 2018\nHere is judges Ka ladla jise winner banaya but @ANKUSH_00007 is real winner versatile and better singer — manu singh (@ManuSingh611) December 23, 2018\nAnkush deserves this trophy #IndianIdolGrandFinale — Anjali Khakhkhar (@Anjali_k) December 23, 2018\nFor me Ankush is first winner and second is Vibhor he is much much better..This Ali don't deserve in top 7 even..next season..total boycott.. — Atul Bloggerspress (@nationfirstall) December 23, 2018\nWell, all the contestants on the show worked immensely hard and everyone is a winner. in their own way!", "title": "Salman Ali Declared As Indian Idol 10 Winner But The Internet Is Unhappy & Calls It Fixed!", "date_publish": "24/12/2018, 10:53:47", "description": "Salman Ali was one of the best contestants of the Indian Idol 10, he every time managed to mesmerize the judges as well the audiences on the show with his powerful voice. Last night was the final of the show and every top 5 contestants of the show gave their best to win.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/salman-ali-declared-as-indian-idol-10-winner-but-the-internet-is-unhappy-calls-it-fixed-359150.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/salman_ali_1545628000_800x420.jpg"}