{"text": "Salman Khan Mimics Sanjay Dutt To Narrate How He Tried To Convince Him For Marriage & It’s Epic\nSalman Khan Mimics Sanjay Dutt To Narrate How He Tried To Convince Him For Marriage & It’s Epic\nWhen is Salman Khan getting married? – This million dollar question has been asked to the Dabangg Khan several times, but each time, he manages to dodge the question with a witty reply.\nSo, this time, when Salman Khan was on The Kapil Sharma Show, he narrated a funny incident on how once Sanjay Dutt tried to convince him to tie the knot. Sanjay pointed out many advantages of getting married, but what happened after that was hilarious.\nWatch Salman Khan narrate the entire incident himself, in the video below.\n“Sanju baba mujhe convince kar rahe the ki Bhaijaan, you should get married, bro. Phone ki ghanta bhi baj rahi thi unki. When you come from shooting, you’re tired, your wife is there to comfort you. His phone again rings. Shaadi na is like the best thing in the world. Bhaijaan, one second my wife is calling me,” he says.\nIsn’t this hilarious? This episode is going to fun, it seems. In another promo, Kapil Sharma asks Salman Khan if he is comfortable working with a new actress. Here’s what Salman said to this:\nDon't Miss 812 SHARES 5.5 K SHARES 1 K SHARES 3 K SHARES 4 K SHARES\nSalman Khan will be joined by Arbaaz Khan and Sohail Khan on this episode of The Kapil Sharma Show.", "title": "Salman Khan Mimics Sanjay Dutt To Narrate How He Tried To Convince Him For Marriage & It’s Epic", "date_publish": "02/01/2019, 15:03:49", "description": "So, this time, when Salman Khan was on The Kapil Sharma Show, he narrated a funny incident on how once Sanjay Dutt tried to convince him to tie the knot. Sanjay pointed out many advantages of getting married, but what happened after that was hilarious.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/salman-khan-mimics-sanjay-dutt-to-narrate-how-he-tried-to-convince-him-for-marriage-it-s-epic-359700.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/salman_khan_mimics_sanjay_dutt_to_narrate_how_he_tried_to_convince_him_for_marriage__its_hilarious_1546421267_800x420.jpg"}