{"text": "Mahesh Manjrekar, whose Marathi film, Bhai: Vyakti Ki Valli released recently, in an interview with Mirror revealed that he would have directed Sanjay Dutt’s biopic Sanju differently.\nVVC Films\n“I have seen Sanju, and it is a well-made commercial film. However, it left a lot unexplored. I would have directed it with a different approach,” said the director, who also made a special appearance in the biopic directed by Rajkumar Hirani.\nBCCL\nHe further added that the audience liked the film, which is proved by the tons of money which the film made. “Hirani was on a journey to make a commercial film, and the numbers suggest that he has succeeded in doing so. As a film, I enjoyed it, but as a biopic I was a little disappointed,” he pointed out.\nDon't Miss 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES\nMahesh and Sanjay Dutt have worked together on films like Vastav, Kurukshetra, Hathyar and Viruddh to name a few. And back in the 2000’s, they were said to be the closest pals in the B-Town.\nBCCL\nMahesh’s next directorial is a Hindi film on the lines of the iconic Godfather franchise. He has silently wrapped up shooting for the film in Mumbai and is looking to make a formal announcement about the cast, crew and release date soon. His daughter, Ashwami, is gearing up for her big Hindi film debut under Salman Khan’s banner.\nOriginally published in Ahmedabad Mirror", "title": "Sanju Was A Good Commercial Film But A Disappointing Biopic, Says Mahesh Manjrekar", "date_publish": "21/01/2019, 12:50:29", "description": "Mahesh and Sanjay Dutt have worked together on films like Vastav, Kurukshetra, Hathyar and Viruddh to name a few. And back in the 2000’s, they were said to be the closest pals in the B-Town.“Hirani was on a journey to make a commercial film, and the numbers suggest that he has succeeded in doing so. As a film, I enjoyed it, but as a biopic I was a little disappointed,” he pointed out.", "authors": ["Himesh Mankad"], "url": "https://www.indiatimes.com/entertainment/sanju-was-a-good-commercial-film-but-a-disappointing-biopic-says-mahesh-manjrekar-360770.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hirani_sanju_1548056291_800x420.jpg"}