{"text": "Sansa Stark Goes 'Desi', Dons An Exquisite Salwar-Suit For PC - Nick Jonas' Wedding Puja\nSansa Stark Goes 'Desi', Dons An Exquisite Salwar-Suit For PC - Nick Jonas' Wedding Puja\nNick Jonas has no 'Aitraaz' in marrying Priyanka Chopra and the lovebirds are all set to tie the knot in Jodhpur in December. The celebrations for the Jonas' and the Chopra's have just begun. The wedding ceremonies have begun with a Puja at PC's mother's Dr. Madhu Chopra's residence in Mumbai.\nThe couple, along with Nick's older brother Joe Jonas and his fiancee, Sophie Turner were spotted entering the Puja venue.\nThe paps managed to click them all. The most fascinating visual delight was to see Sophie Turner AKA Sansa Stark get all dolled up as a Desi Girl.\nDon't Miss 365 SHARES 161 SHARES 12.5 K SHARES 186 SHARES\nShe donned a red and yellow Salwar suit and Joe Jonas was seen in Kurta Pyajama as well.\nViral Bhayani\nPC was seen in a light blue Kurta with a sheer embellished dupatta and Nick, on the other hand, opted for a light pink kurta-pajama set.\nIt's heartwarming to see how the #LadkeWale from Nick Jonas' side chose to go all Desi for Priyanka Chopra. Have a look at the pictures.\nViral Bhayani\nViral Bhayani\nViral Bhayani\nThe couple is all set to tie the knot on Dec 2. Joining the long list of A-listers and PC's Videshi friends, a Pinkvilla report further claims that superstar Dwayne Johnson, popularly known as ‘The Rock’ and PC's Baywatch co-star will also land in India soon to join the celebrations.\n(Also read: All Decked Up For Priyanka Chopra & Nick Jonas’ Wedding, Jodhpur’s Umaid Bhavan Looks Dreamy)", "title": "Sansa Stark Goes 'Desi', Dons An Exquisite Salwar-Suit For PC - Nick Jonas' Wedding Puja", "date_publish": "28/11/2018, 14:33:13", "description": "Priyanka and Nick were spotted entering the residence followed by Nick's older brother Joe Jonas and his fiancee, Sophie Turner. The two couples donned in traditional outfits for the event.Check out more pictures from these ceremonies right here. Read on,", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sansa-stark-goes-desi-dons-an-exquisite-salwar-suit-for-pc-nick-jonas-wedding-puja-357526.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_jonas_1543394470_800x420.jpg"}