{"text": "Sapna Bhavnani Attacks Amitabh Bachchan On #Metoo, Says 'Your Truth Will Come Out Very Soon'\nSapna Bhavnani Attacks Amitabh Bachchan On #Metoo, Says 'Your Truth Will Come Out Very Soon'\nThe #MeToo movement is not ready to slow down anytime soon. After Bollywood actors like Alok Nath, Nana Patekar, Hrithik Roshan have been allegedly accused of sexual harassment, new names are coming up with every passing day.\nNow Amitabh Bachchan has also been accused of sexual misconduct. Although none of the women has come out as a survivor, the internet is abuzz with comments saying that stories involving the megastar have been heard by people.\nOn Friday, celebrity hairstylist Sapna Bhavnani took to Twitter to attack Amitabh Bachchan. Replying to a Twitter user sharing Bachchan’s post on the ‘Me Too’ movement, she wrote, “This has to be the biggest lie ever. Sir, the film Pink has released and gone and your image of being an activist will soon too. Your truth will come out very soon. Hope you are biting your hands cuz nails will not be enough. @SrBachchan #Metoo #MeTooIndia #comeoutwomen.\"\nThis has to be the biggest lie ever. Sir the film Pink has released and gone and your image of being an activist will soon too. Your truth will come out very soon. Hope you are biting your hands cuz nails will not be enough. @SrBachchan #Metoo #MeTooIndia #comeoutwomen https://t.co/gMQXoRtPW3 — Sapna Moti Bhavnani (@sapnabhavnani) October 11, 2018\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nEncouraging women to “come out”, she even went on to claim to have “personally heard so many stories of Bachchan’s sexual misconduct.”\nHave personally heard so many stories of Bachchan’s sexual misconduct and I I hope those women come out. His hypocrisy is sooooo tired. #Metoo #MeTooIndia https://t.co/2BpumLoYlF — Sapna Moti Bhavnani (@sapnabhavnani) October 11, 2018\nHer tweet read, “Have personally heard so many stories of Bachchan’s sexual misconduct and I hope those women come out. His hypocrisy is sooooo tired. #Metoo #MeTooIndia.”\nT 2959 - An interview on the eve of birthday : It is that special day again...special for us, that is. Why (cont) https://t.co/8n1ERaBtXw — Amitabh Bachchan (@SrBachchan) October 11, 2018\nOn his 76th birthday on October 11, Amitabh finally broke his silence on the ongoing ‘Me Too’ movement and shred his take on the same in a lengthy social media post stating: “No woman should ever be subjected to any kind of misbehaviour or disorderly conduct; especially at her workplace.”\nAfter Sapna's tweets, she has been receiving a backlash on social media.\nfolks telling me that i should be scared of losing my life .... huh??? why?? cuz i said his stories will come out soon???? is this how we keep women shut now? #MeTooIndia #MeToo — Sapna Moti Bhavnani (@sapnabhavnani) October 13, 2018\nThis is the biggest case of #WhyNotMe. Your mind has gone and your existence will soon too. You will eat your words. Preserve your hands cuz fork and knife will not be enough. #StopLies — Dharmesh Patel (@mrdkpatel) October 12, 2018\nTrue said ,she is mad now #whyNotme ..sharam Kar #sapnabhavnani . — kala EF (@KalaYadav3) October 12, 2018\nWohi to. Koi bhaav nahin deta to nirdosh ka naam chillati hain publicity keliye aisi aurate. Aur jo sach mein bhugat rahi hain, un pe kiye huwe atyachaar ka mazaak banaaya jaata hain. #WhyNotMe — Dharmesh Patel (@mrdkpatel) October 12, 2018\nIf you ain’t naming the crime YOU HAVE NO RIGHT to drag someone’s name into the mud! Me too is a serious movement and NOT for ppl with other agenda to use it and trivialise it — tina noor (@sealed_beauty) October 12, 2018\nHe has die hard fans .. you won’t be able to get away if this so easily . But bye the way who are you : how come Me Bachchan comes in contact with such people. I don’t think he even gives too hoots to such kind of people. — Sharad Kumar Singh (@singhsharadkgma) October 12, 2018\nab isko bhi publicity chahiye... bigg boss mae to sanki thi hi ab real life mae bhi sanak gayi hai — Khushbu Gupta (@MySelfKhushi) October 12, 2018", "title": "Sapna Bhavnani Attacks Amitabh Bachchan On #Metoo, Says 'Your Truth Will Come Out Very Soon'", "date_publish": "13/10/2018, 11:14:55", "description": "The #MeToo movement has only just begun in India, and it has already seen several big names like Alok Nath, Vikas Bahl, Nana Patekar, Sajid Khan, Anu Malik, Kailash Kher and many more from the Bollywood film industry being called out for their alleged past acts of sexual misconduct.", "authors": [], "url": "https://www.indiatimes.com/entertainment/sapna-bhavnani-attacks-amitabh-bachchan-on-metoo-says-your-truth-will-come-out-very-soon-354695.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sapna_bhavnani_1539409767_800x420.jpg"}