{"text": "Sara Ali Khan Explains Why She Chose To Become An Actress Despite Studying From Columbia\nSara Ali Khan Explains Why She Chose To Become An Actress Despite Studying From Columbia\nSara Ali Khan won a million hearts already with her charm in the Kedarnath trailer and songs. Then she made a smashing debut in Koffee With Karan along with her father Saif Ali Khan and nailed it with her sass. And if you meet her in person, you will definitely get bowled over by her beauty and confidence.\nSara, who is all set for the release of her debut Kedarnath, is enjoying all the attention during promotions, unlike other actors. Indiatimes met Sara for an interview and it was refreshing because she is a charmer, for sure.\nInstagram\nTo begin with, she confessed how much she is loving the promotions and all the attention, “I am having a lot of fun. I have heard a lot of horrible things, actors talk about promotions, but honestly, I am loving it may be because it’s my first time. It’s so nice to see how people are talking to me with so much warmth and love”.\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nBeing a star kid she obviously dreamt of becoming an actor since a kid, she explains how she landed into acting despite all the education,\n“I wanted to become an actor since the age of 5. I was quite convinced about that. I was also very studious, I got my degree from Columbia University, studied law, political science and after doing all this I realised what rush acting gives me, all this doesn't for sure.\nA 5-year-old girl wanted to become a heroine because she knew nothing. But a 20-year-old girl who studied in America and came back, and even then decided to become an actor with the same passion means something.”\nAfter Kedarnath, Sara has her next release Simmba opposite Ranveer Singh filmed by Rohit Shetty. She was asked to picks her favourite director, and she replied,\n“I am standing here because of Abhishek Kapoor and Rohit Shetty. I can't say that I am only here because of Abhishek sir because that would negate what Rohit sir has done for me. But giving me a film like Kedarnath that itself makes Abhishek sir special”.\nInstagram\nThe newbie even admitted that working with Ranveer was an overwhelming experience,\n“He is just amazing, he is the bundle of energy you can't ignore. The first time I had met him was at a wedding, where I had asked a picture with him and it was bliss. I was a fan of him and I still am. Working with him was an overwhelming scenario and still is”.\nInstagram\nComing from a filmy family, Sara understands the importance of films doing good business,\n“ I know how important it is for a film to make good money. 100 crore is good and I hope Kedarnath earns that. But I don’t want to pressurize myself, because I have done my work. The result isn’t in my hand. I can only be hopeful of good results”.\nInstagram\nHer passion for acting reflects on her face, she wants to work with every director and in every genre,\n“I don't want Imtiaz Ali, Sanjay Leela Bhansali or David Dhawan say Sara can't do this, I want them to say if we give her the chance and guidance she can definitely do it. That’s my aim”.\nClearly, the girl is here to stay and conquer. Sara's Kedarnath and Simmba will be releasing on December 7 and 28.", "title": "Sara Ali Khan Explains Why She Chose To Become An Actress Despite Studying From Columbia", "date_publish": "01/12/2018, 13:14:50", "description": "Sara Ali Khan has won millions of hearts already with her appearance in Koffee With Karan and Kedarnath trailer and songs. And if you meet her in person you will definitely be blown by her beauty and confidence she holds.Sara is all set to make her debut with Kedarnath and has begun the promotions in full swing. She is also thoroughly enjoying all the attention. Indiatimes too met Sara for an inte", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sara-ali-khan-explains-why-she-chose-to-become-an-actress-despite-studying-from-columbia-357722.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_1543661332_800x420.jpg"}