{"text": "Sara Ali Khan All Praises For Step Brother Taimur, Says He Is My Blood And Source Of My Father's Joy\nSara Ali Khan All Praises For Step Brother Taimur, Says He Is My Blood And Source Of My Father's Joy\nIn the Hindi film industry, there are several families that have a complicated family tree. However, that in no way signifies that the inter-personal relationships between the family members are sour or complicated.\nThe biggest example of this is the Pataudi family. On Koffee with Karan, Sara Ali Khan beautifully explained the dynamics of their own family. She said, \"Instead of one unhappy home, I have two happy homes'. Amrita Singh and Saif Ali Khan chose to part ways and he moved on in his life and is now happily married to Kareena Kapoor Khan.\nWhile the adult relationships appear a bit twisted, the way Sara and the other kids have embraced the relationship, it shows how the family believes in the concept of moving on with dignity. In a recent interview with Filmfare, Sara Ali Khan expressed her love for her brother Taimur Ali Khan.\nShe said that even though she doesn't get to meet Taimur quite often, every time he is in the room, there's only happiness and joy. She adds,\nInstagram\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"To be honest, I don’t get to see Taimur very often but every time I do he’s a bundle of happiness. When Taimur is happy, the whole room is happy. He is my blood and the source of my father’s joy.\"\nThe bonding time between the siblings in the Pataudi and the Kapoor family has always been endearing and pictures from several celebrations have popped up on our timeline and that proves that everything is happy and perfect in the family!", "title": "Sara Ali Khan All Praises For Step Brother Taimur, Says He Is My Blood And Source Of My Father's Joy", "date_publish": "01/04/2019, 18:02:24", "description": "The bonding time between the siblings in the Pataudi and the Kapoor family has always been endearing and pictures from several celebrations have popped up on our timeline and that proves that everything is happy and perfect in the family! Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sara-ali-khan-all-praises-for-step-brother-taimur-says-he-is-my-blood-and-source-of-my-father-s-joy-364694.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/taimur_1554123396_800x420.jpg"}