{"text": "Sara Ali Khan Is Carving Her Own Way In The Industry & Nepotism Or Not, She Is Here To Stay!\nSara Ali Khan Is Carving Her Own Way In The Industry & Nepotism Or Not, She Is Here To Stay!\nShe is smart, she is sassy, she is the new kid on the block! Sara Ali Khan is Saif Ali Khan and Amrita Singh's elder daughter but within a short span of time she has managed to grab eyeballs and it's not because of her parents but her outstanding acting in her debut film Kedarnath and her affable personality. Though she got the film because she is Saif's daughter but the girl proved it that she was worth the opportunity.\nInstagram\nIndiatimes met Sara soon after Kedarnath release and spoke to her about the film not impressing the audience, nepotism, her transformation and lot more.\nTo begin with, we asked her about Kedarnath not being loved by the audiences but people are loving her in the film and claim that she is the only saving grace in the film, she answered,\nInstagram\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\n\"It’s a bittersweet emotion because Kedarnath is my first film and it’s difficult to alienate myself from that, so when people say that I am the only saving grace in the film I feel bad that people didn’t like the film, I feel bad that it’s not connecting with the audience. However, at the end of the day, I am Sara and when I read I was good, I also feel happy.”\nDespite the nepotism debate, Sara has been welcomed with open arms and she is very happy about that,\n“Nepotism conversation has become very prominent and lots of people are talking about it. But, I didn’t choose to be Saif and Amrita’s daughter. I love my parents, I am happy to be born to them and I am proud of them. But I didn’t choose it; I have always said that irrespective of what your family is, and who your family is you have to make your own mark at the end of the day.\nTwitter\n\"And I know that with nepotism comes pressure, expectation and despite that people are liking me, I am so happy. I have received a lot of love and warmth from media and people despite nepotism and I am very grateful, but I know there were people who were waiting to pull me down and say ‘ arrey iski maa aur baap star hai, isliye ye yaha pahuch gayi hai’ and if those people are also thinking I got an opportunity and I proved myself and liking my work, it’s a blessing.”\nSara is looking gorgeous in Kedarnath, and it was no piece of cake. She worked immensely hard to lose weight as she was suffering from PCOD, but she also admits nobody pressurized her to lose weight, she did it because she wanted to,\nInstagram\n“ I wasn’t pressurized to lose weight; I wanted to become an actor so I had to. But if someone is suffering from PCOD, it’s very important to lose weight for your health. You have to be healthy, and if you are very fat and have PCOD than please feel pressurized and lose your weight. But if you are happy with what you are and you are healthy then please don’t listen to anyone. Just listen to your heart, happiness is the second most important thing in life, but health is first, Besan laddo makes me very happy but it also makes me unhealthy, so I can’t eat it.\"\nInstagram\nSara says it was her dream to become an actor and she doesn’t care which is her first film be it Kedarnath or Simmba, “My dream was to become an actor and experiment different things, play different characters, honestly I really don’t care what is my first or second film, I want to do everything. If people will like it I will do it over and over again, that’s it.”\nInstagram\nWe also quizzed her about the constant media glare on Taimur and whether she feels blessed to be a 90s kid, she said, “ Every time has its advantages and disadvantages, I don’t know how time was when mom had me, I can’t say how Taimur must be feeling right now. But I think it’s ok, you are the product of your time and you will learn to adjust.”\nThis girl clearly wins us over every time we talk to her.", "title": "Sara Ali Khan Is Carving Her Own Way In The Industry & Nepotism Or Not, She Is Here To Stay!", "date_publish": "11/12/2018, 16:13:42", "description": "Sara Ali Khan has left everyone gaga over her transformation from fat to fit. Sara had a lot of struggle to lose weight as she was suffering from PCOD but after her transformation she realised how important is to be healthy. Sara made her debut with Kedarnath and left the audience spellbound with her beauty and outstanding acting. In fact lots of people don’t mind nepotism for once as they are in", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sara-ali-khan-is-carving-her-own-way-in-the-industry-nepotism-or-not-she-is-here-to-stay-358329.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_1544515298_800x420.jpg"}