{"text": "Sara Ali Khan & Ranveer Singh Become The Newsmakers Today And More From The Ent World!\nSara Ali Khan & Ranveer Singh Become The Newsmakers Today And More From The Ent World!\nWhile mixed reviews have dropped in about the film where toxic masculinity and misplaced social messaging is what is upsetting the critics, this film is all about Ranveer Singh. Accompanying and matching up to Ranveer Singh's screen-presence is veteran actor Ashutosh Rana! Their camaraderie is what will make you want to whistle.\nCruising through negative reviews and a lukewarm response from the critics, Ranveer Singh's Simmba has already registered an opening of around Rs 20 crore. According to Boxofficeindia.com report, Rohit Shetty's Simmba has registered itself a massive opening in the Mumbai circuit with collections of around Rs 8 crore.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES\nSara isn't a frivolous 20-year old but there is much more to her that has made her enter into the favorite list of critics and the audience. She might be just two film old but her larger than life dreams prove that she has plans to conquer the world of films.\nAnd 2019 will be another year where Katrina will be shining in Salman Khan's Bharat. The actress was also starring alongside Varun Dhawan in a dance film. Vaurn had even announced the movie on Instagram and the duo even came together on Koffee With Karan.\nAmidst all the ups and down in the Kapoor family in 2018, the family stood by each other in thick and thin. To end the year on a happy note, the Kapoors have flown to Singapore to ring in Anshula Kapoor's 26th birthday.", "title": "Sara Ali Khan & Ranveer Singh Become The Newsmakers Today And More From The Ent World!", "date_publish": "29/12/2018, 17:48:41", "description": "Ashutosh Rana-Ranveer Singh's Camaraderie Is One Of The Reasons Why You Should Go For Simmba! While mixed reviews have dropped in about the film where toxic masculinity and misplaced social messaging is what is upsetting the critics, this film is all about Ranveer Singh. Accompanying and matching up to Ranveer Singh's screen-presence is veteran actor Ashutosh Rana!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sara-ali-khan-ranveer-singh-become-the-newsmakers-today-and-more-from-the-ent-world-359493.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_ali_khan_1546086122_800x420.jpg"}