{"text": "Sara Ali Khan Aspires To Keep It Real, Says She’s Trying To Be As Organic As She Can\nSara Ali Khan Aspires To Keep It Real, Says She’s Trying To Be As Organic As She Can\nEven before her debut in Sushant Singh starrer Kedarnath, Saif Ali Khan and Amrita Arora’s daughter Sara Ali Khan won hearts of the audiences, after she made her debut on Karan Johar’s chat show Koffee With Karan.\nShe was confident, smart and refreshingly genuine. She didn’t even hesitate to talk about the fact that she suffers from PCOD (Poly Cystic Ovarian Disorder), a health issue that is very common among young women, in her first appearance on a talk show. She wasn’t even once shy or embarrassed when the video from her childhood was played in which she was apparently over-dramatic. She was like a breath of fresh air.\nAlso Read: Father-Daughter Duo Saif & Sara Ali Khan Discuss Their Modern Family Over Steaming Cups Of 'Koffee'\nSo, even before she proved her acting mettle, people knew she is here to stay and slay. So much so, that she instantly became social media’s favourite.\nDon't Miss 169 SHARES 183 SHARES\nAfter debuting with Sushant Singh Rajput starrer Kedarnath, Sara Ali Khan says she is awaiting the release of her next film Simmba, which stars Ranveer Singh.\nSara might be pursuing acting, but she says she wants to keep it as real and relatable as possible.\nRSVP Films\n“People appreciate the fact that I am real. I endeavour to be most real person. I don't think too much and try to be as organic as I can. I do make mistakes. With the same token you get appreciation and criticism as well and you have to take it the same way,” she said.\nTwitter\nFurthermore, she says as a performer, and she wants to experiment.\n“I am taking each day as it comes. I will see what offers come my way and whatever excites me I will take that up. As an actor I want to experiment with different kinds of films. I have always loved acting. I am always dying to be on a film set. Life is empty for me without that,” she said.\nAlso Read: In A Sweet Gesture, Sara Ali Khan Sends 'Thank You' Notes To Paparazzi & Invites Them For Coffee\nhttps://www.indiatimes.com/entertainment/in-a-sweet-gesture-sara-ali-khan-sends-thank-you-notes-to-paparazzi-invites-them-for-coffee-357858.html\nWith inputs from PTI", "title": "Sara Ali Khan Aspires To Keep It Real, Says She’s Trying To Be As Organic As She Can", "date_publish": "16/12/2018, 18:10:02", "description": "After debuting with Sushant Singh Rajput starrer Kedarnath, Sara Ali Khan says is awaiting the release of her next film Simmba, which stars Ranveer Singh. Sara might be pursuing acting, but she says she wants to keep it as real and relatable as possible.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sara-ali-khan-aspires-to-keep-it-real-says-she-s-trying-to-be-as-organic-as-she-can-358720.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sara_ali_khan_aspires_to_keep_it_real_says_shes_trying_to_be_as_organic_as_she_can_1544958795_800x420.jpg"}