{"text": "1. Saroj Khan Slams Bollywood, Reveals She Was Replaced By Prabhu Deva In 'Thugs Of Hindostan'\nSpeaking to an entertainment tabloid, “Four years after Gulaab Gang, I’ve choreographed another song for Madhuri (Dixit). All through the film (Kalank) she makes others dance and never dances herself, then, in the climax, when Varun’s (Dhawan) Zafar enters the kotha, she breaks into a mujra. Tabahi is a sad, situational song with fast-paced beats. Madhuri and I danced our hearts out and I’m hopeful that after seeing it, people will remember Saroj Khan again. After just reading about it, Kangana Ranaut with whom I had worked in Tanu Weds Manu earlier, called me to do a song, Rajaji, in Manikarnika: The Queen of Jhansi.”\n2. Kangana Ranaut Targets Ranbir Kapoor & Alia Bhatt Once Again, Calls Them 'Dumb' This Time\n\"I do only that when I am rubbed the wrong way. And what is this thing of calling them young... Ranbir Kapoor is, what, 37 years old, young kid of the generation and Alia Bhatt just turned turned 27... my mother had three children at 27. This is absolutely unfair... bachche hai, ki dumb hai ki kya hai...\"\nDon't Miss 126 SHARES 336 SHARES 174 SHARES\n“After reading the scripts I went back and watched season one again because so much of it refers back to that season. There are so many scenes that will look similar. And also I watched just to remind myself of the arc I've taken already. I wanted Arya to go full circle and try for some kind of normalcy like when she was younger,” she was quoted as saying to Entertainment Weekly.\n4. Jacqueline's Lookalike Amanda Cerny Is Having A Blast In Mumbai, Hangs Out With Salman Khan\nSoon after, the duo and their fans realised their uncanny resemblance. They were labelled as long lost sisters. And now that Amanda is in India, Jacqueline is taking care of her in the most special ways.\n5. Angelina Jolie Might Make Her Superhero Debut Soon, Is In Talks For Marvel’s ‘The Eternals’\nWe have seen her nailing some action roles in movies like Lara Craft: Tomb Raider and Wanted among others. But are you all ready to see her in the Marvel Cinematic Universe? According to The Hollywood Reporter, the actress is in talks to star in The Eternals.", "title": "Saroj Khan Slams Bollywood, Kangana Targets Ranbir & Alia Again & More From Ent", "date_publish": "28/03/2019, 18:15:48", "description": "From Saroj Khan slamming Bollywood to Kangana Ranaut hitting out at Alia Bhatt and Ranbir Kapoor yet again, here’s all that rocked the world of entertainment today. Just recently, she lashed out at Ranbir Kapoor and Alia Bhatt once again, and the reason is she doesn't like them being called the young-age actors.", "authors": [], "url": "https://www.indiatimes.com/entertainment/saroj-khan-slams-bollywood-kangana-targets-ranbir-alia-again-more-from-ent-364508.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/saroj_khan_slams_bollywood_kangana_targets_ranbir__alia_again__more_from_ent_1553775568_800x420.png"}