{"text": "What makes Bollywood different from other movie industries? While some of you may say Hollywood has better story lines and actors, there is something that Hollywood doesn't offer. The beautiful songs and the dances that our Bollywood has in abundance. When we talk about dance, the only choreographer that comes to our mind is Saroj Khan.\nThe original one and a veteran in her art. From training Remo D'souza, Ganesh Acharya, Madhuri Dixit and other A-listers, Saroj Khan is the queen of beautiful dance forms. However, in a recent film, Thugs Of Hindostan, the dancer was replaced by Prabhu Deva for Katrina Kaif's song at the last moment.\nTwitter\nWhile some claimed she has been feeling unwell, some said Saroj Khan is considering retirement. But she has refuted all rumours. Saroj Khan is coming back again in Kalank.\nDon't Miss 106 SHARES\nSpeaking to an entertainment tabloid, “Four years after Gulaab Gang, I’ve choreographed another song for Madhuri (Dixit). All through the film (Kalank) she makes others dance and never dances herself, then, in the climax, when Varun’s (Dhawan) Zafar enters the kotha, she breaks into a mujra. Tabahi is a sad, situational song with fast-paced beats. Madhuri and I danced our hearts out and I’m hopeful that after seeing it, people will remember Saroj Khan again. After just reading about it, Kangana Ranaut with whom I had worked in Tanu Weds Manu earlier, called me to do a song, Rajaji, in Manikarnika: The Queen of Jhansi.”\nFacebook/Saroj Khan FC\nShe also criticised the new age choreographers and said we shouldn't take the the dance moves from the West when we have plenty of dance forms in India.\n“Why go into living rooms in the West and show them their own moves when people abroad love and want to learn our todas and taals? It’s stupid, but then music directors today can’t even come up with original tracks, they have to remix yesteryear hits. Remo D’souza, Ahmed Khan, Ganesh Acharya, my own son Raju Khan have all been my students. In my time, we always encouraged new talent, we were not insecure of them taking our work away from us. Taqdeer roti deti hai,” she added.\nWell, she does make a valid point.", "title": "Saroj Khan Slams Bollywood, Reveals She Was Replaced By Prabhu Deva In 'Thugs Of Hindostan'", "date_publish": "28/03/2019, 13:07:37", "description": "From training Remo D'souza, Ganesh Acharya, Madhuri Dixit and other A-listers, Saroj Khan is the queen of beautiful dance forms. However, in a recent film, Thugs Of Hindostan, the dancer was replaced by Prabhu Deva for Katrina Kaif's song at the last moment. From training Remo D'souza, Ganesh Acharya, Madhuri Dixit and other A-listers, Saroj Khan is the queen of beautiful dance forms.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/saroj-khan-slams-bollywood-reveals-she-was-replaced-by-prabhu-deva-in-thugs-of-hindostan-364454.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/saroj_khan_1553757057_800x420.jpg"}