{"text": "Satyajit Ray's 'Pather Panchali' Is The Only Indian Film That Made It To BBC's Top 100 Foreign Language Films\nSatyajit Ray's 'Pather Panchali' Is The Only Indian Film That Made It To BBC's Top 100 Foreign Language Films\nFilmmaker Satyaji Ray's cult film, Pather Panchali has been chosen as one of the best foreign films of all time. As per BBC's 100 best films, Pather Panchali stands at the 15th position.\nTwitter\nThe movie is a 1955 Bengali film written and directed by Satyajit Ray and was produced by the Government of West Bengal. As per the website, BBC Culture polled 209 critics in 43 countries to find the best in world cinema.\nThe website also mentions that four of the 100 films have been directed by women. However, it said that 45 per cent of the critics who took part in the poll were women.\nIMDB\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n\"27 of the highest-rated films were in French, followed by 12 in Mandarin, and 11 each in Italian and Japanese,\" according to the BBC.\nHere's taking a look at the top 20 films that made the cut. For this festive week ahead, we suggest you take sometime off and watch the best classic films of all time.\n20. The Mirror (Andrei Tarkovsky, 1974)\n19. The Battle of Algiers (Gillo Pontecorvo, 1966)\n18. A City of Sadness (Hou Hsiao-hsien, 1989)\n17. Aguirre, the Wrath of God (Werner Herzog, 1972)\n16. Metropolis (Fritz Lang, 1927)\n15. Pather Panchali (Satyajit Ray, 1955)\n14. Jeanne Dielman, 23 Commerce Quay, 1080 Brussels (Chantal Akerman, 1975)\n13. M (Fritz Lang, 1931)\n12. Farewell My Concubine (Chen Kaige, 1993)\n11. Breathless (Jean-Luc Godard, 1960)\n10. La Dolce Vita (Federico Fellini, 1960)\n9. In the Mood for Love (Wong Kar-wai, 2000)\n8. The 400 Blows (François Truffaut, 1959)\n7. 8 1/2 (Federico Fellini, 1963)\n6. Persona (Ingmar Bergman, 1966)\n5. The Rules of the Game (Jean Renoir, 1939)\n4. Rashomon (Akira Kurosawa, 1950)\n3. Tokyo Story (Yasujirô Ozu, 1953)\n2. Bicycle Thieves (Vittorio de Sica, 1948)\n1. Seven Samurai (Akira Kurosawa, 1954)\nThe selected film, Pather Panchali depicts the childhood of the protagonist Apu (Subir Banerjee) and his elder sister Durga (Uma Dasgupta) and the harsh village life of their poor family.\nBusiness Standard\nWell, we couldn't be more proud of our film. Here's hoping there are many more Indian films adding to world cinema in the future.", "title": "Satyajit Ray's 'Pather Panchali' Is The Only Indian Film That Made It To BBC's Top 100 Foreign Language Films", "date_publish": "01/11/2018, 15:44:28", "description": "The movie is a 1955 Bengali film written and directed by Satyajit Ray and was produced by the Government of West Bengal. As per the website, BBC Culture polled 209 critics in 43 countries to find the best in world cinema. The website also mentions that four of the 100 films have been directed by women. However, it said that 45 per cent of the critics who took part in the poll were women.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/satyajit-ray-s-pather-panchali-is-the-only-indian-film-that-made-it-to-bbc-s-top-100-foreign-language-films-355861.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pather_panchali_1541061831_800x420.jpg"}