{"text": "If you still don’t know that when the Avengers: Endgame tickets went up for pre-sale in the US, it broke all records. The websites were crashed due to high demand. People were reselling them on eBay for Rs 10 Lakhs, and some people bought them for exorbitant prices too.\nRead More: Someone Just Bought Avengers: Endgame Ticket For More Than Rs 10 Lakhs & We Are Freaking Out\nTwitter\nThe frenzy is on to another level! Who wants to miss such a movie, right? The spoilers could be all over social media. And if not, than your friends might ruin it for you. So, better buy the tickets before hand, so that you catch the first day show of the Marvel movie because tickets might be available for online sale soon.\nAccording to a report in NDTV, the tickets are likely to go on sale this Sunday, on April 21. This they have predicted on the basis of the trend witnessed last year during the releasing of Avengers: Infinity War. Even the sales for Captian Marvel began five days in advance.\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 6.4 K SHARES\nAlso Read: Avengers: Endgame Footage Leaked Online & Fans Are Taking Social Media Detox To Avoid Spoilers!\nadventuresinpoortaste.com\nSo, most likely, the confirmation might drop in soon. Meanwhile, Russo brothers, the director duo of the movie, have urged the fans to not spread the spoilers after watching the movie. If you’re a true fan, you won’t cheat and ruin the movie for others. Let’s all take a pledge!\nRead More: Russo Brothers Appeal To ‘Greatest Fans In The World’ To Not Spread Avengers: Endgame Spoilers\nAvengers: Endgame is hitting the screens on April 26 – mark the date if you haven’t already. So, are you ready for a roller coaster ride full of emotions?", "title": "Save The Date! Avengers: Endgame Tickets Will Most Likely Go On Sale From April 21st In India", "date_publish": "18/04/2019, 16:40:13", "description": "According to reports, Avengers Endgame tickets in India are likely to go on sale this Sunday, on April 21. This they have predicted on the basis of the trend witnessed last year during the releasing of Avengers: Infinity War. Even the sales for Captian Marvel began five days in advance.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/save-the-date-avengers-endgame-tickets-will-most-likely-go-on-sale-from-april-21st-in-india-365705.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_endgame_in_india_will_go_on_sale_on_sunday__april_21_1555584624_800x420.png"}