{"text": "Secret Is Finally Out! Ranveer Gives Deets About Dating Deepika & How He Knew She Was The 'One'\nSecret Is Finally Out! Ranveer Gives Deets About Dating Deepika & How He Knew She Was The 'One'\nWe have seen a lot of celebrity relationships culminate into marriage but Ranveer Singh and Deepika Padukone are different and how.\nTheir romance blossomed on the sets of Goliyon Ki Raasleela-Ramleela and within six months into their relationship, they both knew that this one was for keeps.\nPinterest\nFree-flowing romance, long-trips to undisclosed destinations and going gaga over each other during interviews, DeepVeer (As fans call them) turned into everyone's favorite celebrity couple. There was nothing pretentious nor dramatic about their romance.\nAgencies\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nAfter dating for over six years, the couple finally solemnized their marriage in the picturesque locals of Italy, at Lake Como. With only a few closed ones and friends around them, it was a wedding that you only see in films and read in romantic novels.\nViral Bhayani\nWith love, joy and the intention to last it forever, Mr. and Mrs. Ranveer Singh began their sweet forever in Italy. But what was their 'it' moment when both realized that it was meant to be?\nIn a detailed interview with Filmfare, Ranveer bared his heart out on marriage with Padukone and how he aims to be a millennial husband. In a first, Ranveer revealed that he was just waiting for his lady-love Deepika to give a final nod.\nInstagram\n\"I’ve been ready for a while. I was just waiting for Deepika to be ready. It would happen whenever she had decided. I was fully ready and raring to go.\"\nRanveer finally revealed why the couple zeroed down on Lake Como, Italy for the wedding.\nInstagram/Ranveer Singh\n\"Whatever she wished, I wanted her to have it. That’s the first step in being the husband of the millennium. Whatever her vision of getting married, I wanted her to realize it. Whatever she wanted, it was done exactly in that manner. She deserves every bit of it. I too deserve happiness and my happiness comes from her happiness. It’s that simple.\"\nRanveer spilled the beans on the 'this is it' moment of their relationship. He added,\nPinterest\n\"Six months into the relationship, I knew she was the one. I nurtured the relationship accordingly. It’s been six years now. She’s too good, too lovely. She’s a force of nature. I understood that almost immediately.\"\nWhen he was asked if she's lucky to have him, he had a very different take on it. He added,\nInstagram/Ranveer and Deepika\n\"I don’t think about these things. I’m lucky to have her. I knew all too well that this is the woman I’m going to marry. This is the woman who would become the mother of my children. I’ve been thinking about marriage seriously for almost three years now. I was just waiting, I told her the minute you say so, we’ll do it.\"", "title": "Secret Is Finally Out! Ranveer Gives Deets About Dating Deepika & How He Knew She Was The 'One'", "date_publish": "28/11/2018, 16:39:13", "description": "Ranveer Singh, Deepika Padukone, DeepVeer, DeepVeer Wedding, Deepika Padukone and Ranveer Pictures, DeepVeer Wedding Pics IndiaRanveer Singh, Deepika Padukone, DeepVeer, DeepVeer Wedding, Deepika Padukone and Ranveer Pictures, DeepVeer Wedding Pics IndiaRanveer Singh, Deepika Padukone, DeepVeer, DeepVeer Wedding, Deepika Padukone and Ranveer Pictures, DeepVeer Wedding Pics India", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/secret-is-finally-out-ranveer-gives-deets-about-dating-deepika-how-he-knew-she-was-the-one-357548.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singh_and_deepika_padukone_1543405671_800x420.jpg"}