{"text": "Sexual Predators Are Everywhere, Sometimes In Our Own Household, Says Jacqueline Fernandez\nSexual Predators Are Everywhere, Sometimes In Our Own Household, Says Jacqueline Fernandez\nThe #MeToo movement is not fading away anytime soon. A lot of names, especially from Bollywood have cropped up in the past that include Alok Nath, Vikas Bahl, Rajat Kapoor, Kailash Kher, Sajid Khan and Anu Malik among others. Sharing her opinion on the ongoing #MeToo movement, Jacqueline Fernandez says that sexual predators are everywhere, sometimes in our own household.\nActress Jacqueline Fernandez has supported #MeToo movement by saying that gender dialogue is long overdue not just in a film industry but in the society as well. She also feels that sexual predators are present everywhere. Jacqueline was interacting with media after walking the ramp for brand \"Jade\" on its 10th anniversary along with Kanika Kapoor on Tuesday, here.\nReacting on #MeToo campaign that has gathered momentum in India especially in Bollywood, Jacqueline said, \"It's very important to remember that the gender dialogue is a conversation that's a long overdue and let's not limit it to our film industry.\nbccl\nDon't Miss 837 SHARES 3.6 K SHARES\nIt's a dialogue which has been long overdue in our society as well. Unfortunately, the sad truth is sexual predators are all around us. They are sometimes in our own household so, we should not deviate from the actual issue which is not entirely about sex but it's about the power struggle. We really have to stick to the issue and be serious about it if we want solutions and if we want to have safe workplace for everyone and for society.\"\nReacting on #MeToo movement in India, Kanika Kapoor said, \"I am very shocked about it. I feel very sad for anybody whoever has gone through any sort of sexual assault or misbehaviour.\nbccl\n\"I am really happy that India is becoming a safer place with every passing minute and I really support this movement.\"\nShe says that from now on, people will not mess with anybody be it a girl, a boy or a kid.\n\"I feel the whole confidence of women in our country is growing which is really nice so, kudos to all the girls and boys who are coming up and sharing their stories. This #MeToo movement is absolutely wonderful for our country and for the world. I hope that we all make this country and the world a better place to live,\" she said.\nbccl\nThe #MeToo movement has gained momentum in India after Tanushree Dutta accused veteran actor Nana Patekar of harassment.\nFollowing her revelation, accusations are being levelled against some powerful personalities in politics, media and the entertainment industry including Sajid Khan, Rajat Kapoor, Kailash Kher, Alok Nath, Vikas Bahl, MJ Akbar, Anirban Blah, Ashish Patil, painter Jatin Das, writer Varun Grover, casting director Vicky Sidana, Mukesh Chhabra and among others.\nInputs From IANS", "title": "Sexual Predators Are Everywhere, Sometimes In Our Own Household, Says Jacqueline Fernandez", "date_publish": "25/10/2018, 11:23:44", "description": "The #MeToo movement is not fading away anytime soon. A lot of names, especially from Bollywood have cropped up in the past that include Alok Nath, Vikas Bahl, Rajat Kapoor, Kailash Kher and Anu Malik among others. Sharing her opinion on the ongoing #MeToo movement, Jacqueline Fernandez says that sexual predators are everywhere, sometimes in our own household.", "authors": [], "url": "https://www.indiatimes.com/entertainment/sexual-predators-are-everywhere-sometimes-in-our-own-household-says-jacqueline-fernandez-355403.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/jacqueline_fernandez_says_sexual_predator_are_everywhere_sometimes_in_our_own_household_1540448330_800x420.jpg"}