{"text": "There are a few actors who know how to strike the right kind of work-life balance. Even with impending work commitments, they know how to take time out and be with their family. Shahid Kapoor is one such actor.\nInstagram\nBeing an actor means that your personal life is always in the spotlight and Shahid has been no exception. From his arranged marriage to Mira Rajput to his two babies, fans have always got a closer look at actor's personal life-thanks to Mira and Shahid's social media accounts and the paps!\nActor Shahid Kapoor and wife Mira Rajput are currently holidaying in London. Mira, who is an active social media user has been giving everyone a glimpse of their vacation and it's mostly about food and loads of shopping.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nShahid was busy with the shoot of his film Kabir Singh and this looks like an apt vacation for the actor. Have a look at the pictures!\nInstagram\nInstagram\nInstagram\nOn the work front, Shahid Kapoor is all geared up for the release of his film Kabir Singh. The teaser of the film was unveiled on social media a few days ago.\nIn the film, Shahid will be playing the title role of a surgeon Kabir Singh, who goes on the path of self-destruction after being rejected by his girlfriend.", "title": "Shahid Kapoor And Mira Rajput’s London Vacay Was All About Pizza And Shopping Dates!", "date_publish": "17/04/2019, 16:23:57", "description": "Shahid Kapoor is one such actor. Actor Shahid Kapoor and wife Mira Rajput are currently holidaying in London. Mira, who is an active social media user has been giving everyone a glimpse of their vacation and it's mostly about food and loads of shopping.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shahid-kapoor-and-mira-rajput-s-london-vacay-was-all-about-pizza-and-shopping-dates-365628.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shahid_and_mira_1555493798_800x420.jpg"}