{"text": "Shah Rukh Khan Sheds Light On Importance Of Training In Acting, Wants Suhana To Learn The Craft Before Debut\nShah Rukh Khan Sheds Light On Importance Of Training In Acting, Wants Suhana To Learn The Craft Before Debut\nAn actor doesn’t go to a gym, an entertainer does – Neeraj Kabi, the man who played the role of DCP Parulkar in Sacred Games had once said while shedding light on the thin line between an actor and an entertainer in an interview with Indiatimes, and rightly so.\nRead More: Neeraj Kabi Sheds Light On The Thin Line Between Actors & Entertainers, Shares Acting Secrets!\nFor long, acting in films was considered the least skilled of all the performing arts. Didn’t we all think that anyone can be picked from the streets and taught acting? All you need is a face and a great physique, right?\nBut times are changing. Actors who earlier played sidekicks – like Nawazuddin Siddiqui and Vicky Kaushal – are now playing main leads and on the other hand, several films of the big stars including Salman Khan’s Race 3 have failed miserably at the box office.\nAFP\nShedding light on the importance of training in acting, Shah Rukh Khan recently said he wants his daughter, Suhana Khan, who aspires to be an actress, to learn acting and practice it – do theatre for three-four years – before she make her Bollywood debut.\nDon't Miss 193 SHARES 5.1 K SHARES 357 SHARES 763 SHARES 153 SHARES\n“In India, I think we don't learn acting, we just assume that we are talented. Like if you drive very first, it first mean you are going to become a Formula 1 driver. You'll have to finally learn it. So I want her to have a formal training in acting. The experience matters a lot,” he said.\nTwitter\nHe, furthermore, said that he wants her to learn the craft. He revealed she visited him on the sets of his upcoming film Zero to observe how things work.\n“She came on sets because learning acting has a lot to do with spending time on the sets and learning production. She did the same in London and while she was here.She said she still has two weeks to go back to London and we were shooting a song for 'Zero' in the coming two weeks. So she came here to have that experience.\nTwitter\nShah Rukh Khan said that he wanted Suhana to learn the nuances from Anushka Sharma and Katrina Kaif.\n“I wanted her to see Anushka and Katrina perform live as both are such different kind of actors. Katrina has her own charm and Anushka has her own way of enacting things. So I wanted her to spend time (on sets). So what they did is they put her onto me as an assistant director.\n\"But I think ground experience is good for actors or any kind of job, only as an internship. But you have to finish your education first. If you have the opportunity to study, it formalises and makes your craft better. So, I want her to study first for some time.\"\nAlso Read: Ranveer Wins Best Actor For Padmaavat, Leaves Wife Deepika Teary-Eyed With His Emotional Speech\nWith inputs from PTI", "title": "Shah Rukh Khan Sheds Light On Importance Of Training In Acting, Wants Suhana To Learn The Craft Before Debut", "date_publish": "17/12/2018, 19:00:12", "description": "Shedding light on the importance of training in acting, Shah Rukh Khan recently said he wants his daughter, Suhana Khan, who aspires to be an actress, to learn acting and practice it – do theatre for three-four years – before she make her Bollywood debut.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-sheds-light-on-importance-of-training-in-acting-wants-suhana-to-learn-the-craft-before-debut-358779.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_sheds_light_on_importance_of_training_in_acting_wants_suhana_to_learn_the_craft_bef_1545051642_800x420.jpg"}