{"text": "It's been less than a week since the trailer of Shah Rukh Khan's most-awaited film Zero released but it has already landed in a controversy.\nAccording to an IANS report, Delhi Sikh Gurudwara Management Committee (DSGMC) general secretary, Manjinder Singh Sirsa on Monday filed a complaint against Bollywood actor Shah Rukh Khan for allegedly hurting the sentiments of the Sikh community in his upcoming venture Zero.\nIn a complaint filed at the North Avenue Police Station, Sirsa has said that they have received a number of complaints from the Sikh Sangat. In the complaint, Sirsa alleged that in the promo of the movie, actor Shah Rukh Khan has been shown wearing ‘Gatra Kirpan’ (Article of Sikh Faith) in their movie promo which has created an outrage among Sikh community worldwide.\nscreen grab/youtube\nThe Akali Dal legislator told the police that according to the Sikh Rehat Maryada only an ‘Amritdhari Sikh’ can wear Gatra Kirpan. He further urged the police to lodge FIR against the movie.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nInstagram/SRK FC\nHe also requested the authorities that the promo of the upcoming movie Zero showing actor Shah Rukh Khan wearing Gatra Kirpan, should be stopped without any further delay.\nHe further said that in the promo, the film star not only appears wearing the Kirpan but also the poster shows the star in a lighter mood thereby further showing the Sikh article of faith in a lighter vein.\nscreen grab/youtube\nHe added that Sikhs cannot tolerate such mischievous acts either in films or in real life. Sirsa further added, “Sikh Guru Sahiban have given enough power and strength to the Sikhs to fight with such situations if they arise in their life.”\nThe film Zero is an upcoming venture of Shah Rukh Khan, and also features Katrina Kaif and Anushka Sharma. It has been directed by Anand L. Rai.\nInputs From ANI", "title": "Shah Rukh Khan’s Zero In Trouble For Allegedly Hurting Sentiments Of Sikh Community", "date_publish": "06/11/2018, 10:37:53", "description": "Delhi Sikh Gurudwara Management Committee (DSGMC) general secretary, Manjinder Singh Sirsa on Monday filed a complaint against Bollywood actor Shah Rukh Khan for allegedly hurting the sentiments of the Sikh community in his upcoming venture Zero. Read more gere,", "authors": [], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-s-zero-in-trouble-for-allegedly-hurting-sentiments-of-sikh-community-356127.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/srk_zero_1541483525_800x420.jpg"}