{"text": "Acid attack is even brutal than death because the intent here is not to kill the person but to make him/her suffer for the rest of their life. The survivors of acid attack are brave as well as courageous. However, they do need love and support to be constantly reminded of the fact that beauty isn’t skin-deep.\nShah Rukh Khan who has been supporting the bravehearts of acid attack through his Meer Foundation, recently met with acid attack survivors and spent an afternoon with them. Soon after, he shared pictures on his Twitter handle and wrote a beautiful message along with it. He urged his fans to support his sisters.\nAll of u please put ur hands in prayer...and say Bhagwan inki zindagi ki nayi shuruaat mein...inpar karam karna...May God have mercy on them...Insha Allah. These r my sisters & need ur prayers for recovery, without distinguishing between the mode of prayer https://t.co/JjE8ZM08mX — Shah Rukh Khan (@iamsrk) March 28, 2019\nEarlier as well, Shah Rukh Khan in a video had talked about beauty and social acceptance. “Beauty is not skin deep, is often said but not really felt. We all need well, but we look away, we shy away from looking at things that are unpleasant, yet we want social acceptance for ourselves, we discriminate from inside, yet we fight for empowerment, yes we all need well, but we do look away,” he said in a video.\nDon't Miss 343 SHARES 460 SHARES 555 SHARES 1.7 K SHARES\nNot just Shah Rukh Khan, Deepika Padukone also wants to bring India’s attention to these beautiful souls. In her next film, she is playing the role of a real-life acid attack survivor Laxmi Agarwal, whose inspiring story will give you goosebumps.", "title": "Shah Rukh Khan Spends Time With Acid Attack Survivors, Writes A Heart-Felt Message For Them", "date_publish": "29/03/2019, 12:01:33", "description": "Shah Rukh Khan who has been supporting the bravehearts of acid attack through his Meer Foundation, recently met with acid attack survivors and spend an afternoon with them. Soon after, he shared pictures on his Twitter handle and wrote a beautiful message along with it. He urged his fans to support his sisters.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-spends-time-with-acid-attack-survivors-writes-a-heart-felt-message-for-them-364524.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shah_rukh_khan_spends_time_with_acid_attack_survivors_writes_a_heartfelt_message_for_them_1553840378_800x420.png"}