{"text": "Shahid Kapoor's Rugged Avatar In Kabir Singh Will Remind You Of Udta Punjab & Fans Are Impressed!\nShahid Kapoor's Rugged Avatar In Kabir Singh Will Remind You Of Udta Punjab & Fans Are Impressed!\nIt has been long since we saw Shahid Kapoor in a film, right? He was last seen in Batti Gul Meter Chalu.\npinimg.com\nThe man who has often left us floored with his impeccable performances in movies like Kaminey and Haider is back with a bang.\nScreengrab\nShahid Kapoor will next be seen in Kabir Singh, which is a remake of the original Telugu hit 'Arjun Reddy'.\nScreengrab\nHe plays a Doctor, Lover and a Rebel -- all that the same time. His character seems intense, powerful and disturbed too. In just one-minute teaser, he has left us all floored. Without further ado, take a look!\nFrom drugs to alcohol and a raw-edgy avatar of Shahid Kapoor, didn’t the teaser remind you of Udta Punjab?\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAnd fans are floored!\nFaaad Jaaaaabaarrassssttt wala Faaaaddduuuuu teaser ..You nailed it man...You just nailed it 👏👏👏👏👏👏👏👏👏👏 @shahidkapoor in & as #KabirSingh #KabirSinghTeaser .. FDFS fixed .. 👊👊👊👍👍👍 . https://t.co/7ZMezOy6yq — Manoj Sharma (@manojksharma2) April 8, 2019\nOhh Dauymmmm 😍\nLooking forward . 21st june 💁♥ @shahidkapoor #KabirSingh #KabirSinghTeaser\nTreaser Itna jordar toh trailer kaisa hoga .Cantwait ! https://t.co/QsHXU893tl — Vedhita (@vedhi16) April 8, 2019\nBAWAAAL!!!!! Range dekho range!!! Just compare the first dialogue and the last- kisine nahi dekha!!!! #KabirSingh 💪💪💪💪💪💪💪💪#Mass https://t.co/zZxXjX7BOz — Aziz Shaikh (@ForBeingAziz) April 8, 2019\nOMG!! Finally Dr. Kabir singh Att.. No words... @shahidkapoor Nailed it. 🔥 aag laga di 🔥 @imvangasandeep Sir no words I can see more raw and bold 🔥 https://t.co/lBjVqhaFi3 — why so serious? (@ErramRakesh) April 8, 2019\nFINALLYYYYY IT'S OUT NOW!!! @shahidkapoor YOU ARE PERFECTION AS USUAL....THIS MAN NEVER LETS US DOWN😭😭😭🙏🙏🙏🙏🔥🔥🔥🔥 — Dia💥 (@dia110dia) April 8, 2019\nThe movie is directed by Sandeep Vanga, the man who was behind the original one as well.\nKiara Advani, who is known for her role in Lust Stories, is playing Shahid's love interest in the movie.\nScreengrab\nIn an interview earlier, Shahid Kapoor had revealed what drove him to sign this project.\n“I usually don’t watch too many films in Telugu and it surprised me with its tonality, rawness, simplicity and the fact that it was so real and believable. The character is very fascinating for me as an actor because the emotional arc... is very original. I loved it and Vijay Deverakonda, who played Arjun, did it so well,” he said.\nWe are eagerly waiting for this one. What about you?", "title": "Shahid Kapoor's Rugged Avatar In Kabir Singh Will Remind You Of Udta Punjab & Fans Are Impressed!", "date_publish": "08/04/2019, 18:35:11", "description": "Shahid Kapoor will next be seen in Kabir Singh, which is a remake of the original Telugu hit 'Arjun Reddy'. He plays a Doctor, Lover and a Rebel -- all that the same time. His character seems intense, powerful and disturbed too. In just one minuted teaser, he has left us all floored. Without further ado, take a look! From drugs to alcohol and a raw-edgy avatar of Shahid Kapoor, didn’t the teaser", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shahid-kapoor-s-rugged-avatar-in-kabir-singh-will-remind-you-of-udta-punjab-fans-are-impressed-365082.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shahid_kapoors_rugged_avatar_in_kabir_singh_teaser_will_remind_you_of_udta_punjab_1554726873_800x420.png"}