{"text": "Shah Rukh Khan Completes 9 Years On Twitter, Fans Recalls His First Tweet And Shower Love!\nShah Rukh Khan Completes 9 Years On Twitter, Fans Recalls His First Tweet And Shower Love!\nNo matter how many films prove to be disasters at the box-office, Shah Rukh Khan still remains the undisputed King of Bollywood. With the amount of love and popularity that the actor has gained in years, it is impossible to imagine any of it fade away.\nHe has an enviable fan-base and there is no limit to the love that his fans shower on him. From China to South Korea, his friends are spread all over the globe.\nAgencies\nConsidering he is one of the most loved superstars, his online activity on social media is definitely monitored closely by his fans.\nAnd this is the reason how his friends started celebrating #9YearsOfSRKOnTwitter.\nAgencies\nFrom revisiting his first tweet which was dedicated to his close friend Karan Johar to describing why people love to follow him-his fans have given him a memorable ode on Twitter today. Read on!\nAgencies\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES\nHere is what happened when the memory of his Twitter anniversary popped up on the timeline.\n9 years back on this day, SRK joined Twitter and the rest is history. He's the most followed Indian actor!\nThank you so much for connecting with us and inspiring us like always.\nLots of love!❤️https://t.co/vcz6zVw8LD#9YrsOfSRKOnTwitter pic.twitter.com/5QGWbNIsEf — SRK Universe (@SRKUniverse) January 2, 2019\nThis Scene Has No Dailogue But This Scene Said 1000 Words Without Speaking #9YrsOfSRKOnTwitter pic.twitter.com/Bxfrxw9bO5 — Javed (@JoySRKian_) January 2, 2019\nSRKs 9 years On Twitter::\n9 Years.\n37.1Million Followers (Most Followed Indian Actor on Twitter).\n74 tweets with 10K+ Retweets.\nFirst Indian to cross 100K+ RTs.\nOnly Indian Actor to hav 150K+ RTed Tweet.\nFirst Indian to Do Video Tweet..#9YrsOfSRKOnTwitter pic.twitter.com/Gu6v37dQH5 — HARRY ZERO (@sharmahariom066) January 2, 2019\n9 years of domination on twitter from a MEGASTAR & his FANS 🔥@iamsrk#9YrsOfSRKOnTwitter — 💥ᏢᎡᎾᎢᎬᏟᎢᎾᎡ ᏚᏆNᏩᎻ💥 ᶻᵉʳᵒ ᶜʰʳᶦˢᵗᵐᵃˢ ²⁰¹⁸ (@SRK_Protector) January 2, 2019\nDon't wait for a man ,who breaks your heart ...\n#9 years of srk on twitter pic.twitter.com/TNiwAE9qnT — nawal aabed Allah (@aabed_nawal) January 2, 2019\n9 Years Of SRK On Twitter 😄😄 https://t.co/lo44tSo2pl — 😚Aafiya❤Bauua😘 (@Aafiya22) January 2, 2019", "title": "Shah Rukh Khan Completes 9 Years On Twitter, Fans Recalls His First Tweet And Shower Love!", "date_publish": "03/01/2019, 17:42:59", "description": "No matter how many films prove to be disasters at the box-office, Shah Rukh Khan still remains the undisputed King of Bollywood. With the amount of love and popularity that the actor has gained in years, it is impossible to imagine any of it fade away. He has an enviable fan-base and there is no boundary. From China to South Korea, his friends are spread all over the globe.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shah-rukh-khan-completes-9-years-on-twitter-fans-recalls-his-first-tweet-and-shower-love-359796.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shah_rukh_khan_1546516678_800x420.jpg"}