{"text": "Shah Rukh Khan Has The Funniest Take On Why He Can Never Work With Akshay Kumar\nShah Rukh Khan Has The Funniest Take On Why He Can Never Work With Akshay Kumar\nImagine a film that brings two mega-stars like Shah Rukh Khan and Akshay Kumar together? While filmmakers have time and again pleasantly surprised us with exciting casting, every fan dreams of watching Akshay Kumar and Shah Rukh Khan together on the silver screen.\nPinterest\nDuring a recent interview with DNA, Shah Rukh Khan finally responded to the big question: Why he and Akshay doesn't come for a film? Responding to this, Shah Rukh said,\nAgencies\n“What do I say to this? I don’t wake up as early as him.” While Akshay is known for waking up early and managing his schedules with precision, Shah Rukh prefers to work late at night.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 12.5 K SHARES\n\"I go to sleep when Akshay is waking up. His day starts early.By the time I start working, he is packing up and going home. So he can put in more hours of work. I’m a nocturnal person. Not many people are fond of shooting at night like me.”\nHe jokingly added that even if they sign a movie together, there are chances that they will never be able to meet on the sets. He said,\n“It will be fun to act with Akshay. Dono set pe hi nahin milenge. Woh jaa raha hoga aur main aa raha hounga (laughs). He’ll be leaving the set and I’ll be coming in. I would like to work like Akshay and with him, but our timings won’t match.”", "title": "Shah Rukh Khan Has The Funniest Take On Why He Can Never Work With Akshay Kumar", "date_publish": "05/02/2019, 13:59:36", "description": "He jokingly added that even if they sign a movie together, there are chances that they will never be able to meet on the sets. He said, “It will be fun to act with Akshay. Dono set pe hi nahin milenge. Woh jaa raha hoga aur main aa raha hounga (laughs). He’ll be leaving the set and I’ll be coming in. I would like to work like Akshay and with him, but our timings won’t match.”", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shah-rukh-khan-has-the-funniest-take-on-why-he-can-never-work-with-akshay-kumar-361615.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/srk_and_akshay_1549356613_800x420.jpg"}