{"text": "Shah Rukh Khan knows how to turn on the charm, both in reel and real life. He knows how to keep an audience transfixed whenever he talks about life. Everyone wants to adapt his ideology to their own lives. After all, it’s what made him a superstar without any backing in the industry, and decades since his debut, he remains the undisputed King Khan.\nTwitter\nAs 2018 takes its curtain call, we bring you a few highlights of SRK’s outlook on finding meaning in life.\nAccept imperfection\nToday, we all worry about a lot of things, and our brains are abuzz with a million what ifs. SRK believes there is no point in worrying about those questions and to accept life as it is, “We live most of our life thinking, ‘I wish I would be happier more than I am’. We don't realise that nobody is perfect, either emotionally, mentally or physically. So, we should accept that fast and not waste our time trying to be someone else while life passes us by. Life is just one; you just need to say, ‘this is, who I am, and is the best I can be’, instead of thinking about the incompleteness; you should take it as uniqueness. Just enjoy. God has given us one life and we should just live it the way we want.”\nTwitter\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES 555 SHARES\nStay restless, stay incomplete\nThe actor is the first to admit that he has been a part of dud projects, and has not only come to terms with it, he doesn’t regret his choices. He says he is an incomplete artist and that’s keeps him moving, “As an artist, I am very incomplete and I know that. That is why I wake up in the morning to go for work. Otherwise, why would I work hard and still do something? I am very restless, I am always thinking of a new setup in commercial cinema as an actor or producer. If you think you are complete, then you become boring.”\nTwitter\nWhat 2018 taught him\nSRK says that at the start of his career, most journalists thought he was rude and arrogant. “Today when I read my earlier quotes, like ‘I have come to rule not to be ruled’, I find it embarrassing. But I was not arrogant, I just had lack of knowledge in the art and craft of acting. If you know very little about anything, you feel you know it all, but you don't how deep it may be. For example, in science, we gain knowledge, but we don't know how deep it is. When I knew less I spoke more, but now that I know more, I try to speak less. I wish I knew more earlier so that I could be better. I can't better my past, but I can be better now. As an actor, I know I can do much better.”\nTwitter\nOvercoming failure\n“Jab film flop ho jaati hai (When a movie flops), you can say it was way ahead of its time and that's the best excuse you have. Somebody asked me, ‘What does ahead of its time mean? Time to yahi hai, ahead of time kya hota hai humko kya maalum (Time is now. Who knows what the lies ahead). Swades flopped and now everybody talks how a good that film was, so was it ahead of time? Or maybe be we realise the relevance of that film now and appreciate it more. Some of films have ranked bad and that's OK. As an actor, you need to tell different stories. For example, Chakde India did well, so should I keep on doing the same thing that means I am playing it safe. But, as an artist you can't keep making the same painting. Like DDLJ was flopped by the name but it is working till date. Devdas wasn't appreciated at film festivals, but the audiences liked it. I think, most importantly, there should be a story that touches the heart, and then only you will like it. Connection is essential.”\nTwitter\nWishlist of directors for 2019\n“I really enjoyed myself working with Mani Ratnam. I hope we have the chance to work together again. He had offered me Raavan, but I found it difficult because it was bilingual. I think Anand sir is someone I want to work again, but this time on an action film. I feel it will be really good. Bhansali Saab is someone I want to work as it's been a long time. He had offered me one film but I was busy with Zero. Amongst the new people, I think I would like to work with Rajkumar Hirani. So, all the famous directors are on my list”.\nSRK closes the year and looks ahead with his characteristic charm and wit intact.", "title": "Shah Rukh Khan Says 2018 Taught Him To Push Himself As An Actor", "date_publish": "18/12/2018, 13:21:25", "description": "Shah Rukh Khan knows how to turn on the charm, both in reel and real life. He knows how to keep an audience transfixed whenever he talks about life. Everyone wants to adapt his ideology to their own lives. After all, it’s what made him a superstar without any backing in the industry, and decades since his debut, he remains the undisputed King Khan. As 2018 takes its curtain call, we bring you a f", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-says-2018-taught-him-to-push-himself-as-an-actor-358817.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_1545118926_800x420.jpg"}