{"text": "Opening up about the failure of his last film Zero, Superstar Shah Rukh Khan says he felt bad when \"Zero\" failed, and he hasn't zeroed in on his next project till now.\nRed Chillies\n\"Unfortunately, 'Zero' itself wasn't received too well back home in India. Maybe I made the wrong film, maybe I did not do the right storytelling so I am a little wary how it will be received here and I hope people here will like it,\" Shah Rukh, who has been receiving a lot of love here, said in an interview to China Global Television Network (CGTN).\nShah Rukh's Zero has been selected as the closing film of the Beijing International Film Festival 2019. The fest will close on April 20.\nRed Chillies\nThe 2018 film features Shah Rukh Khan as a person with dwarfism in a love triangle with a scientist with cerebral palsy (actress Anushka Sharma) and a famous actress (Katrina Kaif). The actors were lauded for their performances. Despite a strong buzz and an ensemble cast, the film turned out to be a damp squib at the box office. Looking back, he said,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 449 SHARES 612 SHARES\n\"When it went wrong, I felt bad. That it got rejected by so many people... when you make a film like that for three years and it goes wrong... you get not depressed or anything but...I didn't want to see it. I am going to see it after three months. Maybe I will be able to figure out when I am away what went wrong with it.\"\nShah Rukh was overwhelmed to get a warm and happy welcome, as he tweeted \"I am red all over\". \"When I walked out, suddenly they screamed... and for a moment I thought they were doing it for something else or someone else. Now I have gotten to know that they were from Xinjiang,\" he said in the interview. The actor, who owns a production house, feels \"Indians should have a homegrown superhero\".\nRed Chillies\n\"Like Iron Man or Batman. Maybe we could do a film about Indian and Chinese superheroes… it will be really nice,\" he said, going on to express his interest in acting in a Chinese movie only if he learnt Mandarin.\nThe actor feels cinema is a modern culture about telling stories and \"storytelling and any art form is going to break barriers\". \"I know Chris Martin. But sometimes I don't understand his accent, but I like his music. These things enhance people-to-people culture. Language of art is beyond semantics and grammar.\"\n(With inputs from agencies)", "title": "Shah Rukh Khan Opens Up About The Failure Of Zero, Says \"Maybe I Made The Wrong Film\"", "date_publish": "19/04/2019, 11:55:50", "description": "The actor feels cinema is a modern culture about telling stories and \"storytelling and any art form is going to break barriers\". \"I know Chris Martin. But sometimes I don't understand his accent, but I like his music. These things enhance people-to-people culture. Language of art is beyond semantics and grammar.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shah-rukh-khan-opens-up-about-the-failure-of-zero-says-maybe-i-made-the-wrong-film-365729.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_1555656510_800x420.jpg"}