{"text": "Shahid Kapoor Shares Memory Of His First Meeting With Mira And It Has Full Filmy Feels\nShahid Kapoor Shares Memory Of His First Meeting With Mira And It Has Full Filmy Feels\nShahid Kapoor and Mira Kapoor might have had started their journey as life partners in an arranged marriage set up but their story has enough 'filmy' twists. Shahid spoke about wife Mira and how parenting works between them on Famously Filmfare and his revelations were interesting.\nHe recalled his first meeting with Mira and the way he explained, it felt like he's reading a scene from a Bollywood movie. He said,\nInstagram\n“It was a lovely evening and light was falling on her face. She just turned towards me and smiled and said something. I was like she is so young but I like her, I thought if something is wrong with me.\"\nHe added that he and his wife Mira have a different approach when it comes to parenting. He says she tells him to calm down a bit when it comes to their two children, while he feels she is “too casual”.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nOn being asked if being protective about his children was a ripple effect of his parent’s separation, Shahid said: “My wife tells me that I am a little obsessive and protective and that I need to calm down a little bit. I tell her that she is too casual. Having said that, we try and find the middle ground which I think is good for the kids because you need to have both types of parents.\nHe added that when it comes to parenting, balance is an important key. He added,\n“If both are too obsessive or both are too careless I don’t think that works, so you need to find that balance.\"\nOn the work front, Shahid is currently shooting for his upcoming film Kabir Singh.\n(With agency inputs)", "title": "Shahid Kapoor Shares Memory Of His First Meeting With Mira And It Has Full Filmy Feels", "date_publish": "20/01/2019, 13:29:34", "description": "Shahid Kapoor recalls the first moment when he met wife Mira: I thought she is so young but I like her Shahid Kapoor doles out some marriage secrets as he says wife Mira Rajput believes that he needs to calm down a bit about children Misha and Zain. Read more.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shahid-kapoor-shares-memory-of-his-first-meeting-with-mira-and-it-has-full-filmy-feels-360734.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shahid_and_mira_1547972135_800x420.jpg"}