{"text": "Directed by Aanand L Rai, the film stars SRK, Katrina Kaif and Anushka Sharma in lead roles. The three-minute long-trailer is packed with emotions and drama and some dialogues like:\n\"Plot dekhne ke paise thodi lagte hain.\"\n\"Out!\"\n\"Bahot milenge thumhaare jaise.\"\n\"Ganwar pasand hai mujhe.\"\n\"Lena hai hume.\"\nWhile the verdict on the trailer might not be very favourable but you can't ignore the meme-fest that fans started. We picked up the funniest ones. Read on!\nSRK was asked if he ever felt like a Zero in his life like the title of his film. Commenting on the same, SRK said, \"There are moments when we all feel we are zero. A few days back, I asked AbRam to sit with me, but he didn't and walked away then, I felt, am I not a good father who is not spending enough time with his kids. So that day I felt like a loser, but then, my wife told me that it's not the way you are thinking because your other two kids also do the same with you.\"\nDon't Miss 3.5 K SHARES\nThe duo went on to do films like Happy New Year and Chennai Express together and both the films did well at the box-0ffice. They share a great rapport in real-life too and we saw an example of this when during one of the gaming-rounds of Koffee With Karan, Padukone rang SRK up. In case of emergency, you can only call your dependable friends, right?\nAkshay plays the antagonist in superstar Rajinikanth's \"2.0\", which marks his southern debut. Speaking at the trailer launch event, Akshay said working on the project has been both challenging and fun.\nEver since, the leggy lass got engaged to singer-actor Nick Jonas, things have been turning even more bright and fun for her. Infact, her style diary too is oozing like never before. She's become fearless in her fashion choices and we're totally loving it.", "title": "Shah Rukh Khan Ruled The Internet Today And More From The World Of Entertainment", "date_publish": "03/11/2018, 16:38:22", "description": "Directed by Aanand L Rai, the film stars SRK, Katrina Kaif and Anushka Sharma in lead roles. The three-minute long-trailer is packed with emotions and drama and some dialogues like: \"Plot dekhne ke paise thodi lagte hain.\" \"Out!\" \"Bahot milenge thumhaare jaise.\" \"Ganwar pasand hai mujhe.\" \"Lena hai hume.\" While the verdict on the trailer might not be very favourable but you can't ignore the", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shah-rukh-khan-ruled-the-internet-today-and-more-from-the-world-of-entertainment-355988.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/trending_1541243392_800x420.jpg"}