{"text": "Shah Rukh Khan shared a special video with his fans in which she can be seen rapping. The King Of Bollywood urged people to vote in the Lok Sabha elections via his new song.\nShah Rukh Khan has urged the people of India to vote by releasing a song titled Karo matdan, sung by the superstar.\nThrough Karo matdan, Shah Rukh highlights the importance of people picking the government that loves the country and its citizens more than themselves.\nPM sahib @narendramodi ne creativity ki liye bola tha. Main thoda late ho gaya video banane mein...aap mat hona Vote karne mein!!! ‘Voting is not only our Right, it is our Power.’ Please Use It. Thank u to @tanishkbagchi @abbyviral @parakramsinghr . https://t.co/9280i8BnK3 — Shah Rukh Khan (@iamsrk) April 22, 2019\nShah Rukh shared the video on Twitter and captioned it, \"PM sahib Narendra Modi ne creativity ki liye bola tha. Main thoda late ho gaya video banane mein... aap mat hona vote karne mein (PM Narendra Modi asked for creativity and I got a little late in making a video. You don't get late for voting)! Voting is not only our right, it is our power'. Please use it.\"\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 343 SHARES\nThe song is composed by Tanishk Bagchi and written by Abby Viral. Shah Rukh was last seen on the big screen in 2018 film Zero. Recently, talking about the failure of Zero, Shah Rukh Khan had told IANS, \"Unfortunately, 'Zero' itself wasn't received too well back home in India. Maybe I made the wrong film, maybe I did not do the right storytelling so I am a little wary how it will be received here and I hope people here will like it.\"\nWith inputs from IANS", "title": "Shah Rukh Khan Takes The Gully Boy Route, Raps A Song Urging People To Vote!", "date_publish": "22/04/2019, 18:23:54", "description": "The song is composed by Tanishk Bagchi and written by Abby Viral. Shah Rukh was last seen on the big screen in 2018 film Zero. Recently, talking about the failure of Zero, Shah Rukh Khan had told IANS, \"Unfortunately, 'Zero' itself wasn't received too well back home in India. Maybe I made the wrong film, maybe I did not do the right storytelling so I am a little wary how it will be received here a", "authors": [], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-takes-the-gully-boy-route-raps-a-song-urging-people-to-vote-365903.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_1555935152_800x420.jpg"}