{"text": "Razdan responded to allegations made by Kangana Ranaut’s sister Rangoli Chandel, that she has no right to discuss Indian politics because she isn’t a citizen of the country. However, she questioned Kangana’s agenda and reminded Rangoli that it was Mahesh Bhatt who gave Kangana her big break in Bollywood.\nBeing an actor means that your personal life is always in the spotlight and Shahid has been no exception. From his arranged marriage to Mira Rajput to his two babies, fans have always got a closer look at actor's personal life-thanks to Mira and Shahid's social media accounts and the paps!\nDon't Miss\nSonam was a guest on Arbaaz Khan’s new web chat show, Pinch and during one of the segments of the show, she had to read a few mean comments written for her on social media. One Twitter user had criticised her for not learning how to act despite working as an actor in Bollywood for a decade.\nThe pictures are a testimony to the fact that no dream is too small. Have a look at the pictures.\nIf you call yourself the biggest Marvel fan, you won’t cheat and ruin the film for others. Five-minute spoiler-heavy footage from Avengers: Endgame was leaked yesterday, and if you have watched mistakenly or willingly, you would not spread it and ruin it for others.", "title": "Shahid-Mira's London Vacay, Kangana's Sister Rangoli Attacks Soni Razdan And More From Ent", "date_publish": "17/04/2019, 18:21:35", "description": "Razdan responded to allegations made by Kangana Ranaut’s sister Rangoli Chandel, that she has no right to discuss Indian politics because she isn’t a citizen of the country. However, she questioned Kangana’s agenda and reminded Rangoli that it was Mahesh Bhatt who gave Kangana her big break in Bollywood.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shahid-mira-s-london-vacay-kangana-s-sister-rangoli-attacks-soni-razdan-and-more-from-ent-365655.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_entertainment_news_1555504467_800x420.jpg"}