{"text": "From Mohabbatein to Devdas, every film that Shah Rukh Khan and Aishwarya Rai have worked together on, they have managed to set the screens on fire. After all, what would you expect when the King of Romance and the epitome of beauty collaborate and share the screen space? Their sizzling chemistry makes people go gaga over them.\nTwitter\nShah Rukh Khan and Aishwarya Rai Bachchan once again shared the stage together at Lux Golden Rose Awards. As Aishwarya was presented the award of Timeless Beauty by Shah Rukh Khan.\nTwitter\nThe diva got all emotional and thanked all her fans. She even mentioned Hema Malini, Zeenat Aman, Rekha, Madhuri Dixit, Kajol and remembered late legend Sridevi. As she was concluding her speech, she was interrupted by the King of wit Shah Rukh Khan.\nShah Rukh Khan first praised her for the body of talent that she is and then apologised for not attending Aaradhya’s birthday bash adding that his little munchkin AbRam was present there who thinks Amitabh Bachchan is his grandfather.\nAishwarya's speech after receiving the award from SRK. (Part 1)\nMentions Hema Malini, Zeenat Aman, Rekha, Madhuri Dixit, Kajol.\n\"We love you and miss you Sri ji\" #LuxGoldenRoseAwards pic.twitter.com/adB9IBGepI — హిమాలై🌈 (@Oxynom) November 18, 2018\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nRecalling the films in which he has worked with Aishwarya Rai Bachchan, Shah Rukh Khan poked fun at the roles they played and how he couldn’t romance her any of these films. He says, in Josh, they played twins, in Devdas, it was a tragic end, and in Mohabbatein, Aishwarya played a ghost. \"Mohabbatein mein yeh bhootni thi,\" he quips.\nPart 2 - SRK talks about Ash. pic.twitter.com/KqvItdtzUo — హిమాలై🌈 (@Oxynom) November 18, 2018\nShah Rukh Khan also expressed his wish to work with Aishwarya Rai Bachchan again, and we hope that happens soon.", "title": "Shah Rukh Khan Gives A Hilarious Speech As He Presents Timeless Beauty Award To Aishwarya Rai", "date_publish": "19/11/2018, 18:11:36", "description": "From Mohabbatein to Devdas, every film that Shah Rukh Khan and Aishwarya Rai have worked together on, they have set the screens on fire. Recalling the films in which he has worked with Aishwarya Rai Bachchan, Shah Rukh Khan poked fun at the roles they played and how he couldn’t romance her any of these films. He says, in Josh, they plated twins, in Devdas, it was a tragic end, and in Mohabbatein,", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-gives-a-hilarious-speech-as-he-presents-the-timeless-beauty-award-to-aishwarya-rai-356972.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/shah_rukh_khan_gives_a_hilarious_speech_as_he_expresses_his_wish_to_work_with_aishwarya_rai_bachchan_1542630416_800x420.jpg"}