{"text": "1. Shah Rukh Khan Wants To Play Virat Kohli On Screen & Here’s What Anushka Sharma Has To Say On It\nWhen Shah Rukh Khan was asked which cricketer he wants to play on-screen, he told Times Now, “Viral Kohli”.\n2. Gal Gadot Shares New Pics, Writes A Heartfelt Post As She Wraps Up Wonder Woman 1984’s Shoot\nGal Gadot, who will be reprising the role of Wonder Woman in the sequel titled 1984, has recently wrapped up the shoot of the movie. Sharing pictures of the same, Gal Gadot wrote a heartfelt note. She wrote why the movie will always be special to her and why shooting for it is no less than an emotional roller coaster ride.\n3. Salman Ali Declared As Indian Idol 10 Winner But The Internet Is Unhappy & Calls It Fixed!\nSalman Ali was one of the best contestants of Indian Idol 10 and he managed to mesmerize the judges as well the audiences on the show with his powerful voice, every time he performed on stage. Last night was the finale of the show and every contestant gave their best to win the title.\nDon't Miss 3.4 K SHARES 343 SHARES\n#1 Karan Johar revealed how he had to beg both Prabhas and Rajamouli to be the show. In fact, when KJo spoke to Rana to get them on the show, he said, “It’s never going to happen, they are very shy”. To which Prabhas said, “He was avoiding the show because he feels it’s better to watch him on movies”.\nAfter taking a sabbatical for a year and getting married to Ranveer Singh, Deepika Padukone has finally signed a movie. She will be seen in Meghna Gulzar's next titled Chhapaak, in which she will be playing the role of an acid attack victim.", "title": "Shah Rukh Khan Wants To Play Virat Kohli On Screen, Gal Gadot Writes A Heartfelt Post & More From Ent", "date_publish": "24/12/2018, 18:13:09", "description": "From Shah Rukh Khan saying that he wants to play Virat Kohli on screen and Anushka Sharma asking her to grow a beard if he wants to do that, to Gal Gadot wrapping up the shoot of Wonder Woman 1984 and sharing new pics along with a heartfelt post, here’s all that rocked the world of entertainment.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-wants-to-play-virat-kohli-on-screen-gal-gadot-writes-a-heartfelt-post-more-from-ent-359209.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_wants_to_play_virat_kohli_gal_gadot_writes_a_heartfelt_post__more_from_ent_1545655444_800x420.png"}