{"text": "Shah Rukh Khan’s Chinese Fans Give Him A Warm Welcome, Kiss His Hands And Scream 'I Love You'\nShah Rukh Khan’s Chinese Fans Give Him A Warm Welcome, Kiss His Hands And Scream 'I Love You'\nShah Rukh Khan – the name needs no introduction. The superstar of Bollywood, also hailed as King Khan, has fans across the globe. And where there is Shah Rukh Khan, the love is in the air!\nThis was proved yet again as Shah Rukh Khan headed to the special screening of Zero at the closing of 9th Beijing International Film Festival. As he reached the airport, a huge crowd of fans surrounded him.\nSRK Universe China team waiting for King Khan outside the airport ❤️ pic.twitter.com/gQaITZkfqU — SRK Universe (@SRKUniverse) April 17, 2019\nThey were all cheering for him, shouting his name, and swooning at the same time. The excitement was onto a different level.\nWherever he goes, he gets maximum love ❤️ World's biggest superstar Shah Rukh Khan pic.twitter.com/155e5iE7lL — SRK Universe (@SRKUniverse) April 17, 2019\nAnd Shah Rukh Khan was so overwhelmed seeing the unconditional love. He just couldn’t contain his emotions.\nSRK is live on weibo and answering the questions asked by FANs of China ❤️ Here is his love for all of you 💕 pic.twitter.com/gulFqHfBfL — SRK Universe (@SRKUniverse) April 17, 2019\nHe was blushing as fans kissed his hands. “What a warm and happy welcome here in China by SRK UNIVERSE China. Thx for the gifts, the flowers and the kisses. I am Red all over!,” he wrote on Twitter.\nWhat a warm and happy welcome here in China by SRK UNIVERSE China. Thx for the gifts, the flowers and the kisses. I am Red all over!! pic.twitter.com/0VFGjPBWQl — Shah Rukh Khan (@iamsrk) April 17, 2019\nDon't Miss 623 SHARES 2.4 K SHARES 343 SHARES 2.2 K SHARES 120 SHARES\nShah Rukh Khan just couldn’t contain his emotions. Just look how this fan grabbed his hand, kissed it and screamed ‘I love you’!\nShah Rukh Khan along with filmmaker Kabir Khan will be taking part in China-India Film Cooperation Dialogue, which is an effort to forge ways for the development of Indian as well as Chinese movies and creation of opportunities to strengthen film cooperation between the two countries.\nAlso Read: 9 Countries Where Bollywood Is Badshah", "title": "Shah Rukh Khan’s Chinese Fans Give Him A Warm Welcome, Kiss His Hands And Scream 'I Love You'", "date_publish": "17/04/2019, 17:42:06", "description": "Shah Rukh Khan gets mobbed by his fans in China. The superstar of Bollywood, also hailed as King Khan, has fans across the globe. And where there is Shah Rukh Khan, the love is in the air! This was proved yet again as Shah Rukh Khan headed to the special screening of Zero at the closing of 9th Beijing International Film Festival. As he reached the airport, a huge crowd of fans surrounded him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shah-rukh-khan-s-chinese-fans-give-him-a-warm-welcome-kiss-his-hands-and-scream-i-love-you-365641.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/shah_rukh_khan_gets_mobbed_by_his_fans_in_china_1555498961_800x420.png"}