{"text": "He is one of the biggest superstars of the country and that is why, Shah Rukh Khan has his own way of functioning as a performer. In a recent interview, SRK explained how he has never felt complete as an actor. And he further adds how this is exactly what has kept him going for almost three decades in the industry.\nThe 53-year-old actor says rather than looking for the end results, he believes in quietly celebrating milestones.\n(Also read: Shah Rukh Khan Gets Chucked Out Of Forbes Richest Celeb List But His Response Is Winning Hearts)\nAgencies\n\"I have never felt complete. As an artist, I am very incomplete and I know that. If I am not, then I would not like to work. If I am complete then why would I wake up in the morning and work hard and still try to do something?.\"\nKhan further added that being restless is his nature. He adds,\nAgencies\n\"I always think, within the commercial cinema set-up that I am working in, how can I bring in something new, as an actor, as a producer, in whatever capacity I can. I am not complete at all, I am very restless. If you think you are complete, then you are boring, over and done with!\"\nHe further explains that the issue with looking at things in life as a finish line, according to Shah Rukh, is what does one do when they cross it. He adds,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\n\"So I don't think of things as completing. As an old saying goes...the journey is important. If I cross anything, which I think is a good achievement then I don't think of it as an end-line, I think of it as a milestone. But I don't plan for it. I don't think of 'I should earn this much', or 'I should have that many awards', or 'I have to make that many hit films', I think it is very organic. Because, if you worked in films as long as I have, specifics become less important....\"\nHe adds that he is doing films but he never expects anything after it. He adds,\n\"After twenty-five years of working, I have realised that the only reason you should be working is for the happiness of your heart.\"\nHis upcoming film Zero, directed by Aanand L Rai, aims to celebrate the incompleteness of people. In the film, Shah Rukh plays a vertically challenged man while Anushka Sharma features as a scientist with cerebral palsy and Katrina Kaif plays an actor who is emotionally incomplete.\nShah Rukh clarifies that none of the characters of the film are asking the viewers for pity or sympathy. He adds,\n\"When films are made on special abilities, normally there is an attempt to gain sympathy. In the entire film, we have tried that all the three characters never ask for sympathy from the audience or the world. We don't want anyone's sympathy or empathy.\"\nFurther, he talks about the challenges of playing a vertically challenged person. He says that in no way was this a gimmick for him. He concludes by saying,\n\"For the last one year, we have been worried that the character's height shouldn't become the mainstay of the film. In the first ten-fifteen minutes and even after the trailer, you overcome that. That doesn't become a gimmick. Aanand and I didn't want that to happen.\"\nStarring Anushka Sharma and Katrina Kaif, Zero is scheduled to be released on December 21.\n(Also read: Talking About His Weak Moments, SRK Shares How Sometimes He Ends Up Feeling Like A 'Zero')\n(With PTI inputs) (Pictures: Red Chillies Entertainment)", "title": "Shah Rukh Khan Explains Why He Feels Incomplete And Restless As An Artist", "date_publish": "12/12/2018, 16:13:18", "description": "He might be one of the biggest superstars of the country but Shah Rukh Khan has his own way of functioning as a performer. In a recent interview, he explained how he has never felt complete as an actor. And he further adds how this is exactly what has kept him going for almost three decades in the industry.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/shah-rukh-khan-explains-why-he-feels-incomplete-and-restless-as-an-artist-358442.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_1544612837_800x420.jpg"}