{"text": "Before trolling her again on the internet, you should just listen to her story. Whenever we see latest pictures of actress Shama Sikander, one question immediately pops up in our mind, ‘What has she done to herself? So here's your answer straight from the horse’s mouth. Recently, Shama was trolled brutally for sharing her 10-year challenge picture and that's when we decided to get in touch with her.\nFirstly, we told her we were mind blown with her transformation too. Personally, I feel she looks gorgeous. Well, to each one his own.\nTwitter\nMy first question to Shama was, what made her go through this major transformation, and she confidently said,\n\"The actual changed happened when I was going through depression and bipolar. Earlier, I used to think you cannot change until you have to die or take a rebirth, it’s a very philosophical thing I am going to say right now. ‘Whenever we're stuck somewhere in life, we always feel, wish I had another chance or would've started it another way, but the truth is you actually can, in our mind we think we can’t, ab toh hum phas gaye hai, we can’t change anything’. I was going through the same feeling in my life and I wanted to change everything about me.”\nTwitter\nDon't Miss 2.2 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nShe continues, “I was too nice and naïve, that had brought pain and hurt in my life. I wanted to change that about myself. I wanted a new me. I think in today’s time there is so much conditioning that you don’t let your actual self come out, even if you are good, you are fake good, not authentic good. We are trying to be good because you are thought to be good and not honest.”\nTwitter\nShama even confessed that she was so depressed in life that she wanted to commit suicide, \"Slowly and gradually I learned it is possible to change yourself and you don’t need to die for that. I tried to commit suicide, but I am alive, and then I thought I will start afresh. And after that, I forgot my past completely, I started taking very good care of myself, started eating healthy, started good workouts and the change was beautiful.”\nTwitter\nThe actress says she wasn’t born with a silver spoon and had to do everything on her own,\n“ I am not born with a silver spoon, I made everything on my own and for that, I struggled very hard. I never had anyone backing me. There are lots of star kids today who have fixed number of producers and directors supporting them and that’s a very big mental support, you know if you are going to fall there is someone to pick you up. But in my case, I am the only one, I have to pick myself, no one is going to come and help me. So I promised myself I will be my best friend and here I am.”\nTwitter\nShama who gets brutally trolled for her transformation talks about plastic surgery which she has never gone through or has gone through. Well, she chose to keep it a secret, “I don’t just get into that negativity. My spirituality and depression have taught me that people will always judge you on the borrowed knowledge, they love to gossip, they don’t want to see how much hard work I do to be what I am. They don’t want to believe in that, they want to believe in an easy way, but what I have become is through a lot of hard work, but they aren't bothered.”\nInstagram\nThe actress further adds, “Lots of my colleagues have come and asked me, ‘Hey, I like your nose, where did you get it done from, I was like, if you have pretty nose, that doesn’t mean you have made it, everything doesn’t have to be made up, I don’t mind whoever wants to do whatever, but you can’t tell me this, because first of all, you are not sure that I have done it or not because you are not me.' You just want to grab attention, there are so many times, when I have replied to those negative comments and they end up saying, ‘oh ma'am, we are a big fan of you’, and I am like, 'okay, then why did you say such things, just to take my attention?' Whenever all these things come it doesn’t come from the core, so obviously it doesn’t bother to me.”\nInstagram\nWe asked Shama if her transformation affected negatively in her career and why doesn’t she come out and speak about it, she said,\n“ I don’t want to prove anything to anyone, who are they to ask me, ‘Maine kiya hai, ya nahi woh meri problem hai na, aapki toh nahi. Aur ye kya laga rakha hai plastic, plastic, what the hell is plastic? I don’t even understand this, I want to understand this from anyone who has gone under plastic surgery, how can that person only become plastic, matlab uska poora body plastic hogaya aapke hisaab se, woh plastic ban gaya matlab, just because someone did a small plastic surgery.”\nInstagram\nConvincingly she adds, “If somebody wants to look good and are not happy, they do change. Why do we do haircuts, put makeup, don’t do anything of this, ban everything in the world and just become jungleees that you were and remain there. Don’t even take bath then. And they are the same people to pick you when you start looking tired or when some photos look bad, they troll you and say oh you look old, bad and what not. I know it’s difficult for people to understand how can I look so good, it's magical to me too. I have changed 360 degrees, even I cannot connect myself to the old me, but the difference is I have gone through that transition and not they, so they won’t understand and that’s alright.”\nTwitter\nWhen questioned about her future plans on working in films, Shama said, “ If I have taken a break, that doesn’t mean I have stopped working, I am not getting what I want to do, that doesn’t mean I continue doing the same old stupid things which make no sense in today’s time. For me, it matters to what I do, for me it’s a commitment, I just don’t go on the sets to make money. I have to be honest and committed to the projects that I am associated with. I will be acting forever, that’s my life.”\nTwitter\nMore power to you, girl!", "title": "Shama Sikander Refuses To Be Called 'Plastic', Says This Word Can't Be Her Identity", "date_publish": "29/01/2019, 16:27:36", "description": "Before trolling her again on the internet, you should just listen to her story. Whenever we see the latest pictures of actress Shama Sikander, one question immediately pops up in our mind, ‘What has she done to herself? Today read why straight from the horse’s mouth. Of late Shame was trolled brutally for sharing her 10-year challenge picture and that we decide to get in touch with her. Firstly w", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/shama-sikander-refuses-to-be-called-plastic-says-this-word-can-t-be-her-identity-361243.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/shama_1548766522_800x420.jpg"}