{"text": "Internet is a dark and dangerous place. Because it is easily accessible to people, things go viral in an instant. And if you are a celebrity, you bear the burnt quit often.\nvia GIPHY\nKaran Johar, accidentally liked a tweet abusing Shah Rukh Khan while praising Akshay Kumar and his recently released movie Kesari. He unliked the tweet later on, but it was too late because a lo of fans had already taken a screenshot of it.\nTwitter\nIn India, celebrities are considered as demi-gods, and all of them have a massive fan following who often abuse other celebs on social media. When Shah Rukh Khan and Salman Khan were at loggerheads, fan clubs were fighting among themselves.\nSo, when Karan Johar liked this tweet, Shah Rukh Khan fans were quick to spot it. The hate-game began thereafter. So much so, that #ShameOnKaranJohar was trending on Twitter with about 22,000 people tweeting using the hashtag.\nDon't Miss 343 SHARES 814 SHARES 555 SHARES 263 SHARES 1.2 K SHARES\nThis is the tweet in question.\nThe man who shows believe on you always and support you in starting of your carrer who once ready to take bullet for you and now you are disrespected that person only #ShameOnKaranJohar its really very shameful @karanjohar you should ask apology for this act pic.twitter.com/4VV5K7Vd1K — shilpi Rai (@shilpirai22) March 22, 2019\nAnd trolling began soon after. People even tagged Shah Rukh Khan in their tweets.\n#ShameOnKaranJohar Dear @iamsrk open enemy is better than this type of poisnous snake\nbeware of this snake @iamsrk — shahid (@shahid57253154) March 22, 2019\nalia bhabhi apne papa ko samjao aukat mein raha kare#ShameOnKaranJohar — Gaurav Solanki (@Gaurav_Solankki) March 22, 2019\n@karanjohar tu sach me kalank hai dosti ke naam par....#ShameOnKaranJohar — Prince Pavan (@honestlypavn) March 22, 2019\nThis fucking snake. I think he forgot to switch accounts. Pretty sure he had got a hate account. #ShameOnKaranJohar — endgame (@loki_odinson_6) March 22, 2019\nKaran Johar soon issued a clarification.\nGuys having a technical problem with my twitter account! Strange things are going on!from uploading shoe picture and gibberish to liking tweets I haven’t even read and would NEVER even acknowledge! Please bear with me and I apologise for any inconvenience! Sorting it out asap! — Karan Johar (@karanjohar) March 22, 2019\nAaj twitter pe thodi gadbad ho gayi but baaki sab #firstclass hai. 🙈 — Karan Johar (@karanjohar) March 22, 2019\nGuess what! The controversy was so big that even Shah Rukh Khan responded to it!\nI hate clarifications on SM. @karanjohar is technologically challenged but has other good qualities like his taste in clothes!?Just like Life, twitter doesn’t come with instructions, so mistakes r natural....& also he has fat fingers. Go easy all, Make Lov not War...it’s more fun — Shah Rukh Khan (@iamsrk) March 22, 2019\nFandom can go crazy sometimes, don’t you agree?", "title": "#ShameOnKaranJohar:#ShameOnKaranJohar Trends Online After Karan Johar Accidentally Likes A Tweet Abusing Shah Rukh Khan", "date_publish": "22/03/2019, 15:50:30", "description": "Karan Johar, apparently, accidentally liked a tweet abused Shah Rukh Khan while praising Akshay Kumar and his recently released movie Kesari. He unliked the tweet later on, but it was too late because a lo of fans had already taken a screenshot of it.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shameonkaranjohar-trends-online-after-karan-johar-accidentally-likes-a-tweet-abusing-shah-rukh-khan-364133.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shameonkaranjohar_trends_online_after_karan_johar_accidentally_likes_a_tweet_abusing_shah_rukh_khan_1553248601_800x420.png"}