{"text": "Talking to Mumbai Mirror, producer Ramesh Taurani say, “Yes, we are making a sequel to Ishq Vishk. The story is in the scripting stage and could be about a teenage romance. Hopefully, in the next two-three months, we will lock the script and start looking for the director and cast.”\n“I suppose we have to live with it. This is the age of social media. I don’t think anything can be done about it.”\n\"Extremely sorry to hear of the passing of Shri Manohar Parrikar, Chief Minister of Goa after an illness borne with fortitude and dignity. An epitome of integrity and dedication in public life, his service to the people of Goa and of India will not be forgotten.\"\n\"There is a place and audience for all types of cinema - content and commercial and our industry has balanced it well. Films with good content are making good money at the box office. This is all because audience is more evolved than ever before. Audiences have evolved and so films have evolved to better resonate with that change. I don't think it's a matter of films being better or worse. It's a matter of being the reflection of the times,\" Kapoor told PTI.\nAfter creating the right amount of hype and buzz around the song, Dharma Productions dropped the song today on social media networks.\nDon't Miss 862 SHARES 346 SHARES", "title": "Sharmila Tagore Has Made Peace With Taimur's Popularity, Kalank's New Song Creates Waves & More From Ent.", "date_publish": "18/03/2019, 18:16:09", "description": "Sharmila Tagore Has Made Peace With Taimur's Popularity, Kalank's New Song Creates Waves & More From Ent.Sharmila Tagore Has Made Peace With Taimur's Popularity, Kalank's New Song Creates Waves & More From Ent.Sharmila Tagore Has Made Peace With Taimur's Popularity, Kalank's New Song Creates Waves & More From Ent.Sharmila Tagore Has Made Peace With Taimur's Popularity, Kalank's New Song Creates Wa", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sharmila-tagore-has-made-peace-with-taimur-s-popularity-kalank-s-new-song-creates-waves-more-from-ent-363916.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/bollywood_1552913728_800x420.jpg"}