{"text": "Today is veteran actress Sharmila Tagore's 74th birthday. Even though her family is complicated and complex like several other celeb families, there is something extremely endearing about this one. Be it Sara's equation with Kareena or Sharmila Tagore's equation with Sara, the family is distant but connected.\nIn a recent interview with IANS, she bared her heart on her granddaughter Sara Ali Khan’s confidence, humility and charm make her very happy and it’s heartwarming to see the daughter of Saif Ali Khan and his former wife Amrita Singh the way she has turned out.\nTalking about grand-daughter Sara who has made her debut with Kedarnath, she said,\n\"Yes, I am so excited about her debut (in the film Kedarnath). I am very impressed by her... though I don’t see why her self-confidence should surprise me. But whether it was Koffee With Karan, Rajeev Masand, BBC - her confidence, humility, and charm made me so happy. It’s so heartwarming to see her the way she has turned out. When asked what she’s doing in films after going to Columbia University she said the education was for her growth as a person and not for career. She’s never tongue-tied. And how well she stood up for her father on Karan Johar’s show. I am really proud of her.\"\nThat's not all. She also chuckled while talking about Grandson Taimur and his un-fizzled popularity. She added,\n\"I must confess I’m worried about him a bit. We in this family have all had our share of media attention. They place you on a pedestal and then suddenly drop you. At the moment Taimur is not affected because he’s too young to understand what’s going on. But later when he’s older and if the attention is taken away he might get affected. So we are a little concerned. But as Sara said, what can we do about it? Frankly, without the media, we are not alive in today’s day and age.\"\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nShe further spoke about how she has more time for her grand-kids now.\nAgencies\n\"I do have lots more time for my grandchildren, the kind of pressures on time that I tackled earlier is no more there though I do keep myself busy with professional commitments like the random ad here and a cinema conference there. But definitely, I now have more time for not just my grandchildren but also my children. I have more time for our ancestral home in Pataudi also.\"\n(With agency inputs)", "title": "Sharmila Tagore Says She's Proud Of Sara For Standing Up For Daddy Saif At Koffee With Karan", "date_publish": "08/12/2018, 11:20:30", "description": "Actor Sharmila Tagore, who will turn 74 on Saturday, says that her grand daughter Sara Ali Khan’s confidence, humility and charm makes her very happy and it’s heartwarming to see the daughter of Saif Ali Khan and his former wife Amrita Singh the way she has turned out.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sharmila-tagore-says-she-s-proud-of-sara-for-standing-up-for-daddy-saif-at-koffee-with-karan-358168.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sharmila_tagore_1544249096_800x420.jpg"}