{"text": "As He Talks On #MeToo, Saif Ali Khan Says People Don't Have Guts To Misbehave With His Family\nAs He Talks On #MeToo, Saif Ali Khan Says People Don't Have Guts To Misbehave With His Family\nSaif Ali Khan had earlier said that working with sexual predators in the industry is certainly off-limits for him. Now, speaking on the #MeToo movement, he said that he feels his family is automatically safeguard from sexaul advances. He feels nobody has the guts to misbehave with his family.\nAs the rise of #MeToo movement in India has opened many dark spaces of Bollywood, actor Saif Ali Khan, whose daughter Sara Ali Khan is gearing up for her Bollywood debut, feels no one has the guts to mess with his family members.\n\"It is a very unequal society. I don't think anyone will misbehave with my people... I don't know why I feel like this, but be it my mother or sister or wife, I feel people will not have the guts to do that with them. It might be because they have certain protection around them. So, we have to protect the ladies who don't have that protection around them or that aura that protects them. We have to make the place safe for the vulnerable ladies,\" Saif told IANS here.\nfacebook\nThe 48-year-old actor has urged people to respect everyone as he feels there's more to life than \"getting sh*t from each other\".\n\"We have to come to a situation where women feel safe enough to complain immediately and matters will be taken seriously. I hope the #MeToo movement stays in future and does not die down because it will create a comfortable atmosphere for everyone.\"\nDon't Miss 263 SHARES 707 SHARES 12.5 K SHARES 5.5 K SHARES\nApart from the #MeToo wave, the Dil Chahta Hai actor expressed concern over the growing paparazzi culture in India. He wondered how people could be so interested in his two-year-old son Taimur Ali Khan's life.\nbccl\n\"Media's constant attention to him does not really bother me, but it would be better if it was not there. If the media likes it, people like it, I am okay with it; but I won't be interested in someone else's kids so much. On one level, it is nice that he makes people laugh and smile; but on another level, why is so much attention given to a kid? Why are we so interested in a little kid so much? I don't undertstand it,\" he said with a smile.\nHe likes to keep his distance from social media, even though Taimur is a star in that space, while sister Soha Ali Khan and sister-in-law Karisma Kapoor are quite active on various platforms.\nSaif explained, \"I could easily be on social media but I don't like the idea of it. I like my own world. There are many horrible people out there. We all should create our own world. I don't want to be the voice in one more loud market...\nfacebook\n\"It becomes an addiction and we always worry about what people think. We should live our lives for ourselves. Putting a picture and (waiting to) see if someone likes it or not. What does it mean? I get my validation of what I feel... But not from other people.\"\nOn the acting front, Saif has been on a roll. After wooing the audience with his role as a police officer in \"Sacred Games\", Saif's latest film \"Baazaar\" sees him portray a rich Gujarati stock trader. He says he had to change his voice, walk and look for the film.\n\"That's a complete experience for an actor. I like films which involve a lot of talking and creating space and 'Baazaar' is one of that kind,\" said the actor, who really wants the movie to do well.\nfacebook\nThe actor has been a part of films like Hum Tum, Kal Ho Naa Ho, Salaam Namaste, Omkara and Race. Of late, he has featured in movies like Happy Ending, Rangoon, Chef and Kaalakandi.\nOn the kind of films that work at the box office nowadays, Saif said, \"I really don't know how something runs and something does not run... If I knew, I would be doing films which just run. I don't have an answer to it. It is good if films collect good money because so many people have invested so much money in the films. It does bother me, I would be lying if I say it does not bother me. But it (collections) does not affect my confidence because I know these things go up and down in life.\"\nInputs From IANS", "title": "Sharing His Two Cents On #MeToo, Saif Says People Don't Have Guts To Misbehave With His Family", "date_publish": "28/10/2018, 12:38:52", "description": "As the rise of #MeToo movement in India has opened many dark spaces of Bollywood, actor Saif Ali Khan, whose daughter Sara Ali Khan is gearing up for her Bollywood debut, feels no one has the guts to mess with his family members. \"It is a very unequal society. I don't think anyone will misbehave with my people... I don't know why I feel like this, but be it my mother or sister or wife, I feel peop", "authors": [], "url": "https://www.indiatimes.com/entertainment/sharing-his-two-cents-on-metoo-saif-says-people-don-t-have-guts-to-misbehave-with-his-family-355587.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/saif_ali_khan_1540708590_800x420.jpg"}