{"text": "What happens when a woman makes sexual harassment allegations against a man who vehemently denies it? Do we trust the victim who seems credible or do we give the man a benefit of doubt. Does being innocent until proven guilty matter?\nBCCL\nAs sexual harassment allegations against rich and powerful men are pouring out in abundance, a lot of people are facing the wrath of the #MeToo movement. While some including Rajat Kapoor have issued apologies, others such as Varun Grover have denied the charges categorically.\nBCCL\nTalking the same regard, Shatrughan Sinha says he is all for the #MeToo movement but feels that it is now being blown out of proportion. When he was asked about allegations against his friend Subhash Ghai, here’s what Shatrughan Sinha told NDTV in an interview.\nDon't Miss 837 SHARES 3.6 K SHARES\n“What happened to innocent until proven guilty? I am all for the MeToo movement, never in my 40-year career have I misbehaved with any woman. I treat every lady with utmost respect. Having said that, I think this MeToo campaign is being blown out of all proportion,” he said.\nAlso Read: To Ensure #MeToo Isn’t Misused, Kriti Sanon Urges Women To Reveal Their Identity Or File A Case", "title": "Shatrughan Sinha Feels #MeToo Movement Is Becoming ‘Free For All’ & Being Blown Out Of Proportion", "date_publish": "19/10/2018, 17:16:10", "description": "What happens when a woman makes sexual harassment allegations against a man who vehemently denies it? Do we trust the victim who seems credible or do we give the man a benefit of doubt. Does being innocent until proven guilty matter? Shatrughan Sinha says he all for the #MeToo movement but feels that it is now being blown out of proportion.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shatrughan-sinha-feels-metoo-movement-is-becoming-free-for-all-being-blown-out-of-proportion-355044.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/shatrughan_sinha_feels_metoo_movement_is_becoming_free_for_all__being_blown_out_of_proportion_1539865468_800x420.jpg"}