{"text": "Director: Richie Mehta | Cast: Shefali Shah, Rajesh Tailang, Rasika Dugal, Adil Hussain, Gopal Datt, Denzil Smith, Sanjay Bishnoi\nTeam Indiatimes has just watched two episodes of Shefali Shah starrer Delhi Crime. There is stoic silence and no chatter in the room. The 2012 rape case that shook the entire nation has left wounds that will take forever to heal. After seeing the cinematic adaptation of the case, it's hard to not have moist eyes.\nIndiatimes\nWhile we are still trying to process what we saw, we have actor Shefali Shah and director Richie Mehta walking in the room for a quick Q&A. All of us share silence for a minute or two before we could start asking them questions.\nIndiatimes\nAll of us exchange pleasantries with them and then begin a short session of questions and answers, to know what went behind making of the series, the challenges they faced and what they have in store for the viewers about the case that still leaves them crestfallen. Here are the excerpts.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n1. A more than 400 pages of script is what it took to execute Delhi Crime and later, it was broken down into seven wholesome episodes\nNetflix\nDirector Richie Mehta and Shefali Shah gave us a very interesting insight on their ambitious project. Talking about how he made a story of what happened in five days in seven episodes, Richie told us that a script of over 400 pages was what it took to make Delhi Crime. All the actors and the back end crew worked in sync to pull this off.\n2. Shefali Shah was confident about the project the minute she heard the script\nScreengrab\nPlaying the role of Vartika Chaturvedi (DCP, Delhi Crime Branch) was a challenge for her but she admitted that within 5 minutes of Richie narrating the script, she was already on-board for the project. She added that the role was demanding but she took it as a challenge to do full justice to it.\n3. Playing Vartika Chaturvedi in Delhi Crime was Shefali Shah's biggest learning curve till date\nNetflix\nShefali has been very experimental with her choice of roles. Be it films or TV shows, she has picked up roles of substance. Talking about the preparation of her character, she said, \"There could be no preparation for such a character. The project was like a marriage of three-four minds working together to make this happen. I got full support from Richie and I took each day as it came. I just went with the flow and in my head, I was very sure that there is no way I can do this half-heartedly. I was fully-committed to this project. It won't be wrong to say that it has been my biggest learning curve.\"\n4. Why playing Vartika Chaturvedi was more about striking the right balance between anger and determination\nScreengrab\nTalking about her role, Shefali told us: \"There is a specific approach that I follow with each of my roles. I don’t want to act like the character, I want to be the character\", Shah said.\n\"Vartika has anger and angst but as a woman, she is completely heartbroken after she gets to know the intricate details of the heinous crime. But instead of being emotional about it, my challenge as an actor was to strike the right balance and be determined and focused on nabbing the culprits.\"\n5. Four years of extensive research and 62 days of shoot: The actual journey of Delhi Crime\nScreengrab\nDirector Richie Mehta revealed that he took four years to do an extensive research on the project because he wanted everything factually accurate. He said, “I was trying to grapple with what had happened, like many of us were. It also came from the journalistic side of me… I was amazed at the precision with which this case was solved, and so quickly. I met the officers involved in the case and I was blown away by them. These were people who really wanted to do the right thing and in the right way. While we have seen documentaries and films revealing several other sides of the case, Delhi Crime shows the whole thing from the police team's point of view-which was never done before. After four years, some of the finest actors came together to pull of a over-400 pages script with utmost honesty and sincerity. ”\n6. United 93 and The French Connection were two films that inspired Richie Mehta as a director\nAs a director, two films that helped Richie in approaching the project from a pragmatic point of view were United 93 and The French Connection.\n7. The real interactions: Meeting the real police officers\nScreengrab\nShefali Shah admitted that one approach that helped her in crafting the character well was to meet the real police officers and hear their first hand encounter of handling the case and dealing with all the emotions within them. She said,\"I had the honour of meeting her and she is incredible. I don’t really know what she went through, what she felt, how she reacted moment to moment but there is an inherent grain which is in her and which comes through in Vartika and then it had to be married with him and my instinct and my impulse and the information and insight that she gave. I couldn’t have done it without both of them.\"\n8. Hand-held cameras were used for the interrogation scenes during the shoot\nScreengrab\nTo make the experience more cathartic for the audience, director Richie Mehta revealed that they used handheld cameras on purpose. He says, \"We wanted the audience like they are a part of our narrative and all that was happening on the sets. To make them feel more inclusive, we have shot those scenes with a handheld camera.\"", "title": "Shefali Shah Gives A Glimpse Into The Making Of 'Delhi Crime', The Docu-Drama On Nirbhaya Case", "date_publish": "20/03/2019, 16:00:35", "description": "Team Indiatimes has just watched two episodes of Shefali Shah starrer Delhi Crime. There is stoic silence and no chatter in the room. The 2012 rape case that shook the entire nation has left wounds that will take forever to heal. After seeing the cinematic adaptation of the case, it's hard to not have moist eyes.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/shefali-shah-gives-a-glimpse-into-the-making-of-delhi-crime-the-docu-drama-on-nirbhaya-case-364007.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shefali_shah_1553076053_800x420.jpg"}