{"text": "Shefali Shah Has No Qualms About Doing Limited Number Of Roles, As Long As They Are Special Ones\nShefali Shah Has No Qualms About Doing Limited Number Of Roles, As Long As They Are Special Ones\nIt was with the TV show called Hasratien, when 21-year-old Shefali Shah made a mark in the world of showbiz. It wasn’t just the bold narrative of the show that kept the audience hooked to their screens, it was Shah’s impeccable acting skills that lured them to watch it without fail.\nveethi\nShe made her debut with a show on Doordarshan called Aarohan, but got her due recognition in the year 1996 with Hasratien.\nUnfortunately, her fans haven’t had the pleasure to watch her spill magic both on the big and the small screen that frequently. However, that doesn’t mean that she hasn’t made her presence felt with whatever roles she has done so far.\nthe digital hash\nDon't Miss 159 SHARES 12.5 K SHARES 186 SHARES 185 SHARES 544 SHARES\nPersonally, I became her ultimate fan when I saw her in Monsoon Wedding. Playing the reserved girl Ria Verma, who tries to stay out of her predator uncle Tej, her ability to transform her timid character into a bold one, when she puts her foot down and shares the ordeal with her family and others, only went on to show that she took acting very seriously by giving more importance to her performance over everything else.\ntwitter\nSince then, there was no looking back. At the time when others would have thrown a fit to even think of giving it a shot, she willingly took the role of playing a mother to Akshay Kumar in the film Waqt: A Race Against Time. What’s more she played Amitabh Bachchan’s wife and struck a chord with people of all generations.\nveryshortnews\nShe then went on to win the National Film Award for the Best Supporting Actress for her role in The Last Lear, a critically acclaimed film. Commercially, she then floored us with Dil Dhadakne Do by playing Ranveer Singh and Priyanka Chopra’s mother and an unhappy wife trapped in a sham marriage with Anil Kapoor.\nindian express\nAt the moment, Shefali Shah is making headlines, thanks to her portrayal of DCP Vartika Chaturvedi in new Netflix show Delhi Crime Story.\nIndiatimes got an opportunity to catch a preview of the show before the premiere where Shah and director Richie Mehta came down to have an interesting chat with us.\nindiatimes\nDuring the course of our Q&A, we quizzed her about her professional journey and whether choosing a certain type of roles was deliberate or a coincidence. She said,\n“Well, I would love to do more work but over the time, I have realised that the kind of work I want to do may not come. It’s just, there are some interesting roles that are offered. There are some interesting projects. It’s the kind of work that I have done, I don’t have a lot of work on my resume. But what I do have, I am very proud of. So, if something comes to me, I have to really want to be on that set. “\nindiatimes\nShe then went on to explain, that she requires roles that challenge her as an actor. So much so, that it could be a 2 minute role in a movie but as long as it excites her, she will willingly take it up.\n“I should be obsessed with it(the role), or else it is really not fair, more to the maker than me. Earlier it used to bother me, like ‘O My God, I am not doing enough’ but now it doesn’t. I just realised that to do something special, it just takes time. So, it could be a year, it could be two years. And special doesn’t mean it has to be the lead or it has to be the commercial film or it has to be spread over. It could be anything. It could be 2 minutes in a film. 5 minutes in an 8 hour thing. But if it makes sense to me, if it excites me, I will do it.”\ntwitter\nWell, actors like her who put their heart and soul into doing each and every role are a rare find and we are glad that she entertains us every single time with her amazing performances. Her latest web-series Delhi Crime Story based on the horrendous Nirbhaya rape Case premiered on Netflix on March 22. And no points for guessing that it’s one show you wouldn’t want to miss.", "title": "Shefali Shah Has No Qualms About Doing Limited Number Of Roles, As Long As They Are Special Ones", "date_publish": "22/03/2019, 18:11:09", "description": "She Might Not Have A Lot Of Filmography But Shefali Shah Is A Talent, That’s Rare Breed In The Film Industry It was with the TV show called Hasratien, when 21-year-old Shefali Shah made a mark for herself in the world of showbiz. It wasn’t just the bold narrative of the show that kept the audience hooked to their screens, it was Shah’s impeccable acting skills that lured them to watch it withou", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/bollywood/shefali-shah-has-no-qualms-about-doing-limited-number-of-roles-as-long-as-they-are-special-ones-364152.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shefali_shah_1553257574_800x420.jpg"}