{"text": "1. After Sona Mohapatra, Singer Shweta Pandit Accuses 'Paedophile' Anu Malik Of Sexual Harassment\nAfter singer Sona Mohapatra accused him of sexual misconduct, another singer Shweta Pandit, who debuted in the world of Bollywood with Yash Raj Film's Mohabbatein, recounted what happened with her when she 15 years ago. In her Twitter post, she revealed Anu Malik told her he would give her work if she would kiss him.\n2. Vikas Bahl Files Rs 10-Crore Defamation Suit Against Former Phantom Partners Anurag Kashyap & Vikramaditya Motwane\nAccording to fresh agency reports, Filmmaker Vikas Bahl, accused of sexual assault by a former employee of Phantom Films, has filed an Rs. 10 crore defamation suit against Anurag Kashyap and Vikramaditya Motwane, his former partners in the production house.\n3. Vinta Nanda Takes The Legal Route & Files Police Complaint After Accusing Alok Nath Of Rape\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\n\"The police was very co-operative and they took my statement. It was not easy for me to give my statement as it is like reliving your pain. We have given a written complaint against Alok Nath and they registered the same,\" Nanda said, adding that she gave her statement to a female police sub-inspector.\n4. 8 Reasons Why 'Badhaai Ho' Isn't Just For Entertainment But Also A Great Topic Of Discussions!\nBadhaai Ho is a film that revolves around the life of a middle-aged man Jeetender Kaushik (Gajraj Rao), who works as a TTE in Indian railways. He is married to Priyamvada (Neena Gupta). However, the entire family lands in an awkward situation when Priyamvada gets to know about her untimely pregnancy.\n5. Nana Patekar Is Indecent But He Can’t Do Such A Thing, Says Raj Thackeray On Tanushree Dutta’s Allegations\n“I know Nana Patekar; he is indecent. He does crazy things but I don't think he can do such a thing. Court will look into it. What is the media to do with it? #MeToo is a serious matter, the debate over it on Twitter isn't right,” he said.", "title": "Shweta Pandit Accuses Anu Malik Of Sexual Harassment, Vikas Bahl Files Defamation Case & More From Ent", "date_publish": "18/10/2018, 18:07:56", "description": "The sexual harassment charges on Vikas Bahl has affected the entire Phantom Films, which now has also been dissolved. The unidentified woman employee alleged that Bahl sexually assaulted her in Goa during a promotional tour for the movie \"Bombay Velvet\" in 2015. Just to jog your memory a little, Phantom Films was established in 2011 by Anurag Kashyap, Vikramaditya Motwane, Vikas Bahl and Madhu Man", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/shweta-pandit-accuses-anu-malik-of-sexual-harassment-vikas-bahl-files-defamation-case-more-from-ent-355050.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/shweta_pandit_accuses_anu_malik_of_sexual_harassment_vikas_bahl_files_defamation_case__more_from_e_1539865386_800x420.png"}