{"text": "Siddharth And Ayushmann Khurrana Are Jamming Over Andhadun & We Might Get To See A Remake Soon!\nSiddharth And Ayushmann Khurrana Are Jamming Over Andhadun & We Might Get To See A Remake Soon!\n2018 proved that content is king in Bollywood. The fact that the films like Andhadhun and Badhai Ho won hearts and films of the Khans – Race 3, Thugs Of Hindostan and Zero – failed miserably at the box office – proves that audiences are demanding a change and they can’t be fooled with masala entertainers anymore. Scriptwriters are finally getting their due.\nTwitter\nWho would have imagined that a film like Andhadhun, which wasn’t promoted extensively, would do wonders at the box office! The Ayushmann Khurrana movie received immense love from the audiences as well as critics. So much so, that it has been named as the best film of 2018 by IMDb.\nIt has been more than 100 days since the movie was released, and it is still playing in cinema halls.\nAnd now actor Siddharth, who is known for his stellar performances in films such as Andhadhun, wants a South Indian remake of the movie.\nQuick vote - since it's on the table already, how many of you want to see me remake this lovely film? I'm very serious:) #Andhadhun @ayushmannk #sriramraghavan #Classic https://t.co/lhW4cKfIPM — Siddharth (@Actor_Siddharth) December 26, 2018\nDon't Miss 862 SHARES 322 SHARES 197 SHARES 18.3 K SHARES 12.5 K SHARES\nAs soon as he posted about it on Twitter, asking people for their viewpoint, Ayushmann Khurrana was all game!\nGo for it machaan! 🧡😎 https://t.co/BroTt8vjaz — Ayushmann Khurrana (@ayushmannk) December 26, 2018\nSiddharth was quite pleased with his response.\nAb aap keh rahe ho tho... ❤️😎 https://t.co/0SNfT0z2SN — Siddharth (@Actor_Siddharth) December 26, 2018\nWhat’s your take on this? Tell us in the comments section below.", "title": "Siddharth And Ayushmann Khurrana Are Jamming Over Andhadun & We Might Get To See A Remake Soon!", "date_publish": "26/12/2018, 17:50:06", "description": "Who would have imagined that a film like Andhadhun, which wasn’t promoted extensively, would do wonders at the box office! And now actor Siddharth, who is known for his stellar performances in films such as Andhadhun, wants a South Indian remake of the movie.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/siddharth-asks-if-he-can-remake-2018-s-best-film-andhadhun-ayushmann-khurrana-gives-a-go-ahead-359326.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/actor_siddharth_wants_to_remake_2018s_best_film_andhadhun_ayushmann_khurrana_gives_it_a_goahead_1545825918_800x420.png"}