{"text": "Siddharth Does It Again, Takes A Hilarious Jibe At Akshay Kumar For The PM Modi Interview\nSiddharth Does It Again, Takes A Hilarious Jibe At Akshay Kumar For The PM Modi Interview\nAkshay Kumar announced it to his fans that he is all set to venture into an unknown and uncharted territory with something he had not done before. He announced the news of having a \"candid and completely non- political\" chat with Modi on Wednesday.\nHe added that his conversation with the prime minister will be also a breather in election time. The interview took place in New Delhi today and was telecasted by news agency ANI.\nTwitter\nIn the interview, PM Modi gave insights into his personality, his political friendships and much more. While the interview is being dissected by people all over India, there is one person who had the most subtle judgement to pass.\nTwitter\nDon't Miss 814 SHARES 1.2 K SHARES 9.8 K SHARES 12.5 K SHARES 5.4 K SHARES\nIn his tweet, Rang De Basanti actor Siddharth wrote, \"#Akshaykumar is very underrated as a villain.\" and it isn't a tough nut to crack that it's a jibe at Akshay Kumar!\n#akshaykumar is very underrated as a villain. — Siddharth (@Actor_Siddharth) April 24, 2019\nThe tweet has over 1,517 Retweets 8,791 Likes, proving that a lot of people got the point that he was trying to make. And in no time, fans had a lot to say after his tweet. Check out some of the tweets:\nYou are underrated as a Comedian. — Prasath (@imprasath) April 24, 2019\nHilarious — Madan sharma (@Mannsharma090) April 24, 2019\nhe is very underrated as canadian — ysh paul (@paul_ysh) April 24, 2019\nhe is very underrated as canadian — ysh paul (@paul_ysh) April 24, 2019", "title": "Siddharth Does It Again, Takes A Hilarious Jibe At Akshay Kumar For The PM Modi Interview", "date_publish": "24/04/2019, 17:11:53", "description": "Akshay Kumar announced it to his fans that he is all set to venture into an an unknown and uncharted territory with something he had not done before. He announced the news of having a \"candid and completely non- political\" chat with Modi on Wednesday. He added that his conversation with the prime minister will be also a a breather in election time. The interview took place in New Delhi today an", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/siddharth-does-it-again-takes-a-hilarious-jibe-at-akshay-kumar-for-the-pm-modi-interview-366033.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/akshay_kumar_1556103968_800x420.jpg"}