{"text": "Siddharth Is Going After The Govt For Politicising The Pulwama Terror Attack And He Has A Point\nSiddharth Is Going After The Govt For Politicising The Pulwama Terror Attack And He Has A Point\nWhether it was the Kollywood strike or emerging as a hero during Kerala floods, Bollywood actor Siddharth has always voiced his opinion on Twitter and made people aware that not all actors avoid debates.\nTwitter\nThis time, when the country is going through an on-going tension with Pakistan after Pulwama, Siddharth came forward to tweet about what he feels.\nPM Narendra Modi addressed one of the gatherings saying that it's shocking how people are asking for proofs around the air stirke and it;s heart-breaking to see why people don't believe in our armed forces. Attacking primarily the opposition, PM Modi said,\nDon't Miss 837 SHARES 862 SHARES 346 SHARES\n“First, they (Opposition parties) asked for surgical strike proof. Now, they have even started asking for proof of the air strike by the Indian Air Force. Why are Congress and its allies demoralising our forces? Why are they giving statements which are benefiting our enemies.”\nIt is natural that we all should believe the armed forces and be proud of the forces.\nYet, I don’t understand why some people still want to question the forces: PM @narendramodi — PMO India (@PMOIndia) March 4, 2019\nThe same was tweeted by PMO India twitter handle. This tweet received mixed reactions but Sidhaarth couldn't help but retort to this. Slamming the PM and his government, Siddharth said,\nOur people believe and stand by the armed forces. It's you and your gang they don't believe. Stop politicizing #Pulwama. Stop pretending to be heroes on the backs of real heroes. You should respect the forces. You are not a soldier. Don't expect to be treated like one. Jai Hind. https://t.co/SEwI1Zw5Bh — Siddharth (@Actor_Siddharth) March 4, 2019\n\"Our people believe and stand by the armed forces. It's you and your gang they don't believe. Stop politicizing #Pulwama. Stop pretending to be heroes on the backs of real heroes. You should respect the forces. You are not a soldier. Don't expect to be treated like one. Jai Hind.\"\nWell, India clearly needs more socially vocal actors like Siddharth. What do you think?", "title": "Siddharth Is Going After The Govt For Politicising The Pulwama Terror Attack And He Has A Point", "date_publish": "04/03/2019, 18:47:10", "description": "Siddharth Takes A Dig At Prime Minister Narendra Modi, Says 'Stop Politicizing Pulawama' Siddharth Takes A Dig At Prime Minister Narendra Modi, Says 'Stop Politicizing Pulawama' Siddharth Takes A Dig At Prime Minister Narendra Modi, Says 'Stop Politicizing Pulawama' Siddharth Takes A Dig At Prime Minister Narendra Modi, Says 'Stop Politicizing Pulawama'", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/siddharth-is-going-after-the-govt-for-politicising-the-pulwama-terror-attack-and-he-has-a-point-363153.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/siddharth_1551707211_800x420.jpg"}