{"text": "Siddharth Slams Kohli For Leave India Comment To A Fan, Calls It An 'Idiotic Choice Of Words'!\nSiddharth Slams Kohli For Leave India Comment To A Fan, Calls It An 'Idiotic Choice Of Words'!\nJust like many others who outraged over Virat Kohli's 'Leave India' comment to a fan, Indian actor Siddharth too has reacted. Just to jog your memory a little, Kohli asked a fan to 'leave India' after he said he likes watching English and Australian batsmen more than the Indians.\nFollowing this, Kohli courted a major controversy during the launch of his mobile application when he read out a tweet that read,\n\"Over-rated batsman and personally I see nothing special in his batting. I enjoy watching English and Australian batsmen more than these Indians.\"\nTo this, Kohli replied,\n\"Okay, I don't think you should live in India then...you should go and live somewhere else, no? Why are you living in our country and loving other countries? I don't mind you not liking me but I don't think you should live in our country and like other things. Get your priorities right,\" Kohli replied.\nA lot of people reacted to Kohli's comment and called him 'arrogant' and obnoxious. Joining the set of people who couldn't digest this comment is Rang De Basanti actor Siddharth.\nCalling Indian skipper's comment \"an idiotic set of words\", Siddharth took to Twitter to express his displeasure. He wrote,\nScreengrab\nDon't Miss 3.5 K SHARES 518 SHARES 235 SHARES\nYesterday, after drawing flak for his comments, Kohli had issued a clarification where he said,\n\"I guess trolling isn't for me guys, I'll stick to getting trolled! I spoke about how \"these Indians\" was mentioned in the comment and that's all. I’m all for freedom of choice.Keep it light guys and enjoy the festive season. Love and peace to all.\"", "title": "Siddharth Slams Kohli For Leave India Comment To A Fan, Calls It An 'Idiotic Choice Of Words'!", "date_publish": "09/11/2018, 11:59:12", "description": "Following this, Kohli courted a major controversy during the launch of his mobile application when he read out a tweet that read, \"Over-rated batsman and personally I see nothing special in his batting. I enjoy watching English and Australian batsmen more than these Indians.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/siddharth-slams-kohli-for-leave-india-comment-to-a-fan-calls-it-an-idiotic-choice-of-words-356331.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/kohli_1541746095_800x420.jpg"}