{"text": "Aamir Khan’s track record was broken recently with the failure of Thugs of Hindostan, which not only tanked in India but also in China – a country that has always showered love upon their Uncle Khan.\nOn the other hand, Rohit Shetty who is hailed as the man with hit formula worked his magic with yet another film recently. With his recipe of success, his film Simmba, which stars Ranveer Singh, Sara Ali Khan and Ajay Devgn, has already crossed the Rs 100 crore.\nAFP\nSimmba is Rohit Shetty’s eighth consecutive hit film (after Golmaal 3, Singham, Bol Bachchan, Chennai Express, Singham Returns, Dilwale and Golmaal Again) which has crossed Rs 100 crore mark at the box office. And he is the only Bollywood filmmaker who has achieved this landmark. Simmba has made more than Rs 124 crore in just five days.\nDon't Miss 185 SHARES 544 SHARES 1.7 K SHARES 411 SHARES 12.5 K SHARES\nAnd now, grapevine is abuzz with rumours that a sequel to Simmba is in the works. If a report on Bollywood Hungama is to be believed, Rohit Shetty is planning to make a sequel to the film. If you remember, he even hinted on the same on The Kapil Sharma Show.\n“Rohit Shetty has not designed Simmba as a one-off occurrence. Ranveer will be back as Simmba again. And this time, Ajay Devgn’s Singham won’t be a cameo like it is in Simmba. In the next Simmba film, Ranveer and Devgn will be fighting corrupt elements as a team,” a source told the report.\nPTI", "title": "Simmba Becomes Rohit Shetty’s 8th Consecutive Film To Cross Rs 100 Crore, Sequel Maybe On Cards", "date_publish": "03/01/2019, 16:31:31", "description": "Simmba is Rohit Shetty’s eighth consecutive hit film (after Golmaal 3, Singham, Bol Bachchan, Chennai Express, Singham Returns, Dilwale and Golmaal Again) which has crossed Rs 100 crore mark at the box office. And he is the only Bollywood filmmaker who has done achieved this landmark. Simmba has made more than Rs 124 crore in just five days.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/simmba-becomes-rohit-shetty-s-8th-consecutive-film-to-cross-rs-100-crore-sequel-maybe-on-cards-359784.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/simmba_becomes_rohit_shettys_8th_consecutive_film_to_cross_rs_100_crore_sequel_maybe_on_cards_1546511600_800x420.png"}