{"text": "Simmba's Aankh Maare Remix Is Here & The Internet Is Quite Happy With This Ranveer-Sara Number\nSimmba's Aankh Maare Remix Is Here & The Internet Is Quite Happy With This Ranveer-Sara Number\nBollywood has come to a full circle. After making some original master pieces back in 90s, 2018 has been only about remixing them. From the sizzling Dilbar to the party number Urvasi, remixes have become a fad again.\nTwitter\nAnd one such song that is making its way back in the market is 'Aankh Maare'. The original song featured Arshad Warsi in Tere Mere Sapne was quite a hit and looks like the brand new remix will just double its popularity. In fact, it already has.\nTake a look.\nThe song stars Ranveer Singh and Sara Ali Khan with a teensy cameo from Karan Johar. Sara's second film Simmba which is all set to release next week is nothing like her first.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nScreengrab\nThis one is a typical Rohit Shetty film with lots of action, party tracks and drama. In the song, Ranveer and Sara can be seen twinning in black. The highlight of the song are the Golmaal boys who give a pleasant surprise in the end. Yes, which also means Arshad who was in the original one as well. Check out the internet reactions.\nDid they get Kumar Sanu to sing it ?? Cuz then I’m all in baby!! #AankhMaare — Simmba Aala Re ! 🔥 (@shukla_swasti) December 5, 2018\nLoveeeeed this song back in the day & even though “oh god one more remix”... how good is this💥💥🤩🤩🤩😋 Lovin #SaraAliKhan , energy bomb @RanveerOfficial & highlight is the golmaal boys esp the original #AankhMaare boy @ArshadWarsi .. Def party song of the season!!!💃🏻💥 #simmba https://t.co/OzZWV70xnH — Sophie Choudry (@Sophie_Choudry) December 6, 2018\nAlways. I like this Aankh Maare though, they didn't mess around too much with it — Shreemi Verma (@shreemiverma) December 6, 2018\nAnd 22 years later the king of explosive masala entertainers #RohitShetty brings back 1996's \"Aankh Maare” which sky-rocketed the career of #ArshadWarsi, for his film #Simmba. Featuring Arshad Warsi, #SaraAliKhan & #RanveerSingh together.\nA treat to watchhttps://t.co/RQIOePCjSw — Scheff (@shafiqulhasan81) December 6, 2018\nWith Golmaal team and remake of aankh maare....Rohit might get big music support this time. — ANKUR (@ankur_16n) December 5, 2018\nThe filmmakers have also added a chunk from the original song which has Kumar Sanu singing the song and people can't stop gushing over it.", "title": "Simmba's Aankh Maare Remix Is Here & The Internet Is Quite Happy With This Ranveer-Sara Number", "date_publish": "06/12/2018, 15:11:21", "description": "sara ali khan, simmba, ranveer singh, remix, bollywood, aankh maare, songssara ali khan, simmba, ranveer singh, remix, bollywood, aankh maare, songssara ali khan, simmba, ranveer singh, remix, bollywood, aankh maare, songssara ali khan, simmba, ranveer singh, remix, bollywood, aankh maare, songssara ali khan, simmba, ranveer singh, remix, bollywood, aankh maare, songssara ali khan, simmba, ranveer", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/simmba-s-aankh-maare-remix-is-here-the-internet-is-quite-happy-with-this-ranveer-sara-number-358064.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/simmba_1544090052_800x420.jpg"}