{"text": "Popular Assamese singer Zubeen Garg has appealed to the Chief Minister to take measures to scrap the controversial Citizenship (Amendment) Bill within seven days.\nEven as artistes and singers in the state came out on the streets during the “Assam bandh” to protest against the bill, Garg posted an emotional letter addressed to Sonowal on social media along with a photograph of himself holding the letter.\nTwitter\nAddressing the chief minister as “Sarbada”, the singer said, “Even if the Citizenship Bill has been passed in the Lok Sabha, Sarbada can say no to it. Speak and see, rest will be seen later. I am still keeping my cool.”\n“I won’t be in Assam for one week. It will be good if Sarbada takes some action before my return. Otherwise this time, I will agitate on my own. What I will do, I don’t know,” Garg said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn the face of widespread resentment against the bill, with the AASU, the KMSS, litterateur Hiren Gohain and others speaking against it, the heart-throb of Assam appealed to Sonowal to rethink his stand on the bill.\n“If everyone is opposing the move, why are you not re-considering your decision?”\n“Under no circumstance will the Citizenship Bill be accepted. I am 45 years old now. Since my birth, we have been hearing only about Bangladeshis. It shames me that the very people, who were agitating that illegal Bangladeshi foreigners are not needed, now in their desperation to remain ministers and legislators, are determined to destroy Assam,” he wrote\nZubeen further said: “Sarbananda was himself in AASU. If he does this, whom will we trust. If there is no leader, revolution becomes very dangerous. If that happens, the responsibility of destroying Assam will lie with Sarbananda Sonowal…Instead of clapping sitting beside Prime Minister Narendra Modi, there are more important issues to look after in the state. He (Sonowal) may not be ashamed of his act…we are.”\ngeetguru\nMeanwhile, prominent singers such as Bipin Chowdang, Neel Akash, Kusum Kailash, Madab Ranjan and Debajit Borah took part in the protest against the bill, singing Assamese music legend Bhupen Hazarika’s songs. They also urged Chief Minister Sonowal to “save Assam for Assamese people”.\nThe Lok Sabha passed on Tuesday the Citizenship (Amendment) Bill that seeks to amend the Citizenship Act, 1955 to grant Indian nationality to people from minority communities — Hindus, Sikhs, Buddhists, Jains, Parsis and Christians — from Afghanistan, Bangladesh and Pakistan after six years of residence in India instead of 12 even if they don’t possess any proper document.\nInputs from PTI", "title": "Singer Zubeen Garg Criticises Assam CM, Threatens To Launch Agitation Against Citizenship Bill", "date_publish": "09/01/2019, 17:39:34", "description": "Popular Assamese singer Zubeen Garg on Tuesday threatened to launch an agitation by himself if Assam Chief Minister Sarbananda Sonowal fails to take measures to scrap the controversial Citizenship (Amendment) Bill within seven days. Even as artistes and singers in the state came out on the streets during the “Assam bandh” to protest against the bill.", "authors": [], "url": "https://www.indiatimes.com/entertainment/singer-zubeen-garg-criticises-assam-cm-threatens-to-launch-agitation-against-citizenship-bill-360111.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/zubeen_garg_1547032973_800x420.jpg"}