{"text": "Behind every successful and inspiring story, there is a struggle that not many like to talk about. Not every journey is a cakewalk and for some, the period of trials and tribulations stretch indefinitely.\nBut after passing all these tough phases, the view from the other side is often more more than beautiful. For singer Jasleen Royal, she believes that it takes a series of projects to get one successful project in hand.\nInstagram\nJust to jog your memory a little, Jasleen appeared as a contestant on the first season of reality TV show India's Got Talent. On it, she was called a one-woman band as she can play different musical instruments while singing.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"I think it's funny and interesting how I got the tag! Kirron Kher Ma'am called me that when I was a contestant on India's Got Talent and it stayed with me,\" she added.\nFrom an independent artists to a Bollywood playback singer-the transition\nFor 27-year-old, her big debut in Bollywood music industry happened with Sonam Kapoor starrer Khoobsurat. Her song Preet became a popular track for every heartbroken soul. She then landed some more projects that includes songs in films like Phillauri, Dear Zindagi, Baar Baar Dekho and now Gully Boy and Akshay Kumar-starrer Kesari.\nInstagram\n\"I got a lot of love from people after the release of Love You Zindagi song. People from every age group know the song. They started recognising me after that song, but it won't be fair to call it as a milestone project. I do not believe in milestone projects. It takes a series of projects to land into a great project. I don't believe in overnight success,\" Jasleen told IANS.\nYou would be living under a rock if you are unaware of the fact that before stepping into B-Town, she had released three singles—Panchhi Ho Javan, Mai Ni and Din Shagna Da.\nTalking about her struggling days, she recalled how she used to save money from her gigs to release her first single. She said,\n\"I am grateful for how things have turned out. If I look back at my first single Panchhi Ho Javan, which was a zero budget song, I still remember how I used to save money from my gigs. I would get Rs 7,000-8,000 from my gigs and then I saved it to record my first single. I put it (the song) on YouTube. It reached many people from the industry. I then got an offer for Khoobsurat (Preet) and that's how one thing led to another. It was not an overnight shift. It was a gradual process.\"\nCurrently, she is basking in the success of her popular track \"Chalun Main Jahaan\" from Gully Boy.\nInstagram\nHer short and sweet appearance in the film is earning her praises too!\n(With agency inputs)", "title": "Singer Jasleen Royal's Story Of Releasing Her First Solo With Her Saved Money Is Inspiring!", "date_publish": "20/02/2019, 15:29:13", "description": "For 27-year-old, her big debut in Bollywood music industry happened with Sonam Kapoor starrer Khoobsurat. Her song Preet became a popular track for every heartbroken soul. She then landed some more projects that includes songs in films like Philauri, Dear Zindagi, Baar Baar Dekho and now Gully Boy and Akshay Kumar-starrer Kesari.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/singer-jasleen-royal-s-story-of-releasing-her-first-solo-with-her-saved-money-is-inspiring-362475.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/jasleen_1550652284_800x420.jpg"}