{"text": "Six years after the suicide of his ex-girlfriend Jiah Khan, actor Sooraj Pancholi has finally broken his silence. On the occasion of his 28th birthday, Pancholi wrote a heartbreaking note and posted on social media.\nAddressing the legal battle that he has been fighting since last six years, Pancholi mentioned how he has been portrayed as the 'monster' in media.\nIn his note, he mentions what he had to go through during these six years. From talking about how he felt to thanking people who extended support to him, this note presents his side of the story.\nHe wrote,\n\"Today I complete 28 years of my life. I want to take up this moment to share a few thoughts that have been in my heart for a while. I wanted to wait to speak out until the case ended, but it’s taken longer than expected. I don’t know where to start from. It is difficult to express some feelings when so many people, so many emotions are involved. First, I want to thank those who have stood by me like a pillar of strength. It has been a long journey that started when I was still trying to understand life.\nI have been fighting the case in court for the last 6 years, with patience and respect, waiting for the trial to be completed. In this process, I have been called a murderer, a criminal, an abuser and so much worse. I read these things about me almost every single day. And my heartfelt effort has always been to be strong, respectful and ignore it. But they still fill my and my loved ones’ heart with so much sadness. I don’t blame the people who call me names, because that’s how I have been portrayed in public, but I'm not the monster that has been portrayed in headlines.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nI know how easy it is to think the worst of someone and accuse them but it is exceptionally hard to prove myself innocent as there’s a procedure that we need to follow. A procedure that has taken long enough that I have been made to feel guilty without even being given a fair chance to prove my innocence. There have been accusations and assumptions but there has been no validation.\nBut, this is not about what others say. This is about how I feel. For as long as I can remember, my dream has always been to make my parents proud. I have always tried to be a good son to them. In the last 6 years, I’ve tried harder every day to achieve this dream and to be positive.\nSo today, I am praying with my heart that our family can move forward, that the trial can come to a fair end and that I can give back all the love, support and strength I have received from so many of you.\nThank you to all of you who constantly send positivity my way. You may not know it, but every single one of your prayers has helped.\"\nJust to jog your memory a little, Actor Jiah Khan committed suicide in 2013 in her flat in Juhu, Mumbai, by hanging herself.\nIn her suicide note, she wrote about Sooraj and mentioned how he ruined his life. Sooraj was charged with abetment to suicide in January and the trial began on February 17.", "title": "Six Years After Jiah Khan's Death, Sooraj Pancholi Pens Down A Heartbreaking Note", "date_publish": "09/11/2018, 18:04:44", "description": "Six years after the suicide of his ex-girlfriend Jiah Khan, actor Sooraj Pancholi has finally broken his silence. On the occasion of his 28th birthday, Pancholi wrote a heartbreaking note and posted on social media.Actor Sooraj Pancholi has broken his silence on the suicide case of his ex girlfriend and actor Jiah Khan.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/six-years-after-jiah-khan-s-death-sooraj-pancholi-pens-down-a-heartbreaking-note-356371.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sooraj_1541767252_800x420.jpg"}