{"text": "The bold and the beautiful, Kangana Ranaut is known for voicing out her opinions without mincing her words. In the wake of the #MeToo controversy, the diva not only talked about the instances of Vikas Bahl’s sexual misconduct with her, but she demanded people of the film fraternity to not work with those who keep “their wives as trophies and keep young girls as their mistresses.” When asked who she was talking about, she wasn’t reluctant to name Hrithik Roshan.\nOf course, she soon became the eye of the storm. Post Kangana Ranaut’s allegations against Vikas Bahl, his ex-wife Richa Dubey wrote an open letter on Twitter slamming the Queen actress. She questioned if she had such issues with Vikas Bahl then why did she dance with him at Madhu Mantena and Masaba Gupta’s wedding.\nNow, ex-Bigg Boss contestant and actress Gauahar Khan has also slammed Kangana Ranaut in a post on Twitter. Calling her “Feminist Of Convenience”, she said that #MeToo movement is meant for real women.\nDon't Miss 193 SHARES 862 SHARES 126 SHARES\nMeanwhile, many celebrities are opening up on the wave of #MeToo movement that is taking the nation by storm.\nFardeen Khan recently said that making an allegation against someone automatically proves them guilty.\n“This is a worldwide phenomenon that has been going on. Women in this situation are extremely vulnerable. I do believe that they deserve the benefit of doubt, at the same time I don't believe that making allegations against someone automatically proves that he is guilty so there has to be process,” he was quoted as saying by IANS.\nSwara Bhasker also applauded women who are now coming out and sharing their stories.\n“Have already spoken at length about it. I also tweeted my support. I think the #MeToo movement was a long time pending in India and it's good that it has finally come out and kudos goes to all the women who are braving their past trauma and re-living it and claiming their own stories with their own names,” she told IANS.\nMeanwhile, Subhash Ghai has also been accused of sexual harassment by an actress, who has claimed in her complaint that the filmmaker grabbed her and tried to kiss her forcefully.\nActor Kate Sharma files police complaint against filmmaker Subhash Ghai; says, 'he called me at his house on August 6. 5-6 ppl were present there,he asked me to give him massage.I massaged him&went to wash my hands,he followed me, called me to his room to talk & tried to kiss me' pic.twitter.com/TiJm9EADCy — ANI (@ANI) October 13, 2018", "title": "Slamming ‘Feminist Of Convenience’ Kangana Ranaut, Gauahar Khan Says #MeToo Is For Real Women", "date_publish": "14/10/2018, 17:16:19", "description": "Ex-Bigg Boss contestant and actress Gauahar Khan has also slammed Kangana Ranaut in a post on Twitter. Calling her “Feminist Of Convenience”, she said that #MeToo movement is meant for real women. Post Kangana Ranaut’s allegations against Vikas Bahl, his ex-wife Richa Dubey wrote an open letter on Twitter slamming the Queen actress. She questioned if she had such issues with Vikas Bahl then why wo", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/slamming-feminist-of-convenience-kangana-ranaut-gauahar-khan-says-metoo-is-for-real-women-354772.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/slamming_feminist_of_convenience_kangana_ranaut_gauahar_khan_says_metoo_is_for_real_women_1539516480_800x420.png"}