{"text": "Like they say, with fame comes responsibility, and today’s era, with popularity comes trolling as well. From stars like Shah Rukh Khan to Salman Khan, no one has been spared on social media. Soha Ali Khan thinks that Bollywood is not meant for thin-skinned people and those actors who are on social media have crocodile skin.\nBCCL\nSoha Ali Khan has been a part of the industry for 15 years now. She made her debut with Dil Maange More in 2004 and has done some great films like Rang De Basanti, Tum Mile and Saheb, Biwi Aur Gangster Returns among others. She comes from a family that has popular names including Sharmila Tagore, Saif Ali Khan and Kareena Kapoor. When asked if the profession comes with insecurities, here’s what she said.\nBCCL.\n“Most actors have crocodile skin and most people on social media, I think have crocodile skin. Because if you post something on social media and actually read the comments, some people will just be destroyed, but then you get used to it and like most human beings do, you adapt.”\nDon't Miss 365 SHARES 7.4 K SHARES 322 SHARES\nBCCL/Pravin Barnale\nIt’s your own happiness that matters in the end, she says. “You tend to realise that you can't make everyone happy and the most important person you need to make happy is yourself.\nWith superstars’ Shah Rukh Khan, Salman Khan and Aamir Khan’s movies failing at the box office last year, everyone has been asking if the age of stardom is gone. When Soha was asked if stardom comes with an expiry date and has this thought ever struck her mind, she said:\n“No, life comes with an expiry date and stardom cannot be taken seriously because honestly when you go, you are not going to take your awards with you or your money with you. I mean people say that you leave behind something but I have seen enough famous people being forgotten and not being taken seriously”.”\nDon’t sacrifice a lot for stardom, she says. “If stardom makes you happy, great, but if it makes you unhappy then maybe you need to re-look at things”.\nTalking about her own career, Soha Ali Khan said that she wanted more opportunities. She thinks she wasn’t tapped fully as an actor.\nWith inputs from IANS", "title": "Soha Ali Khan Thinks Bollywood Is Not Meant For Thin-Skinned People, Says Actors Have Crocodile Skin", "date_publish": "30/03/2019, 15:06:30", "description": "Like they say, with fame comes responsibility, and today’s era, with popularity comes trolling as well. From stars like Shah Rukh Khan to Salman Khan, no one has been spared on social media. Soha Ali Khan thinks that Bollywood is not meant for thin-skinned people and those actors who are on social media have crocodile skin.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/soha-ali-khan-thinks-bollywood-is-not-meant-for-thin-skinned-people-says-actors-have-crocodile-skin-364584.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/soha_ali_khan_thinks_bollywood_is_not_meant_for_thinskinned_people_says_actors_have_crocodile_skin_1553931270_800x420.png"}