{"text": "Son Of Sardar! Diljit Dosanjh Shares The Advice He Got Before Becoming A Bollywood Actor\nSon Of Sardar! Diljit Dosanjh Shares The Advice He Got Before Becoming A Bollywood Actor\nIn an industry, which is driven more by the popularity of an actor rather than his/her skills – where good looks matter more than the actual acting prowess – and where nepotism is a never-ending debate that the entire film fraternity either disses or avoids the topic, do you even think it is easier to even aspire to become an actor?\nWithout good looks and great physique, even the most remarkable actors have to struggle before landing the lead role in a film.\n4.bp.blogspot.com\nNow just imagine how difficult it is for a Sikh actor to make way in such an industry.\nHaving bagged prominent roles in Bollywood films, Diljit Dosanjh has carved his own path in the industry and how! He is one of the only few actors who has successfully represented Sikh community in the mainstream Hindi cinema.\nmahapunjab.com\nDon't Miss 183 SHARES 1.5 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Sardar actors can't be successful in Hindi cinema,” that’s what Diljit Dosanjh used to think before venturing into the world of films. Not only did he change that for himself but for others too.\nbollywoodmdb.com\n“Actually a lot of people have told me that I shouldn't be an actor. People told me to get rid of my turban or not become an actor. Back then, I knew that I would be okay to give up films, but not my turban,” he told IANS.\nWallpapers Den\nWith films such as Udta Punjab, Phillauri and Soorma, Diljit Dosanjh has not only proved his mettle as an actor but also his versatility.\n“An actor is more than his ethnicity and his religion. A filmmaker, a director has to be convinced and should be able to envision someone in a role, regardless of Sikh or not Sikh, if the filmmaker feels you suit the role, then that's perfect,\" he says.\nAlso Read: After Paying Off Loans Of 1398 Farmers, Amitabh Bachchan Donates Rs 50 Lakh For Welfare Of Senior Citizens", "title": "Son Of Sardar! Diljit Dosanjh Shares The Advice He Got Before Becoming A Bollywood Actor", "date_publish": "09/12/2018, 13:17:20", "description": "“Sardar actors can't be successful in Hindi cinema,” that’s what Diljit Dosanjh used to think before venturing into the world of films. Not only did he change that for himself but for others too. He is one of the only few actors who have successfully represented Sikh community in the mainstream Hindi cinema. People told him to get rid of the turban or not become an actor.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/son-of-sardar-diljit-dosanjh-shares-the-advice-he-got-before-becoming-a-bollywood-actor-358225.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/get_rid_of_the_turban_diljit_dosanjh_shares_what_advice_he_got_before_becoming_an_actor_1544340462_800x420.jpg"}