{"text": "After visits in New York and family brunches, Sonali Bendre reunited with her best friends, Sussanne Khan and Gayatri Oberoi, for a TV show and got teary-eyed while recalling her recent stay in New York.\nIn July last year, the actress had quit the reality show India’s Best Draamebaaz, on which she served as one of the judges, to start treatment for a metastatic cancer at the renowned research facility Sloan Kettering in the Big Apple. The chemotherapy sessions that followed resulted in dramatic hair loss and while the actress embraced the change, even talking candidly about it on social media, it was a difficult topic to discuss on the Colors Infinity show.\nBCCL\nDuring the conversation, Sonali reminisced about her early days in showbiz, adding that her thick mane was much talked about then. So much so, they even landed her K Ravi Shankar’s Aag in 1994, her acting debut. “Now that I think of it, earlier, my whole life had been all about my hair, even though it sounds superficial. I’ve endorsed every hair product at some point in my life,” she said, adding that it used to be a big part of her personality.\nOn how she dealt with it, the 44-year-old actress said, “My sisters and friends were with me for support. I was sure I didn’t want it to be clumpy and feel horrible about it. I wanted to enjoy getting rid of it as much as I had loved wearing it. My friends and our kids were all with me when I got the first haircut. I kept it short and it did look nice,” Sonali said.\nDon't Miss 197 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nBCCL\nWhen it was time to go bald, Gayatri suggested that she keep the hair, so they could make a wig out of it. “I said no. Let’s just give it away, it’s not meant to be, just let it go,” Sonali concluded.\nOriginally published in Mumbai Mirror", "title": "Sonali Bendre Opens Up About Battling Cancer, Says Earlier Her Whole Life Was About Her Hair", "date_publish": "04/04/2019, 13:01:31", "description": "After visits in New York and family brunches, Sonali Bendre reunited with her best friends, Sussanne Khan and Gayatri Oberoi, for a TV show and got teary-eyed while recalling her recent stay in New York. In July last year, the actress had quit the reality show India’s Best Draamebaaz, on which she served as one of the judges.", "authors": ["Natasha Coutinho"], "url": "https://www.indiatimes.com/entertainment/sonali-bendre-opens-up-about-battling-cancer-says-earlier-her-whole-life-was-about-her-hair-364837.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sonali_bendre_opens_up_about_battling_cancer_says_earlier_her_whole_life_was_about_her_hair_1554361210_800x420.jpg"}