{"text": "Not only on-screen, off-screen as well, Sonakshi Sinha is known for her amiable and cheerful nature, whether it's dealing with her family, fans or the paparazzi. The actress is about to complete a decade in Bollywood and on that occasion, idiva decided to launch their digital cover with this phenomenal face and we couldn't be more glad.\nReports claim that Mindy might also be helming the project. Deadline Hollywood claims that the film might be a unique combo of Crazy Rich Asians meets My Big Fat Greek Wedding.\nDon't Miss 3.4 K SHARES 3.1 K SHARES 155 SHARES 343 SHARES 870 SHARES\nAt the trailer launch event, Ananya expressed her opinion and said that she believes the film industry thrives if there is competition between the actors. Ananya, daughter of actor Chunky Panday, said the entry of new talents in the industry only motivates the others to work hard.\nJust to jog your memory a little, Amitabh Bachchan had paid off loans of 2,084 farmers in Muzaffarpur, Bihar. He has also donated Rs 10 lakh to the family members of each victim of the February 14 Pulwama terror attack.\nAlia Bhatt said, “I respect Kangana’s work a lot and I respect her opinion. If she feels a particular way she must have reason to feel that way. I would rather remember how much she had praised me after watching Raazi. And I’d just like to focus on my work. Maybe she will appreciate me again if I work hard enough.”", "title": "Sonakshi Sinha Decodes A-Z Of Bollywood, PC Collaborates With Mindy Kaling And More From Ent", "date_publish": "13/04/2019, 16:47:50", "description": "Not only on-screen, off-screen as well, Sonakshi Sinha is known for her amiable and cheerful nature, whether it's dealing with her family, fans or the paparazzi. The actress is about to complete a decade in Bollywood and on that occasion, idiva decided to launch their digital cover with this phenomenal face and we couldn't be more glad.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonakshi-sinha-decodes-a-z-of-bollywood-pc-collaborates-with-mindy-kaling-and-more-from-ent-365398.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_news_1555154382_800x420.jpg"}