{"text": "Sonali Bendre Thanks Priyanka Chopra For Lifting Her Spirits, Showers Love On Her Pet 'Diana'!\nSonali Bendre Thanks Priyanka Chopra For Lifting Her Spirits, Showers Love On Her Pet 'Diana'!\nWhen life throws a curve ball at you, you have exactly two options to deal with it. You can either accept your fate and move on positively or cry and rant about how unfair life is. For Sonali Bendre, this curveball came in the form of cancer and as we all know, she chose to deal with it with all the positivity and self-love she had for herself. Currently, the actress is in the U.S, where she is getting treated for metastatic cancer.\nA lot of her industry friends flew down to visit her but one special person who is lighting up her life these days is Priyanka Chopra. Just a few days ago, Bendre posted on Instagram about her special meeting with Priyanka and her new friend Sophie Turner.\nShe shared the picture with a sweet caption. She wrote,\n“Was a little low and lonely as @goldiebehl had left for Mumbai… thank you @priyankachopra for lifting my spirits! #AGirlsDayOutIsLikeChickenSoupForTheSoul @sophiet @danasupnick @mimi”\nBut it looks like Sonali is not just fond of Priyanka Chopra but her pet Diana has become her favorite too.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\nSonali shared a photo with Diana and wrote a long caption mentioning how she misses her own pet back in Mumbai.\n“Dogs are the best, really. This is the first dog I’m playing with after leaving my #LittleMissIcy back home in Mumbai…. lots of emotions, a bittersweet combination of love and nostalgia. Thank you @priyankachopra for letting me hang out with @diariesofdiana, she’s absolutely adorable and is the cutest thing in the world!\" she wrote.", "title": "Sonali Bendre Thanks Priyanka Chopra For Lifting Her Spirits, Showers Love On Her Pet 'Diana'!", "date_publish": "16/10/2018, 14:16:50", "description": "A lot of her industry fans flew down to visit her but one special person who is lighting up her life these days is Priyanka Chopra. Just a few days ago, Bendre posted on Instagram about her special meeting with Priyanka and her new BFF Sophie Turner.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonali-bendre-thanks-priyanka-chopra-for-lifting-her-spirits-showers-love-on-her-pet-diana-354881.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sonali_bendre_1539679762_800x420.jpg"}