{"text": "Sonali Bendre Finds Joy In Her Furry Friend After Returning From New York Post Cancer Treatment\nSonali Bendre Finds Joy In Her Furry Friend After Returning From New York Post Cancer Treatment\nAn epitome of grace, tolerance, and positivity, Sonali Bendre is a woman who has inspired many of us with her zeal.\nBendre, who was in New York for cancer treatment since five months managed to put up a brave fight. From embracing the uncertainty of life to being patient, her traits are definitely aspirational and inspirational.\nPTI\nOn Monday, Bendre landed back in Mumbai and was accompanied by her husband Goldie. She posed for paps as they welcomed the actress with a smile on their faces. Navbharat Times report also quoted Goldie as saying,\nPTI\n“Sabhi ka bahot bahot shukriya. Kareeb 6 mahine ho chuke hain, main sabko batana chahta hoon ki ab Sonali theekh hain, woh achchi tarah recover kar rahin hain. Main unke sabhi fans aur chaahne walon ka shukriya karta hoon, jinn ke pyar, prayer aur support se woh swasthh ho gayin hain (Thank you. After six months, I would like to mention that Sonali is doing fine and is recovering well. I want to thank all her fans and well-wishers, whose love, prayers and support have been critical to her path to good health.)\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAfter returning back home, Sonali's friends came to meet her. But one reunion that will warm the cockles of your heart is how she reunited with one of her furry friends.\nSharing it as an Instagram story, Sonali wrote: “Reunited, Little Miss Joy.”\nInstagram Screengrab\nBefore leaving for home, Sonali wrote a heartwarming note from New York, where she mentioned how distance indeed made her heart stronger and long for her loved ones even more.\nIn her note, Sonali also mentioned how her battle with cancer is yet to be over but she will be resilient and strong, as always. More power to her.\n(Also read: Sonali Bendre Returns To India With A Brave Smile, Says Battle With Cancer Is Not Over Yet)", "title": "Sonali Bendre Finds Joy In Her Furry Friend After Returning From New York Post Cancer Treatment", "date_publish": "04/12/2018, 11:36:11", "description": "An epitome of grace, tolerance, and positivity, Sonali Bendre is a woman who has inspired many of us with her zeal. Bendre, who was New York for cancer treatment since last five months managed to put up a brave fight. From embracing the uncertainty of life to being patient, her traits are aspirational and inspirational.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonali-bendre-reunites-with-her-furry-friend-at-home-after-returning-from-cancer-treatment-in-new-york-357875.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonali_bendre_1543903801_800x420.jpg"}