{"text": "Sonakshi Sinha's Friendship With Salman Khan Is Not Just Because She Wants To Be His Next Heroine\nSonakshi Sinha's Friendship With Salman Khan Is Not Just Because She Wants To Be His Next Heroine\nSonakshi Sinha is one hardworking actress, she got her due as an actress when she was appreciated for Lootera (2013). Her transformation in that film was beautiful and it’s still very much present in the audience's mind.\nShe will be seen next in Kalank, which gives a major deja vu of her character from Lootera. We met the actress for an interaction where she looked stunning in a multi-hued printed kaftan paired with black pants.\nSonakshi spoke her heart out with us right from her upcoming film Kalank, her highs and lows to her Dabangg 3.\nThe very first question that she was asked was about Dabangg 3, sipping her coffee, she answered, “It was so emotional as I was going back to the same team; It was like literally home coming for me.\"\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES\n\"I feel like Rajjo is the character I can play in my sleep. It is because of Dabangg where I am today, it has given me a life that I never imagined for myself, I never wanted to be an actor while I was growing up, but as soon as Dabangg happened that’s when I realised this is my true calling and this is what I want to do in life. When I was saying this dialogue we didn’t even think it would become such a rage, even after nine years people tell me that dialogue.”\nWhen asked about how her camaraderie has changed with Salman Khan over the years, she said, “Nothing has changed at all and that’s the best part about it. Over the years, our friendship and bond has only gotten stronger, even if we have not worked for so many years we have still maintained that aspect of our equation.\"\n\"And with me it’s never been that, I am not just his friend because I want to be his next heroine. I know that he has given me something in my life that I will cherish forever because that has really changed my life. I will forever be grateful to him and now our equation is beyond films.”\nSonakshi has completed nine years in the industry but she is only appreciated for Lootera and now her look as Satya as left audience mesmerised, talking about her prep on all the roles she said,\n\"The funniest part is my approach to a Dabangg or a Rowdy Rathore is same as my approach to Lootera or Kalank. I have no process, I land up on the set, say aaj kya kar rahe hai, mere lines dikha do. I am completely a blank slate and that’s how I have always worked.\"\nShe further added, \"The only preparation I do is, I speak with my directors and understand their vision for the entire film as a whole and then my character, my job as an actor is to give the audience 97 percent of what my directors told me and 3 percent of what I can act, if at all I can act.\"\nShe is one actress who has faced highs and lows in equal measures, talking about her setbacks, she said, “Honestly there is nothing to deal with, I won’t even call it a setback these were experiences for me, it would have been a set back if I was out of work because of the results of the films. I have not stopped working a day in the last 9 years, there has not been a single day that I have sat at home and had nothing to do. So all the films that I have done have taught me to be something or the other, and box office result is something that is not in my hands, so I will not stress about it. My job is to go on set, give it a 100 percent, perform and come back , go to home, get sleep and go back to work next morning which is what I have been doing since last 9 years.\"\n\"And everybody has to go through this, in fact. once Akshay Kumar was telling me that he had this phase where he went through 13 flops in a row, that can change for anyone at any time, you just have to be patient, do your work, do it well and just keep going.”\nSonakshi was then asked about how secure she is as an actor when she does a multi starrer film like Kalank. To which she said, “If an actor thought of all this before doing a film then toh multi-starrers would never be made only and all these things about insecurities, how big or small is your role, now if George Clooney had asked Brad Pitt tumhara role mere role se bada kaise, toh Ocean 11, 12 or 13 banti hi nahi, koi bhi multi starrer nahi banta.\nIf you see Kabhi Khushi Kabhie Ghum, Kareena had entered only after interval point, all these things are very little when you see the bigger picture. For me, my role was very fantastic who holds the family together, who takes the narrative forward, every character is so well written whether it is Madhuri ji, Varun, Alia, Aditya or Sanju sir, every character contributes to the story in a very important and big way including mine, so there was no stress about it.”\nConcluding the interview, we asked her if she is happy with her achievement so far, she replied, “ It can always be better but I am happy with my entire journey with what I have learnt and most importantly I have made my parents proud.”\nSonakshi is definitely one of the most honest actors in tinsel town.", "title": "Sonakshi Sinha's Friendship With Salman Khan Is Not Just Because She Wants To Be His Next Heroine", "date_publish": "11/04/2019, 11:44:17", "description": "Sonakshi Sinha is one hardworking actress, she got her due as an actress when she was appreciated for Lootera (2013), her transformation in that film was beautiful and it’s still very much present in the audiences mind. She will be seen next in Kalank, which gives the major dejavu of her character from Lootera. We met the actress for an interaction where she looked stunning in a multi coloured an", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/celebs/sonakshi-sinha-s-friendship-with-salman-khan-is-not-just-because-she-wants-to-be-his-next-heroine-365214.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sonakshi_sinha_1554963245_800x420.jpg"}