{"text": "Sonam Kapoor broke all the stereotypes by playing a gay character in Ek Ladki Ko Dekha Toh Aisa Laga. She left everyone stunned with the first trailer and it’s probably the first time any lead commercial actress is playing such a role and that’s a progressive sign for the society and not just Bollywood.\nEarlier, we have seen films where gay or transgenders were mocked for their orientation but hopefully, with this film this attitude might change for the better.\nTwitter\nIndiatimes met Sonam and spoke about how careful she was about portraying a gay character since a major chunk of the society still thinks that homosexuality is a disease.\nDon't Miss 167 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nShe began saying, “There are lots of stereotypes that exist in this world and people’s mind. Like for example, if you belong to a certain community then you are like this or like that. You are judged on the basis of your community and unfortunately, a lot is propagated by films, TV show, and books. Just because you are not in love with the opposite sex that doesn't mean you are different. Love is love at the end of the day. You can't choose whom to love, it just happens. Anand (her husband) had said something very beautiful to me - we didn’t choose each other, destiny chose us for each other. Something that is not in your control, how can you blame someone for that. I think judgments, especially in our country, come in various forms.”\nTwitter\nShe further went on to say,\n“We always are conformed to think in a certain way. For e.g, career choice - I am so sure a lot of parents must have said, ‘arey media mai jaa rahe ho? Ladko ko bolenge, is it a stable industry for you? And ladkiyon ko bolenge, you know the kind of people you will meet? It’s better to become a doctor or an engineer.\"\nTwitter\n\"But you cannot ignore your calling and you fight for it. Same goes with everything, whether getting married into a different religion or deciding to have a sexual partner who isn’t of the opposite sex or you deciding whether you want to be a man or woman. It’s never your own choice, it’s something that you are and you can’t help it. So, if parents and society are conformed to think, to be a certain way that is very cruel, you have to let people be who they are”\nTwitter\nWe asked her that today we can debate with our parents on career choices, but how can we make them understand that being gay is not a disease, she said, “15 years ago if you told somebody, I am getting a divorce, you would have been ostracized from the community, but the more you hear it and see it, it stops affecting after a point. Everything takes time for it to become palatable.”\nTwitter\nShe continued, “Our audience is way more intelligent and receptive than we think they are. People of India are not as regressive as much we think they are. So many of my friends who think they come from very conservative families have come out to their parents, about their orientation and their parents didn’t react but were rather happy about it. If your parents or friends truly love you they will understand you eventually because being gay is absolutely normal and natural.”\nTwitter\nSonam also said that from now on, she will only do a film where she can break a stereotype, “My endeavour has always been to break stereotypes with all my films because stereotypes are so dangerous. We don’t understand the power of films and media, we don’t understand how it will affect the people”.\nTwitter\nWhen we asked her if films are to be blamed for building the stereotype of being gay is not natural and that they should be mocked, she disagreed by saying, “Not only films, it’s books, media, people and so many other things. You have to understand it’s not only that. We have to be very responsible for what we write, what films we do, or books we handover to our kids. We always have a preconceived notion for lots of things which is very dangerous.”\nInstagram\nThe actress is hopeful, the society will change one day.\n“One day hopefully, people will realise ki yaar it’s ok if my son or daughter is gay because there is nothing wrong with them they are clearly intelligent and beautiful. My cousin, who is a writer of this film has written Lipstick Under My Burkha. She is a fantastic writer. Some of the most powerful people in fashion and films our gay. There is nothing but pride in what they do.”\nSonam has always been an inspiration but with this film, she has made us even more proud. The film also features Anil Kapoor, Rajkummar Rao and Juhi Chawla in pivotal roles and is all set to release on February 1, 2019.", "title": "Sonam Kapoor Insists Being Gay Is Absolutely Normal & Natural", "date_publish": "31/01/2019, 17:12:48", "description": "Sonam Kapoor broke all the stereotypes by playing a gay in Ek Ladki Ko Dekha Toh Aisa Laga. She left everyone stunned with the first trailer, it’s the first time any commercial lead actress is playing a gay and that’s a sign welcoming a new change in society and Bollywood as well.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sonam-kapoor-insists-we-need-to-rise-above-stereotypes-because-being-gay-is-absolutely-normal-361378.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sonam_kapoor_1548934774_800x420.jpg"}