{"text": "Sonali Bendre's Diwali Post Amidst Cancer Treatment Should Teach You A Thing Or Two About Embracing Life!\nSonali Bendre's Diwali Post Amidst Cancer Treatment Should Teach You A Thing Or Two About Embracing Life!\nIf you ever feel low or directionless in life, Sonali Bendre's Instagram account is where you must head. The actress who was diagnosed with metastatic cancer in July this year has been battling the disease with every ounce of positivity that one can possess.\nFrom sending out messages across embracing your own self in every condition to teaching a thing or two about self-love, Bendre's philosophies in life will never make you feel lonely or depressed.\nSonali has been in New York for months and her friends and family are taking every necessary step to ensure that she gets all the support she needs. For the festival of Diwali, her husband Goldie Behl and son Ranveer reached New York to be with her.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nEven though her celebrations were low-key but they for sure were perfect. She posted images of her lighting candles and offering prayers with her family. Mentioning her unconventional celebrations, she wrote,\n\"It was quite an unconventional one... We didn't have Indian clothes, we had a small puja... But it was all heart.\"\nLast week, Sonali and Neetu Kapoor also made a rare appearance together at Priyanka Chopra's bridal shower.\nWhen life hits rock-bottom, being positive is all that it takes to be sane and happy and Sonali's struggle and journey throughout cancer proves just that!", "title": "Sonali Bendre's Diwali Post Amidst Cancer Treatment Should Teach You A Thing Or Two About Embracing Life!", "date_publish": "08/11/2018, 17:27:43", "description": "If you ever feel low or directionless in life, Sonali Bendre's Instagram account is where you must head. The actress who was diagnosed with metastatic cancer in July this year has been battling the disease with every ounce of positivity that one can possess.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonali-bendre-s-diwali-post-amidst-cancer-treatment-should-teach-you-a-thing-or-two-about-embracing-life-356310.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sonali_bendre_1541678527_800x420.jpg"}