{"text": "When Tanushree Dutta had levied sexual harassment allegations against Nana Patekar, Sonam Kapoor was one among the few Bollywood stars who said that they believed her.\nI believe #TanushreeDatta and @janiceseq85 recollection of the account. Janice is my friend, and she is anything but an exaggerator or a liar. And it’s upto us to stand together. https://t.co/sF3mS5o1P8 — Sonam K Ahuja (@sonamakapoor) September 28, 2018\nNot long ago, Rajkumar Hirani was accused of sexual harassment by a woman who worked with him on his 2018 movie Sanju. It was apparently the first time that a Bollywood A-lister was accused of #MeToo. Bollywood stars kept mum on this except a few including Arshad Warsi, Sharman Joshi and Raageshwari among others.\nSonam Kapoor who is busy promoting her movie Ek Ladki Ko Dekha Toh Aisa Laga, which has been released today, was asked about the same in one of the interviews.\n“In the Me Too movement, I always believe a woman. But in this case, we need to reserve our judgment. Two things here - one the film is as important as the movement and second, I have known Hirani for many years and I respect him as a filmmaker and a man. I will talk about it at length when the movie is released. But what if it’s (allegations) aren’t true, the movement will get derailed,” she had said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nfilmibeat.com\nAnd Twitter was quick to call her out for being a “hypocrite”.\nSonam Kapoor comes of as a hypocrite often. — ❄️ (@preethla) January 30, 2019\nSonam Kapoor's \"feminism\" is flakier than the chicken puffs sold in Malad's bakeries. At least those puffs can be enjoyed with evening tea. — Neerja | نیرجا ✨ (@neerjadeodhar) January 31, 2019\nSonam Kapoor believes in every women unless/until women accuses Rajkumar Hirani👏🏼👏🏼 pic.twitter.com/H6GOIEmcAv — Rishav Sharma (@rishav_sharma1) January 30, 2019\nSonam kapoor should understand... That taking Mr Hirani's side won't give her films... I'm waiting to see what rk has to say... https://t.co/GbKxGkHl42 — GullyBoy📢14th ko🤘AYEGA🎤 (@RanveerandRowdy) January 31, 2019\nSonam Kapoor saying she believes all women, just not when they're accusing the producer of her new film, and especially not when the film is as important as the movement, and anyway, the woman's probably lying https://t.co/SQvVaZ439T pic.twitter.com/92zwI0zdAs — Uday Bhatia (@yooday) January 30, 2019\nHaha. It’s more like a matter of convinience. Shout all #Metoo until one of your loved one (Male) gets harassed by the dirty women with hidden agenda. #sonamkapoor — S Mantri (@SMantri4) January 31, 2019\nwhen we have a lot of intelligent women to be heard why we paying attention to Sonam Kapoor — Harshit Srivastava (@cinema_stalker) January 31, 2019\npehle dossre pe laga to koi question nahin kiy truth about allegation tab sonnam kaha thi selfish lady @sonamkapoor — TIGER (@raghu4917_rag) January 31, 2019\nSonam Kapoor reeks of elite ignorance. — Parmesh Dogra (@Parmesh101) February 1, 2019\nSelective activism. — Druss Reacher (@myqueries137) January 31, 2019\nIt's Sonam Kapoor. I don't expect anything more than this half-assed statement. — Poorva Joshi (@poorvajoshi93) January 31, 2019", "title": "Sonam Kapoor trolled:Sonam Kapoor Gets Trolled For Backing Rajkumar Hirani On #MeToo Allegations, Fans Call Her Hypocrite", "date_publish": "01/02/2019, 17:11:03", "description": "When asked about #Metoo allegations against Sanju director Rajkumar Hirani, Sonam Kapoor asked what if they are not true. Thereafter, the trolling began. Fans called Sonam Kapoor a hypocrite for siding with Rajkumar Hirani on sexual harassment allegations against him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sonam-kapoor-gets-trolled-for-backing-raju-hirani-on-metoo-allegations-fans-call-her-a-hypocrite-361428.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sonam_kapoor_gets_trolled_for_backing_raju_hirani_on_metoo_allegations_fans_call_her_a_hypocrite_1549021359_800x420.png"}