{"text": "Sonakshi Sinha Receives Iron Piece Instead Of Headphones, People Are Just Happy Amazon Isn't Partial!\nSonakshi Sinha Receives Iron Piece Instead Of Headphones, People Are Just Happy Amazon Isn't Partial!\nEditors Note: Story updated with a statement from Amazon.\nWho would have thought in the ’80s or early ’90s that you can sit at home and order products that you want, including the groceries? Well, now this glorious invention is as common as pollution in Delhi.\ntechinasia.com\nAnd why not? It is just so convenient, right? You no more have to deal with over-enthusiastic salespersons or travel at multiple stores to find the right product, and also, no more standing in the long queues at the billing counter. Online shopping has made shopping experience simpler.\nOr maybe not!\nnewsapi.com.au\nHaven’t we all faced problems including – late delivery, digital payment failures, hassles in return and refund and lack of security and delivery of the wrong product.\nDon't Miss 264 SHARES 4.3 K SHARES 130 SHARES 1.1 K SHARES\nPeople have received soaps and bricks when they ordered mobile phones. Flipkart once had to pay Rs 10,000 as compensation for delivering wrong product to a customer. Can you even imagine?\nBut guess what? No just us, it happens to celebrities as well!\nTwitter\nSo recently, Sonakshi Sinha ordered premium Bose headphones from Amazon, because who wouldn’t want stuff being delivered at your doorstep? And guess what she got instead of that? A tap-like metal object!\nFollowing this, Sonakshi did exactly what you would have done. She wrote to Amazon on Twitter to bring this to their notice. And being a celeb that she is, the tweet went viral in no time.\nHey @amazonIN! Look what i got instead of the @bose headphones i ordered! Properly packed and unopened box, looked legit... but only on the outside. Oh and your customer service doesnt even want to help, thats what makes it even worse. pic.twitter.com/sA1TwRNwGl — Sonakshi Sinha (@sonakshisinha) December 11, 2018\nIf you think people sympathised with her at this, you might want to take another guess. They were instead happy that Amazon isn’t partial when it comes to duping their customers and that the company treats all their customers equally.\nWonderfull..u hv shown the best example of no partially..u harras customer at the same level even being celebrity..excellent. — Ashish (@iHeartThoarb) December 12, 2018\nBehen give me your order details I have experience of fighting for this kind of things! — Safed Kaali (@flyingpriya) December 11, 2018\nNo partiality with celebrity. Good job @amazonIN 👍\n🙏i thought this happens only to a common being... — Nitinpradhan (@Nitinpr58755532) December 11, 2018\nha ha ha fraudsters believe in diversity and equality..celebrity ho yaa koi bhi :) choona lagana hai to lagana hai — Ankur Sharma (@Anky1980) December 11, 2018\nWhen same thing happen with common people they don't believe ......and start investigating to prove him wrong — Rajeev Wadhwa (@ContactWadhwa) December 11, 2018\nAmazon, on the other hand, was quick enough to apologise!\nUh-oh! This is unacceptable! Apologies for the recent ordering experience and the subsequent correspondence with our support team. Please share your details here: https://t.co/vIE01Lj9nJ, we'll get in touch with you directly. ^JC — Amazon Help (@AmazonHelp) December 11, 2018\nBut people couldn't stop laughing!\nthese look very uncomfortable ..how's the battery life ? — José Covaco (@HoeZaay) December 12, 2018\nOh shitt — BADSHAH (@Its_Badshah) December 11, 2018\nye log bhi amazon se product mangwate h kya matlab bose ke showroom me phone kar do toh bnda ghar tak dene aa jaye — Hindustani 🇮🇳 (@bp0056) December 12, 2018\nStill better than soaps being delivered by Flipkart. — Rahul Gandhi (@rahulgandhi38) December 11, 2018\nSo, we are all sailing in the same boat, people!\nOfficial statement from Amazon: As a customer centric company, we take great care in the safe delivery of our customer packages. While we are investigating this incident, we have resolved the issue for the customer and regret the inconvenience caused.", "title": "Sonakshi Sinha:Sonakshi Sinha Receives Iron Piece Instead Of Headphones, People Applaud Amazon For Being ‘Impartial’", "date_publish": "13/12/2018, 11:39:03", "description": "Sonakshi Sinha ordered premium Bose headphones from Amazon, perhaps because who wouldn’t want stuff being delivered at your doorstep? And guess what she got instead of that? A tap-like metal object. If you think people sympathised with her at this, you might want to take another guess. They were instead happy that Amazon isn’t partial when it comes to duping their customers (by mistake sometimes)", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sonakshi-sinha-receives-iron-piece-instead-of-headphones-people-are-just-happy-amazon-isn-t-partial-358477.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonakshi_sinha_receives_iron_piece_instead_of_headphones_people_applaud_amazon_for_being_impartial_1544680062_800x420.png"}