{"text": "Nepotism is one topic that has been discussed to the core since a couple of years in the Indian film industry. No matter on which side of the debate you belong to, almost everyone has had an opinion on nepotism.\nEver since that fateful Kangana Ranaut's episode on Koffee With Karan, the topic gained more momentum and everyone shared their two cents on it. The latest actor to join the discussion is Sonam Kapoor.\nAgencies\nSonam was a guest on Arbaaz Khan’s new web chat show, Pinch and during one of the segments of the show, she had to read a few mean comments written for her on social media. One Twitter user had criticised her for not learning how to act despite working as an actor in Bollywood for a decade.\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nResponding to everyone who has been targeting her for using her father's name for work, she said,\nTwitter\n“I just want to explain what nepotism really means. Everybody really think that it is a relative of a person, but it actually means to get a job through any connection. I think people have misunderstood it or people don’t understand it or use the word for their benefit to put other people down.\"\nShe added that if she doesn't take advantage of her father, actor Anil Kapoor’s goodwill, it would be disrespectful towards him.\nAgencies\n“Another thing that I would like to that is that my father did not come from an illustrious family. He’s been in this industry for 40 years and he has worked hard only for his children. If I don’t take advantage of his hard work, which he has done for us, I think I’d be a little disrespectful to his work and to what he is trying to do for us. Because every man or woman, a mother or a father works for their children,” she added.\nJust to jog your memory a little, in an interview with The Times of India in 2017, Anil Kapoor had shared similar views on nepotism. He had said,\nAgencies\n“There is a thought that if I have so much, why should I not give it to my kids? It’s a very Indian, emotional way to think. It’s in every business. You equally respect those who make it on their own. There is pain in both. The pain here is that we are unnecessarily running them down, what can we do if we are born in this family? There is pain there too. I have also thought that way - When I had started my career I used to think the same way about Sunny Deol and Sanjay Dutt, that they had it much easier because they had Dharmendra and Sunil Dutt.\"\nApart from nepotism, Sonam went on to talk about the fact that she is often body-shamed and it does affect her. On the work front, Sonam was last seen in Ek Ladki Ko Dekha Toh Aisa Laga and Anil Kapoor played her on-screen father.", "title": "Sonam Kapoor Defends Nepotism And Says It's Legit To Take Advantage Of Her Father's Goodwill", "date_publish": "17/04/2019, 13:46:05", "description": "Sonam was a guest on Arbaaz Khan’s new web chat show, Pinch and during one of the segments of the show, she had to read a few mean comments written for her on social media. One Twitter user had criticised her for not learning how to act despite working as an actor in Bollywood for a decade.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonam-kapoor-defends-nepotism-and-says-it-s-legit-to-take-advantage-of-her-father-s-goodwill-365610.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sonam_kapoor_1555487926_800x420.jpg"}