{"text": "“Above all, be the heroine of your life, not the victim.”\nShe might be an actress on the silver screen but her real act of heroism lies in the way she dealt with cancer. Sonali Bendre is an inspiration for each one of us and for reasons more than one. Even during the most toughest phase of her life, one thing that remained consistent in her life was positivity.\nShe stood rock-solid against all odds - be it losing her hair, battling cancer or bearing the side-effects of chemotherapy, Sonali Bendre dealt with each obstacle like a boss!\nNow that she is back in India and has resumed her normal life that involves acting and being in front of the camera, she is also in an introspective mood.\nIn her recent media interviews, she explained how cancer has been a life-changing journey. Talking to Vogue India, Sonali Bendre shared the insecurities she had after the diagnosis. She said,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"My first thought was to hide it because it was a disease. I thought my ‘brand’ is over—all along I had been endorsing healthy eating and health-focused products, and suddenly it was all gone. It was only when my oncologist said that I had fourth-stage cancer and a 30 percent chance that my whole world view changed. Suddenly I didn’t see any reason not to talk about it. I had done nothing wrong; it was not my fault I had cancer, so why was I hiding it?”\nSonali believes in embracing all her scars and for her, cancer never meant hating her body. She said,\n“I have a more loving relationship with my body for what it has gone through. I started thanking it for what it was doing… how it was healing itself and taking me forward. I’m more comfortable with my body now and I don’t want to unnecessarily stress it or have unrealistic goals. I’m okay with some saggy, loose bits here, some cellulite there. I don’t find it ugly anymore. In fact, I find it beautiful and I don’t know when that shift happened.”\nThat's not all. She shot for the same magazine and embracing all her flaws and scars, she also flaunted her 20 inch surgery scar. Have a look at the pictures.\nVogue India | Image: Photographed by R Burman. Styled by Anaita Shroff Adajania\nVogue India image: photographed by R Burman, Styled by Anaita Shroff Adajania\nVogue India | image: R Burman | styled by: Anaita Shroff Adajania\nVogue India | Image: R Burman | Styled by: Anaita Shroff Adajania\n(Also read: As A Mother & Cancer Survivor, Sonali Bendre Explains Why Her Son Was A Part Of Her Journey)", "title": "Sonali Bendre Proudly Flaunts 20-Inch Scar From Cancer Surgery, Says She Doesn't Find It Ugly", "date_publish": "06/03/2019, 14:31:06", "description": "She stood rock-solid against all odds and be it losing her hair, battling cancer or bearing the side-effects of chemotherapy, Sonali Bendre dealt with each obstacle like a boss! Now that she is back in India and have resumed her normal life that involves acting and being in front of the camera, she is also in an introspective mood.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sonali-bendre-proudly-flaunts-20-inch-scar-from-cancer-surgery-says-she-doesn-t-find-it-ugly-363251.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/sonali_bendre_1551862216_800x420.jpg"}