{"text": "Backing and supporting Kashmiri students who have been victims of abuse, threat and violence across the country following the February 14 Pulwama attack, veteran actress Soni Razdan has made a valid point.\nOn Friday, the Supreme Court came out with a direction for the safety of Kashmiri students.\nAgencies\nThe apex court directed Chief Secretaries and police chiefs of states and union territories to take prompt action to prevent threats, assaults, intimidation and boycott of Kashmiris, especially students, after the terror carnage which was claimed by the Pakistan-backed Jaish-e-Muhammad terror outfit.\nSoni, whose father was a Kashmiri Pandit, on Friday night tweeted,\nAgencies\n\"I just want to say to all those Kashmiri students and those who have suffered because of mobs... It's not you. It's them. They are the ones who are the terrorists not you. And everyone understands this except for those pathetic apologies for human beings... Those paid to do this.\"\nThis is not the first time that she has extended this kind of support. A few days back, she had urged in a tweet to \"keep Kashmiri students safe\".\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nTwitter\n\"My dear India... We are hurt, we are shocked and we are grieving. Let us do that with dignity and not hate and madness against those that are not perpetrators of insanity and violence. Please refrain from becoming what we despise. Let's lead by example. Keep Kashmiri students safe.\"", "title": "Soni Razdan Backs Kashmiri Students Who Were Subjected To Abuse & Violence Post Pulwama Attack", "date_publish": "23/02/2019, 15:54:14", "description": "Veteran actress Soni Razdan, in a tweet, has backed Kashmir students who have been victims of abuse, threat and violence across the country following the February 14 Pulwama attack that killed 40 CRPF troopers. Soni, who is actress Alia Bhatt's mother, had earlier urged in a tweet to \"keep Kashmiri students safe\".", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/soni-razdan-backs-kashmiri-students-who-were-subjected-to-abuse-violence-post-pulwama-attack-362659.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/soni_razdan_1550916472_800x420.jpg"}