{"text": "About 700 theatre artists including names such as Naseeruddin Shah, Ratna Pathak Shah and Anurag Kashyap have urged people to vote against BJP in this year’s election, which they say are “the most critical in the history of independent India”.\ntime8.in\n“All this is being concertedly eroded by the current government. The BJP, which came to power five years ago with the promise of development, has given free rein to Hindutva goons to indulge in the politics of hate and violence,” reads the joint statement.\nTwitter\nIn the same regard, Anupam Kher, who was last seen in The Accidental Prime Minister, said that these people from the film fraternity are “officially campaigning” for opposition parties by releasing that letter for public.\nSo some people from my fraternity have issued a letter for public to vote out the present constitutionally elected government in the coming elections. In other words they are officially campaigning for opposition parties. Good!! At least there are no pretensions here. Great. 🙏 pic.twitter.com/gqnZBGNdKa — Anupam Kher (@AnupamPKher) April 6, 2019\n“So some people from my fraternity have issued a letter for public to vote out the present constitutionally elected government in the coming elections. In other words they are officially campaigning for opposition parties. Good!! At least there are no pretensions here. Great.,” he tweeted.\nDon't Miss 182 SHARES 1.1 K SHARES 175 SHARES 3.6 K SHARES 2.5 K SHARES\nAnupam Kher’s tweet didn’t go down well with people, including actors such as Swara Bhasker and Soni Razdan. Hitting back at Anupam Kher, Swara Bhasker wrote, “Yes, it's called democracy sir”. To which Kher replied, “Agreed! As long as it is not confused with intolerance when others use it.”\nAgreed!!! As long as it is not confused with #Intolerance when others use it. Jai Ho and Jai Hind.😍🙏🇮🇳🇮🇳🇮🇳 https://t.co/N5AJqOYnrg — Anupam Kher (@AnupamPKher) April 6, 2019\nAlia Bhatt’s mother Soni Razdan argued, “If you can align yourself to the present government, why would you think others doing the same is any different? Just curious.” To which Kher said, “Dearest Soni! It was an observation. Not a complaint.”\nDearest Soni! It was an observation. Not a complaint.:) https://t.co/0c9pKOLHGj — Anupam Kher (@AnupamPKher) April 7, 2019\n“Our appeal - vote bigotry, hatred, and apathy out of power. Vote against the BJP (Bharatiya Janata Party) and its allies... Vote for secular democratic, inclusive India... Vote wisely,” read the statement. The voting for Lok Sabha elections will begin on April 11 and conclude on May 19.", "title": "Soni Razdan & Swara Bhasker Slam Anupam Kher For His Dig At Artists' Vote Appeal Against BJP!", "date_publish": "08/04/2019, 16:13:48", "description": "About 700 theatre artists including names such as Naseeruddin Shah, Ratna Pathak Shah and Anurag Kashyap have urged people to vote against BJP in this year’s election, which they say are “the most critical in the history of independent India”. In the same regard, Anupam Kher, who was last seen in The Accidental Prime Minister, said that these people from the film fraternity are “officially campaig", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/soni-razdan-swara-bhasker-slam-anupam-kher-for-his-dig-at-artists-vote-appeal-against-bjp-365070.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/soni_razdan__swara_bhasker_slam_anupam_kher_for_his_dig_at_artistes_urging_people_to_vote_out_bjp_1554719104_800x420.png"}