{"text": "Once again, after the Azaan row, Sonu Nigam had moved the nation after he said that he wished he was born in Pakistan.\nBCCL\nHere’s what he had said when he was asked about his opinion on why so many songs are remixed these days.\n“Sometimes, I feel like it would be better if I was from Pakistan. At least I would get offers from India,” he had jokingly said.\nTwitter\nHe later had to clarify his remark on Facebook.\n“My point about being better off being born in Pakistan was about the music companies in India asking Indian singers to pay 40-50% of their concerts remunerations to them, and only then they'll work with those artistes.. but they don't ask the same from the singers from abroad, namely Pakistan..!” he wrote.\nWhile people were still getting over this, there was another remark by Sonu Nigam that didn’t go down well with many.\nAbout the #MeToo movement and allegations against Anu Malik, he said:\n“If you say, 'Anu Malik met me this morning', that's fine. You accused him without any proof; let's accept that too. Had he (Anu Malik) wanted to say anything, he could have said a lot. But he did not.\nIf I say that you misbehaved with me, you will ask me for proof. But there's no proof, right? Despite that, people are respecting the accusers, who are tarnishing Anu Malik's name. But how can you ban him? How can you snatch his bread and butter? How can you torture his family?”\nDon't Miss 837 SHARES 2.4 K SHARES 362 SHARES 763 SHARES 2.1 K SHARES\nFollowing Sonu Nigam’s comments, singer Sona Mohapatra who had also accused Anu Malik of sexual misconduct had lashed out at Sonu Nigam in a series of tweets.\nSo much sympathy for a millionaire losing work? So much empathy for his privileged family being ‘tortured’?How about the scores of girls & women he tortured?Multiple testimonies not proof enough?\n“Sonu Nigam backs Anu Malik on #MeToo: Where is the proof?” https://t.co/xGajdQQfT8 — SONA (@sonamohapatra) December 19, 2018\n1)Not 1 but possibly 💯+ women & MEN can attest to Anu Malik’s deplorable abusive behaviour.\n2)I guess Mr. Sonu Nigam expects all these women/underage girls to - a)strap recording devices b)carry spy cams,other proof gathering devices cus they have much to benefit defaming him? https://t.co/2udQ71S70a — SONA (@sonamohapatra) December 19, 2018\nAre Arijeet Singh, Badshah,Vishal Dadlani from Pakistan though? 🤔\n(U’ve had your moment under the sun dear. India anoints a new ‘Male Super Star’ every 3/4/5 years without fail. Don’t blame the Pakistani artists. Also do not mix up Art & Music with Politics & Idealogy. 🎶🙏🏽🔴) https://t.co/VIUNZVCgjt — SONA (@sonamohapatra) December 19, 2018\nI always found Sonu Nigam to be brighter than most of his peers, intelligent, so talented, excellent at his craft & yes, kind too. Feel so let down hearing him talk like this & choose the dark side to side up with. I’m hoping he realises how sad this is. 🙏🏽🔴 https://t.co/aQxiD2VdUx — SONA (@sonamohapatra) December 19, 2018\nNow, replying to what Sona said, Sonu Nigam stated that not every issue requires quarrels.\n“The respectable lady vomiting on Twitter, is the wife of someone who I consider very close to me, so although she has forgotten the relationship, I’d like to maintain the decorum.\n“It's okay to accuse someone, but to punish someone? How is that right? Isn't it the job of the law to punish?\" (So aarop lagana sahi hai...par saza dena? Ye kaise sahi hua? Saza dena toh kanoon ka kaam haina?),” he added.\nAnd here's what Sona Mohapatra has to say to that.\nSo, now, my identity has become ‘wife’. Not only does your reporter refer to me as that, so does the defender of a serial sexual predator. Big hurray for the boys club & big hurrah to patriarchy, not. 🤘🏾🔴 https://t.co/kaewm6HeKR — SONA (@sonamohapatra) December 20, 2018\nDear Sonu Nigam,\nI wont call you someone’s son, husband or father & also have a detailed reply to your defense of a serial predator & accused in the #MeToo movement. My open letter Part 1. 👇🏽 Part 2 will respond to your complains about music labels. 🙏🏽🔴 https://t.co/GuqhVLmbiz — SONA (@sonamohapatra) December 20, 2018\nAlso Read: Sona Mohapatra Slams Sonu Nigam For Supporting Anu Malik During #MeToo Allegations", "title": "Sonu Nigam Hits Back At Sona Mohapatra, Says ‘Every Issue Doesn’t Need Quarrelling’", "date_publish": "20/12/2018, 14:32:03", "description": "Once again, after the Azaan row, Sonu Nigam had moved the nation after he said that he wished he was born in Pakistan. Sona Mohapatra lashed out at him in a series of tweets. Now, responding back to her, Sonu Nigam said that \"the respectable lady vomiting on Twitter\" and doesn’t need quarrelling around it”", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sonu-nigam-hits-back-at-sona-mohapatra-says-every-issue-doesn-t-need-quarrelling-358973.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/sonu_nigam_hits_back_at_sona_mohapatra_says_every_issue_doesnt_need_quarrelling_1545294108_800x420.jpg"}