{"text": "Sophie Turner Officially Changes Her Name To Sophie Jonas After Her Secret Wedding At Vegas With Joe\nSophie Turner Officially Changes Her Name To Sophie Jonas After Her Secret Wedding At Vegas With Joe\nIt’s the most beautiful feeling to add your name for life with your loved ones. Well, Sophie Turner is right now living this surreal dream. On Wednesday, the Game Of Thrones star took wedding vows with her fiancé and lover Joe Jonas in Las Vegas and their ceremony pictures and videos are all over the internet.\nAnd now the latest, we see Sophie Turner has changed her name to Sophie Jonas. Yes the GOT actress has proudly added Jonas surname to her name which only shows her love for her husband and family.\nAccording to documents obtained by TMZ, Sophie has officially changed her name from Sophie Belinda Turner to Sophie Belinda Jonas but she is yet to change it on social media.\nDon't Miss 159 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe entire Jonas family along with Priyanka Chopra were present at their wedding and gave all the best wishes to the newlyweds. As per reports, Sophie and Joe will do a formal wedding in Paris where relatives, friends from the fraternity will be invited. We are definitely looking forward to this wedding.\n2019 has clearly been the season of love and wedding in the Jonas family.", "title": "Sophie Turner Officially Changes Her Name To Sophie Jonas After Her Secret Wedding At Vegas With Joe", "date_publish": "03/05/2019, 17:07:16", "description": "It’s the most beautiful feeling to add your name for life with your loved ones. Well, Sophie Turner is right now living this surreal dream. On Wednesday, the Game Of Thrones star took wedding vows with her fiancé and lover Joe Jonas in Las Vegas and their ceremony pictures and videos are all over the internet. And now the latest we see Sophie Turner has changed her name to Sophie Jonas. Yes the G", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sophie-turner-officially-changes-her-name-to-sophie-jonas-after-her-secret-wedding-at-vegas-with-joe-366569.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/sophie_turner_1556883600_800x420.jpg"}