{"text": "Sorry Ishaan-Janhvi But Internet Thinks 'Conjectures' On KWK Are True And You Guys Are Dating!\nSorry Ishaan-Janhvi But Internet Thinks 'Conjectures' On KWK Are True And You Guys Are Dating!\nWhen you enter the world of stardom and glamor, your first co-star is always special. You lean on to them, share similar fears and find comfort in their presence. For Janhvi Kapoor and Ishaan Khatter, each other's company mattered a lot because they began their journey into the world of cinema together. They were roped in for Dharma Productions' Dhadak.\nDharma\nWhile Ishaan had faced cameras before for his film Beyond The Clouds, Dhadak was Janhvi's first film as an actor.\nInstagram\nShe hadn't even completed the shooting of the film when tragedy hit her life. She lost her mother and within ten days of her demise, Janhvi bounced back to life and how! She was back on the sets of Dhadak to complete the Kolkatta Schedule of the film.\nJanhvi/Instagram\nWhile shooting their first film together, Janhvi Kapoor and Ishaan Khatter became good friends. But now their pictures, social media PDA and basically in Arjun Kapoor's words Ishaan is always spotted 'buzzing around' Janhvi. Are they just friends or is there more to it?\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhile neither of the two has opened up about their romantic inclination towards each other but pictures have said it all.\nPinterest\nFrom accompanying each other to events and birthdays to just being around each other as a constant in life, their equation has sparked a lot of rumours of them dating.\nScreengrab\nThese rumours turned into 'conjectures' when Karan Johar brought this topic up during the Janhvi-Arjun's episode. Yesterday, Ishaan posted a picture of Janhvi and looks like the internet has already made up its mind.\nLove me or love me not? While Janhvi and Ishaan are silent, here's what the internet thinks of their camaraderie.\nScreengrab\nScreengrab\nScreengrab\nScreengrab\nScreengrab", "title": "Sorry Ishaan-Janhvi But Internet Thinks 'Conjectures' On KWK Are True And You Guys Are Dating!", "date_publish": "30/11/2018, 16:56:39", "description": "When you enter the world of stardom and glamor, your first co-star is always special. You lean on to them, share similar fears and find comfort in their presence. For Janhvi Kapoor and Ishaan Khatter, each other's company mattered a lot because it was their first film together.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sorry-ishaan-janhvi-but-internet-thinks-conjectures-on-kwk-are-true-and-you-guys-are-dating-357669.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/janhvi_and_ishaan_1543578269_800x420.jpg"}