{"text": "South Korean Singer Jung Joon-young has recently been slammed for sharing and filming intimate scenes with his ladies. The singer-songwriter admits he did it without their consent.\nTwitter\n\"I filmed women without their consent and shared it in a chatroom, and while I was doing so I didn't feel a great sense of guilt,\" he added in a statement released late Tuesday (Mar 12).\n“Throughout the rest of my life, I will repent on my immoral and illegal acts that constitute crimes. I will faithfully cooperate with an investigation by police and I will readily accept whatever punishment is in store for me,\" the publication quoted Jung Joon-young as saying.\nThe singer also announced that he will be withdrawing himself entirely from the entertainment scene and that he repents his unlawful act for the rest of his life.\nDon't Miss 106 SHARES 7.5 K SHARES\nThe news of Jung Joon Young's misdeeds has come as a shock after the news of another K pop singer Lee Seung Hyun aka Seungri emerged where he had been accused of offering sexual services at nightclubs.\nThe sex scandal has got everyone livid and the fans are devastated.\nmy heart breaks for jung joon young. He was the first korean artist that I had come to like. This is just so devastating, thinking that it's the second time that he's involved in a scandal. I'm not sure if he can still recover his career after this 😭😭😭😭😢😢😢😢 — all hail King Jongdae aka baby dino 🙌❤ (@EXOx1D) March 11, 2019\nAs a Jung Joon Young stan, I am truly saddened by the news. And I feel betrayed. This will be my last statement regarding his scandal.\nI stand with all 10 victims.\n#여자들_할_수_있어 pic.twitter.com/r7hYFlqjA0 — 📌read pinned tweet (@hongstars) March 12, 2019\nUmm, the convo that is very controversial right now happened before jung joon young's scandal. I think he already learned his lesson after that scandal and i really saw how he matured especially when he came back in 2d1n 🙂 — 🙁🙁🙁🙁 (@LegendaryKPOP) March 11, 2019", "title": "South Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of Women", "date_publish": "14/03/2019, 16:37:26", "description": "South Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of WomenSouth Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of WomenSouth Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of WomenSouth Korean Singer Jung Joon-young Apologises For Filming And Sharing Intimate Videos Of WomenSouth Korean Singer", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/south-korean-singer-jung-joon-young-apologises-for-filming-and-sharing-intimate-videos-of-women-363717.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/jung_joon_1552560570_800x420.jpg"}