{"text": "Speaking On Pay Parity, Abhishek Reveals His Wife Aishwarya Got Paid More In 8 Out Of 9 Films They Did Together\nSpeaking On Pay Parity, Abhishek Reveals His Wife Aishwarya Got Paid More In 8 Out Of 9 Films They Did Together\nWhile there has been an increase in the number of women-oriented movies and films that portray women characters in powerful characters, the issue of pay disparity in Bollywood is only getting bigger.\nSpeaking on the wage gap, the dirty little secret of the industry, a lot of celebrities have spoken earlier. The debate has always been a heated one. While some say that things are changing with times, others have complained it’s taking too long.\n1.bp.blogspot.com\nAt a recent event, Abhishek Bachchan who came back with a thunder in Manmarziyaan after a brief sabbatical shared his views on pay parity.\n“There’s a huge debate on gender parity in the film business and in other industries. I’ve worked in nine films with my wife [Aishwarya Rai Bachchan] and in eight of those, she’s got paid more than I have. The highest-paid actor in ‘Piku’ was Deepika [Padukone],” he was quoted as saying by News18.\nTwitter\nDon't Miss 3.5 K SHARES 3.1 K SHARES 155 SHARES 343 SHARES 870 SHARES\n“It’s a business and if you are a saleable actor, you get paid accordingly. You can’t be a new actress and demand to be paid the same as Shah Rukh Khan,” he added.\nAbhishek Bachchan and Aishwarya Rai will next be seen together in Sarvesh Mewara's Gulab Jamun, which will be produced by Anurag Kashyap.", "title": "Speaking On Pay Parity, Abhishek Reveals His Wife Aishwarya Got Paid More In 8 Out Of 9 Films They Did Together", "date_publish": "13/11/2018, 14:04:19", "description": "At a recent event, Abhishek Bachchan who came back with a thunder in Manmarziyaan after a brief sabbatical, shared his views on pay parity. “There’s a huge debate on gender parity in the film business and in other industries. I’ve worked in nine films with my wife [Aishwarya Rai Bachchan] and in eight of those, she’s got paid more than I have. The highest-paid actor in ‘Piku’ was Deepika [Padukon", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/speaking-on-pay-parity-abhishek-reveals-his-wife-aishwarya-got-paid-more-in-8-out-of-9-films-they-did-together-356568.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/abhishek_bachchan_speaks_on_pay_parity_says_aishwarya_rai_was_paid_more_in_8_out_of_9_films_they_di_1542103431_800x420.jpg"}