{"text": "‘Spider-Man Doesn’t Want His Life Back After This’, SOTY 2 Trailer Evokes Hilarious Outrage!\n‘Spider-Man Doesn’t Want His Life Back After This’, SOTY 2 Trailer Evokes Hilarious Outrage!\nDharma productions dropped the trailer of 'Student Of The Year 2' and first reactions prove that it hasn't been able to live upto all the hype and hoopla it created. Starring Tiger Shroff and debutants Ananya Panday and Tara Sutaria, the film is a love triangle revolving around a school competition.\nIn just a few hours of the release, people have a lot to say about the trailer. From making fun of a particular scene where Tiger and Tara dressed up as superheroes Spider-Man and Wonder Woman, to creating memes from some of the most absurd dialogues, there are some hilarious memes that sum up the first reactions to the movie.\nOne of the tweets read: “I feel u both @MarvelStudios and @TheDCUniverse can file defamation case against @DharmaMovies for this...can claim Rs. 1000-2000 crore...”\nIn case you are wondering what's in store for you, have a look at the memes right here and most hilarious tweets!\nWhen Marvel and DC characters met at Baba Siddique's Iftar party pic.twitter.com/zdsKMirhCl — Sagar (@sagarcasm) April 12, 2019\nDon't Miss 357 SHARES 1.1 K SHARES 207 SHARES 542 SHARES 12.5 K SHARES\nTopper friend: Bhai tu saal bhar to Padtha nhi h fr bhi pass kaise ho jata h\nMe:#SOTY2Trailer pic.twitter.com/CJnuJUriO4 — Saurabh Manjhi 🇮🇳 (@saurabhmanjhi_) April 12, 2019\nWhen Tiger Shroff had Mooli Ke Parathe for breakfast. #SOTY2Trailer pic.twitter.com/6MbjobLpQe — Bhosdi Waley (@bhosdiwaley) April 12, 2019\n#SOTY2Trailer\nDelivery guy: bhaiya me order lekar gate per khada hu\nMe : pic.twitter.com/TdDmXNYoVl — Chowkidar Humor Being (@followTheGupta) April 12, 2019", "title": "‘Spider-Man Doesn’t Want His Life Back After This’, SOTY 2 Trailer Evokes Hilarious Outrage!", "date_publish": "12/04/2019, 17:44:42", "description": "In just a few hours of the release, people have a lot to say about the trailer. From making fun of the particular scene where Tiger and Tara dressed up as superheroes Spider-Man and Wonder Woman, to creating memes from some of the most absurd dialogues, there are some hilarious memes that sum up the first reactions to the movie.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/spider-man-doesn-t-want-his-life-back-after-this-soty-2-trailer-evokes-hilarious-outrage-365357.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/soty_2_1555071734_800x420.jpg"}