{"text": "Angad Bedi and Neha Dhupia have had an eventful 2018. From secretly getting married in a Gurudwara ceremony in Delhi to welcoming their baby girl, the duo has been on our Instagram feed giving us major family goals.\nTwitter\nIn one of the chat shows of Saavn, Angad Bedi revealed how his in-laws went livid after they learnt about Neha Dhupia's pregnancy before marriage. The chat show, which was hosted by Neha Dhupia, went from Aww to Whoa! He had earlier revealed how Neha's pregnancy was the main reason why they tied the knot.\nAnd now after Mehr is born, Angad Bedi decided to speak about the negativity that was around the entire family as Neha gave birth to their child six months after the marriage.\nDon't Miss 106 SHARES\n“If a situation like this arises in the West, we want to read about it and we are like 'oh so good' and if something happens here, we have to criticise it. I think it's the hypocrisy of society and that's not going to change,” he told Pinkvilla.\nTalking further about how life has changed for him, Angad said, “Winning an award or signing of the film can never be compared to the feeling of holding a new-born in your arms. I feel that Mehr is my biggest achievement, adding, “My everything revolves around her and she has brought me a lot of luck. I have managed to sign four projects.”", "title": "Spilling The Beans On Neha's Early Pregnancy, Angad Bedi Says Society's Hypocrisy Won't Change", "date_publish": "10/01/2019, 17:10:02", "description": "Angad Bedi and Neha Dhupia have had an eventful 2018. From secretly getting married in a Gurudwara ceremony in Delhi to welcoming their baby girl, the duo has been on our Instagram feed giving us major happy goals. And now after Mehr is born, Angad Bedi decided to speak about the negativity that was around the entire family as Neha gave birth to their child six months after the marriage.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/spilling-the-beans-on-neha-s-early-pregnancy-angad-bedi-says-society-s-hypocrisy-won-t-change-360184.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/neha_1547118854_800x420.jpg"}