{"text": "We have lost count of the times Sreesanth has wanted to quit Bigg Boss 12 and it's been just a month since the show aired. In last night’s episode as well, he attempted to walk out of the house in anger. It’s no surprise anymore that Sreesanth is the most aggressive contestant on the show and that he often loses his temper.\nHe was evicted from the show a few days ago, only to be kept in a secret room along with Anup Jalota. After having watched other contestants play the game and seeing their true and real side, Sreesanth is not only against Dipika Kakar, who he calls his elder sister, but is also plotting the entire game against her with the help of other contestants.\nThis, apparently, isn’t going down well with the fans, who are calling out Sreesanth for playing a bad game on Twitter.\n#Sreesanth even now says that he wants to go home but when he was chosen by #DipikaKakkar, he blames her for choosing him. He is losing his self respect more and more by continuing the show. #BiggBoss #BiggBoss12 #BB #BB12 — Nikhil Reddy #MovieManiac (@sainikhilreddy7) October 16, 2018\n#Sreesanth - #BiggBoss mujhe ghar jana hai. Mujhe nikalo#DipikaKakar - #sree ghar jana chahta hai. Toh mai uska nam leti hu#Shreesanth - Dipika ji ne mera nam liya! Mai expose karunga usko.\n& again mujhe ghar jana hai. Mujhe nikalo @BiggBoss\nDipika haters ko dekho aur haso — Sakhawat H Sonnet (@tweet4sonnet) October 16, 2018\nDon't Miss 684 SHARES 2.3 K SHARES 294 SHARES 12.5 K SHARES 5.5 K SHARES\nSree fans - aa Gaya humara Sher secret room se wapis😍😍😍😍\nSree- Lol😂😂😂😂#bb12 #BiggBoss — 🎯Parivesh Malhotra🇮🇳 (@Parivesh95) October 16, 2018\nTwo Famous Dialogue Of #Sreesanth In #BB12\n\"BiggBoss Ae Darwaja Kholo Mujhe Ghar Jaana Hai\"\n\"Mai Ise Maar Deta\"\n\"Mai Ise Marne Wala Tha\"\n\"Mai Ise Maar Dunga\"\nBhai Past aur Future Tense Me Baate Kyo Karta Hai ,Kabhi Present Me Bhi Aa Ja#BiggBoss12#BiggBoss#BB12 — Tony (@TonyKaTashan) October 17, 2018\nAre Yaar Ajj Laga #Dipika Ne Jaise Bhi Reason Diya #Sreesanth to Nikalne Ke Liye Best Tha#Sreesanth se Bada Wala Maine Ajj Tak Nahi Deekha\nYe Sabse Bada bhagoda Hai, #Deepika Ko Usse Ab Nahi Samjhana Chaayie.\nBiggBoss Ise Ghar Se Bahar Pheko#BiggBoss12#BiggBoss#BB12 — Tony (@TonyKaTashan) October 17, 2018\nThis season is all about SreeSanth and Dipika but both of them doesn’t have Winner qualities!!! Horrible season 🤮#BB12 #BiggBoss12 — H. (@PaigesAngel_) October 17, 2018\n#Sreesanth ne socha tha ke hm Drama create kar le @ms_dipika ke against kar denge sabko lekin jab task shuru hua to #Sree ko laga ye to bhari pad gaya is liye party badal li, aur #DipikaKakar ko support kar diya. #WeSupportDipikaKakar @BiggBoss #BiggBoss12 — Ehtisham Farooqui (@etifarooqui) October 17, 2018\nActually I supported Sree so much last week because he was willing to play the game ... and expose Dipika's fakeness ...\nbut again he is saying gaalis and trying to run away after small instigation from Romil ... #bb12 very annoying — JC Miller (@JCMiller8720) October 17, 2018\nWho is your favourite contestant on Bigg Boss 12? Tell us in the comments section below.", "title": "Sreesanth’s Game Plan Against Dipika Kakar In Bigg Boss Has Left Twitterati Highly Disappointed", "date_publish": "17/10/2018, 16:39:51", "description": "After having watched other contestants play the game and seeing their true and real side, Sreesanth is not only against Dipika Kakar, who he calls his elder sister, but is also plotting the entire game against her with the help of other contestants.This, apparently, isn’t going down well with the fans, who are calling out Sreesanth for playing a bad game on Twitter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sreesanth-s-game-plan-against-dipika-kakar-in-bigg-boss-has-left-twitterati-highly-disappointed-354966.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sreesanths_game_plan_against_dipika_kakar_in_bigg_boss_12_is_disappointing_fans_on_social_media_1539771388_800x420.png"}