{"text": "He makes unconventional films and his film Andhadhun has been declared as the best film from Bollywood to come out in 2018 by critics and fans but for director Sriram Raghavan it was just a \"little mad idea\" that he wanted to try out after \"Badlapur\".\nRaghavan said he did not want to waste time dwelling on the success of \"Badlapur\", which, in his own words, was his first box office success.\nThe director said he thought \"Andhadhun\" would be his hassle free follow-up to \"Badlapur\", similar to what Ram Gopal Varma did after the mega success of \"Satya\". RGV went ahead and made \"Kaun?\", a small thriller set in a house and shot in just 20 days.\nbccl\n\"I wanted to do this one ('Andhadhun') almost like that. Take a little mad idea and make a movie,\" Raghavan told PTI in an interview.\n\"When I was doing this, we were not like 'Let's do it for more money or popularity'. You can't plan all that. Sometimes it happens, sometimes it doesn't. Now, I just feel 'so far, so good'. Next one is again a new mountain to climb,\" he added.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nRaghavan is a revered figure in the directors' community for his ability to shock with dark thrillers, a genre that Hindi film industry has not been able to crack in recent past.\nThe filmmaker of cult hits such as \"Ek Haseena Thi\" and \"Johnny Gaddar\", however, does not believe that he has a signature.\n\"The only thing, I think, is that I try to tell the story as economically and as interestingly as possible,\" he said.\n\"Andhadhun\" is partly inspired by a French short film, whose rights Raghavan acquired, and also from a song sequence from his \"Agent Vinod\", a film for which he still has a lot of affection despite its box office failure.\nWhen asked whether the blockbuster success of \"Andhadhun\" will inspire people to revisit his older works, Raghavan said, \"Many people have not seen 'Agent Vinod'. I tell them, 'Ok, it is a little exhausting, a little long, almost a three-hour film but generally they are all binge-watching mini series, so you can watch it like that'.\"\nThere were rumours that Raghavan may collaborate with Shah Rukh Khan but the director said the superstar had simply called to tell him that he loved \"Andhadhun\".\nap\nShah Rukh, however, is one of the names that figure prominently in Raghavan's mind when it comes to interesting stories and he had even written a version of the story that became Shah Rukh's first major hit, \"Baazigar\".\n\"There are certain actors I think I can approach whenever I am working on something and Shah Rukh is one of those. He's somebody whom I'd love to work with. For example, one of the very early stories I'd written, was based on a novel on which 'Baazigar' was also based - 'A Kiss Before Dying'.\n\"My version of that movie would have been something else. In fact, I worked on the script and later found out that a film had already been made on the idea.\"\ntwitter\nWith box office success there is more recognition for a filmmaker but Raghavan prefers anonymity.\n\"I want that anonymity, I prefer that actually. I should be able to walk and observe people and all that. Unless the movie is about to release, I don't like to be in the limelight. Then I have no choice, but after that you have to get back. I'm not a social person. I don't like parties. I like small groups, we discuss ideas in my office. That way, I am a little weak on social skills.\"\nNext on Raghvan's wishlist is a war film, which he hopes would be big in scale. \"The work has not yet begun. It will be expensive so it needs a lot of prep.\"\nInputs From PTI", "title": "Sriram Raghavan On Mad Ideas, Anonymity And Working With Shah Rukh In Future", "date_publish": "19/12/2018, 15:34:25", "description": "He makes unconventional films and his film Andhadhun has been declared as the best film from Bollywood to come out in 2018 by critics and fans but for director Sriram Raghavan it was just a \"little mad idea\" that he wanted to try out after \"Badlapur\". Raghavan said he did not want to waste time dwelling on the success of \"Badlapur\", which, in his own words, was his first box office success.", "authors": [], "url": "https://www.indiatimes.com/entertainment/sriram-raghavan-on-mad-ideas-anonymity-and-working-with-shah-rukh-in-future-358913.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_and_sriram_raghavan_1545214011_800x420.jpg"}