{"text": "SRK Comes Out In Support Of Aamir Khan's Thugs Of Hindostan, Says People Have Been Too Harsh\nSRK Comes Out In Support Of Aamir Khan's Thugs Of Hindostan, Says People Have Been Too Harsh\nBollywood actor Aamir Khan comes out with a movie once a year and it creates fireworks at the box office. From 3 Idiots, PK to Dangal, all his movies have broken records. This time too, his much anticipated film Thugs Of Hindostan released. Just like all his films, day 1 of the film had a spectacular response due to the festive Diwali week.\nTwitter\nHowever, gradually the movie started sinking. From garnering Rs 51 crore on opening day to barely collecting Rs 128 crore in 5 days, Aamir Khan starrer has seen a shocking dip.\n#ThugsOfHindostan\nHINDI:\nThu 50.75 cr, Fri 28.25 cr, Sat 22.75 cr, Sun 17.25 cr, Mon 5.50 cr, Tue 4.35 cr. Total: ₹ 128.85 cr\nTAMIL + TELUGU:\nThu 1.50 cr, Fri 1 cr, Sat 75 lakhs, Sun 75 lakhs, Mon 50 lakhs, Tue 40 lakhs. Total: ₹ 4.90 cr\nTotal: ₹ 133.75 cr\nIndia biz.#TOH — taran adarsh (@taran_adarsh) November 14, 2018\n#ThugsOfHindostan CRASHES on Mon... Witnesses a drastic fall... In fact, expect a free-fall on weekdays... Metros / plexes are down to shockingly low levels, while mass belt / single screens are falling rapidly... #TOH is, without doubt, the BIGGEST SHOCKER of 2018... — taran adarsh (@taran_adarsh) November 13, 2018\nDon't Miss 862 SHARES 5.1 K SHARES 346 SHARES\nFrom critics, fans and audience, the word of mouth spread way too quickly and the movie crashed within no time. So much so, that according to reports, the movie which was made on a budget of Rs 250 crore, may not even be able to cover the costs.\nTwitter\nDespite the ill-will around the movie, actor Shah Rukh Khan feels the approach towards the movie has been a little too harsh. Speaking to The Telegraph in an interview, the superstar said,\n\"The greatest contribution to Hindi cinema in the last 10 years has been from Aamir, and with Amitji, it’s been even longer. Now if a film of theirs (Thugs of Hindostan) doesn’t reach the level that you expected it to, does it take away from what they have done for cinema? I think some people have been a little too harsh. It’s heartbreaking. It doesn’t mean that their spirit is broken, they are all amazing artistes who will bounce back\"\nHe further added,\n\"I may be speaking out of turn, but just like we have embraced Stree, we need to give some leeway to films like Thugs… that attempt something different. An adventure film has not been made in India in decades. Thugs… has tried to introduce this genre and kabhi kabhi upar neeche ho sakta hai. But the fact remains that in our cinema, we haven’t made an Indiana Jones and screw the comparison yaar, humne 'Pirates of the Caribbean' bhi nahin banayi. So props to them for the attempt.”\nWhile we do understand SRK's genuine concern for Aamir's movie, we're also slightly worried about his own upcoming project Zero which has received mixed response on the trailer.", "title": "SRK Comes Out In Support Of Aamir Khan's Thugs Of Hindostan, Says People Have Been Too Harsh", "date_publish": "15/11/2018, 13:19:40", "description": "Despite the ill-will around the movie, actor Shah Rukh Khan feels the approach towards the movie has been a little too harsh. Speaking to The Telegraph in an interview, the superstar said, \"The greatest contribution to Hindi cinema in the last 10 years has been from Aamir, and with Amitji, it’s been even longer.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-comes-out-in-support-of-aamir-khan-s-thugs-of-hindostan-says-people-have-been-too-harsh-356708.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/srk_1542270681_800x420.jpg"}