{"text": "\"Agar woh tumse sacha pyaar karti hai..toh woh palat ke zaroor dekhegi...palat...palat...palat...\"\nThese iconic lines from Shah Rukh Khan and Kajol's iconic movie DDLJ might teleport you to the good old world of 90's cinema but in real life, SRK has a different perspective on his roles.\nThe actor who has romanced and set some real standards for men to follow is not a very big endorser of his own onscreen characters. In an interview with Indian Express, he revealed that he has warned daughter Suhana Khan of being cautious of boys who behave like his onscreen characters.\nYashraj Films\nHe added that if Suhana ever meets someone like lover boy Rahul, the quintessential loverboy that he has so often played in his films, he would rather have her ‘kick him in the shins’. He was quoted as saying,\nInstagram/Suhana\n“What is the essence of romance? To make somebody feel it at a particular moment in time. Personally, I’m not like that. If I stood with my arms open and sang a song in front of my wife, probably she’d throw me out of the house. I told my daughter, that if a guy meets you and says, ‘Rahul, naam toh suna hoga’, he’s a stalker. If a boy looks at you across a room at a party and says, ‘Aur paas, aur paas’, go kick him in the shins. But in the film, if I’m able to activate an element of innocence and make it attractive, the role gets reinvented by itself.\"\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nWell, that's not all. A protective father that Shah Rukh Khan has always been, he has time and again confessed that he is a paranoid father who takes extra care of his kids.\nJust a few weeks ago, SRK took to his social media account as he had a piece of special news to share. Suhana had performed as Juliet in a play in London, where she is currently studying. After watching the play, Daddy Khan couldn't help but shower up with praises.\nFrom keeping that away from unnecessary media glare to restricting himself to revealing limited information about his kids, Shah Rukh Khan is a 10 on 10 Daddy!", "title": "SRK Tells Daughter Suhana To Beware Of Boys Who Behave Like His On-screen Characters In Real Life!", "date_publish": "29/12/2018, 11:17:13", "description": "\"Agar woh tumse sacha pyaar karti hai..toh woh palat ke zaroor dekhegi...palat...palat...palat...\" These iconic lines from Shah Rukh Khan and Kajol's iconic movie DDLJ might teleport you to the good old world of 90's cinema but in real life, SRK has a different perspective on his roles.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-tells-daughter-suhana-to-beware-of-boys-who-behave-like-his-on-screen-characters-in-real-life-359456.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/srk_1546063387_800x420.jpg"}