{"text": "According to agency reports, local outfit Thursday threatened to throw ink at Bollywood star Shah Rukh Khan and show him the black flag when he visits Bhubaneshwar next week during the 2018 Men’s Hockey World Cup.\nUpdate: SRK's security has been beefed up for his Bhubaneshwar next week during the 2018 Men’s Hockey World Cup.\nVarun and Natasha were spotted at the Mumbai airport today with Daddy Varun Dhawan as they flew out of the city. The couple and Daddy Dhawan posed for the paps and smiled. The pictures made way on the internet and like always, everyone has a similar reaction: When's the wedding?\nDon't Miss 10.9 K SHARES\nShe said, “Yes, I have informed the Mumbai police that I want to withdraw my complaint against Subhash Ghai. I want to take care of my family and my ailing mother instead of roaming here and there to get justice for whatever has happened to me.”\nTalking about the same, Kareena said, “They are leaving us with no choice. But of course, as a mother, it would kill me to send him away. And I think it'd be unfair and I tell Saif that it'd be like running away from reality because this is the reality.”\nHe said, \"The children coming together gave me a lot of strength to cope up with the situation we were facing. I couldn’t have asked for more. For a parent, children come first and seeing all my 4 children together was….kind of a balming effect after the tragedy.\"", "title": "SRK's Security Beefed Up, Natasha-Varun Flies Out of Mumbai And More From Ent World", "date_publish": "24/11/2018, 17:31:57", "description": "According to agency reports, local outfit Thursday threatened to throw ink at Bollywood star Shah Rukh Khan and show him the black flag when he visits Bhubaneshwar next week during the 2018 Men’s Hockey World Cup. Update: SRK's security has been beefed up for his Bhubaneshwar next week during the 2018 Men’s Hockey World Cup.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-s-security-beefed-up-natasha-varun-flies-out-of-mumbai-and-more-from-ent-world-357317.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/trending_1543061021_800x420.jpg"}