{"text": "Who would have thought that Anand L Rai, who is known for his blockbusters Tanu Weds Manu and Tanu Weds Manu Returns, would fail miserably with his next project!\nHis most ambitious project, in which he collaborated with Shah Rukh Khan, made a lot of waves even before the release of the movie. It had Shah Rukh Khan playing a dwarf, after all.\nTwitter\nEach time Shah Rukh Khan has experimented with his roles, he has been anxious before the release of the movie. He once even said that fans want him to experiment with his roles but he reinvented himself as an actor with a role like Fan, it flopped.\nTwitter\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES 555 SHARES\nThe history repeated itself once again. Zero also failed miserably at the box office. But the question is – is Shah Rukh Khan affected by it all?\nRumours were rife that Shah Rukh Khan has walked out of Rakesh Sharma biopic, a film Aamir Khan had suggested him to take up because he thought SRK would fit in the role better. Grapevine also suggested that Shah Rukh Khan doesn’t want to experiment with different kinds of roles anymore, especially after the failure of Zero. And now, writer Anjum Rajabali has confirmed that the rumours were all true.\nRubbishing the rumours that SRK walked out of the film because he didn’t want to do another space film after Zero, he said, “If you're asking me, there was a problem with the script (of 'Zero'). Himanshu (Sharma, the writer) is a very talented person but things go wrong sometimes. I don't think he said no to 'Saare Jahan Se Achcha' because of the space (angle). I think he's also pretty shaken up, he was banking a lot on that,\" Anjum said while moderating a panel discussion 'Screenwriters: The Creative Force Powering Indian Cinema's New Surge'.”\nthepunchmagazine.com\nFurthermore, Anjum also pointed out how makers always blame everything else but the script when a film fails.\n“This whole practice and culture of postmortem, of analysing what went wrong hasn't really caught on. What happens then is, there are knee-jerk reactions rather than responses even from the makers. Oh, it (the failure) could be because of the space and hence we put two into two together. Oh it's because the time wasn't right, nobody wants to see a star in a disabled person's role.' It could also well be that there was a problem with the DNA of the script,” he said.\nIf not Shah Rukh Khan, who will play the lead role in Rakesh Sharma biopic? Do you feel the King Khan has made a right choice? Let us know in the comments section below.\nWith inputs from PTI", "title": "Shah Rukh Khan:Writer Anjum Rajabali Confirms SRK Opted Out Of Rakesh Sharma Biopic, Says He’s ‘Shaken Up’ After Zero's Failure", "date_publish": "15/03/2019, 14:17:33", "description": "Writer Anjum Rajabali has confirmed that Shah Rukh Khan walked out of Rakesh Sharma biopic titled Saare Jahan Se Achha because she is \"shake up\" after the Anand L Rai's Zero failed at the box office. Rubbishing the rumours that SRK walked out of the film because he didn’t want to do another space film after Zero, he said, “If you're asking me, there was a problem with the script (of 'Zero'). Himan", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/srk-opts-out-of-rakesh-sharma-biopic-writer-anjum-rajapali-says-he-s-shaken-up-after-zero-s-failure-363769.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/shah_rukh_khan_is_shaken_up_post_zeros_failure_confirms_writer_of_rakesh_sharma_biopic_1552639013_800x420.jpg"}