{"text": "SRK Is Looking Forward To Deepika-Ranveer's Wedding, Says He Wanted To Hug Her When She Broke The News\nSRK Is Looking Forward To Deepika-Ranveer's Wedding, Says He Wanted To Hug Her When She Broke The News\nShah Rukh Khan is a man whose heart is made of gold and what his co-stars think of him proves just that. The actor who has ruled the industry for years now is one of the most loved in Bollywood. When he is not shooting, he is seen, unwinding, meeting and chilling with his industry friends.\nShah Rukh has several friends in the industry and one person who he is really close is Deepika Padukone. Deepika, infact, calls SRK, 'Shah' and he has also been really special for her considering she made her Bollywood debut with him in Farah Khan's Om Shaanti Om.\nThe duo went on to do films like Happy New Year and Chennai Express together and both the films did well at the box-0ffice. They share a great rapport in real-life too and we saw an example of this when during one of the gaming-rounds of Koffee With Karan, Padukone rang SRK up. In case of emergency, you can only call your dependable friends, right?\nSRK was recently interacting with the media during the trailer launch of his upcoming film 'Zero' when he was asked to comment about Deepika and Ranveer's wedding. His reaction to Deepika's wedding was exactly how a close-friend would react. A PTI report quoted the actor as saying,\nDon't Miss 343 SHARES 460 SHARES 555 SHARES 1.7 K SHARES\n\"When I came in the film industry I started acting with Sridevi ji, Madhuri (Dixit) ji. They got married. I have flowered as an actor and star because of the love these ladies have given me. The second generation got married and this is the third set who is getting married. I get really emotional when they get married. I called Deepika and I wanted to hug her, I told her be happy. My love to Deepika and Ranveer.\nWe will be celebrating as and when they call.\"\nDeepika and Ranveer Singh announced their wedding in a public statement.\nThe couple will tie the knot in Italy and the ceremonies will take place from 14-15th November.\n(All the pictures have been sourced from fan pages on social media)", "title": "SRK Is Looking Forward To Deepika-Ranveer's Wedding, Says He Wanted To Hug Her When She Broke The News", "date_publish": "03/11/2018, 11:01:34", "description": "The duo went on to do films like Happy New Year and Chennai Express together and both the films did well at the box-0ffice. They share a great rapport in real-life too and we saw an example of this when during one of the gaming-rounds of Koffee With Karan, Padukone rang SRK up. In case of emergency, you can only call your dependable friends, right?", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-is-looking-forward-to-deepika-ranveer-s-wedding-says-he-wanted-to-hug-her-when-she-broke-the-news-355960.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1541224158_800x420.jpg"}