{"text": "SRK Confirms Aamir Khan Will Be Playing The Role Of Krishna In Mahabharata, Says He Wanted The Same Part Too!\nSRK Confirms Aamir Khan Will Be Playing The Role Of Krishna In Mahabharata, Says He Wanted The Same Part Too!\nAs an actor, the biggest game that you can never stop playing is to juggle between your hits and a flop. While a hit can't define your career entirely, a flop doesn't mean that you're out of the game.\nAamir Khan has had a bad year with his mega-budget film Thugs Of Hindostan tanking at the box-office. The actor has expressed his disappointment and he admitted that it felt terrible but he has promised that he won't stop entertaining his audience.\nHe was present at an award ceremony of India’s Storytellers Script Contest, where he took full responsibility for the failure of the film. He had said,\nDon't Miss 468 SHARES 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES\n“I would like to take full responsibility for that. You can be sure that we tried our level best. There are people who have liked the film a lot and we would like to thank them. Majority of the people did not like the film and we are aware of the fact. So there is no doubt that we did go wrong. I want to apologise to the viewers who came to watch my film in the theatres as I was not able to entertain them despite trying my best.”\nThe actor is back in the game and is currently focused on another mega-project Mahabharata.\nThe project has been in the news for a lot of reasons and now finally we know that Aamir Khan is playing the role of Krishna in the movie. The news was confirmed by none other than his very good friend Shah Rukh Khan. During an interview with DNA, SRK was asked about what kind of role he would like to play to which he replied,\n‘Krishna from Mahabharata’ but went on to add “Krishna from Mahabharata has already been taken by Aamir so I will not be able to do that.”\nReports have time and again hinted at the fact that Mahabharata was to be made on a budget of around Rs 1000 crore but will now be made as a seven-part web series. There has been another juggle of role between Aamir and SRK as Aamir was to star in astronaut Rakesh Sharma’s biopic but he passed on the role to Shah Rukh.\nWriter Anjum Rajabali had also confirmed the same and said, “Frankly, I was very keen that Aamir should do the film. He liked the script, we discussed it a lot and we had a lot of hopes about it, Unfortunately, Aamir is consumed with a larger sort of project called Mahabharat.”\nWell, all's well that ends well and we are glad that both the Khans have found projects that they will end up giving their best to.", "title": "SRK Confirms Aamir Khan Will Be Playing The Role Of Krishna In Mahabharata, Says He Wanted The Same Part Too!", "date_publish": "22/12/2018, 13:24:44", "description": "The news was confirmed by none other than his very good friend Shah Rukh Khan. During an interview with DNA, SRK was asked about what kind of role he would like to play to which he replied, ‘Krishna from Mahabharata’ but went on to add “Krishna from Mahabharata has already been taken by Aamir so I will not be able to do that.”", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-confirms-aamir-khan-will-be-playing-the-role-of-krishna-in-mahabharata-says-he-wanted-the-same-part-too-359078.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/aamir_and_srk_1545466527_800x420.jpg"}