{"text": "Twitter\nDespite the ill-will around the movie, actor Shah Rukh Khan feels the approach towards the movie has been a little too harsh. Speaking to The Telegraph in an interview, the superstar said,\n\"The greatest contribution to Hindi cinema in the last 10 years has been from Aamir, and with Amitji, it’s been even longer. Now if a film of theirs (Thugs of Hindostan) doesn’t reach the level that you expected it to, does it take away from what they have done for cinema? I think some people have been a little too harsh. It’s heartbreaking. It doesn’t mean that their spirit is broken, they are all amazing artistes who will bounce back\"\n#WATCH: Visuals from Villa del Balbianello at Lake Como, the wedding venue of Deepika Padukone & Ranveer Singh, in Italy's Lombardy pic.twitter.com/47Jk1MmU2j — ANI (@ANI) November 14, 2018\nWhile the couple took extra efforts in ensuring the privacy and no official media was cover the wedding, there were few people from the media who were present at the location to at least get some information straight from the wedding.\nDon't Miss 106 SHARES 7.6 K SHARES\nThe Baywatch actress Priyanka Chopra has partnered with Facebook India for a live event called #SocialForGood to spread awareness on issues like mental health, cyber bullying and women entrepreneurship.\n#SocialForGood will be a four hour long live event, which will take place on November 27 on Facebook.\nHere’s her answer to it,\n“When this film was offered to me, I had stopped working in films. I have been in cricket for all this while, and when I heard this script - I was like this is so not me, ‘ye toh mai bilkul hi nahi karungi’. If you look at my career graph, I started it with Kya Kehna. Dil Se released first, Soldier, Mission Kashmir, Sangharsh, Armaan, Dil Hai Tumhara, every role was character driven, maybe one or two films I did to build a house, or someone forced me to do for a relationship otherwise every film I have done is for a story or a character.\nSo, at one stage of my life I went to filmmakers who are my friends and asked why ain’t they casting me in a desi role, they were like no, that’s not your personality and I was like I am an actor, and that was probably I thought now I want to do something else, because when you are up there, been there, done that, and you have even worked with Yash Chopra you want to experiment, but that time was not of experiment, whenever I wanted to do some desi role, they used to say no Rani Mukerji will do it well.\"\nAnd just like DeepVeer fans, Indian politician and Textile minister Smriti Irani is also starving for the photos of the Bollywood couple. So much so, that she recently shared this meme.", "title": "SRK Defends Aamir Khan's Thugs Of Hindostan, Smriti Irani Awaits DeepVeer's Photos Too & More From Ent.", "date_publish": "15/11/2018, 18:00:27", "description": "Despite the ill-will around the movie, actor Shah Rukh Khan feels the approach towards the movie has been a little too harsh. Speaking to The Telegraph in an interview, the superstar said, \"The greatest contribution to Hindi cinema in the last 10 years has been from Aamir, and with Amitji, it’s been even longer.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-defends-aamir-khan-s-thugs-of-hindostan-smriti-irani-awaits-deepveer-s-photos-too-more-from-ent-356761.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/wrap_1542285515_800x420.jpg"}