{"text": "SRK Is All Praises For His Interior Decorator Wife Gauri But Says He Can't 'Afford' To Hire Her\nSRK Is All Praises For His Interior Decorator Wife Gauri But Says He Can't 'Afford' To Hire Her\nHe's a megastar and a charmer. She, on the other hand, is a producer and an interior decorator. Together, they're perfect.\nShah Rukh Khan and Gauri Khan are two people who compliment each other perfectly. The couple made a media appearance recently for the opening of a cafe that Gauri had designed. SRK was in his usual joking mood while interacting with the press.\nPinterest\nPraising and talking about his wife Gauri, SRK said he cannot afford to get his interior decorator and producer wife Gauri Khan on board to design for films.\nAgencies\nHe was quoted as saying, \"We make really small films. We can't afford to get her on board for our films.\"\nGauri had a different take on why she'll take time to take up his projects. She said,\nPinterest\n\"Right now, I am very busy. My hands are full and whenever I will have time then, 100 percent I will do it.\"\nThe couple was interacting with the media on Monday at the inauguration of 'Sanchos' -- a Mexican restaurant designed by Gauri. Joking about the free food that he gets, he added,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nPinterest\n\"I just go to whichever restaurant she opens because I get a free meal, so it's really good for me... I hope she keeps opening up new restaurants so that all of us can keep coming here to do parties.\"\nApart from designing restaurants and office spaces, Gauri has also designed the homes of Bollywood celebrities like Ranbir Kapoor, Varun Dhawan, Sidharth Malhotra, Karan Johar, and Jacqueline Fernandez among many others.", "title": "SRK Is All Praises For His Interior Decorator Wife Gauri But Says He Can't 'Afford' To Hire Her", "date_publish": "14/11/2018, 12:53:49", "description": "He's a megastar and a charmer. She, on the other hand, is a producer and an interior decorator. Together, they're perfect. Shah Rukh Khan and Gauri Khan are two people who compliment each other perfectly. The couple made a media appearance recently for the opening of a cafe that Gauri had designed. SRK was in his usual joking mood while interacting with the press.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-is-all-praises-for-his-interior-decorator-wife-gauri-but-says-he-can-t-afford-to-hire-her-356625.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/gauri_andsrk_1542179137_800x420.jpg"}