{"text": "SRK Bowled Over By Daughter Suhana's Performance In 'Juliet', Showers Her With Praises\nSRK Bowled Over By Daughter Suhana's Performance In 'Juliet', Showers Her With Praises\nShah Rukh Khan is not only the biggest superstars of the country but he is also a hands-down 10/10 father! When he's away from shooting and his routine life, he is often seen spending time with his family, especially his kids.\nThe actor dots on his kids and we have innumerable instances. Be it accompanying his kids for family trips or just being there on their important days, SRK ensures he never misses any special day.\n(Also read: Suhana Khan Turns 18 And These Pics Prove That SRK Is Both Her Best Friend & A Doting Dad!)\nYesterday, SRK took to his social media account as he had a special news to share. SRK's daughter Suhana recently performed as Juliet in a play in London, where she is currently studying. After watching the play, Daddy Khan couldn't help but shower up with praises.\n(Also read: Not Just Cricket, IPL Means Quality Family Time For SRK And His Kids. These Pics Are A Proof!)\nDon't Miss 343 SHARES 555 SHARES 263 SHARES\nCalling it a ‘wonderful experience’, he conveyed his good wishes to the other members of the cast, calling their acts ‘exceptional’.\nInstagram\nWith this message, he shared a collage of Suhana on the poster of the play. The other half of the collage has a picture of Daddy Khan with Suhana, where he is seen hugging her with a bouquet.\nJust to jog your memory a little, this isn't the first time that SRK is impressed with the daughter's acting skills. Last year in February, a video of Suhana's school play went viral on the internet and SRK himself praised her for her skills.\nSuhana made headlines this year after she was featured on the cover of Vogue. While the pictures went viral, it also sparked controversy around her credibility and privilege.", "title": "SRK Bowled Over By Daughter Suhana's Performance In 'Juliet', Showers Her With Praises", "date_publish": "01/12/2018, 10:58:53", "description": "Shah Rukh Khan might be one of the biggest superstars of the country but he is also a hands-down 10/10 father! When he's away from shooting and his routine life, he is often seen spending time with his family, especially his kids. The actor dots on his kids and we have innumerable instances. Be it accompanying his kids for family trips or just being there on their important days, SRK ensures he n", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/srk-bowled-over-by-daughter-suhana-s-performance-in-juliet-showers-her-with-praises-357686.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/srk_1543642415_800x420.jpg"}