{"text": "Almost every Marvel and superhero fan across the globe is mourning the death of the comic-book legend Stan Lee. The real-life superhero – that’s what Stan Lee was fondly called – left us all for his heavenly abode yesterday, and all superheroes were left grieving this sad news.\nAlso Read: Stan Lee, The Man Who Created Spider-Man & Iron Man, Passes Away & All Superheroes Are Mourning\nThe man who gave us Spiderman, Iron Man, Avengers and Fantastic Four, has regularly done cameos in Marvel films over the years. He indeed had cast an immense impact on comics and films.\nReuters\nBut the good news is that Stan Lee will be seen on the big screen once again and for the one last time. He will be seen in Avengers 4, Captain Marvel and Ralph Breaks The Internet as the legend had already filmed for the movie prior to his death.\nAP\nFurthermore, director Joe Russo had confirmed Stan Lee’s appearance in the upcoming Avengers 4, while talking to CBR.com.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“So, Stan, typically we try to get him out — he doesn’t love to fly — so we try to get him out for his cameos around the same time... so if we have other movies shooting on the same lot that we’re on, for instance Ant-Man 2 or Avengers 4, we group his cameos together and then move him from one set to the next and kind of get him through his cameos in one day,” he had said.\nReports also suggest that fans shall not be surprised if they see Stan Lee in Spider-Man: Into the Spider-Verse.\nAlso Read: In This Old Video, Marvel Comic’s Real-Life Superhero Stan Lee Hoped People Kept His Obituary Ready", "title": "Stan Lee Had Filmed His Cameos For ‘Captain Marvel’ & ‘Avengers 4’ Prior To His Death!", "date_publish": "14/11/2018, 13:51:12", "description": "Almost every Marvel and superhero fan across the globe was mourning the death of the comic-book legend Stan Lee. The real-life superhero – that’s what Stan Lee was fondly called – left us all for his heavenly abode yesterday, and all superheroes were left grieving this sad news.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/stan-lee-had-filmed-his-cameos-for-captain-marvel-avengers-4-prior-to-his-death-356645.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/stan_lee_had_filmed_his_cameos_for_captain_marvel__avengers_4_prior_to_his_death_1542183011_800x420.png"}