{"text": "When he was asked what’s on his wish list, he told The Daily Beast, “That I leave everyone happy when I leave. Well, I don’t mean happy that I left. Happy that I took the right path.”\nThe man who kept our childhood alive, who created superheroes to show us what heroes are made of and that we could be like them too, Stan Lee, the creator of Marvel superheros including Iron Man and Spider Man has died at the age of 95.\nsagacom.com\nThe news has sent shockwaves across the globe and everyone is mourning the death of Marvel creator and comic book legend Stan Lee, who is fondly called the real-life superhero.\nsnopes.com\nFrom Ryan Reynolds and Chris Evans to Robert Downey Jr, celebs paid their tribute to the rich legacy of Marvel Comic legend. Marvel Studios' President, Kevin Feige said that Stan Lee has left an extraordinary legacy that will be outlived all.\n#1\nNo one has had more of an impact on my career and everything we do at Marvel Studios than Stan Lee. Stan leaves an extraordinary legacy that will outlive us all. Our thoughts are with his daughter, his family, and his millions of fans. #ThankYouStan #Excelsior! — Kevin Feige (@Kevfeige) November 12, 2018\nDon't Miss 264 SHARES 974 SHARES 17.1 K SHARES 555 SHARES\n#2\n#3\n#4\n#5\n#6\n#7\n#8\nThere will never be another Stan Lee. For decades he provided both young and old with adventure, escape, comfort, confidence, inspiration, strength, friendship and joy. He exuded love and kindness and will leave an indelible mark on so, so, so many lives. Excelsior!! — Chris Evans (@ChrisEvans) November 12, 2018\n#9\n#10\n#11\nToday, we pause and reflect with great sadness on the passing of Stan Lee: https://t.co/J0cwgdn677 pic.twitter.com/eOBdZAqdZ0 — Marvel Entertainment (@Marvel) November 12, 2018\n#12\nHe changed the way we look at heroes, and modern comics will always bear his indelible mark. His infectious enthusiasm reminded us why we all fell in love with these stories in the first place. Excelsior, Stan. — DC (@DCComics) November 12, 2018\nThanks for everything Stan Lee. Your work and contribution to this world will be cherished for centuries to come. May your soul rest in peace!", "title": "Stan Lee, The Man Who Created Spider-Man & Iron Man, Passes Away & All Superheroes Are Mourning", "date_publish": "13/11/2018, 11:01:05", "description": "The man who kept our childhood alive, who created superheroes to show us what heroes are made of and that we could be like them too, Stan Lee, the creator of Marvel superheros including Iron Man and Spider Man has died at the age of 95. The news has sent shockwaves across the globe and everyone is mourning the death of Marvel creator and comic book legend Stan Lee, who is fondly called the real-li", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/stan-lee-the-man-who-created-spider-man-iron-man-passes-away-all-superheroes-are-mourning-356536.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/man_who_gave_the_world_spider_man__iron_man_stan_lee_is_dead__all_superheroes_are_mourning_1542087131_800x420.png"}