{"text": "Veteran filmmaker Steven Spielberg has taken a new battle to fight.\nAccording to a PTI report, he is taking his fight with streaming giant Netflix to a notch above. According to Indiewire, the 72-year-old director will be speaking with the Board of Governors at the Academy of Motion Picture Arts and Sciences (AMPAS) to insist for a rule change that will make films made by the streaming services like Netflix, Hulu and Amazon ineligible for Oscars.\nSpielberg had last month taken a potshot at the streaming services by urging directors to make movies for the “big dark theatres”. He had previously said that films which debut on streaming services should compete for the Emmys instead of the Oscars.\nafp\nSpielberg represents the Directors branch of the Academy on their Board of Governors. “Steven feels strongly about the difference between the streaming and theatrical situation,” a spokesperson for Spielberg’s Amblin Entertainment said.\n“He’ll be happy if the others will join (his campaign) when that comes up (at the Academy Board of Governors meeting). He will see what happens,” the spokesperson added.\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe veteran director’s move comes days after Netflix feature Roma, directed by Mexican filmmaker Alfonso Cuaron, bagged three awards -- Best Director, Best Cinematography, and Best Foreign Language Film -- at the 91st Academy Awards.\nThe film’s award-sweeping run was stopped by Green Book, which also had the backing of Spielberg, as the Peter Farrelly-directed film claimed the top prize of the night -- the Best Picture trophy.\nreuters\nThe director is not alone in the fight against the streaming services with other Academy members also arguing that Netflix spent too in its marketing campaign for Roma, which was around USD 50 million. ahead of the Oscars and that the streaming giant failed to adhere to proper theatrical release rules already in place.\n“There’s a growing sense that if (Netflix) is going to behave like a studio, there should be some sort of standard. The rules were put into effect when no one could conceive of this present or this future. We need a little clarity,” one Academy governor told IndieWire.\nDirector Ava DuVernay was among the first to react to the news of Spielberg planning to approach the academy, saying a decision should be taken only after consulting all the filmmakers, including those “who feel differently”.\nreuters\n“Dear @TheAcademy, This is a Board of Governors meeting. And regular branch members can’t be there. But I hope if this is true, that you’ll have filmmakers in the room or read statements from directors like me who feel differently. Thanks, Ava DuVernay,” she wrote on Twitter.\nDuVernay’s Oscar-nominated documentary 13th was distributed through Netflix in 2016, and she is currently working on When They See Us, a four-part series on the 1989 Central Park Five case which will premiere on the streaming giant’s platform on May 31.\nInputs From PTI", "title": "Steven Spielberg Wants To Change Oscar Rules To Make Netflix Films Ineligible", "date_publish": "03/03/2019, 11:03:43", "description": "Veteran filmmaker Steven Spielberg is taking his fight with streaming giant Netflix to a notch above. According to Indiewire, the 72-year-old director will be speaking with the Board of Governors at the Academy of Motion Picture Arts and Sciences (AMPAS) to insist for a rule change that will make films made by the streaming services like Netflix, Hulu and Amazon ineligible for Oscars.", "authors": [], "url": "https://www.indiatimes.com/entertainment/hollywood/steven-spielberg-wants-to-change-oscar-rules-to-make-netflix-films-ineligible-363060.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/steven_spielberg_wants_to_change_oscar_rules_1551591310_800x420.jpg"}