{"text": "Stop Whining! The Internet Is Discussing Game Of Thrones Season 8 Episode 1 By Giving Spoilers Without Context\nStop Whining! The Internet Is Discussing Game Of Thrones Season 8 Episode 1 By Giving Spoilers Without Context\nMonday blues - what is that? People all across the globe are in a celebratory mode!\nA few hours later whole world! 🥳 #GameOfThrones pic.twitter.com/5EkDc7PuY4 — The North Remembers (@starkhanesi) April 14, 2019\nSunday night or in our case Monday morning brought with itself the most awaited treasure that all of us had been pining for! After an ultra long wait of 565 days, Game Of Thrones Season Finale has finally commenced. To say that it opened with a bang would be an understatement.\nNow, we know the drill. Every episode of every season makes a large percentage of people whine and throw a fit. Why you ask? Well, the spoilers - what else!\ntwitter\nPersonally, i feel that it’s just balderdash. We can cut these whiners some slack for the previous seasons but the FINALE! I mean come on, it’s simple - you snooze, you lose! How can you wait desperately for something and not watch it the minute it premiers. So much for passion, right?\nDon't Miss 159 SHARES 842 SHARES\nHowever, the internet is not all devious. There are kind souls out there who have come up with a brilliant way of discussing the first episode. SPOILERS WITHOUT CONTEXT!\nYes, you read that right! Putting their best creative foot forward, Twitterati has invented a super cool way of discussing the episode and acting as an agent of mercy at the same time. Don’t believe us, here are some of the gems. Scroll!\n#1\n#2\n#3\nGame of Thrones season 8 spoiler but without context: pic.twitter.com/STDOh8nEe8 — 🦔 (@whowould_ever) April 15, 2019\n#4\n#5\n#6\n#7\nGoT season 8 episode 1 spoilers without Context pic.twitter.com/CyuQSceU71 — Roberto Nazal (@johnny_bROBo) April 15, 2019\n#8\nGame of Thrones spoilers but without context #got pic.twitter.com/ZduotBtQlA — 𝕄𝕒𝕟𝕫𝕚𝕝 𝕊𝕙𝕣𝕖𝕤𝕥𝕙𝕒 (@1sttwoletters) April 15, 2019\n#9\n#GameofThrones season 8 episode 1 spoilers without context pic.twitter.com/IlJTknOhsP — The Weekday (@TheWeekday7) April 15, 2019\n#10\n#11\nshazam spoilers without context LMFAOO this is the only good meme i’ve ever made PHEW pic.twitter.com/wfSSZNJiJ2 — 𝔞𝔫𝔫𝔞 ⎊ (@crazedevils) April 7, 2019\n#12\n#13\nTo those who haven’t seen the 1st episode... here’s a spoiler without context #GameofThrones pic.twitter.com/xjoTNpmfq7 — Jaymarc Verce Buan (@TheNewestMakoy) April 15, 2019\n#14\nIn conclusion, all you whiners - please do us a favour and up your game, just a tad!", "title": "Stop Whining! The Internet Is Discussing Game Of Thrones Season 8 Episode 1 By Giving Spoilers Without Context", "date_publish": "15/04/2019, 13:12:26", "description": "Monday blues - what is that? People all across the globe are in a celebratory mode! Sunday night or in our case Monday morning brought with itself the most awaited treasure that all of us had been pining for! After an ultra long wait of 565 days, Game Of Thrones Season Finale has finally commenced. To say that it opened with a bang would be an understatement. Now, we know the drill. Every episo", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/stop-whining-the-internet-is-discussing-game-of-thrones-season-8-episode-1-by-giving-spoilers-without-context-365462.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_1555313176_800x420.jpg"}