{"text": "Straight Out Of A Fairy Tale! Priyanka Chopra & Nick Jonas’ Official First Wedding Pictures Are Out\nStraight Out Of A Fairy Tale! Priyanka Chopra & Nick Jonas’ Official First Wedding Pictures Are Out\nAll Hail NickYanka! A long-distance courtship, a lot of rumours, a beautiful proposal – two months after getting engaged and officially announcing their relationship, Priyanka Chopra and Nick Jonas’ love story has finally come to its righteous end. The lovebirds are officially man and wife now! It was the wedding of the year!\nFrom Yeh Jawani Hai Deewani feels in the picture on the left, and Hum Saath Saath Hain feels in the right one, we have little glimpses of what went inside the royal Taj Umaid Bhawan. With cricket matches and Bollywood songs, we’re sure there was a happy vibe, which is making us gush and smile.\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 1 K SHARES 161 SHARES\nHere's a glimpse from their wedding day!\nPriyanka Chopra and Nick Jonas tied the knot in Christian ceremony on Dec 1, which was followed by Hindu ceremonies on December 2. It is said that Indian food was served for the guests. While for the Christian wedding, it was all about floral decorations, for Hindu wedding ceremony, the theme was all colourful.\nThe Mandap was reportedly 40 feet high with Mehrangarh Fort as the backdrop. According to DNA, the couple tied the knot at the Baradari Lawns. Congratulations to the gorgeous couple!", "title": "Straight Out Of A Fairy Tale! Priyanka Chopra & Nick Jonas’ Official First Wedding Pictures Are Out", "date_publish": "04/12/2018, 18:24:21", "description": "All Hail NickYanka! A long-distance courtship, lot of rumours, a beautiful proposal – two months after getting engaged and officially announcing their relationship, Priyanka Chopra and Nick Jonas’ love story has finally come to its righteous end. The lovebirds are officially man and wife now! It was the wedding of the year! From Yeh Jawani Hai Deewani feels in the picture on the left, and Hum Saa", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/straight-out-of-a-fairy-tale-priyanka-chopra-nick-jonas-official-first-wedding-pictures-are-out-357799.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/for_evening_desi_bride__videshi_groom_priyanka_chopra__nick_jonas_wedding_pictures_are_finally_1543923758_800x420.png"}