{"text": "Millie Bobby Brown shot to fame with her role as Eleven in the Netflix science fiction drama series Stranger Things. At the age of just 14, she has been chosen as the UNICEF's Goodwill Ambassador. And with that, she has become the youngest ever goodwill ambassador for UNICEF.\nNetflix\n“It's a dream come true to become a UNICEF Goodwill Ambassador. It's a huge honour to join such an impressive list of people who have supported UNICEF over the years. I am looking forward to meeting as many children and young people as I can, hearing their stories, and speaking out on their behalf,” Millie Bobby Brown said in a press release.\nThe appointment was marked on World Children's Day at United Nations Headquarters and the Empire State Building in New York.\nMillie Bobby Brown said she wants to raise awareness using the global platform about children’s rights and other issues including education, bullying, violence and poverty.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"I'm delighted to welcome Millie to the UNICEF family, particularly on World Children's Day a day that is all about giving children and young people a voice. Children are their own best advocates. I know that Millie will use her passion and dedication to defend the rights of vulnerable children and young people everywhere,\" said UNICEF Executive Director Henrietta Fore.\nMillie Bobby Brown has been supporting UNICEF’s work since 2016 hosting its 70th-anniversary celebrations at the United Nations in 2016, and championing UNICEF's inaugural World Children's Day last year.\nWith inputs from PTI", "title": "'Stranger Things' Star Millie Bobby Brown Becomes UNICEF's Youngest-Ever Goodwill Ambassador", "date_publish": "22/11/2018, 17:18:17", "description": "Millie Bobby Brown shot to fame with her role as Eleven in the Netflix science fiction drama series Stranger Things. At the age of just 14, she has been chosen as the UNICEF's Goodwill Ambassador. And with that, she has become the youngest ever goodwill ambassador for UNICEF.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/stranger-things-star-millie-bobby-brown-becomes-unicef-s-youngest-ever-goodwill-ambassador-357197.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/stranger_things_star_millie_bobby_brown_becomes_unicefs_youngestever_goodwill_ambassador_1542887385_800x420.jpg"}