{"text": "Actress Renuka Shahane has always been vocal about issues and she has been more than active in making valid points on several social issues. Recently, she was again in the spotlight after she got involved in a friendly banter with actress Suchitra Krishnamoorthi on social media.\nOn Wednesday, Renuka Shahane chose to give her piece of mind on a tweet by Suchitra Krishnamoorthi, wherein she compared sex workers to criminals. In her tweet, Suchitra wrote,\nHidden Compass\n\"Amma always said, Money is not everything. Even criminals and whores have money. What matters is not money but character and integrity. I truly understand her words only today. Jeez I've never felt more proud of my middle class roots.\"\nAs soon as Renuka Shahane read the tweet, she decided to school Ms Krishnamoorthi. She began the conversation by writing,\nAgencies\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"No disrespect to your Amma, but as women let's try and correct the injustice that our traditions have imposed on whores. We castigated whores while letting off their customers who are leading \"respectful\" lives! Let's not put whores and criminals in one bracket at least.\"\nIn series of posts, she explained her point of view. \"Whores sell what is theirs. Criminals take what is others. Whores are often pushed into their profession due to human trafficking at ages as young as 7. Does any child have the right to say \"no\" at that age? Whores are pushed into prostitution by people they trust explicitly.\"\nThe conversation soon turned into a healthy discussion and it ended on a happy note. Read on!\nNo disrespect to your Amma @suchitrak but as women let's try & correct the injustice that our traditions have imposed on whores. We castigated whores while letting off their customers who are leading \"respectful\" lives! Let's not put whores & criminals in one bracket at least 1/4 https://t.co/qQkwPSGztZ — Renuka Shahane (@renukash) March 26, 2019\nWhores sell what is theirs. Criminals take what is others. Whores are often pushed into their profession due to human trafficking at ages as young as 7. Does any child have the right to say \"no\" at that age? Whores are pushed into prostitution by people they trust explicitly 2/4 https://t.co/qQkwPSGztZ — Renuka Shahane (@renukash) March 26, 2019\nWhores are abused, raped, tortured, drugged, given hormonal injections at a very early age & then raped relentlessly throughout their professional lives. Most of what should be their earnings is taken away by pimps & middlemen or middle women! 3/4 https://t.co/qQkwPSGztZ — Renuka Shahane (@renukash) March 26, 2019\nWhores are abused, raped, tortured, drugged, given hormonal injections at a very early age & then raped relentlessly throughout their professional lives. Most of what should be their earnings is taken away by pimps & middlemen or middle women! 3/4 https://t.co/qQkwPSGztZ — Renuka Shahane (@renukash) March 26, 2019\nYes I have been following that thread & I do think you are incredibly brave for following it up relentlessly 🤗 https://t.co/Vb8uq5BxKo — Renuka Shahane (@renukash) March 26, 2019\nYes I have been following that thread & I do think you are incredibly brave for following it up relentlessly 🤗 https://t.co/Vb8uq5BxKo — Renuka Shahane (@renukash) March 26, 2019\nWell, all's well that ends well!", "title": "Suchitra Krishnamoorthi Compares Sex Workers To Criminals, Renuka Shahane Gives A Solid Reply!", "date_publish": "27/03/2019, 12:01:28", "description": "Actress Renuka Shahane has always been vocal about issues and she has been more than active in making valid points on several social issues. Recently, she was again in the spotlight after she got involved in a friendly banter with actress Suchitra Krishnamoorthi on social media.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/suchitra-krishnamoorthi-compares-sex-workers-to-criminals-renuka-shahane-gives-a-solid-reply-364370.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/renuka_shahane_1553667406_800x420.jpg"}