{"text": "Ranveer Singh Will Most Likely Be The First Guest On Sunil Grover’s Comeback Show On TV\nRanveer Singh Will Most Likely Be The First Guest On Sunil Grover’s Comeback Show On TV\nAfter a long gap, Sunil Grover is making a comeback with a new TV show. While TV actress Adaa Khan will reportedly play his wife on the show, it is said the first guests on the show called Kanpur Wale Khuranas will be Rohit Shetty and Ranveer Singh, according to DNA.\nPopular actor-comedian Sunil Grover is returning to the small screen with Star Plus show Kanpur Wale Khuranas. The actor, who is known for playing characters like 'Gutthi' and 'Dr Mashhoor Gulati', says the fresh concept of the show interested him.\n\"I am happy to be back on the small screen with a fresh concept. This character is unlike any I've played before and I am very excited to embark on this journey of entertaining my viewers.\nbccl\n\"The show is sure to charm everyone alike with a theme that resonates with the viewers and keep them hooked onto their television screens at night,\" Grover said in a statement.\nInputs From PTI\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Sunil Grover Is Returning On TV & Ranveer Singh Will Likely Be The First Guest On His Show", "date_publish": "21/11/2018, 16:11:17", "description": "Popular actor-comedian Sunil Grover is returning to the small screen with Star Plus show \"Kanpur Wale Khuranas\". The actor, who is known for playing characters like 'Gutthi' and 'Dr Mashhoor Gulati', says the fresh concept of the show interested him. \"I am happy to be back on the small screen with a fresh concept. This character is unlike any I've played before and I am very excited to embark on t", "authors": [], "url": "https://www.indiatimes.com/entertainment/sunil-grover-is-returning-on-tv-ranveer-singh-will-likely-be-the-first-guest-on-his-show-357112.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singh_will_reportedly_be_the_first_guest_on_sunil_grovers_comeback_show_on_tv_1542798400_800x420.png"}