{"text": "Sunny Leone is one inspiring woman who stood by herself, no matter what. From the day she entered Bollywood, she was judged and ridiculed but she was rock solid and today has emerged as a winner. Indiatimes exclusively got candid with her about her biopic Karenjeet, dealing with constant judgments, feeling accepted in Bollywood, motherhood and lots more.\nInstagram\nWhen we met Sunny on a bright sunny day in Novotel, Juhu, she looked ravishing in a dark blue cold shoulder top paired with a sexy purple skirt. Well it’s clearly a crime to be so gorgeous. But what was more gorgeous about the evening was her little daughter Nisha who landed in the hotel to meet her mommy along with daddy Daniel Weber. The moment Nisha entered the interview room, she ran to hug her mommy, and I wish I could freeze that moment becausel it was just beautiful to describe in words.\nInstagram\nWhen we started the interaction with her, we asked Sunny how accepted she feels in Bollywood now compared to when she started. Her answer bowled us over again, “First of all, everything is amazing and exciting now. If you stick around for a long time at the same place, people feel she is not going anywhere, so it's okay to accept her. I think I was in people’s face all the time through work, social media or different entertainment platforms, so that progression will naturally happen.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nSunny once admitted that she is scared to accepted in India. Asking what she thinks about staying here now, Sunny said,\n“I think you are judged anywhere and everywhere, people will ridicule and say horrible things about you no matter what. For me in the beginning, I knew nothing about young India or how things work here; I only knew what my parents told me about India or what I experienced in America.”\nInstagram\nShe further went on saying, “The Indians in America are completely different than the Indians here, they live in a bubble there, they have tied themselves to backward India, while India has moved forward but they are still somewhere back so many years, because they are in such a foreign land, they are trying to hold on the ideologies or cultural values, their religion, they are trying to hold on whatever they can, so they don’t lose it. I had gone through so many hate mails, so much negativity from the Indian community there at a very young age. At that age you are getting so much hate, you don’t know what to do with it, so all I did was I digested and said I have got nothing to do with anything they are saying. Bollywood and Indian community was a very difficult process for me, their feelings were mean and hurtful, it was horrible, it’s in season one Karenjeet you guys can see it.”\nWhen she mentioned about her biopic Karenjit, we couldn't help but ask if she was skeptical to do a biopic on her own-self, “My natural reaction on the idea for my biopic was NO because who wants to go down to that memory lane again, it’s not fun, and then I was said they will not make it mainly on what people will think which is the adult industry. The makers told me they wanted to know my family dynamics, what I or my parents went through and the closeness about my family, that became interesting for me, so I ended up saying yes.”\nSunny's biopic Karenjit is available on Zee 5 across the globe.\nSunny who came in India for work, was offered many item songs and Bollywood films which many thought it was sleazy, but the actress didn’t give a damn because she wanted to settle down and earn big bucks, “ For me when I got here, Daniel and I had a basic vision and that was to just work and our views on right and wrong were completely different from what people think, so we did what we got. I worked only for pay cheques because we wanted to settle here, so you need money. And mainly I didn’t find anything wrong in it. Coming from that industry to this one, it was like a walk in the park for me. I was like oh my gosh, you are hiring me to do a song and just 3 days of work, wow I am in. I did all my work with my instincts and what was good for me. I don’t see my career graph how others might see”.\nTwitter\nWe asked Sunny if motherhood has changed her life and she says, “I think it’s the most amazing part of my life, it’s very fulfilling, Nisha is such an angel, so beautiful, just her entering and giving me a hug and kiss is the world’s best feeling, that itself makes my day, I just become naturally happy when I see her and my boys”.\nBefore ending the interview, we asked Ms. Leone how does she deal with her failure and her answer was just bang on, “Each failure just depends on how it happened and what the bounce back should be. If it’s a film, I mean most people know if the film will work or not, but we have to do our part, we have to do the promotions, we have to believe that maybe there is a slight chance it might do okay, so we got to keep moving because you don’t have a choice. I don’t get away easily from personal failures, it takes a very long time for me to move on, while professional failures it’s easy, it’s business for me, if it doesn’t work, we try something else, it’s that simple”.\nWell, Sunny is really an incredible person and the ones who have met her will totally agree with me.", "title": "Sunny Leone Talks About The Hatred She Receives, Feels Indians In America Are Very Backward", "date_publish": "02/04/2019, 15:04:16", "description": "Sunny Leone is that inspiring woman who stood by herself no matter what. From the day she entered Bollywood, she was judged and ridiculed but she was rock solid and today has emerged as a winner Indiatimes exclusively candid with her about her biopic Karenjeet, dealing judgments, feeling accepted in Bollywood, motherhood and lot more. When we met Sunny on a bright sunny day in Novotel Juhu aroun", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/sunny-leone-talks-about-the-hatred-she-receives-feels-indians-in-america-are-very-backward-364745.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sunny_leone_1554200117_800x420.jpg"}