{"text": "Sunny Leone has had a fantastic journey in Bollywood so far. She made her debut with reality show Bigg Boss and since then there has been no looking back. She came into the silver screen with Jism 2.\nTwitter\nAfter receiving much love and praise for her performance, she continued her stint with more films and reality shows like Splitsvilla. As per one of her earlier interviews, she mentioned about being a great business woman, who loves maths and understands making money.\nSo much so that, Sunny even produced a film on her life, The Untold Karenjit Kaur, in which she featured too, which reveals her life prior to Bollywood when she was an adult film star.\nInstagram/Sunny Leone\nDon't Miss 185 SHARES 544 SHARES 263 SHARES 411 SHARES\n7 years into the Indian industry and her fans are only increasing on social media, all thanks to her humble nature and good looks.The actress recently celebrated 18 million followers on Instagram. She performed on Aankh Maarey with her husband and it was a super sweet surprise.\nThe two can be seen on a farm grooving on the sizzling number where Daniel ends up taking her in the end which is the cutest. Take a look at this fiery couple giving us all sorts of goals.\nThe song from Simmba, originally features Sara Ali Khan and Ranveer Singh. We really hope we can see more of these fun videos from Sunny!", "title": "Sunny Leone Celebrates Hitting 18 Mn Followers On Instagram By Grooving To Aankh Maarey With Husband Daniel Weber", "date_publish": "21/01/2019, 14:30:33", "description": "She's not alone. Husband Daniel also joins in with his lady love to celebrate the milestone.She's not alone. Husband Daniel also joins in with his lady love to celebrate the milestone.She's not alone. Husband Daniel also joins in with his lady love to celebrate the milestone.She's not alone. Husband Daniel also joins in with his lady love to celebrate the milestone.She's not alone. Husband Daniel", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sunny-leone-celebrates-hitting-18-mn-followers-on-instagram-by-grooving-to-aankh-maarey-with-husband-daniel-weber-360777.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sunny_leone_1548061624_800x420.jpg"}