{"text": "Sunny Leone Is The Happiest With Her Kids, Boney Kapoor To Remake Pink & More From Ent\nSunny Leone Is The Happiest With Her Kids, Boney Kapoor To Remake Pink & More From Ent\nAkshay Kumar not only agrees with this but is a living example showing us all that your dreams can come true. The Khiladi Kumar recently revealed that he wasn’t good in academics, but with his hard work and the blessing of his parents, he managed pretty well.\nSoon after, she made a debut in Bollywood and has been in India since then. She is known for breaking stereotypes, whether it was changing industries, sweetly replying to some ruthless questions or adopting a girl child, Sunny Leone has proved she is one of a kind.\nIndiatimes met Sonam and spoke about how careful she was about portraying a gay character since a major chunk of the society still thinks that homosexuality is a disease.\nKeeping up the good work, Amitabh Bachchan recently performed national anthem with specially-abled children in sign language. The video will not only give you goosebumps but will also make your hearts melt. Watch it below.\nDon't Miss 862 SHARES 346 SHARES\nPink is now getting a Tamil remake. Boney Kapoor who is producing the movie says it’s an ode to his late wife Sridevi. He revealed that Sridevi wanted Ajith to be cast in the role of Amitabh Bachchan and fulfilling her wish, Boney Kapoor has indeed done the same.", "title": "wrap:Sunny Leone Is Happiest With Kids, Boney Kapoor To Remake Pink & More From Ent.", "date_publish": "31/01/2019, 18:29:59", "description": "Akshay Kumar not only agrees with this but is a living example showing us all that your dreams can come true. The Khiladi Kumar recently revealed that he wasn’t good in academics, but with his hard work and the blessing of his parents, he managed pretty well.Akshay Kumar not only agrees with this but is a living example showing us all that your dreams can come true. The Khiladi Kumar recently reve", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sunny-leone-is-the-happiest-with-her-kids-boney-kapoor-to-remake-pink-more-from-ent-361393.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/bollywood_1548938926_800x420.jpg"}