{"text": "Thirty-five years and several blockbusters later, actor Sunny Deol admitted in an interview that his process of working in a film is purely \"instinctive\" and he is more interested in listening to the storyteller than reading scripts.\nFor Sunny, it is a matter of choice that he avoids reading scripts as he believes he might look at them with a \"certain mindset\" and hence prefers to hear them straight from the writers.\n\"I am a very instinctive person. I hear an idea, a thought and if it is good and I like it, I just jump for it. I don't go into the detailings of it. Right now, you need to do that but back then filmmaking was different.\"\nbccl\nSince his debut in 1983 with Betaab, Sunny has featured in some strong content driven films such as Ghayal, Damini, Darr and Gaddar: Ek Prem Katha, among others. A process of not reading scripts can be considered risky but Sunny still goes by his instincts while giving nod to a film.\n\"One never takes it as gamble. I do it because I love it and I'm enjoying the story. Obviously sometimes in the journey you realise the production, the director, writer, or some things are going here and there but you don't disown it. You don't run away because it's everyone's baby,\" he says.\nDon't Miss 7.9 K SHARES 11.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nbccl\nThe actor can currently be seen in Bhaiaji Superhit, which also features Priety Zinta and Arshad Warsi. The film is set in familiar territory for Sunny. It’s an action-comedy, but the actor says it does not mean he goes to the sets thinking it will be a cakewalk.\n\"I don't think I have ever worked with the attitude that 'This is easy I can do it.' Hats off to those who say and do it. For me, I need to enjoy it. You can't be nervous while performing a scene because then you wouldn't be able to,\" he says.\nThe 62-year-old actor, however, is aware that to stay relevant, he has to pick up roles which move according to times.\nbccl\n\"I cannot be a teenager in films. You move accordingly and your experience makes you do certain subjects which you wouldn't have done when you were younger. As the time goes, you interact and become more aware of certain things. It'll be stupid if I still want to play a college boy. Besides that nobody would want to make it also. It's only when the filmmakers know that this actor can pull it off, is when they approach you,\" he adds.\nDirected by Neerraj Pathak and produced by Chirag Dhariwal, Bhaiaji Superhit releases on Friday.\n(With agency inputs)", "title": "Sunny Deol Admits He Has Never Read A Movie Script In His Entire Career", "date_publish": "23/11/2018, 14:25:02", "description": "Thirty five years and several blockbusters later, actor Sunny Deol says his process of working in a film is purely \"instinctive\" and he is more interested in listening to the storyteller than reading scripts. For Sunny, it is a matter of choice that he avoids reading scripts as he believes he might look at them with a \"certain mindset\" and hence prefers to hear them straight from the writers. \"I a", "authors": [], "url": "https://www.indiatimes.com/entertainment/sunny-deol-admits-he-has-never-read-a-movie-script-in-his-entire-career-357242.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sunny_deol_says_he_has_never_read_a_film_script_in_his_entire_career_1542963413_800x420.jpg"}