{"text": "Sunny Leone Looks The Happiest When She's Accompanied By Her Kids And These Pictures Are Proof!\nSunny Leone Looks The Happiest When She's Accompanied By Her Kids And These Pictures Are Proof!\nShe is one of the most humble celebrities we have in Bollywood. She is always open to talking about where she came from and how she has made a living in this industry. We're talking about none other than Sunny Leone.\nTwitter\nDespite having a significant presence in the adult film industry, Sunny was approached by Bigg Boss, the reality show. Her down to earth nature and happy-go-lucky personality proved she's here to win hearts.\nSoon after, she made a debut in Bollywood and has been in India since then. She is known for breaking stereotypes, whether it was changing industries, sweetly replying to some ruthless questions or adopting a girl child, Sunny Leone has proved she is one of a kind.\nInstagram/Viral Bhayani\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nToday, the actress was spotted with her twins. And just like she is, Sunny could be seen smiling at the paparazzi. Unlike other celebrities, who rush to their car with their children's faces covered, Sunny smiled, waved and posed for shutterbugs.\nInstagram\nWe even got a glimpse of her tiny tots and just like her, they are adorable. She carried one baby and her nanny carried the other one, both close to each other.", "title": "Sunny Leone Looks The Happiest When She's Accompanied By Her Kids And These Pictures Are Proof!", "date_publish": "31/01/2019, 16:21:01", "description": "Sunny Leone Looks Happiest When She's Accompanied By Her Twins And These Pictures Are ProofSunny Leone Looks Happiest When She's Accompanied By Her Twins And These Pictures Are ProofSunny Leone Looks Happiest When She's Accompanied By Her Twins And These Pictures Are ProofSunny Leone Looks Happiest When She's Accompanied By Her Twins And These Pictures Are ProofSunny Leone Looks Happiest When She'", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sunny-leone-looks-the-happiest-when-she-s-accompanied-by-her-kids-and-these-pictures-are-proof-361374.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sunny_1548930465_800x420.jpg"}