{"text": "'Superwoman' Lilly Singh’s Self-Empowering Twist To Bollywood Songs Will Blow Your Mind With Awesomeness\n'Superwoman' Lilly Singh’s Self-Empowering Twist To Bollywood Songs Will Blow Your Mind With Awesomeness\nLilly Singh is truly a superwoman! It wasn’t long ago that she came out in public about her bisexuality. She even made history after becoming the first woman to be hosting a late night show. But what she did recently has won our hearts over yet again. She is a genius and a Queen and all her fans agree.\nYouTube\nLilly Singh just dropped a rap on Bollywood songs last night, and it’s BANG ON! She turned the song lyrics to give a new, refreshing yet motivational meaning. She talks about real issues, including the taboo around LGBTQ, and it’s the best thing you’ll hear today.\nFrom choli ke peeche kya hai and All Izz Well to Aankh Marey’s new rendition, Lilly Singh is just slaying it with the lyrics. Without further ado, listen to the song below.\nAnd everyone is in love with this one. So much so, that fans are demanding a part 2 of it, already.\nthis is amazing - this deserves a part 2. I’m calling it now! Thank you for being you Lilly — Saket (@Saket___) March 29, 2019\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n'What position i like?' 'The head of the table'...you are a genius and you know it 😌 — Kalyani (@TeamSuperAU_) March 28, 2019\nI fucking can't get over how good this is. And you in a lungi just made my entire year.\nI'm going to replay this video until my death thank you very much. — Samyuktha/21st Apr.❤ (@TeamSuperPipoca) March 28, 2019\nHad to come on here to say this is one of my favourite video of yours??? You killed it bb, so so good !! — Kalyani (@TeamSuperAU_) March 28, 2019\nI think the choli one deserve a full 3 mins .. Good rap 👍 — Debasish Dash (@TheDashd) March 29, 2019\nLily is a whole other VIBE pic.twitter.com/n28vFP8w9U — anijsa (@AnisanKhan) March 28, 2019\nQUEEN! Lilly, this is genius 💖 — Rutuja Shinde (@HavaldarShinde) March 29, 2019\nAlso the way you put across important lessons & messages through a SONG, you're a legend. So creative, so informative & ALL THE FACTS WERE SPILLED. SO PROUD OF YOU BBY — Miloni Kothari💜 (@TS_Milo) March 28, 2019\nBisexual representation.\nMy Bisexual self RN: pic.twitter.com/VTAQtZJVpr — NihaL (@n11hal) March 28, 2019\nFinally the bisexual bop I know you've been waiting to drop!!! Loved it!!!! — Brooke (@Brooke60669985) March 29, 2019\nThat’s the kind of songs we need. Don’t you all agree?", "title": "'Superwoman' Lilly Singh’s Self-Empowering Twist To Bollywood Songs Will Blow Your Mind With Awesomeness", "date_publish": "29/03/2019, 16:17:30", "description": "Lilly Singh just dropped a rap on Bollywood songs last night, and boy, it’s BANG ON! She turned the song lyrics into giving a new motivational meaning. She talks about real issues, including the taboo around LGBTQ, and it’s the best thing you’ll hear today.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/superwoman-lilly-singh-s-self-empowering-twist-to-bollywood-songs-will-blow-your-mind-with-awesomeness-364547.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/superwoman_lilly_singhs_selfempowering_twist_to_bollywood_songs_will_blow_your_mind_with_awesome_1553854324_800x420.jpg"}