{"text": "From Ryan Reynolds and Chris Evans to Robert Downey Jr, celebs paid their tribute to the rich legacy of Marvel Comic legend. Marvel Studios' President, Kevin Feige said that Stan Lee has left an extraordinary legacy that will be outlived all.\n2. The Countdown Has Begun! Deepika Padukone & Ranveer Singh’s Wedding Venue Is No Less Than A Beautiful Dream\nThe ever-gorgeous couple has chosen an equally stunning location for their wedding. They will tie the knot at Lake Como in Italy – the location which is referred to as “mirror of paradise”, is also home to Hollywood stars including George Clooney, Madonna and Donatella Versace among others, and is the same place where the lavish engagement bash of Isha Ambani and Anand Piramal took place.\n3. 'Narcos' Star Diego Luna Has A Personal Connect With India, Says His Grandmother Was Born Here\nDon't Miss 264 SHARES 185 SHARES 1 K SHARES 460 SHARES\nHe was hesitant to talk about his spiritual connection with India. “I told you this because I had four vodkas inside me... the spiritual connection is different... It is personal. I don't see how it connects with 'Narcos',” he said, after which, Shakun Batra shared that Luna's grandmother was born in India and he had read parts of Bhagavad Gita as well.\n4. Karanvir's Wife Teejay Writes An Open Letter To Bigg Boss Makers, Says He's Ridiculed Every Weekend\nMany outside the house have come out in support of Karanvir realising that during the Weekend Ka Vaar, the celebrity contestant is ridiculed by the host Salman Khan, not once but multiple times.\n5. Speaking On Pay Parity, Abhishek Reveals His Wife Aishwarya Got Paid More In 8 Out Of 9 Films They Did Together\n“There’s a huge debate on gender parity in the film business and in other industries. I’ve worked in nine films with my wife [Aishwarya Rai Bachchan] and in eight of those, she’s got paid more than I have. The highest-paid actor in ‘Piku’ was Deepika [Padukone],” he was quoted as saying by News18.", "title": "Superheroes Mourn Stan Lee's Demise, Pics From Deepika Padukone & Ranveer Singh’s Wedding Venue & More From Ent", "date_publish": "13/11/2018, 17:59:11", "description": "From Stan Lee’s death sending shockwaves across the world and celebrities including superheroes mourning the death of real-life superhero, to Deepika Padukone and Ranveer Singh’s wedding preparation, here’s all that rocked the world of entertainment.", "authors": [], "url": "https://www.indiatimes.com/entertainment/superheroes-mourn-stan-lee-s-demise-pics-from-deepika-padukone-ranveer-singh-s-wedding-venue-more-from-ent-356605.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/superheroes_mourn_the_death_of_stan_lee_pic_from_deepika_padukone__ranveer_singhs_wedding_venue__1542112365_800x420.png"}