{"text": "\"The superheroes in 'Avengers' personify traits like courage, perseverance, bravery, and hope — the same traits countless kids and their families in children's hospitals exhibit every day,\" Robert Iger-the CEO of Disney.\nWell, in this case-superheroes with capes came in rescue of kids along with Robert Iger, appeared at Disneyland Resort on Friday. The team reunited to announce a $5 million donation to children's hospitals across the country.\nAgencies\nThe charity is a combined effort of groups including The LEGO Group, Hasbro, Funko and Amazon and the donation of cash and toys will directly be to Starlight Children's Foundation. This comes under the Avengers Universe Unites campaign- which is Walt Disney Company's signature philanthropic commitment to Disney Team of Heroes.\nToday the stars of Avengers: Endgame visited the Disneyland Resort to launch Avengers Universe Unites, a charity event that supports The Walt Disney Company's signature philanthropic commitment, Disney Team of Heroes: https://t.co/dc3GnNtplD pic.twitter.com/5gsoIxfKyI — Walt Disney Company (@WaltDisneyCo) April 5, 2019\nPresent at the announcement were Robert Downey Jr., Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Paul Rudd, and Brie Larson. The stars reunited at Disney California Adventure Park in order to ring in the celebrations.\nDon't Miss 264 SHARES 153 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES\nThe more-the-merrier\nA group of children from the Boys & Girls Clubs of Anaheim and Garden Grove joined their favorite Avengers stars! The pictures and the videos prove that it was a happy event with smiles all over.\nAgencies\nAgencies\nAgencies\nAgencies", "title": "Superheroes Without Capes: Avengers-Disney Unite To Donate $5 Million To Children’s Hospitals", "date_publish": "06/04/2019, 16:19:03", "description": "The team reunited to announce a $5 million donation to children's hospitals across the country.The team reunited to announce a $5 million donation to children's hospitals across the country.The team reunited to announce a $5 million donation to children's hospitals across the country.The team reunited to announce a $5 million donation to children's hospitals across the country.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/hollywood/superheroes-without-capes-avengers-disney-unite-to-donate-5-million-to-children-s-hospitals-364997.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_1554547926_800x420.jpg"}