{"text": "Casting Director Mukesh Chhabra's directorial debut Kizie Aue Manny has been in news for all the wrong reasons. A few months ago, there were reports floating that claimed how Sushant Singh Rajput had made his co-star Sanjana Sanghi uncomfortable with his 'over-friendliness' and 'flirt' behavior.\nHowever, these reports were rubbished by Mukesh Chhabra, who claimed that these are fabricated reports and nothing of that sort ever happened on the sets of the film.\nAnd now with the ongoing #MeToo movement in India, the reports of Sushant harassing co-star Sanjana started resurfacing on Twitter. A lot of Twitter users came out and pointed the same about the harassment and accused Sushant.\nNow, to defend himself, Sushant Singh Rajput took to Twitter to explain his side of the story. He wrote,\nScreengrab\n\"The last thing worth doing is to defend yourself of the fiction created by an agenda. People using this much-required campaign for their personal agenda is too much to ignore. So here is the text conversation with Sanjana till the time I shot for the film. I let you decide.\"\nThat's not all. Sushant also shared the screenshots of his chats with Sanjana, that prove how they only indulged in casual-friendly banter and nothing more than that. Sharing the screenshots, he wrote,\nDon't Miss 193 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"I feel sad to reveal personal information but it seems that there is no other way to state what actually happened, in the midst of this curated, well timed and agenda driver smear campaign. From the first day of the shoot till the last day, this is what happened on the sets with Sanjana. Misconduct ? Not at al. Agenda ? You decide.\"\nHere are the screenshots of his chats with the actress.\nI feel sad to reveal personal information but it seems that there is no other way to state what was, in the midst of this curated and well timed smear campaign. From the first till the last day of the shoot, this is what happened on the Set with Sanjana. (1/2) pic.twitter.com/oZXRkkMmo6 — Sushant Singh Rajput (@itsSSR) October 19, 2018\nI feel sad to reveal personal information but it seems that there is no other way to state what was, in the midst of this curated and well timed smear campaign. From the first till the last day of the shoot, this is what happened on the Set with Sanjana. (2/2) pic.twitter.com/vTOcbSwada — Sushant Singh Rajput (@itsSSR) October 19, 2018\nAnd for all those deliberately using the missing of Twitter ‘blue tick’ to substantiate their false claims, allow me to tell you that it is not there since 5th of September. Get your facts checked before jumping to conclusions that you so eagerly want to. pic.twitter.com/9iIUWo8RKZ — Sushant Singh Rajput (@itsSSR) October 19, 2018\nOne of his conversations with Sanjana read,\n\"Hey just wanted to tell you that despite of everything that's so not conducive for actors on set, what you're doing is nothing short of f***ing epic. Good going girl.\" Sanjana responded to the message with a text that read, \"A whole lot of non-conducive conditions, yes. Thank you so much, Immanuel.\"\nTaking a stand for his actor Sushant, Mukesh Chhabra took to Twitter to extend his support. he added,\nI totally stand by @itsSSR - no such incident happened on the sets and let's not have a Twitter trial and make an innocent person suffer for somebody else's ulterior motives I had clarified this on twitter long back and I still maintain it . https://t.co/aIzoEq0Xrj — Mukesh Chhabra CSA (@CastingChhabra) October 18, 2018\nSanjana Sanghi is yet to make a statement or comment on this matter.", "title": "Sushant Singh Rajput Denies Sexually Harassing Co-Actor Sanjana Sanghi, Shares Chat Screenshots", "date_publish": "19/10/2018, 10:54:48", "description": "With the ongoing #MeToo movement in India, the reports of Sushant harassing co-star Sanjana started resurfacing on Twitter. A lot of Twitter users came out and pointed the same about the harassment and accused Sushant. Now, to defend himself, Sushant Singh Rajput took to Twitter to explain his side of the story.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sushant-singh-rajput-denies-sexually-harassing-co-actor-sanjana-sanghi-shares-chat-screenshots-355062.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/sushant_1539926979_800x420.jpg"}