{"text": "In case you are wondering whether to watch the film or not, this will will help you out!\n\"It wasn't hard to miss how several big names maintained a studied silence on the subject. Point out the dichotomy, and she says, it's disappointing that not many actresses have spoken up on the matter. They probably gave themselves over to their ambitions. Some stories of Swara [Bhasker] and Kangana's [Ranaut] struggles have been chronicled, but several others disappeared.\"\n\"Sushmita and Rohman have been dating for two months after they met at a fashion gala and enjoy a good equation. The duo has even discussed the idea of marriage and if things go as planned, they will take their marital vows next year.”\nDon't Miss 106 SHARES 7.6 K SHARES\n\"Yes, there appears to be a movie version of Breaking Bad. It's a great story, and there's a lot of people who felt that they wanted to see some kind of completion to these storylines that were left open, and this idea, from what I'm told, gets into those...at least a couple of the characters who were not completed, as far as their journey,\" Fox news quoted actor Bryan Cranston as saying on The Dan Patrick Show.\nAlia was asked about her dialogue in her film, Dear Zindagi, “Is there someone like the one? What is this perfect one exactly? Mere liye toh koi perfect hona chahiye na.,” to which, Alia said,\n“Yeah, I think I have”. She further added that in love she is an ‘affectionate, beautiful person’. “I have stars and a halo on my head, and I’m walking around with rainbows. I like to keep it simple and sweet.\"", "title": "Sushmita May Tie The Knot Next Year, Thugs Of Hindostan Opens To Poor Reviews & More From Ent.", "date_publish": "08/11/2018, 17:52:19", "description": "\"Sushmita and Rohman have been dating for two months after they met at a fashion gala and enjoy a good equation. The duo has even discussed the idea of marriage and if things go as planned, they will take their marital vows next year.” Alia was asked about her dialogue in her film, Dear Zindagi, “Is there someone like the one? What is this perfect one exactly? Mere liye toh koi perfect hona chahi", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/sushmita-may-tie-the-knot-next-year-thugs-of-hindostan-opens-to-poor-reviews-more-from-ent-356314.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/movies_1541680237_800x420.jpg"}