{"text": "It is said that when people fall in love, they glow very differently. For Sushmita Sen and Boyfriend Rohman Shawl, this saying is definitely true. The couple has been seeing each other since a long time and Sush has never hid the fact that there is a man in her life whom she dearly loves.\nApart from being a part of Sush's life, Rohman is also close to both of her daughters and the way they spend time with each other is a good enough proof. Be it Diwali or attending a friend's wedding, the couple looks very much in love!\n(Also read: Wedding Might Be On The Cards Next Year For Sushmita Sen And Rumoured Beau Rohman Shawl, Claim Reports!)\nDon't Miss 343 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nRecently, they were holidaying and Sush took to Instagram to share their journey with her fans and loved ones.\nSushmita being one of the most popular celebrities on Instagram received several messages by her fans!\nScreengrab\nScreengrab\nScreengrab\nWhile Indians still look down on people who fall in love without seeing the age-gap, people's acceptance towards the couple's love proves that India is finally growing up and letting people just be.\nIt also proves that be it dating someone of the same sex or dating someone who is years younger to you, love is love!", "title": "Sushmita Sen And Boyfriend Rohman Shawl's Unconditional Love Is Making Everyone Happy!", "date_publish": "27/04/2019, 11:13:35", "description": "It is said that when people fall in love, they glow very differently. For Sushmita Sen and Boyfriend Rohman Shawl, this saying is definitely true. The couple has been seeing each other since a long time and Sush has never hid the fact that there is a man in her life whom she dearly loves.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sushmita-sen-and-boyfriend-rohman-shawl-s-unconditional-love-is-making-everyone-happy-366172.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/sushmita_sen_1556344594_800x420.jpg"}