{"text": "Sushmita Sen Confirms Relationship With 27-Year-Old Rohman Shawl, Says 'Not Getting Married Yet'\nSushmita Sen Confirms Relationship With 27-Year-Old Rohman Shawl, Says 'Not Getting Married Yet'\nWith immense amount of confidence and self-love, Sushmita Sen has time and again proved she is the eternal diva and an inspiration to several women across the globe.\nWith her two daughters, she has been enjoying her life to the most and breaking stereotypes by showing the world that she is a happy single mother.\nUnlike most of us, Sushmita Sen has never felt something was missing in her life because of her single relationship status. She thinks she doesn’t need a man to make her happy. She is capable of doing that on her own.\nWhen she is single, she had earlier proclaimed it to the world, and now that she is in love, she has no qualms about sharing this beautiful phase of her life with her fans.\nDon't Miss 183 SHARES\nAlso Read: 15 Times Sushmita Sen Gave Valuable Lessons On How To Deal With Relationships & Heartbreaks\nAfter dating Randeep Hooda and Ricky Martin in the past, Sushmita Sen is now dating 27-year-old model Rohman Shawl. From sharing lots of pictures to making public appearances with him, she has finally confessed that she is in love but is “not getting married yet”.\nAlso Read: Arbaaz Khan & Sushmita Sen Make An Entrance With Their Partners At Shilpa Shetty’s Star-Studded Diwali Bash\n“Sushmita and Rohman were dating for two months after they met at a fashion gala and enjoy a good equation. The duo has even discussed the idea of marriage and if things go as planned, they will take their marital vows next year,” revealed a source to Times Now.\nThe couple also celebrated Diwali festivities together.\nDon’t they look much in love? We are happy to see you happy, Sushmita Sen! Keep shining bright like a diamond!\nAlso Read: Sushmita Sen Dances To Nora Fatehi’s ‘Dilbar’ & Proves Nobody Can Do It Better Than Her!", "title": "Sushmita Sen Confirms Relationship With 27-Year-Old Rohman Shawl, Says 'Not Getting Married Yet'", "date_publish": "11/11/2018, 12:19:16", "description": "Earlier being in love with stars like Randeep Hooda and Ricky Martin, Sushmita Sen is now dating 27-year-old model Rohman Shawl. After sharing lots of pictures and making public appearances with him, she has finally confessed that she is in love but is “not getting married yet”.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/sushmita-sen-confirms-relationship-with-27-year-old-rohman-shawl-says-not-getting-married-yet-356431.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/confirming_relationship_with_27yo_rohman_shawl_sushmita_sen_says_shes_rohmancing_life_1541917483_800x420.png"}