{"text": "Sushmita Sen Will Make A Comeback In Films But Only When She Gets The Right Projects\nSushmita Sen Will Make A Comeback In Films But Only When She Gets The Right Projects\nFormer Miss Universe and actor Sushmita Sen knows the art of staying relevant. The actress might be missing in action by not taking up any film projects but she still is one of the trending topics on the internet.\nFrom giving people health and fitness tips on social media to sharing her motherhood diaries, there is a lot to take away from her social media presence.\nDuring a recent media interaction, she was asked about her comeback to which she said that she is waiting for the right script to make her comeback and might even don the cap of a film producer in the near future.\nTwitter\nThe style icon, who walked the ramp here for designer Ashish N Soni, also said that she felt more comfortable directly interacting with her audience as a professional model than facing the camera in films.\nDon't Miss 343 SHARES 594 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Since my days as a girl, I have been doing fashion shows. I always feel at home in events where I can have live interactions with the audience,” she told the reporters.\nJust to jog your memory a little, she did some spectacular work and her performances were appreciated in films like Sirf Tum (1999), Biwi No 1 (1999) and Main Hoon Na (2004). She added,\n“I have to wait for the right thing. I was very close to being a part of a film, which finally did not happen Not because of me though. Let’s see, God has better plans.\"\nSen also said that she might make films when the time is right, but would not want to mix the two professions of acting and production. She added,\n\"What is going on right now in Bollywood is amazing. I can produce a film when the time is right even though I may not act in it, the 43-year-old diva said.\"\n(With agency inputs)", "title": "Sushmita Sen Will Make A Comeback In Films But Only When She Gets The Right Projects", "date_publish": "23/01/2019, 16:16:49", "description": "From giving people health and fitness tips on social media to sharing her mother diaries, there is a lot to take away from her social media presence. During a recent media interaction, she was asked about her comeback to which she said that she is waiting for the right script to make her comeback and might even don the cap of a film producer in the near future.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/sushmita-sen-will-make-a-comeback-in-films-but-only-when-she-gets-the-right-projects-360925.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sushmita_sen_1548237967_800x420.jpg"}