{"text": "Swara Bhasker Lashes Out At Veena Malik After She Mocked IAF Pilot Abhinandan In Pakistan Custody\nSwara Bhasker Lashes Out At Veena Malik After She Mocked IAF Pilot Abhinandan In Pakistan Custody\nEveryone is aware of the ongoing current situation between India and Pakistan. On February 14, 2019, Jaish-e-Mohammed, the terrorist group had made an explosion where over 40 CRPF jawans were killed and soon after 12 days on 26th February, India retailed and reportedly killed 300 terrorists of JeM located in Pakistan.\nIAF Sources: At 0330 hours on 26th February a group of Mirage 2000 Indian Fighter jets struck a major terrorist camp across the LoC\nand completely destroyed it. pic.twitter.com/RlxTJ4e3AF — ANI (@ANI) February 26, 2019\nSoon, IAF came into full force and, however one one the Jets shot down and wing Commander Abinandan Varthaman is currently under Pakistan custody. India has demanded them to hand over the officer safe and sound.\nTwitter\nAmid the rising tension between both the nations, members of both Indian and Pakistan film fraternity are urging peace and not war. However, Veena Malik who loves to share her unwanted opinion is taking a dig at Indians and is shamelessly mocking about the IAF pilot who is under the custody of Pakistan.\nDon't Miss 1.1 K SHARES 174 SHARES 3.1 K SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nShe wrote on twitter, “Abhi Abhi Tu Ayo Ho...Achi Mehmaan Nawazi Ho GI Aap Ki”.\nAbhi Abhi Tu Ayo Ho...Achi Mehmaan Nawazi Ho GI Aap Ki😜 pic.twitter.com/BDcWO25orE — VEENA MALIK (@iVeenaKhan) February 27, 2019\nHer statement left Swara Bhasker fuming and she gave a befitting reply to the Pakistani actress. She replied in a very dignified and tweeted, “Veena ji.. Shame on you & ur sick mindset. Your glee is just gross! Our officer is a hero- brave, gracious & dignified in the face of capture. At least some decency from that major in you army who was questioning #WingCommanderAbhinandan or the many Pakistanis suing 4 peace #sick.”\nVeena ji.. Shame on you & ur sick mindset. Your glee is just gross! Our officer is a hero- brave, gracious & dignified in the face of capture. At least some decency from that major in you army who was questioning #WingCommanderAbhinandan or the many Pakistanis suing 4 peace #sick https://t.co/KvJH8ClkmW — Swara Bhasker (@ReallySwara) February 28, 2019\nNot only Swara, even TV actress Sauyma blasted Veena for her irresponsible tweet.\nCan’t imagine someone like him tweeting like this. Sad really sad. https://t.co/bcpvlffKJv — Saumya Tandon (@saumyatandon) February 28, 2019\nAfter India’s surgical strike, Veena has posted quite a few of tweets which promotes hatred and not peace.\nHey @akshaykumar these Machines of #indianAirForce destroyed the terror camps of trees Yesterday... Check them out Now😎😎😎 @akshaykumar\nFor Details check out News channels n Twitter😂🤣😂 pic.twitter.com/bPTm7niqoL — VEENA MALIK (@iVeenaKhan) February 27, 2019\nTheir #Surgicalstrike2 was as real as Her Horse in her latest Film😂 pic.twitter.com/dAY1u9mbQr — VEENA MALIK (@iVeenaKhan) February 27, 2019\nWe hope the Pakistani actress understands the critical situation going on the rising situation between both the countries and not just have her random say for mere publicity.", "title": "Swara Bhasker Lashes Out At Veena Malik After She Mocked IAF Pilot Abhinandan In Pakistan Custody", "date_publish": "28/02/2019, 13:16:59", "description": "Amid the rising tension between both the nations, members of both Indian and Pakistan film fraternity are urging peace and not war. However, Veena Malik who loves to share her unwanted opinion is taking a dig at Indian and is shamelessly mocking about the IAF pilot who is under the custody of Pakistan.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/swara-bhasker-lashes-out-at-veena-malik-after-she-mocked-iaf-pilot-abhinandan-in-pakistan-custody-362919.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/veena_malik_1551340874_800x420.jpg"}