{"text": "It has been months since Veere Di Wedding released, but trolls haven’t found a new topic to mock Swara Bhasker. Often in the past, she has been slut-shamed owing to that scene in a film, because of her political opinions and stands.\nYouTube\nAnd yet again, today, when Mumbaikers stepped out to vote in the fourth phase of Lok Sabha elections, some people had placards in their hands that said, “Use your fingers wisely.”\nWhen Swara Bhaker learnt about her “dedicated and sweet” trolls who were making so many “efforts” to just troll her, she gave a classy reply. Check it out.\n“Awwwwwww!!!!! My trolls are hard at work again, sweating it out in the heat to popularise my name.. You guys are SO dedicated & sweet!!! Don’t mind the slut-shaming guys.. their imagination is a bit limited.. but loving the effort you two,” she wrote.\nAwwwwwww!!!!! My trolls are hard at work again, sweating it out in the heat to popularise my name.. You guys are SO dedicated & sweet!!! 🤗🤗🤗🤗❣️❣️❣️❣️ Don’t mind the slut-shaming guys.. their imagination is a bit limited.. but loving the effort you two 🙌🏾🙌🏾🙌🏾 pic.twitter.com/fRqjGZ3b0q — Swara Bhasker (@ReallySwara) April 29, 2019\nSwara Bhasker is one among other celebrities like Javed Akhtar and Prakash Raj who are supporting Jawaharlal Nehru University (JNU) alumnus Kanhaiya Kumar, who is contesting elections on the ticket for Communist Party of India (CPI).\nBCCL\nDon't Miss 1.1 K SHARES 174 SHARES 12.5 K SHARES 5.4 K SHARES 3.4 K SHARES\nAnd for this, she has been trolled in the past as well.\nRead More: Swara Bhasker Trolled For Masturbation Scene On Supporting Kanhaiya Kumar, Gives An Epic Reply\nदीदी finger ठीक है! पर आपकी imagination बहुत थकी हुई है.. कुछ नया सोचो.. और दस रुपय per tweet से अपनी price बढ़ाओ! 🙏🏿🙏🏿🙏🏿🙏🏿 https://t.co/OySg8Q1mmZ — Swara Bhasker (@ReallySwara) March 25, 2019\nSwara Bhasker spent her birthday (on April 9) campaigning for Kanhaiya Kumar at a rally in Begusarai.\nInstagram", "title": "Swara Bhasker Gives A Classy Reply To Trolls Who Slut-Shamed Her For The Masturbation Scene!", "date_publish": "29/04/2019, 17:13:19", "description": "It has been months since Veere Di Wedding released, but trolls haven’t found a new topic to mock Swara Bhasker. Often in the past, she has been slut-shamed owing to that scene in a film, because of her political opinions and stands. And yet again, today, when Mumbaikers stepped out to vote in the fourth phase of Lok Sabha elections, some people had placards in their hands that said, “Use your fi", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/swara-bhasker-gives-a-classy-reply-to-trolls-who-slut-shamed-her-for-the-masturbation-scene-366284.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/swara_bhasker_slut_shamed_and_trolled_for_masturbation_scene_during_lok_sabha_elections_1556536729_800x420.jpg"}