{"text": "Swara Bhasker is one of the very few Bollywood stars who don’t shy away from expressing their opinions on things that matter. She is known for speaking her mind without mincing words, and that has often led to her becoming a target of trolls. She has often been bullied too.\nSwara Bhasker, who had stirred up a storm on social media because of her masturbation scene in Veere Di Wedding, launched upcoming TV show Courtroom – a show inspired by real life court cases. The show will focus unveil proceedings from charges to verdicts of cases that had successful judgements that retained the faith of people in judiciary.\nBCCL\nSwara Bhasker was asked about social media and its trials and how it has become a court itself. To this, the actress said that social media is meant for connecting people and not for mob trails.\n“I am actually against this idea of Twitter justice. These days the trial and the justice both happen on Twitter itself. I think social media is a platform for connecting but you can’t replace our judiciary with mob trials on social media. That’s such a dangerous thing to ask for,” she was quoted as saying by Indian Express.\nBCCL\nDon't Miss 623 SHARES 365 SHARES 402 SHARES\nIn another interview to Times Of India, Swara Bhasker had revealed that she had sent legal notices to online trolls.\n“On my Twitter account, there is always a war. I have had to send some legal notices to online trolls, and troll sites because they have spread willful lies about me on the internet. That is the extent but it didn't require me to follow up as the notices were enough to silence people.”\nWhat’s your take on this? Tell us in the comments section below.", "title": "Swara Bhasker Thinks Social Media Is A Platform Meant For Connecting People, Not For Mob Trails", "date_publish": "07/02/2019, 16:30:26", "description": "Swara Bhasker is one among the very few Bollywood stars who don’t shy away from expressing their opinions on things that matter. She is known for speaking her mind without mincing words, and that has often led to her becoming a target of trolls. She has often been bullied too. the actress said that social media is meant for connecting people and not for mob trails.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/swara-bhasker-thinks-social-media-is-a-platform-meant-for-connecting-people-not-for-mob-trails-361760.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/swara_bhasker_thinks_social_media_is_a_platform_meant_for_connecting_people_not_for_mob_trails_1549536232_800x420.jpg"}