{"text": "Swara Bhasker Lost Out On A Film For ‘Looking Intelligent’ In The Initial Days Of Her Career\nSwara Bhasker Lost Out On A Film For ‘Looking Intelligent’ In The Initial Days Of Her Career\nNot every successful actor or actress is handsome or beautiful in a conventional way. So, do looks matter? Actors like Nawazuddin Siddiqui struggled before finally getting lead roles, and short people like Rajpal Yadav are still facing a tough time getting roles.\nNow that actors are getting recognition for their talent despite the looks, actress Swara Bhasker says that she was once rejected by a director for “looking intelligent.”\nBCCL\n“I think everyone who comes to the industry has to face certain kind of rejection for how they look. Otherwise people would not be spending so much money on the make up. All this is a reflection of a person's mindset. The first meeting I had when I came to Bombay, a director rejected me saying, you look too intelligent. I have still not understood what does this mean,” she told PTI.\nBCCL\nSwara says it is better to ignore such things and focus on work. Furthermore, she adds it is important to be associated with good content. That’s how she has been able to survive in the industry, she says.\nDon't Miss 1.1 K SHARES 174 SHARES 3.1 K SHARES 12.5 K SHARES", "title": "Swara Bhasker Lost Out On A Film For ‘Looking Intelligent’ In The Initial Days Of Her Career", "date_publish": "28/10/2018, 17:22:28", "description": "Actress Swara Bhasker says that she was once rejected by a director for “looking intelligent.” Swara says it is better to ignore such things and focus on work. Furthermore, she adds it is important to be associated with good content. That’s how she has been able to survive in the industry, she says.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/swara-bhasker-lost-out-on-a-film-for-looking-intelligent-in-initial-days-of-her-career-355609.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/in_initial_days_of_her_career_sawara_bhasker_was_rejected_by_a_director_for_looking_intelligent_1540726374_800x420.jpg"}