{"text": "The election season is on, and so are the arguments and fights on social media. Be it hate speeches, offensive memes or trolls, the topic of discussion on social media mostly revolves around elections, which will take place in stages from April 11 to May 1.\nYouTube\nSo, when actress Swara Bhasker expressed her support for Kanhaiya Kumar, former president of Jawaharlal Nehru University and the newest entrant into active politics, who will be contesting elections from Bihar’s Begusarai, she was trolled on social media.\nBCCL\nPeople have apparently not got over with Swara Bhasker’s commendable masturbation scene in Veere Di Wedding. The scene had received a lot of flak on social media, and looks like people are still trolling her over that.\nYay! #KanhaiyaKumar lands ticket 2 contest #LokSabha2019 Despite being subjected to a hysterical & inaccurate #GodiMedia trial Kanhaiyya has been steadfast in raising important issues that matter 2 democracy & people! V need more like Kanhaiyya in Parliament! #Kanhaiya4Begusarai — Swara Bhasker (@ReallySwara) March 24, 2019\nWhen Swara Bhasker extended her support to Kanhaiya Kumar, a Twitter user, apparently a woman trolled her for her masturbation scene in Veere Di Wedding.\nOffcourse after ditched by Mahaghatarabandhan.\nThey too know what scum he is.\nNo wonder you are happy, one scum backs another is the nature's course.\nBtw @ReallySwara howz your finger working ?? Keep it intact to vote to your 'Khan'aiyya. Bechara will be desperate for vote. https://t.co/rp19sraOoa — Mauna👩‍✈️ (@ugtunga) March 25, 2019\nDon't Miss 402 SHARES 638 SHARES 389 SHARES 182 SHARES\nSwara Bhasker slapped back at the troll with an epic reply.\nदीदी finger ठीक है! पर आपकी imagination बहुत थकी हुई है.. कुछ नया सोचो.. और दस रुपय per tweet से अपनी price बढ़ाओ! 🙏🏿🙏🏿🙏🏿🙏🏿 https://t.co/OySg8Q1mmZ — Swara Bhasker (@ReallySwara) March 25, 2019\nThe \"finger\" was a reference to Swara Bhasker's masturbation scene in Veere Di Wedding.", "title": "Swara Bhasker Trolled For Masturbation Scene On Supporting Kanhaiya Kumar, Gives An Epic Reply", "date_publish": "27/03/2019, 11:30:12", "description": "Swara Bhasker expressed her support for Kanhaiya Kumar, former president of Jawaharlal Nehru University and the newest entrant into active politics, who will be contesting elections from Bihar’s Begusarai, she was trolled on social media. When Swara Bhasker extended her support to Kanhaiya Kumar, a Twitter user, apparently a woman trolled her for her masturbation scene in Veere Di Wedding.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/swara-bhasker-trolled-for-masturbation-scene-on-supporting-kanhaiya-kumar-gives-an-epic-reply-364366.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/swara_bhasker_trolled_for_supporting_kanhaiya_kumar_slaps_back_at_troll_with_an_epic_reply_1553665522_800x420.png"}