{"text": "Swara Bhaskar Has A Strong Message For Women, Says Don't Subscribe To The Notion Of Shame\nSwara Bhaskar Has A Strong Message For Women, Says Don't Subscribe To The Notion Of Shame\nBollywood actress Swara Bhaskar has always been unapologetic about her thoughts and has been the fearless one of the film industry. People look up to her as she always stands tall with her choices and opinions.\nWhether it was an open letter to Sanjay Leela Bhansali for Padmaavat last year or battling with trolls, Swara is the only A-lister who doesn't shy away from speaking her mind. The actress was last seen in a short film, Shame, alongside Ranvir Shorey.\nAnd speaking about the title of the her film, Swara strongly feels one should not subscribe to shame.\n\"One of the values we give to our children in the form of respect is the notion of shame. It is across caste, class, linguistic barriers, we all have deeply engraved notion of shame,\" Swara said in a statement.\n\"This is one of the biggest obstacles to recognise something wrong is happening to you, and to be able to call it out and to share it and come out without, and try and be a part of the movement to stop these things,'' Swara further added.\nDon't Miss 862 SHARES 769 SHARES 346 SHARES\nSwara has been trolled multiple times especially when she took up a bold role in Veere Di wedding. She recieved backlash for her masturbation scene but she dealt with it head on.\n\"Do not subscribe to this notion of shame. Shame is nothing, there is an integrity to our soul, even if our bodies are violated nobody can take our integrity from us. Your sense of sanctity does not lie in your body,'' Veere Di Wedding actress said.\n''My learning for every girl out there is, do not subscribe to this notion of shame,\" concluded the actress.\nSwara was present during a discussion around Me Too movement and Harvey Weinstein and she shared her thoughts along with Dia Mirza.", "title": "Swara Bhaskar Has A Strong Message For Women, Says Don't Subscribe To The Notion Of Shame", "date_publish": "23/01/2019, 12:50:14", "description": "Swara Bhaskar Has A Strong Point For All The Girls Out There, Says Do Not Subscribe To This Notion Of ShameSwara Bhaskar Has A Strong Point For All The Girls Out There, Says Do Not Subscribe To This Notion Of ShameSwara Bhaskar Has A Strong Point For All The Girls Out There, Says Do Not Subscribe To This Notion Of ShameSwara Bhaskar Has A Strong Point For All The Girls Out There, Says Do Not Subsc", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/swara-bhaskar-has-a-strong-message-for-women-says-don-t-subscribe-to-the-notion-of-shame-360896.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/swara_1548227237_800x420.jpg"}