{"text": "T-Pain Accused Of Plagiarising Aashiqui 2 Song Tum Hi Ho, Gets Trolled By 'Brown Twitter'\nT-Pain Accused Of Plagiarising Aashiqui 2 Song Tum Hi Ho, Gets Trolled By 'Brown Twitter'\nA lot of Indian composers have often become a butt of jokes for getting 'inspired' by international songs and artists. However, it doesn’t take a genius to figure out plagiarism, right?\nWhat happened recently is definitely a rarity. American rapper T-Pain has been accused of plagiarising a recurring flute melody from Arijit Singh’s popular song from Aashiqui 2, Tum Hi Ho.\nFilm’s director Mohit Suri was the first one who brought this to people’s attention.\nMusic composer Mithoon was also taken aback when it came to his notice.\nSir, the melody that you have used in your new song is my original work for a previously released Hindi film..The Label is looking into this.#tumhiho #Aashiqui2 https://t.co/5fnDf4sfg7 — Mithoon (@Mithoon11) December 15, 2018\nAnd soon, T-pain became a victim of trolls. He was facing the wrath of “brown twitter”, he said.\ni cant listen to what t pain is saying i can only concentrate on tum hi ho in the background KDJFH — megha (@gorepeaches) December 17, 2018\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nT Pain: if I throw it at you baby that’s yo money\nMe: meri aashiqui ab tum hi ho — 👑 Queen Supreet 👑 (@Queen_Supreet) December 15, 2018\nCannot believe T pain sampled Tum Hi Ho 😂😂😂😂😂 I’m so dead — Bhad Bhai (@DerrKaiser) December 15, 2018\nt pain stealing tum hi ho tune is acc the funniest shit ever, labels r involved now skksksjfkdkd — fhams (@fhxmshoque) December 16, 2018\nHe took to twitter to clarify that he didn’t produce the tune, and also stated that it was a small matter and his label was looking into it.\nWoke up to getting dragged by brown twitter. Sooooo yea. I definitely didn’t produce this song. Had no idea that was a sample and have never heard the music before I got the beat from the producer. Easy thing to work out. The labels will be in contact. Thanx — T-Pain (@TPAIN) December 15, 2018\nSome people were just amazed by seeing all this happening for real.\nThe irony in seeing Bollywood fans attacking T Pain for sampling Tum Hi Ho on a trap beat, when Bollywood literally takes a WHOLE composition claiming it as their own track.\nC'mon guys, lol. — Bhaveek N. Makan (@TehBhav) December 16, 2018\nMeanwhile, T-pain’s song which was titled That’s Yo Money has been pulled off from YouTube. But it’s still available on other channels and fan pages. If you want to know what’s all the ruckus about, listen to the tune below:\nThis isn’t the first time that T-series has been embroiled in an international battle. Remember the label’s feud with Swedish internet celebrity PewDiePie over YouTube followers? They are competing against each other for most followed YouTube channel. In the recent development, after YouTube purged spam accounts, PewDiePie has once again beaten T-Series as the most subscribed channel.", "title": "T-Pain Accused Of Plagiarising Aashiqui 2 Song Tum Hi Ho, Gets Trolled By 'Brown Twitter'", "date_publish": "18/12/2018, 11:33:54", "description": "American rapper T-Pain has been accused of plagiarising a recurring flute melody from Arijit Singh’s popular song from Aashiqui 2, Tum Hi Ho. Film’s director Mohit Suri was the first one who brought this to people’s attention. Music composer Mithoon was also taken aback when it came to his notice.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/t-pain-accused-of-plagiarising-aashiqui-2-song-tum-hi-ho-gets-trolled-by-brown-twitter-358796.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/tpain_accused_of_plagiarising_from_aashiqui_2_song_tum_hi_ho_his_song_pulled_off_from_youtube_1545111767_800x420.png"}