{"text": "Taapsee Pannu Took Classy Revenge On An Ex For Breaking Up With Her After Giving A Silly Excuse\nTaapsee Pannu Took Classy Revenge On An Ex For Breaking Up With Her After Giving A Silly Excuse\nTaapsee Pannu is one classy woman. She speaks more with her actions and that’s what people love about her. Indiatimes met the Manmarziyaan actress for an interaction on her upcoming film Badla along with Amitabh Bachchan at Red Chillies' Office.\nTwitter\nLooking gorgeous in a white shirt paired with brown bell bottoms and donning spectacles, Taapsee had her geek mode on.\nInstagram\nShe was elated to work with Mr. Bachchan all over again after Pink and said she has become even more confident. But the highlight of the interview was her revelation about taking revenge with an ex-boyfriend.\nDon't Miss 814 SHARES 555 SHARES 144 SHARES 12.5 K SHARES 5.5 K SHARES\nTwitter\nYes. Taapsee who’s next film is Badla, said she too has taken a Badla in real life, she revealed,\n“When I was dating a boy in school he broke up with me by giving 10th board excuse, I felt very bad at that time. After two years, he started flirting with me online and I came to know he was already dating someone but was still flirting with me, so I took the print out of the entire chat and sent it to the girl who he was dating.”\nTwitter\nThe actress doesn’t have any regrets of doing the same. In fact, she excused herself by saying bachpan mai yahi sab toh karte hai hum.\nTwitter\nTaapse has a lot of hopes from Badla, says the film will leave the audiences amazed. Badla is directed by Sujoy Ghosh and we just cannot contain our excitement to watch the film.", "title": "Taapsee Pannu Took Classy Revenge On An Ex For Breaking Up With Her After Giving A Silly Excuse", "date_publish": "22/02/2019, 16:12:47", "description": "Taapse Pannu is one classy woman, she speaks more with her action and that’s what people love about her. Indiatimes met this actress for interaction for her upcoming film Badla along with Amitabh Bachchan at Red Chillies Office.Looking gorgeous in white shirt paired with brown bell bottoms, Taapse had her geek mode on with a cool spectacle.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/taapsee-pannu-took-classy-revenge-on-an-ex-for-breaking-up-with-her-after-giving-a-silly-excuse-362605.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/taapsee_pannu_1550827576_800x420.jpg"}