{"text": "Unlike other actresses, Taapsee Pannu wasn’t ever inclined towards doing glamorous roles. She chose performance oriented roles and proved her mettle with every film. From Pink to Naam Shabana and Badla recently, the diva has come a long way. She is considered one of the finest actresses in the industry today.\nWith no godfather and connections in the industry, her journey in Bollywood wasn’t a cake walk. She was often replaced and rejected too. Recently, she called out the makers of Pati Patni Aur Woh for replacing her with Bhumi Pednekar without informing her.\nraagalahari.com\nTaapsee Pannu thinks her biggest strength in the industry is her average looks which makes her resonate with average Indian women.\nDon't Miss 555 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“I am an average Indian girl, who isn’t extraordinarily good-looking and that is my biggest strength,” she was quoted as saying by TOI.\nTwitter\nUnlike other celebrities, Taapsee is also known for never mincing her words. She is never diplomatic. She is not afraid to call spade a spade.\n“Speaking the truth is a lot easier. Putting up a façade or a certain image is a lot of hard work. I am a very lazy person, so I refrain from lying as I would forget what story I have cooked up before. I won’t be able to remember the cover-up,” she told TOI.\nTwitter\nMeanwhile, Taapsee Pannu’s recently released film Badla is receiving great reviews from audiences and critics alike. In the film helmed by Sujoy Ghosh, she is sharing screen time with Amitabh Bachchan yet again after Pink.", "title": "Taapsee Pannu Thinks She Isn’t ‘Extraordinarily Good Looking,' Calls It Her Biggest Strength", "date_publish": "09/03/2019, 16:49:21", "description": "Taapsee Pannu thinks her biggest strength in the industry is her average looks which makers her resonate with average Indian women. “I am an average Indian girl, who isn’t extraordinarily good-looking and that is my biggest strength,” she was quoted as saying by TOI.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/taapsee-pannu-thinks-she-isn-t-extraordinarily-good-looking-that-it-s-her-biggest-strength-363436.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/taapsee_pannu_thinks_she_isnt_extraordinarily_good_looking_says_its_her_biggest_strength_1552128632_800x420.jpg"}