{"text": "Taare Zameen Par is one of the biggest hits of Indian cinema and till today, people fondly remember the film and child actor Darsheel Safary. In a recent interview, he said that the director of the film and superstar Aamir Khan has been his guiding force.\nDarsheel was applauded by both the audience and critics for his moving portrayal of a child with dyslexia Ishaan Awasthi in the film.\nTwitter\nTalking about his current equation with Aamir Khan, he said,\n“He has been a guiding force. My dad often speaks to him. It has been a long time since I spoke to him. I keep asking should I do this. He replies. He responds till date. It is very nice of him. I would love to talk about cinema, industry (with him). He will be quite shocked as the last time he left me I was this 10-year-old naughty, mischievous kid, who did not know what he is supposed to do. Now I am getting my way right, I have developed a passion for films. I would love to have a conversation with him about that someday,” Darsheel told PTI.\nDarsheel's journey post-Taare Zameen Par\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAfter Taare Zameen Par, Darsheel Safary was seen in several films including Priyadarshan’s Bumm Bumm Bole, Disney’s Zokkomon and Deepa Mehta’s Midnight’s Children. And now, at 22-year-old has been auditioning for ad films, features and web shows.\n“People call me because I have acted in Taare Zameen Par. They ask me what are your plans. I do go for auditions. I am being choosy, I don’t want to do random stuff, want to do something that appeals to me.”\nHe said whatever interesting work comes his way, he tries to make the most of it. “For me the key lies in working towards my passion. I am sure it will work out one day.”\nDarsheel's love for the theatre!\nHe is busy with his latest play “Kaise Karenge?” which premiered Saturday. It is a story of two brothers, played by Darsheel and Abhishek Pattnaik, and how the latter, who happens to be the elder brother with multiple personality disorder.\nNot many know that since the age of 19, Darsheel has been doing theatre and since then he has three plays to his credit – “Can I Help You”, in which he played the role of a suicidal, aggressive fast bowler, “Two Adorable Losers” addressed the question about ‘If a person speaks fluent English, why is he considered knowledgeable?’ through student-teacher relationship and the third being “Kaise Karenge?”.\n“Once the script is ready it takes about three-four months to put the show. Theatre enhances you as an actor. It is fun to perform live for audience, it also helps you as an actor. One has to be more observant, alert as there is very little room for error.\"\nCiting example of his play “Two Adorable Losers”, which has had 90 plus shows, Darsheel said theatre is all about good content.\n“Today the generation says that theatre is a dying form, I strongly disagree. It all depends on the content. You get more people to watch it if the story is good.” He said even when he starts doing films, he will continue to do theatre just like veteran actors like Paresh Rawal and Naseeruddin Shah.\n(With PTI inputs)", "title": "Taare Zameen Par Actor Darsheel Safary Thankful To Aamir Khan For Being A Guiding Light", "date_publish": "18/03/2019, 13:15:44", "description": "Darsheel Safary: Aamir Khan has been my guiding force: He adds, “He has been a guiding force. My dad often speaks to him. It has been a long time since I spoke to him. I keep asking should I do this. He replies. He responds till date. It is very nice of him.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/taare-zameen-par-actor-darsheel-safary-is-thankful-to-aamir-khan-for-being-a-guiding-light-363893.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/darsheel_safary_1552896516_800x420.jpg"}