{"text": "Suffering from cancer is almost like a close encounter with death. Lucky are the ones who win the battle. And once you survive, your perspective towards life changes – for good.\nAlso Read: 13 Times Sonali Bendre & Irrfan Khan Taught Us How To Live Life While Battling Cancer!\nAyushmann Khurrana’s wife Tahira Kashyap was diagnosed with DCIS (ductal carcinoma in situ) with high-grade malignant cells in her right breast in September 2018. Cancer didn’t keep her down, instead, the braveheart battled it and empowered everyone.\nDue to chemotherapy, the diva lost strands of hair – hair, which were hiding the parts she was insecure about. But then, she learnt a new definition of beauty. She went bald and felt more powerful.\nDon't Miss 862 SHARES 322 SHARES 122 SHARES 12.5 K SHARES 5.5 K SHARES\nIn an empowering note, Tahira Kashyap narrated her story and wrote a powerful note on self-love and acceptance during cancer, and it’s inspiring.\nInstagram\nHere’s what she wrote:\n“WARNING!! Before you swipe left, some pictures might not go down too well with your palette. But I am hoping there is a change in the perception of that one perfect flavour that we have always had. The last couple of months have been an extreme case of metamorphosis for me. And I am not categorising it whether it was from a caterpillar to a butterfly phase or vice versa. I could be the larva or the pupa or any other intermediate stage as each phase is unique and special. But there is a deep sense of acceptance when it comes to the life cycle of this creature. Taking a ‘leaf’ from this caterpillars life, I feel I have undergone a tremendous change mentally and physically too. From my obsession with long hair, associating beauty with rapunzel tresses, and hiding most of the time behind my hair (as I felt secure , lest my crooked nose, or freckles or pimples or simply not so chiseled face isn’t exposed) to losing my hair, wearing extensions and a cap, going bald to now a short crop. I am enjoying every phase because somehow with hair I lost my insecurity, my stupid notion of beauty and my complexes. I don’t know whether I’ll keep long hair or not, in either case I am not going to hide my face. I don’t claim to have refined beauty, but I have changed my own mindset and my biggest victory is changing the mindset and perception of my 7 year-old-son, the next generation. From running to get a cap and placing it on my head when I was losing my hair and had a bald patch to proudly introducing me to his friends when I was bald or now with short hair, I feel I am a part of a change. This post is dedicated to women of all shapes and sizes and to all those posts I get when they fret losing their hair during or after chemotherapy. You are beautiful now and always.”\nAlso Read: Manisha Koirala Shares The Biggest Takeaway From Her Cancer Battle, Reveals How It All Began", "title": "Tahira Kashyap Pens A Powerful Note On Self-Love & Acceptance During Cancer & It’s A Must Read!", "date_publish": "28/04/2019, 14:39:36", "description": "In an empowering note, Tahira Kashyap narrated her story and wrote a powerful note on self-love and acceptance during cancer, and it’s inspiring. Due to chemotherapy, the diva lost strands of hair – hair, which were hiding the parts she was insecure about. But then, she learnt a new definition of beauty. She went bald and felt more powerful.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/tahira-kashyap-pens-a-powerful-note-on-self-love-acceptance-during-cancer-it-s-a-must-read-366231.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/tahira_kashyap_narrated_her_story_and_wrote_a_powerful_note_on_selflove_and_acceptance_during_cance_1556440037_800x420.jpg"}