{"text": "'Bald' and beautiful Tahira posted a stunning back shot with bald head, bare back and a mastectomy scar. Ever since she started her journey towards recovery, she has been very vocal and expressive about her journey which definitely is very inspiring.\n\"Characters are quite different from roles. I feel nice when people make me do what I can't. The most difficult thing is to play your own self on silver screen. When we do creative things, people ask \"did you ever thought you would reach this level of stardom\" and I say, \"never\".\"\n\"We haven't met after it. Our relationship is civil. I don't think it's bitter. It's been a while. I have known her for much longer even before we dated. I gave my first ever shot with her in SOTY, I was crazy, and there is so much history\"\n\"I don't know if you find love or love finds you, either way, it's a gift from the universe. So be grateful. Every. Single. Day\"\nThis proves that they have indeed found their love and bliss in each other. Several reports have hinted at the fact that they are also ready to take the plunge and might tie the knot in a private ceremony by the end of first quarter of 2019.\nRanveer rapped live while walking the ramp with his \"Gully Boys\" gang to showcase a unique fashion line, GullyGen. Ranveer was present with his team and rapper Naezy and other artistes, sang \"Asli hip hop\" and \"Apna time aayega\" from the yet to release film.\nDon't Miss 862 SHARES", "title": "Tahira Kashyap Posts Pic Of Her Surgery Scar, Farhan Akhtar Makes His Relationship Official & More From Ent.", "date_publish": "04/02/2019, 17:33:31", "description": "'Bald' and beautiful Tahira posted a stunning back shot with bald head, bare back and a mastectomy scar. Ever since she started her journey towards recovery, she has been very vocal and expressive about her journey which definitely is very inspiring. 'Bald' and beautiful Tahira posted a stunning back shot with bald head, bare back and a mastectomy scar.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/tahira-kashyap-posts-pic-of-her-surgery-scar-farhan-akhtar-makes-his-relationship-official-more-from-ent-361580.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_1549282218_800x420.jpg"}