{"text": "Taimur Ali Khan Trumps Ranveer Singh! Kareena Kapoor Says Her Son Is More Stylish Than Him\nTaimur Ali Khan Trumps Ranveer Singh! Kareena Kapoor Says Her Son Is More Stylish Than Him\nAll kids are cute and adorable, right? We know, how often you wonder why paparazzi’s favourite Taimur Ali Khan makes headlines every now and then. But did you know that his parents, Saif Ali Khan and Taimur Ali Khan, fight over the two-year-old’s looks?\nInstagram\nDon’t believe us? Saif had once admitted to it. “She (Kareena) says he looks like me but I am pretty sure he looks a lot like her. I cannot tell. Some days he looks like me and some days he looks like her. He looks like a Chinese her… Not Chinese, let’s say Mongol. But Mongol sounds like he is missing a chromosome. Let’s say Timurid,” he had said.\n\"Taimur looks like a Chinese or Mongol version of Kareena\" - Saif Ali Khan pic.twitter.com/dKisPPEkwf — Kareena Kapoor Khan (@KareenaK_FC) October 12, 2017\nNow, as he is growing up, he is turning out to be a star in his own right. Remember when he was clicked in a printed Kurta and green sunglasses, people compared his style statement with Ranveer Singh. We know, he is just a kid and perhaps doesn’t know/care about it yet. But nothing can stop the internet.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 707 SHARES\nWhat’s more? When Kareena Kapoor was recently awarded the most stylish (female) award, in her acceptance speech, she went on to say that her son Taimur is the most stylish man alive. He is more stylish than Ranveer Singh, she declared.\n“I am accepting this award on my son Taimur’s behalf, the most stylish man alive. And he is definitely more stylish than you Ranveer.”\nMeanwhile, after Taimur Dolls, Taimur cookies have taken over the internet. At the Cosmo India Blogger’s Award 2019, Taimur cookies were served to the guests. It’s a strange world, after all.\nAlso Read: As If Dolls Weren't Enough, Now Taimur Ali Khan-Inspired Cookies Have Become The Latest Fad!", "title": "Taimur Ali Khan Trumps Ranveer Singh! Kareena Kapoor Says Her Son Is More Stylish Than Him", "date_publish": "30/03/2019, 15:57:18", "description": "When Kareena Kapoor was recently awarded the most stylish (female) award, she, in her thanking speech, said that her son Taimur Ali Khan is the most stylish man alive. He is more stylish than Ranveer Singh, she said. When Kareena Kapoor was recently awarded the most stylish (female) award, she, in her thanking speech, said that her son Taimur is the most stylish man alive. He is more stylish than", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/taimur-ali-khan-trumps-ranveer-singh-kareena-kapoor-says-her-son-is-more-stylish-than-him-364589.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/taimur_ali_khan_beats_ranveer_singhs_swag_kareena_says_her_son_is_more_stylish_than_the_actor_1553937801_800x420.png"}