{"text": "Take This GoT Quiz & We'll Predict The Character Who Deserves The Throne & The Badge Of Hand!\nTake This GoT Quiz & We'll Predict The Character Who Deserves The Throne & The Badge Of Hand!\nFor almost two years, fans have been waiting patiently for this very moment to arrive. The whole 'i’m some of the only few people left who haven’t see Game Of Thrones’ vanished away into thin air over the course of 8 years. It’s time when we get to see who will finally get to sit on the Iron Throne. After a zillion debates and discussions, the teams are distinct. Each one of us know who we want to see as the King or Queen once and for all! With just 10 days to go for the season finale, here’s a way to know who deserves to sit on the throne. Not just that, we also have a method to find out who will be the hand of that king/queen! Don’t believe us? Take this quiz to find out.\n1. What is your preferred weapon?\n2. Which of these quotes resonates with you the most?\n3. What scares you the most?\n4. Which characteristic trait excites you the most?\n5. If you had to live in a castle, which would it be?\n6. What would be your major concern, if you were made to sit on the iron throne?\n7. Who is your spirit animal?\n8. What is the most important thing for a ruler?\n9. Which one is your least favourite character?\n10. If you were to face the White Walkers, what would you do?\nTyrion Lanister with Bronn as his hand Well, you prefer the lavish lifestyle consisting of unlimited supply of wine, books and beautiful women. The kingdom has to learn how to chill, ya’ll! SHARE THE RESULT RETAKE QUIZ\nArya Stark with Gendry as her hand Every subject will be skilled in weapon-making and faceless-ness! The kingdom will be unbeatable. SHARE THE RESULT RETAKE QUIZ\nJaime Lannister with Jon Snow as his hand Coz nobel men will never go out of style! More adventures and sword-fighting will be the pastime for all the subjects SHARE THE RESULT RETAKE QUIZ\nSansa Stark with Brienne of Tarth as the hand Why should boys have all the fun? Sansa will teach everyone how to look pretty and Brienne will train them to be badass and fearless. A perfect mix of both! SHARE THE RESULT RETAKE QUIZ\nDon't Miss 159 SHARES 842 SHARES", "title": "Take This GoT Quiz & We'll Predict The Character Who Deserves The Throne & The Badge Of Hand!", "date_publish": "05/04/2019, 11:52:29", "description": "For almost two years, fans have been waiting patiently for this very moment to arrive. The whole 'i’m some of the only few people left who haven’t see Game Of Thrones’ vanished away into the air over the course of 8 years. It’s time when we finally get to see who will finally get to sit on the Iron Throne. After a zillion debates and discussions, the teams are finally distinct. Each one of us know", "authors": ["Bhavya Sadhwani", "Bhupinder Singh"], "url": "https://www.indiatimes.com/entertainment/take-this-got-quiz-we-ll-predict-the-character-who-deserves-the-throne-the-badge-of-hand-364813.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/game_of_thrones_quiz_1554372746_800x420.jpeg"}