{"text": "Rajpal Yadav recently completed his three-month prison sentence after being convicted in a case of non-repayment of a loan. The actor says that no matter what the situation, he tried to interact with the inmates to understand their problems and often indulged in recreational activities with fellow prisoners.\nIn an interview with Zoom, Rajpal said that he likes interacting with people and he tries to observe his surroundings and understand the environment.\nBCCL\nIf people in prisons think that a jail term is the end of life, Rajpal thought that he should use his creativity to make them feel alive. The actor understood that if he had to live there, he had to indulge in creative things that benefit him and the inmates equally. Rajpal added that he would try to make feel better and they could learn things from each other. He also used to participate in several cultural programmes. Rajpal knew that he couldn't reduce anyone's difficulties, but he tried to improve their blood circulation by making them laugh and made the most of his creative skills to better himself during the time.\nYoutube\nDon't Miss 199 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nYadav, who is of the view that bygones should be bygones, also explained that he made sure to live a disciplined life. He was quoted saying,\n“If people there think that this is the end of life, I thought I should use my creativity to make them feel alive... I understood that if I have to live here, I have to indulge in creative things that benefit me and them equally. Koshish karta rehta tha ki logo ko acha lage, ek doosre se seekhe aur samjhe... I used to pariticpate in several cultural programmes. Museebato ko toh mai kisi ki kam nahi kar sakta, kam se kam unka blood circulation hi acha rahe, taaki wo ache se rahe.\"\nThe Delhi High Court had sentenced Rajpal to three months in prison over non-repayment of a loan of Rs 5 crore that his company had taken to produce a film.\nOriginally published in Times of India", "title": "Talking About 3-Month Imprisonment, Rajpal Yadav Explains Why He Performed Comedy For Inmates", "date_publish": "23/04/2019, 16:41:48", "description": "Rajpal Yadav recently completed his three-month prison sentence after being convicted in a case of non-repayment of a loan. The actor says that no matter what the situation, he tried to interact with the inmates to understand their problems and often indulged in recreational activities with fellow prisoners.", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood/talking-about-3-month-imprisonment-rajpal-yadav-explains-why-he-performed-comedy-for-inmates-365958.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/rajpal_yadav_1556018271_800x420.jpg"}