{"text": "Bollywood couples are redefining millennial relationship goals and how! Anushka Sharma and Virat Kohli fit in perfectly in the definition of a perfect millennial couple. Their love-story might be cliche but how they conduct their relationship and strike a work-life balance in the correct measures is what becomes aspirational for many of us.\nAfter dating for over four years, the couple had a Tuscany wedding in December last year. While their work keeps them busy and tied up, they know how to strike a work-life balance.\nAgencies\nDuring the promotions of her upcoming film Zero, Anushka spilled the beans on her and Virat's equation and how they manage to balance work and personal life so well. She said,\nAgencies\nDon't Miss 3.5 K SHARES 518 SHARES 235 SHARES\n“I feel mentally good when I am working. At the same time, you have to create work-life balance, which I think I did even before I got married. Like I was always somebody who understood that categorising is important. That this is my work and this is my personal life, is very important and I think both of us have managed to do that really well.\"\nThe couple is all set to celebrate their first wedding anniversary for which they have planned a romantic getaway in Australia.", "title": "Talking About Work-Life Balance, Anushka Sharma Explains How She & Virat Kohli Manage Everything", "date_publish": "30/11/2018, 16:25:43", "description": "Their love-story might be cliche but how they conduct their relationship and strike a work-life balance in correct measures is what becomes aspirational for many of us. Anushka Sharma and Virat Kohli fit in perfectly in the definition of a perfect millennial couple. After dating for over four years, the couple had a Tuscan wedding in December last year. While their work keeps them busy and tied", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-work-life-balance-anushka-sharma-explains-how-she-virat-kohli-manage-everything-357666.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/virushka_1543576375_800x420.jpg"}