{"text": "Ranveer Singh and Deepika Padukone's love story feels straight out of a fairy-tale. But that's not all. While we gush over their dreamy pictures every now and then, there is much more to them apart from what we see on the surface.\nRanveer has endlessly spoken about Deepika and their post-marriage life in his interviews. Yesterday was no different. The actor was present at a Filmfare press-conference when he again opened up about his post-marriage life and made some candid confessions.\nAgencies\nTalking about love of his life Deepika Padukone, Ranveer said that since their wedding, there have been many restrictions on him but that they have made him a better person.\n(Also read: Deepika Padukone Spills Secrets About Hubby Ranveer Singh, Says He Takes More Time Than Her To Get Ready!)\nBe it having his meals on time or waking up on time to reaching work on time –Ranveer added that he loves all the restrictions that Deepika imposes on him. He said,\nAgencies\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\n“Itne pyaare pratibandh hai unke.. Mai bandh gaya hu grahasti mei. Mai toh matlab time se uthna, time pe khana khana, time pe kaam pe pahuchna, time pe ghar jaana, time pe sona.. Wow, kya sudhar gaya hai ladka. Kya sudhar gaya hai.” (Her restrictions are so adorable and I am totally tied down to my married life. Now, I wake up on time, reach on sets on time and all of this has happened because of Deepika's restrictions).\nHe laughed and added,\nAgencies\n“Mai kehta hu tu sudhar mujhe, tu sudhar. Laga tu pratibandh pe pratibandh.”\nOn the professional front, Ranveer is prepping up for 83-Kabir Khan's next on Kapil Dev and India's 1983 world-cup win.", "title": "Talking About His Life Post-Marriage, Ranveer Thanks Deepika For Making Him A Disciplined Man!", "date_publish": "12/03/2019, 11:18:20", "description": "Talking about love of his life Deepika Padukone, Ranveer said that since their wedding, there have been many restrictions on him but that they have made him a better person. Be it having his meals on time or waking up on time to reaching work on time –Ranveer added that he loves all the restrictions that Deepika imposes on him.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-his-life-post-marriage-ranveer-thanks-deepika-for-making-him-a-disciplined-man-363549.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranveer_singh_1552369828_800x420.jpg"}