{"text": "Talking About His Weak Moments, SRK Shares How Sometimes He Ends Up Feeling Like A 'Zero'\nTalking About His Weak Moments, SRK Shares How Sometimes He Ends Up Feeling Like A 'Zero'\nAs humans, we all have our 'weak' moments. Moments where we feel like we lack something or we aren't 'good enough'. While we as ordinary people have such phases, there are super-successful people too who have these insecurities too. Even they aren't deprived of such moments and they are inescapable.\nCurrently, Shah Rukh Khan is all set for the big release of this year, Zero. The trailer of the same was unveiled yesterday and it looked like a glorious tale of an underdog, packed with emotions.\nAgencies\nDuring the trailer launch, SRK was trying to explain the meaning of 'Zero' literally and he said he always feels he is not good enough and therefore, he puts in more efforts in his work.\nSRK was asked if he ever felt like a Zero in his life like the title of his film. Commenting on the same, SRK said,\nAgencies\n\"There are moments when we all feel we are zero. A few days back, I asked AbRam to sit with me, but he didn't and walked away then, I felt, am I not a good father who is not spending enough time with his kids. So that day I felt like a loser, but then, my wife told me that it's not the way you are thinking because your other two kids also do the same with you.\"\nHe might be one of the most successful and popular actors in the world but he too thinks that lack of over-confidence is what enables your personality to grow. He adds,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nAgencies\n\"I think it's always important to have lack of over-confidence. Over-confidence is a worse thing than feeling like a loser.\"\n'Zero' is a romantic drama film, written by Himanshu Sharma and directed by Aanand L. Rai. Also starring Katrina Kaif and Anushka Sharma in lead roles, the film is all set to hit the theaters on December 21.", "title": "Talking About His Weak Moments, SRK Shares How Sometimes He Ends Up Feeling Like A 'Zero'", "date_publish": "03/11/2018, 13:55:58", "description": "During the trailer launch, SRK was trying to explain the meaning of 'Zero' literally and he said he always feels he is not good enough and therefore, he puts in more efforts in his work. SRK was asked if he ever felt like a zero in his life like the title of his film suggests.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-his-weak-moments-srk-shares-how-sometimes-he-ends-up-feeling-like-a-zero-355975.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/srk_1541235035_800x420.jpg"}