{"text": "Talking On #MeToo, Kalki Koechlin Says Her Stance Is Clear As She Has ‘F**k Off’ Sign On Her Forehead\nTalking On #MeToo, Kalki Koechlin Says Her Stance Is Clear As She Has ‘F**k Off’ Sign On Her Forehead\nKalki Koechlin is one of the few Bollywood actresses who has always voiced her opinion on women empowerment and gender equality. Recently, speaking about the #MeToo movement that was kickstarted in the country last year, she opened up about the progress and aftermath of the movement.\nTwitter\nAdmitting that there has been a positive change in the industry, Kalki Koechlin said that there’s a lot of work to be done. When she was asked if she has ever faced harassment in the industry, the Gully Boy actress said that her stance on feminism is quite solid and she hasn’t faced such a situation.\n“My stance on feminism is quite solid and transparent. I have a big Fuck off sign on my forehead, so no I haven’t faced it. But what I do see is that there is a lot of casual sexism. That happens when someone makes fun of your body. I’ve experienced that. But I’ve been very clear about my stand from the start, so I haven’t had anything dramatic happen to me,” she was quoted as saying by India Today.\nDon't Miss 259 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nEarlier in an interview with Cosmopolitan, Kalki had talked about the challenges that women who shared their #MeToo stories had to face.\n“We can't let fear steer the way, dictate our lives. This movement has proved that we can't sit here and fear what might or might not happen. It's true that women who've been speaking are hugely threatened; their lives are under stress for calling out their abusers,” she had said.\nRead More: Kalki Koechlin Feels There Is A Lack Of Environment For Women To Speak About Sexual Abuse", "title": "Kalki Koechlin:Talking On #MeToo, Kalki Koechlin Says Her Stance Is Clear & She Has ‘F**k Off’ Sign On Her Forehead", "date_publish": "16/02/2019, 18:09:08", "description": "Kalki Koechlin is one of the few Bollywood actresses who has always voiced her opinion on women empowerment and gender equality. Recently speaking about the #MeToo movement that was kickstarted in the country last year, she opened up about the progress and aftermath of the movement.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/talking-on-metoo-kalki-koechlin-says-her-stance-is-clear-as-she-has-f-k-off-sign-on-her-forehead-362281.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/talking_on_metoo_kalki_koechlin_says_her_stance_is_clear__she_has_fk_off_sign_on_her_forehead_1550320043_800x420.jpg"}