{"text": "Talking About #MeToo, Ayushmann Khurrana Says It’s Important For Men To Understand What Consent Is\nTalking About #MeToo, Ayushmann Khurrana Says It’s Important For Men To Understand What Consent Is\nThe #MeToo movement has created a storm on social media and big names including Anu Malik and Nana Patekar have been accused of sexual harassment. It’s important, especially at this time, to talk about sexual consent – which is voluntary agreement of both the parties to engage in sexual activity.\nAyushmann Khurrana who is basking in the success of his recently released films Badhai Ho and Andhadhun also feels that it is important for men to understand consent – what it means and what it applies to.\nActor Ayushmann Khurrana has supported the #MeToo movement by saying that men should understand what consent is. Ayushmann visited the PVR Citi Mall here on Saturday to know the audience's reaction for his latest film Badhaai Ho.\nReacting to the #MeToo campaign that has gathered momentum in India, especially in Bollywood, Ayushmann told media, \"The #MeToo movement is a good movement, but at the same time, I feel both parties should be given equal opportunities to share their account and to prove their innocence. Having said that, I feel women should be respected and they shouldn't be harassed.\nBCCL\nDon't Miss 862 SHARES 346 SHARES\n\"There should be stringent rules at every workplace. It is not only about workplace, but I think that the code of conduct should be followed in every sphere of society, be it our family or where we live.\"\nUnion Women and Child Development Minister Maneka Gandhi has announced the formation of a committee of four retired judges and a lawyer to examine all issues emanating from #MeToo, a movement against sexual harassment. Actors like Aamir Khan, Akshay Kumar and Hrithik Roshan have also taken a firm stand against their colleagues, who have been accused in sexual harassment cases.\nAsked whether these kind of measures are necessary to curb harassment at workplace, Ayushmann said,\"I think we should have taken these measures long time ago, but whatever measures we have taken are absolutely correct.\n\"Women should feel safe whether it's in journalism or sometimes we go to shoot, our films are in outdoor locations. We shoot there till late nights and not a single woman should feel unsafe there and men should understand what consent is and without that, you cannot do anything to anyone. No one can touch other person without his or her consent and if anyone does that, then strict action should be taken against that individual.\"\nThe #MeToo movement gained momentum in India after actress Tanushree Dutta accused veteran actor Nana Patekar of harassment.\nWith inputs from IANS", "title": "Talking About #MeToo, Ayushmann Khurrana Says It’s Important For Men To Understand What Consent Is", "date_publish": "22/10/2018, 13:39:15", "description": "Ayushmann Khurrana who is basking in the success of his recently released films Badhai Ho and Andhadhun also feels that it is important for men to understand consent – what it means and what it applies to. The #MeToo movement has created a storm on social media and big names including Anu Malik have been accused of sexual harassment. It’s important, especially at this time, to talk about sexual co", "authors": [], "url": "https://www.indiatimes.com/entertainment/talking-about-metoo-ayushmann-khurrana-says-it-s-important-for-men-to-understand-what-consent-is-355188.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/talking_about_metoo_ayushmann_khurrana_says_its_important_for_men_to_understand_what_consent_is_1540193933_800x420.jpg"}