{"text": "Talking About Love And Life, Alia Bhatt Confirms That She Has Found The 'One'\nTalking About Love And Life, Alia Bhatt Confirms That She Has Found The 'One'\nThis year has been really lucky for a lot of people as cupid stuck for many of them. From Priyanka-Nick to Ranbir-Alia, these couples have love stories that are more beautiful than fairy tales.\nIf we talk about Ranbir Kapoor and Alia Bhatt, this couple started off as friends to co-stars, before taking a leap ahead and getting into a relationship. Alia-Ranbir has been together for over a year now and they have given us enough hints on their relationship.\nIn a recent interview with Vogue India magazine, Alia was asked about her dialogue in her film, Dear Zindagi, “Is there someone like the one? What is this perfect one exactly? Mere liye toh koi perfect hona chahiye na.,” to which, Alia said,\n“Yeah, I think I have”. She further added that in love she is an ‘affectionate, beautiful person’. “I have stars and a halo on my head, and I’m walking around with rainbows. I like to keep it simple and sweet.\"\nShe added that even though she doesn't like to talk about her personal life but she also doesn't like to conceal her feelings. She added,\nDon't Miss 336 SHARES 247 SHARES 699 SHARES 1.7 K SHARES 12.5 K SHARES\n“Actors, in general, are very vulnerable. Ours is the life on display for constant judgment. I’m very affected by judgments about my professional life. I even get worked up if my director is stressed about something. I can only act in front of one camera.\"", "title": "Talking About Love And Life, Alia Bhatt Confirms That She Has Found The 'One'", "date_publish": "08/11/2018, 12:08:16", "description": "She added that even though she doesn't like to talk about her personal life but she also doesn't like to conceal her feelings. She added, “Actors, in general, are very vulnerable. Ours is the life on display for constant judgment. I’m very affected by judgments about my professional life. I even get worked up if my director is stressed about something. I can only act in front of one camera.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-love-and-life-alia-bhatt-confirms-that-she-has-found-the-one-356262.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranbir_and_alia_1541660176_800x420.jpg"}