{"text": "Talking About His Own Harassment Experience, Saif Ali Khan Says #MeToo Offenders Must Be Punished\nTalking About His Own Harassment Experience, Saif Ali Khan Says #MeToo Offenders Must Be Punished\nIt’s high time that the people understand the importance of consent. Just because you’re rich and powerful, it doesn’t give you the authority to misbehave, harass, molest or assault another person.\nIndia’s #MeToo movement is finally here and women across the world are braving their families, peers, friends and acquaintances to come out with their stories of sexual harassment, because time is up now.\nAP\nA lot of celebrities have opened up on their stories, including Kangana Ranaut and Vinta Nanda, and a lot of other celebrities stand in solidarity with the victims understanding the pain they had to go through.\nSaif Ali Khan, recently said that he was harassed too, not sexually, but the scars of the incident, he says, are afresh.\n“I have also been harassed in my career, not sexually, but I have been harassed 25 years ago and I am still angry about it,” he was quoted as saying by PTI.\nAFP\nDon't Miss 535 SHARES 193 SHARES 769 SHARES 856 SHARES 520 SHARES\n“Most people don't understand other people. It is very difficult to understand other people's pain. I don't want to talk about it because I am not important today. Even when I think about what happened with me I still get angry. Today, we have to look after women,” he added.\nFurthermore, Saif Ali Khan says that the offenders must be punished even if they are found guilty in old cases.\n“People are offended and they want justice. What it is happening is good and it gives you a sense that something is happening. You are removing someone (from the job) and it is a big deal. You are removing a person, but everybody has worked on a project so you have to balance things. People who have sexually harassed and abused women should pay for it.”\nAlso Read: In The Light Of #MeToo Movement, Saif Ali Khan Hints At Changes In Core Team Of ‘Sacred Games 2’\nytimg.com\nTalking about allegations against Sajid Khan and working with him on Humshakals, here’s what Saif Ali Khan said.\n“I don't remember anything like this happening genuinely because if it would have happened I would not have been comfortable in that environment or allowed it to happen in front of me… I would hate an atmosphere where women are being looked down upon or mistreated in any way. I don't think that's how an atmosphere should be.”\nWith inputs from PTI", "title": "Talking About His Own Harassment Experience, Saif Ali Khan Says #MeToo Offenders Must Be Punished", "date_publish": "15/10/2018, 12:28:24", "description": "Saif Ali Khan, recently said that he was harassed too, not sexually, but the scars of the incident, he says, are afresh. “I have also been harassed in my career, not sexually, but I have been harassed 25 years ago and I am still angry about it,” he was quoted as saying by PTI.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/talking-about-his-own-harassment-experience-saif-ali-khan-says-metoo-offenders-must-be-punished-354792.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/talking_about_his_own_harassment_experience_saif_ali_khan_says_metoo_offenders_must_be_punished_1539585739_800x420.jpg"}