{"text": "Talking About 'Thugs' Failure, Aamir Says It's Okay For The Audience To Vent Out Frustration\nTalking About 'Thugs' Failure, Aamir Says It's Okay For The Audience To Vent Out Frustration\nFailure and success both come as a package for actors. Their fate and shelf live majorly depend on how their films fare at the box-office. When it comes to box-office success, Aamir Khan is one of the most bankable actors who has given some solid blockbusters in the last few years.\nHowever, Thugs Of Hindostan was an exception that his fans would want to forget and erase from their memory. The multi-starrer film starring Amitabh Bachchan, Katrina Kaif and Fatima Sana Shaikh was one of the biggest disasters of 2018.\nInstead of dodging the questions around the failure of the film, Aamir has always taken it in his stride and bared his heart honestly.\nAfter the release, he also extended his sincere apology for the failure. Talking to media, he had said, “I would like to take full responsibility for that. You can be sure that we tried our level best.\"\nDon't Miss 468 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAnd now, talking to Pinkvilla, he again spoke about the failure of the film. Aamir says,\nPinterest\n“Many came to me saying that they liked the film. I think the audience has the full right to say exactly what they want and they can be harsh in that criticism, that is their right. If there was a certain amount of harness, then so be it. It has been a long time that I have not given any flop film... good that audience also got a chance to remove their frustration.\"\nCurrently, Khan is busy prepping for a web series adaptation of the Mahabharata.\n(Also read: ‘Aamir Khan, We Forgive You for Thugs & Dhoom’, Say Fans After Watching ‘Rubaru Roshni’)", "title": "Talking About 'Thugs' Failure, Aamir Says It's Okay For The Audience To Vent Out Frustration", "date_publish": "28/01/2019, 17:41:22", "description": "Failure and success both come as a package for actors. Their fate and shelf live majorly depend on how their films fare at the box-office. When it comes to box-office success, Aamir Khan is one of the most bankable actors who has given some solid blockbusters in the last few years.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-thugs-failure-aamir-says-it-s-okay-for-the-audience-to-vent-out-frustration-361186.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/aamir_khan_1548678395_800x420.jpg"}