{"text": "She entered the Bigg Boss house with a lot of zeal and fire. Jasleen Matharu entered the Bigg Boss house with Anup Jalota and the 'romantic' angle between them gained a lot of publicity. They received strong flak from people for their relationship but it somehow helped her sail through the show for weeks.\nShe was one of the strongest competitors on the show this season but couldn't gain the right amount of support from the audience to stay inside the house.\n(Also read: Jasleen Matharu Denies Faking Relationship With Anup Jalota, Says She Kissed Him On A Date)\nColors\nAfter being eliminated from the show, Jasleen Matharu spoke to media and shared her side of the story. She said,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nColors\n\"I am 28 and he is 65. I was shocked that it had become a national issue. I Googled all that was written about me; I saw the memes about Anupji and me.\"\nShe went on to clarify that there was no romantic angle involved between the couple. In fact, it was a joke gone 'horribly' wrong. She added,\n\"Our affair is a prank gone horribly wrong. As the show's theme was jodis, I suggested that Anupji come along; we were a guru-shishya jodi. But when Salman was introducing the housemates in the opening episode, I joked that I know Anupji for three years and that we are together. Anupji was taken aback and did not react. Had he reacted then, the matter would have ended there. I continued the joke inside the house, and he played along. But when he realized things were going too far, he was scared.\"\nApart from Jasleen, Megha Dhadhe was also eliminated from Salman Khan's show this week.", "title": "Talking About Dating Anup Jalota, Jasleen Matharu Says It's A Prank Gone Horribly Wrong", "date_publish": "08/12/2018, 17:29:15", "description": "She entered the Bigg Boss out with zeal and fire. Jasleen Matharu entered the Bigg Boss house with Anup Jalota and the 'romantic' angle between them gained a lot of publicity. They received strong flak from people for their relationship but it somehow helped her sail through the show for weeks. She was one of the strongest competitors on the show this season but couldn't gain the right amount of", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-dating-anup-jalota-jasleen-matharu-says-it-s-a-prank-gone-horribly-wrong-358202.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/jasleen_1544271977_800x420.jpg"}