{"text": "Talking About His Struggling Phase, Shah Rukh Khan Says He Was Called 'Ugly' By A Director\nTalking About His Struggling Phase, Shah Rukh Khan Says He Was Called 'Ugly' By A Director\nThere are no free lunches in life and everyone has to battle some amount of struggles before achieving success. If we talk about superstar Shah Rukh Khan, one of Bollywood's most bankable and popular actors, his journey into stardom didn't happen overnight.\nWithout a 'jugaad' in the industry, Shah Rukh Khan began his journey into the world of Cinema with baby steps that included theater and TV shows.\nAgencies\nHe got his first break in Bollywood with Deewane in 1992 and rest, as they say, is history. He went on to achieve the tag of 'King Khan' and nothing much has changed even after three decades.\nPinterest\nDuring a recent event in Lucknow, Khan took everyone down the memory lane as he spoke about his initial struggling days in Hindi Cinema. Talking about the days when the goal of becoming a superstar looked like a far-fetched dream, he said,\nDon't Miss 343 SHARES 555 SHARES 263 SHARES\nAgencies\n\"I was practical and knew that I didn’t look the hero type, nor couldn’t I dance like one. In fact, a director once told me that he could use me anywhere because I was so ugly and not the hero-type.\"\nHe also revealed how he was in doubts about taking up a romantic film but it was Yash Chopra, who told him that if he wanted to be a legend he should be doing romantic films and that's how his journey began.\nKhan is currently promoting his film Zero, that stars Anushka Sharma and Katrina Kaif in lead roles and will hit the theaters on December 21.", "title": "Talking About His Struggling Phase, Shah Rukh Khan Says He Was Called 'Ugly' By A Director", "date_publish": "18/12/2018, 13:05:48", "description": "There are no free lunches in life and everyone has to struggle before achieving success in life. If we talk about superstar Shah Rukh Khan, one of Bollywood's most bankable and popular actors, his journey into stardom didn't happen overnight. Without a 'jugaad' in the industry, Shah Rukh Khan began his journey into the world of Cinema with baby steps that included theater and TV shows.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/talking-about-his-struggling-phase-shah-rukh-khan-says-he-was-called-ugly-by-a-director-358810.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/shah_rukh_khan_1545116432_800x420.jpg"}