{"text": "1. Vishal Bhardwaj Points Out Error In National Anthem, Tells I&B Ministry To Get It Rectified\n\"Heard our national anthem produced by @Films_Division and @MIB_India during @MumbaiFilmFest. There is a technical glitch at \"Gahe Tav Jai Gaatha\", seems to be a sound transfer issue. Goes off tune and hurts ear and soul. Can @MIB_India please get this rectified?,\" he tweeted.\n2. Tanushree Dutta Slams ‘Sex & Money Obsessed’ Rakhi Sawant, Asks If She's Got Plastic Surgery Done On Brain\n“The only time I interacted with her was at the international airport lounge when I was flying out of India many years ago for a stage show abroad… She told me that I will go to hell if I don't believe in Jejus… You sex and money obsessed moron..Have you done plastic surgery on your brain also?? You will perish along with your lies and so will your friends who have put you up for it,” Tanushree told BollywooLife in a statement.\n3. The Cat Is Finally Out Of The Bag! Anup Jalota Confesses There’s No Love Story With Jasleen\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n“People are not able to understand our relationship. We don't have any kind of love story. We just share a musical relationship. She is my student and I am her teacher. I help her in learning music. There is no girlfriend-boyfriend kind of relationship between us and we are also not involved in any romantic and physical relation,” he was quoted a saying by IANS.\n4. The Wedding Festivities Begin As Priyanka Chopra Shines Bright At Her Bridal Shower!\nPriyanka Chopra and Nick Jonas have not yet confirmed their wedding date as of now, but looks like marriage is definitely on the cards soon. They gave a pleasant surprise to their fans announcing their relationship on social media after their Roka ceremony in Mumbai. Will they once again leave fans startled by exchanging the wedding vows in a private ceremony? Only time will tell.\n5. 50 Cent Buys 200 Seats Of Ja Rule Concert To Make It Look Empty And It's Both Hilarious & Sad!\nTaking craziness to another level, 50 Cent just fuelled up his fallout against Ja Rule. He bought 200 tickets of his concert in order to make it look empty. He even posted about it on social media. However, he deleted it later.", "title": "Tanushree Dutta Slams Rakhi Sawant, Vishal Bhardwaj Finds Glitch In National Anthem & More From Ent", "date_publish": "29/10/2018, 18:36:01", "description": "The war of words between Rakhi Sawant and Tanushree Dutta isn’t over yet. After slamming her for belittling her and rubbishing her claims of being a drug addict, Tanushree Dutta has once again hit back the ultimate item girl of Bollywood, Rakhi Sawant for mudslinging.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tanushree-dutta-slams-rakhi-sawant-vishal-bhardwaj-finds-glitch-in-national-anthem-more-from-ent-355676.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/tanushree_slams_rakhi_sawant_vishal_bhardwaj_finds_glitch_in_national_anthem__more_from_ent_1540816831_800x420.png"}