{"text": "The war of words between Rakhi Sawant and Tanushree Dutta isn’t over yet. After slamming her for belittling her and rubbishing her claims of being a drug addict, Tanushree Dutta has once again hit back the ultimate item girl of Bollywood, Rakhi Sawant for mudslinging.\nAlso Read: Tanushree Dutta Hits Back At Rakhi Sawant’s Outrageous Claim, Slaps Rs 10 Crore Defamation Suit\nWhen Rakhi Sawant called her a liar and a drug addict, Tanushree slapped Rs 10 crore defamation suit on her. Then, Rakhi went on to say in a press conference that Tanushree is a lesbian and she raped her multiple times, about 12 years ago.\nHitting back at Rakhi Sawant and her outrageous claims, Tanushree in a statement called her “sex and money obsessed” and asked is she had done a plastic surgery on her brain.\nDon't Miss 245 SHARES 2.2 K SHARES 12.5 K SHARES\nAlso Read: Rakhi Sawant & Her Outrageous Claims About Anup Jalota & His Girlfriend Will Make You Cringe\nTanushree Dutta said that the only time she met her was at the airport when she was leaving for the US. That is when Rakhi Sawant tried to influence her into converting to Christianity.\n“The only time I interacted with her was at the international airport lounge when I was flying out of India many years ago for a stage show abroad… She told me that I will go to hell if I don't believe in Jejus… You sex and money obsessed moron..Have you done plastic surgery on your brain also?? You will perish along with your lies and so will your friends who have put you up for it,” Tanushree told BollywooLife in a statement.\nAlso Read: Rakhi Sawant Makes A Rare Discovery, Says Nose Hair Causes Heart Attacks. Okay, Then!", "title": "Tanushree Dutta Slams ‘Sex & Money Obsessed’ Rakhi Sawant, Asks If She's Got Plastic Surgery Done On Her Brain", "date_publish": "29/10/2018, 13:46:46", "description": "When Rakhi Sawant called her a liar and a drug addict, Tanushree slapped Rs 10 crore defamation suit on her. Then, Rakhi went on to say in a press conference that Tanushree is a lesbian and she raped her multiple times, about 12 years ago. Hitting back at Rakhi Sawant and her outrageous claims, Tanushree in a statement called her “sex and money obsessed” and asked is she had done a plastic surgery", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tanushree-dutta-slams-sex-money-obsessed-rakhi-sawant-asks-if-she-s-got-plastic-surgery-done-on-her-brain-355646.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/tanushree_dutta_slams_sex__money_obsessed_rakhi_sawant_asks_if_shes_done_plastic_surgery_on_bra_1540800544_800x420.jpg"}