{"text": "Tanushree Dutta's case is one of those that will definitely go down in the history of the film industry and India both. Yes, the former actress slapped charges on Nana Patekar for misbehaving with him during the shooting of Horn Ok Pleassss and since then all hell broke loose.\nLittle did she know that she started a mega revolution. The #MeToo movement that we thought will only be limited to Hollywood, courtesy Harvey Weinstein seeped into Bollywood in no time. More and more women came out to share their stories of sexual harassment at their workplace.\nANI\nIn a new development, Tanushree who has been vocal about Nana's misconduct on that film's sets, has now finally filed FIR against him. Not only Nana, but the FIR has also been lodged against director Rakesh Sarang, choreographer Ganesh Acharya and producer Sami Siddiqui for being witnesses and not taking a stand.\nDon't Miss 106 SHARES 282 SHARES 862 SHARES\nTwitter\nThe actress was accompanied to the Oshiwara police station by her lawyer, Nitin Satpute.\nSpeaking about the details of the FIR, Satpute said, \"The statement of Tanushree Dutta has been recorded in English so that she can understand the language. They were writing the statement in Marathi. However, we requested them to write it in English so that what happened 10 years is not repeated again.\"\nTanushree went through a traumatic day way back in 2008 when she was filming for the film and was attacked by a mob when she refused to shoot with Nana. Since then, the incident stayed with her. She did speak about it with media agencies but she was quietly ousted from the industry.", "title": "Tanushree Dutta Finally Records Her Statement, Files FIR Against Nana Patekar & Others", "date_publish": "11/10/2018, 11:50:26", "description": "Besides Patekar, the FIR has also been lodged against director Rakesh Sarang, Ganesh Acharya and producer Sami Siddiqui. Tanushree went through a traumatic evening way back in 2008 when she was filming for the film and was attacked by a mob when she refused to shoot with Nana. Since then, the incident stayed with her. She did speak about it with media agencies but she was quietly ousted.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/tanushree-dutta-finally-records-her-statement-files-fir-against-nana-patekar-others-354570.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/tanushree_1539237038_800x420.jpg"}