{"text": "1. Tanushree Dutta Hits Back At Rakhi Sawant’s Outrageous Claim, Slaps Rs 10 Crore Defamation Suit\n\"We have filed a criminal and civil defamation case against Rakhi Sawant for maligning my client's character and image,” Tanushree’s lawyer told Republic TV.\n2. Things She Hates About Ranveer Singh To His Best Qualities, Deepika Gushes About Her Husband-To-Be Over 'Koffee'\nWhat is that she hates about Ranveer Singh? Deepika Padukone said she hates his lifestyle and sleeping patterns.\n3. Blessings From Queen Bey? Isha Ambani's Wedding Will Have A Special Performance By Beyonce!\n“Isha is a big fan of American singer Beyoncé which is why Mukesh Ambani decided to have the pop star perform at the Sangeet ceremony. Both Anand and Isha are super excited to have the celebrated singer perform at their wedding. Some of Bollywood stars will also be doing a special performance at Isha’s cocktail in Udaipur,” Filmfare quoted a source as saying.\nDon't Miss 365 SHARES 161 SHARES 183 SHARES 1 K SHARES\n4. From Ranbir Singing Channa Mereya To Ranveer's Lehenga, DeepVeer’s Wedding Memes Are On Point!\n*ranveer orders a lahnga*\ndeepika : wow it's so pretty. thank you\nRanveer : pic.twitter.com/5XABjG19EG — Manish🇮🇳 (@Man_isssh) October 21, 2018\nNovember 15, it is! After months of speculations, Deepika Padukone and Ranveer Singh have finally confessed about their love and announced their wedding date while seeking everyone’s blessings.\n5. After Getting Brutally Killed In S1, Ned Stark Will Return In GoT Finale For A Special Episode!\n“It was the last episode, so we all got together… They decided to get all the characters together for a bit for this big show in Belfast and he kind of hosted the evening,” he told The Hollywood Reporter.", "title": "Tanushree Dutta Slaps Defamation Case On Rakhi Sawant, DeepVeer’s Wedding Memes & More From Ent", "date_publish": "22/10/2018, 18:21:42", "description": "From Tanushree Dutta slapping a Rs 10 crore defamation case on Rakhi Sawant to Deepika Padukone spilling secrets of her relationship with Ranveer Singh on Koffee With Karan season 6, here's all that rocked the world of entertainment and bollywood today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/tanushree-dutta-slaps-defamation-case-on-rakhi-sawant-deepveer-s-wedding-memes-more-from-ent-355247.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/tanushree_dutta_slaps_defamation_case_on_rakhi_sawant_deepveers_wedding_memes__more_from_ent_1540212738_800x420.png"}