{"text": "She may have disappeared from films and the industry for years but Tanushree Dutta came back and how! It wasn't a usual comeback with a film but she ended up becoming the unintentional torch-bearer of #MeToo movement in India. After she shared her ordeal, there were many women who came out and shared their stories of harassment and injustice.\nIn a recent interview with Mid-day, Tanushree added how the industry is at least making an honest attempt to adopt a zero-tolerance policy towards sexual harassment. She said,\n\"People have been conditioned to think that it's okay for men to behave inappropriately and actresses have to compromise without complaining. Fortunately, the newer generation is opinionated and will phase out the patriarchal thinking. People have been dropped from projects, studios have become careful to not hire names that are accused.\"\nBut she is still very disappointed that there are actresses who failed to come out to share their stories. She added,\n\"It wasn't hard to miss how several big names maintained a studied silence on the subject. Point out the dichotomy, and she says, it's disappointing that not many actresses have spoken up on the matter. They probably gave themselves over to their ambitions. Some stories of Swara [Bhasker] and Kangana's [Ranaut] struggles have been chronicled, but several others disappeared.\"\nWhile Tanushree has filed a complaint against Nana Patekar, things have not moved as they should have by now.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Tanushree Dutta Is Disappointed That Many Actresses Still Haven't Shared Their #MeToo Stories!", "date_publish": "08/11/2018, 16:59:18", "description": "At the same time, the actress also spoke about the zero tolerance policy adopted by the industry towards sexual harassment. She reportedly said that people have been conditioned to think that it's okay for men to behave inappropriately and actresses have to compromise without complaining.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/tanushree-dutta-is-disappointed-that-many-actresses-still-haven-t-shared-their-metoo-stories-356305.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/tanushree_1541678075_800x420.jpg"}