{"text": "There is a very thin line between being funny and being downright disrespectful and crassy and looks like Rakhi Sawant has crossed that. For many of us, going through Sawant's Instagram account was a source of endless laughter and entertainment, now the time has come to boycott her.\nIf you are wondering why, let me take you through. Just a few days ago, she held a press conference, where she accused Tanushree Dutta of raping her multiple times twelve years ago. Saying that Tanushree is actually a 'man from the inside', she also said that she is a lesbian. In her absurd claims, she added how Tanushree used to take her to rave parties and forced her to consume drugs.\nAnd now, the lady in question has responded. Issuing a statement against Sawant's obnoxious claims, Tanushree said,\n\"For those uninitiated in the art of guerrilla war tactics: Smear campaigns never run fair or square. So just to set the record straight: I'm not a drug addict, I don't smoke or drink and I'm most definitely not a lesbian.\"\nTanushree added how, \"too much of a woman for this patriarchal and misogynistic cesspool to handle\" and that's the reason why Rakhi is making \"perverted character assassination attempts\" to silence her, she said.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nShe concluded in a graceful way make an important point on why we shouldn't dilute the #MeToo movement. She said,\n\"It's clearly not working. Let's not make a jokery (sic) of such a serious movement that can potentially bring positive changes of mindset in our society,\"", "title": "Tanushree Dutta Slams Rakhi Sawant's Obnoxious Claims, Says She's Neither A Drug Addict Nor A Lesbian", "date_publish": "27/10/2018, 11:57:26", "description": "Tanushree said, \"For those uninitiated in the art of guerrilla war tactics: Smear campaigns never run fair or square. So just to set the record straight: I'm not a drug addict, I don't smoke or drink and I'm most definitely not a lesbian,\" Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/tanushree-dutta-slams-rakhi-sawant-s-obnoxious-claims-says-she-s-neither-a-drug-addict-nor-a-lesbian-355549.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/rakhi_sawant_1540623111_800x420.jpg"}