{"text": "Rakhi Sawant cannot always get away by making outrageous claims, it seems. The woman who is a controversy in herself, is known for her unintentionally funny, bizarre and ridiculous statements.\nRecently, Rakhi Sawant, who had replaced Tanushree Dutta in the item song of 2008 movie Horn Ok Pleasss after Nana Patekar allegedly harassed the latter actress, had accused Tanushree of seeking publicity. Not only that she even called her a liar and said that her allegations against Nana Patekar were “cooked up stories.”\nRakhi Sawant had, in fact, claimed that Tanushree Dutta was a drug addict and that she was very high when the incident took place.\nTanushree Dutta has finally responded to Rakhi Sawant’s outrageous claims. She has filed Rs. 10 crore defamation case against her.\nAP\nDon't Miss 1.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES\n\"We have filed a criminal and civil defamation case against Rakhi Sawant for maligning my client's character and image,” Tanushree’s lawyer told Republic TV.\nMeanwhile, Rakhi Sawant’s response to this highly awaited.\nAlso Read: Rakhi Sawant & Her Outrageous Claims About Anup Jalota & His Girlfriend Will Make You Cringe", "title": "Tanushree Dutta Hits Back At Rakhi Sawant’s Outrageous Claim, Slaps Rs 10 Crore Defamation Suit", "date_publish": "22/10/2018, 13:57:29", "description": "Recently, Rakhi Sawant, who had replaced Tanushree Dutta in the item song of 2008 movie Horn Ok Pleasss after Nana Patekar allegedly harassed the latter actress, had accused Tanushree of seeking publicity. Not only that she even called her a liar and said that her allegations against Nana Patekar were “cooked up stories.” Tanushree Dutta has finally responded to Rakhi Sawant’s outrageous claims. S", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tanushree-dutta-hits-back-at-rakhi-sawant-s-outrageous-claim-slaps-rs-10-crore-defamation-suit-355201.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/tanushree_dutta_hits_back_at_rakhi_sawants_outrageous_claim_slaps_rs_10_crore_defamation_case_1540195252_800x420.png"}