{"text": "Nepotism rocks! Well, Bollywood and nepotism go hand in hand and another product of nepotism that will be launched soon is Suniel Shetty's son Ahan. If reports are to be believed, Ahan is all set to enter the world of films with Tadap, which will be a remake of the Telugu blockbuster, RX100. The film will be helmed by Milan Luthria.\nReports further claims that the lead actress locked for the film is Tara Sutaria. Talking to Bollywood life, Milan Lutharia confirmed:\n\"Yes, we have finalised Tara for the film. More details will be announced later.\" He added,\n\"Remaking a cult film like ‘RX 100’ is thrilling for me for reasons more than one. First, it marks the debut of the charismatic Ahan Shetty. Next, it’s a riveting and haunting story ripe for a remake. And of course, it has Sajid as the producer the perfect support a director can ask for. It goes without saying that I can’t wait to embark on this journey that promises to be challenging and exciting at the same time.”\nFor Tara who has not even technically entered the world of films will make her debut with SOTY 2 this year and will also be seen in Marjaavan with Sidharth Malhotra!\nDon't Miss 542 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nShe has definitely struck gold!", "title": "Tara Sutaria All Set To Romance Debutant Ahan Shetty In RX100 Remake 'Tadap'!", "date_publish": "26/03/2019, 13:50:11", "description": "Nepotism rocks! Well, Bollywood and nepotism go hand in hand and another product of nepotism that will be launched soon is Suniel Shetty's son Ahan. If reports are to be believed, Ahan is all set to enter the world of films with Tadap, which will be a remake of the Telugu blockbuster, RX100. The film will be helmed by Milan Luthria.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/tara-sutaria-all-set-to-romance-debutant-ahan-shetty-in-rx100-remake-tadap-364321.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ahaan_shetty_1553588582_800x420.jpg"}