{"text": "Team Simmba Makes Their Debut In KJo's Hilarious 'Toodles' Video And It'll Crack You Up!\nTeam Simmba Makes Their Debut In KJo's Hilarious 'Toodles' Video And It'll Crack You Up!\nOne of Karan Johar's hit productions till today is his #Toodles series. The filmmaker started this hilarious series of Instagram videos where his banter with co-judges Kirron Kher and Malaika remain the key highlight.\nIn no time, the video became so popular that KJo started doing it every week and for fans, it has become something to keenly look forward to.\nGiving this Toodles video a filmy twist was the team of Simmba. Rohit Shetty, Sara Ali Khan and Ranveer Singh were on India's Got Talent for the promotion of their movie.\nCaptioning one of the videos as ‘The Simmba toodles integration!, one of the videos begin with KJo commenting on Sara's colorful outfit. He says,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Didn't miss a color, did you?\"\nTo which she replies, “No, have all of them.”\nThe two videos that KJo shared have all elements of fun, joy and yes, Kirron Kher again managed to steal the cake!\nColors\nWatch this hilarious banter between Team Simmba and India's got talent's judges KJo, Malaika Arora and Kirron Kher right here!", "title": "Team Simmba Makes Their Debut In KJo's Hilarious 'Toodles' Video And It'll Crack You Up!", "date_publish": "20/12/2018, 12:22:34", "description": "Giving this Toodles video a filmy twist was the team of Simmba. Rohit Shetty, Sara Ali Khan and Ranveer Singh were on India's Got Talent for the promotion of their movie. Captioning one of the videos as ‘The Simmba toodles integration!, one of the videos begin with KJo commenting on Sara's colorful outfit.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/team-simmba-makes-their-debut-in-kjo-s-hilarious-toodles-video-and-it-ll-crack-you-up-358955.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/ranveer_1545287194_800x420.jpg"}