{"text": "It's not new that Sikhs have been victims at the USA airport during security checks. While air travel has become difficult for everyone, it's more so for the Sikh community esecially when travelling overseas.\nThe challenges they face during frisking and swab machines went onto only become bigger when Indianapolis-based Khalsa decided to intervene. Meet Sikh entrepreneur Gurinder Singh Khalsa, who was denied from boarding a flight in Buffalo, New York when he refused to remove his turban after successfully passing through each security measure at the airport.\nTwitter\nFollowing suit, Khalsa worked towards bringing the issue in front of the government and made the US change their headgear policies across the nation. And now an 18-year-old American teenager has made a short film, 'Singh' made on his true story in 2007 and the mega campaign that shook the nation.\nDirected by Jenna Ruiz, a student and actor from Indiana said, \"It is an honour to be able to showcase a moment in history that led to change in our TSA (Transportation Security Administration) Policy regarding the removal of headgear, said Ruiz, who is pursuing bachelors degree in Nuclear Medicine Technology at Indiana University-Purdue University Indianapolis.\nPTI\nDon't Miss 862 SHARES 346 SHARES 183 SHARES 151 SHARES 185 SHARES\nKhalsa was recently conferred with the prestigious Rosa Parks Trailblazer award for his campaign. In the short film, Khalsa is made to choose between his religious beliefs and his flight to see his mother in her last days.\n'SINGH' has been filmed at the Indianapolis International Airport and is slated to be released next month. I took this stand for all those who believe in religious liberty and freedom of faith,\" Khalsa had said earlier in a media statement.\nSBS\n\"Incidents like this one happens for the greater good, where misunderstandings occur between people of different backgrounds and faith, strengthen our society,\" said Khalsa, who recently announced that he will enter electoral politics in America and will run for City Council of Fishers\nInputs from PTI", "title": "Teenager Makes Short Film On Trailblazer Gurinder Singh Khalsa Who Made US Change Turban Policy", "date_publish": "13/02/2019, 17:46:31", "description": "Indianapolis-based Khalsa worked towards bringing the issue to the attention of the US Congress, which later resulted in headgear policies being changed in airports nationwide. Indianapolis-based Khalsa worked towards bringing the issue to the attention of the US Congress, which later resulted in headgear policies being changed in airports nationwide.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/teenager-makes-short-film-on-trailblazer-gurinder-singh-khalsa-who-made-us-change-turban-policy-362116.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/khalsa_1550060493_800x420.jpeg"}