{"text": "It was a normal day for TV actresses Bhargavi (20) and Anusha Reddy (21). They were on their way back home after completing the shoot of a serial. However, as they say, life is unpredictable; they both lost their lives in a road accident.\nThe incident took place at Telangana's Vikarabad district on Wednesday. They were both in the same car along with another person Vinay Kumar and cab driver Chakri – who are both injured after the incident.\nAccording to the police, the car driver was trying to avert collision with a truck which was coming from the opposite direction. However, in the process, he hit a roadside tree near Appareddy Guda in the early hours of the day.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nBhargavi (20) died on the spot. Anusha Reddy was taken to the hospital but while being shifted she succumbed to her injuries. The injured were admitted to government-run Osmania Hospital in Hyderabad.\nTwitter\nBhargavi acted in the popular daily soap 'Mutyala Muggu'. Anusha Reddy was an upcoming actress. Both hailed from Telangana. The television artists had gone to Vikarabad on Monday for shooting in Ananthagiri forest. After completing the shooting, the team was returning to Hyderabad.\nWith inputs from IANS", "title": "Telugu TV Actresses Bhargavi And Anusha Reddy Die In A Car Accident While Returning From Shoot", "date_publish": "18/04/2019, 12:59:49", "description": "Two Telugu TV actresses have died in a road accident. It was a normal day for TV actresses Bhargavi (20) and Anusha Reddy (21). They were on their way back to home after having completed the shoot of a serial. However, as they say, life is unpredictable; they both lost their lives in a road accident.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/telugu-tv-actresses-bhargavi-and-anusha-reddy-die-in-a-car-accident-while-returning-from-shoot-365674.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/telugu_tv_actresses_die_in_road_accident_1555571131_800x420.png"}