{"text": "1. Nawazuddin Fits The Role Of Shiv Sena Supremo Bal Thackeray Like A Glove & The Trailer Is Proof\nThe trailer of the most awaited film based on the life of Bal Thackeray is finally out. And going by the looks of it, seems like Nawazuddin has aced the role. After watching this goose-bumps inducing trailer, you'll be left wanting for more.\n2. Janhvi Kapoor To Play Gunjan Saxena, India’s First Woman Pilot Of Kargil & Here’s The 1st Look\nWhile she is also doing another film with Karan Johar, which is a multi-starrer historical drama Takht, she has another one on cards with KJo – a biopic on Indian Air Force Pilots Gunjan Saxena. Here’s the first look!\n3. From Alia Bhatt To Akshay Kumar, Bollywood Celebs Rang In Christmas With Love, Laughter & Fun\nChristmas is always full of love, joy and cheerfulness. Like most of us, Bollywood celebrities also love spending time with their families especially during festivals.\n4. Manisha Koirala Shares The Biggest Takeaway From Her Cancer Battle, Reveals How It All Began\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n“To take my mind off shoots, to numb myself, I started drinking. If I was on a diet, it would be vodka. I remember my ex-boyfriend once telling me that I had no sense of balance. He said, ‘You are a workaholic. You either work hard or party hard. Where is your sense of balance?’ Of course I was aware that I had a tendency to go overboard. Many people around me had tried to tell me that.\"\n5. Siddharth Asks If He Can Remake 2018's Best Film Andhadhun, Ayushmann Khurrana Gives A Go-Ahead\nWho would have imagined that a film like Andhadhun, which wasn’t promoted extensively, would do wonders at the box office! The Ayushmann Khurrana movie received immense love from the audiences as well as critics. So much so, that it has been named as the best film of 2018 by IMDb. It has been more than 100 days since the movie was released, and it is still playing in cinema halls.", "title": "Thackeray Trailer Starring Nawazuddin Is Out, Janhvi To Play Gunjan Saxena & More From Ent", "date_publish": "26/12/2018, 18:42:41", "description": "Flight lieutenant Gunjan Saxena is one of the unsung heroes of the country. Did you know she is India’s first female IAF pilot who helped evacuate soldiers during the Kargil War in 1999? The braveheart, along with her fellow lieutenant Srividya Rajan faced a lot of hurdles, but she emerged a warrior and a fighter. Following the trend of biopics in Bollywood, Karan Johar is making a film on the Gu", "authors": [], "url": "https://www.indiatimes.com/entertainment/thackeray-trailer-starring-nawazuddin-is-out-janhvi-to-play-gunjan-saxena-more-from-ent-359330.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/thackeray_trailer_starring_nawazuddin_is_out_janhvi_kapoor_to_play_gunjan_saxena__more_from_ent_1545828575_800x420.png"}