{"text": "Aanand L Rai will be working with Shah Rukh Khan for the very first time. Considering the cast of Zero that comprises of Katrina Kaif, Anushka Sharma and SRK, this project had to be nothing but amazing.\nIn this film, SRK will be seen playing the role of a man who is vertically challenged but lives life on his own terms and conditions.\nTwitter\nThe film also has two gorgeous ladies, Katrina Kaif and Anushka Sharma and these two will be seen in a total hatke avatar. The film is over but looks like the filmmaker is going through withdrawal symptoms of being on the sets with his actors.\nSo much so, that he has shared an emotional post dedicated to the lead actors of his upcoming film Zero, Shah Rukh Khan, Anushka Sharma and Katrina Kaif, expressing his gratitude towards them for making beautiful memories during the movie's journey.\nDon't Miss 3.5 K SHARES 343 SHARES 555 SHARES 518 SHARES\nTwitter\nTaking to his official Twitter handle, he uploaded unseen pictures of him with the actors, writing, “Sometimes we never come to know the value of a moment until it becomes a memory. Thank you for such beautiful memories in this heartfelt journey of #zero. @iamsrk Khan Saab , @AnushkaSharma & #KatrinaKaif ! #Zero21Dec.”\nSometimes we never come to know the value of a moment until it becomes a memory. Thank you for such beautiful memories in this heartfelt journey of #zero. @iamsrk Khan Saab , @AnushkaSharma & #KatrinaKaif ! #Zero21Dec pic.twitter.com/8ui5JwtQJ2 — AANAND L RAI (@aanandlrai) November 17, 2018\nThe trailer and posters of the film have already created immense buzz on social media since their release. Produced by Gauri Khan, Zero is all set to hit the big screens on December 21, this year.", "title": "Thanking SRK, Anushka & Katrina For A 'Heartfelt Journey', Aanand L Rai Shares BTS Pics Of Zero", "date_publish": "19/11/2018, 14:13:42", "description": "Aanand L Rai will be first time working with Shha Rukh Khan, the project had to be nothing but amazing. The duo collaborated with Zero where SRK plays the role of a man who is vertically challenged but lives his life on his own terms and conditions. The film also had two gorgeous ladies Katrina Kaif and Anushka Sharma and they two will be seen in a total hatke avatar. The film is over but looks li", "authors": [], "url": "https://www.indiatimes.com/entertainment/thanking-srk-anushka-katrina-for-a-heartfelt-journey-aanand-l-rai-shares-bts-pics-of-zero-356946.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/katrina_1542615615_800x420.jpg"}