{"text": "The Second Song From Gully Boy 'Meri Gully Mein' Will Get You Even More Excited For The Film\nThe Second Song From Gully Boy 'Meri Gully Mein' Will Get You Even More Excited For The Film\nIf there is one film that has managed to create a lot of buzz this year, it is Gully Boy.\nHelmed by Zoya Akhtar, the film brings together two of the most powerful stars we have today-Alia Bhatt and Ranveer Singh. Be it the trailer or the first track, people are loving the energy, the vibe and the fact that Ranveer Singh once again will be seen in a compelling and new avatar.\nToday, the second song from the film, titled Meri Gully Mein was released and it is a remix of Divine and Naezy’s breakout single of the same name.\nFor the uninitiated, the film will revolve around the lives of the rappers who became insanely popular after their DIY-style music video for Meri Gully Mein made them and their ‘gully rap’ popular.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe film is loosely based on the lives of Divine and Naezy - both Bombay rappers.\nThe video of the song that has been unveiled by Ranveer has scenes from the same Mumbai chawls in which Naezy originally grew up. The song throws some more spotlight on Singh's character and the mood of the film.\n(Also read: Is India Finally Waking Up To The Desi Underground Rap Scene With Ranveer Singh's Gully Boy?)\nExcel Entertainment\nWithout further ado, watch the song right here.", "title": "The Second Song From Gully Boy 'Meri Gully Mein' Will Get You Even More Excited For The Film", "date_publish": "22/01/2019, 14:42:27", "description": "The film is loosely based on the lives of Divine and Naezy - both Bombay rappers. The video of the song that has been unveiled by Ranveer has scenes from the same Mumbai chawls in which Naezy grew up. The song throws some more spotlight on Singh's character and the mood of the film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-second-song-from-gully-boy-meri-gully-mein-will-get-you-even-more-excited-for-the-film-360841.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/gully_boy_1548148556_800x420.jpg"}