{"text": "The First Teaser Of Lion King Is Here And The Internet Can't Stop Gushing Over Baby Simba\nThe First Teaser Of Lion King Is Here And The Internet Can't Stop Gushing Over Baby Simba\nFor many who grew up in the 90's, connecting to songs, movies and animated characters from that era holds a super special place. And if you have been a Disney fan, then this piece of news is ever more special.\nBecause for people in the 90s, this is childhood, and for others, you would have either grown watching the animated film or are about to witness the the cutest thing EVER. Yes, Disney dropped the much anticipated teaser of The Lion King.\nIt's a first live action remake of the movie after the success of The Jungle Book. The upcoming film will star the voices of Donald Glover, Seth Rogen, Chiwetel Ejiofor, Billy Eichner, John Oliver, Keegan-Michael Key, Beyoncé Knowles-Carter, and James Earl Jones.\nWatch the trailer.\nDon't Miss 153 SHARES 862 SHARES 346 SHARES 183 SHARES 126 SHARES\nThe director Jon Favreau’s all-new The Lion King journeys to the African savanna where a future king must overcome betrayal and tragedy to assume his rightful place on Pride Rock.\nThe minute the trailer hit the screens, it managed to break the internet. Social media has been buzzing about cute Simba is looking. Take a look at the roaring reactions on Twitter.\nCan’t wait to see Lion King opening night and scream at the top of my lungs every time baby Simba is onscreen I MEAN COME ONNNN pic.twitter.com/NEvNeiU1m8 — Zach Kornfeld (@korndiddy) November 23, 2018\nSo pumped for the new Lion King movie but I’m not ready to watch Mufasa die in HD 😭😭😭 — Eric Lambert (@ericthefall) November 23, 2018\nin the summer of 2019 i will weep, because... The Lion King - is my childhood ❤️🦁 pic.twitter.com/wS473MsW3J — 𝓁𝑒𝓇𝒶 (@lera_skolpneva) November 23, 2018\nJust look at this face 💕#LionKing come soonnnnn pic.twitter.com/IEuNTzUBo8 — Bano (@BanoBee) November 23, 2018\nDisney's The Lion King releases in theatres on July 19, 2019.", "title": "The First Teaser Of Lion King Is Here And The Internet Can't Stop Gushing Over Baby Simba", "date_publish": "23/11/2018, 16:07:37", "description": "For many who grew up in the 90's, connecting to songs, movies and animated characters from that era holds a special place. And if you have been a Disney fan, then here's a treat for everyone. For 90s, this is childhood, and for others, this is cutest thing you will ever see. Yes, Disney dropped the much anticipated teaser of The Lion King.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/the-first-teaser-of-lion-king-is-here-and-the-internet-can-t-stop-gushing-over-baby-simba-357255.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/lion_king_1542969890_800x420.jpg"}