{"text": "The Countdown Has Begun! Sophie Turner & Joe Jonas Head To India For Priyanka Chopra & Nick Jonas’ Wedding\nThe Countdown Has Begun! Sophie Turner & Joe Jonas Head To India For Priyanka Chopra & Nick Jonas’ Wedding\nPeople are still not over Deepika Padukone and Ranveer Singh’s dreamy wedding, and the countdown for another big one has already begun. Priyanka Chopra and Nick Jonas are all set to tie the knot in Jodhpur on Dec 2, and looks like the preparations are going on in full swing.\nPriyanka Chopra’s Mumbai house is all decked up already.\nAlso Read: Also Read: With Only A Few Days Left For The D-Day, Bride-To-Be Priyanka Chopra’s Mumbai House Is All Decked Up\nWhat’s more? The Baraatis are on their way. Earlier, reports suggested that Hollywood celebs will fly to India to attend Priyanka-Nick AKA Nickyanka’s wedding. And now, according to buzz, Sophie Turner and Joe Jonas are enroute to India already.\nSophie Turner and Joe Jonas were spotted with a fan on their way to Mumbai. The picture was reportedly taken at Dubai airport. Fans are speculating that the duo must have already landed in Dubai since the video was posted hours ago.\nDon't Miss 365 SHARES\n“Though Prince Harry and Meghan, the Duchess of Sussex, may not make it, many Hollywood names are expected. Since it will be their first brush with an Indian wedding, Priyanka wants to make it special,” a source told Mid-Day.\nAlso Read: Nick Jonas Is Enroute To India For His Wedding With Priyanka Chopra & Fans Are Already Calling Him As 'Jiju'", "title": "The Countdown Has Begun! Sophie Turner & Joe Jonas Head To India For Priyanka Chopra & Nick Jonas’ Wedding", "date_publish": "26/11/2018, 17:43:20", "description": "Priyanka Chopra and Nick Jonas are all set to tie the knot in Jodhpur on Dec 2, and looks the preparations have begun. The Baraatis are on their way. Earlier, reports have suggested that Hollywood celebs will fly to India to attend Priyanka-Nick AKA Nickyanka’s wedding. And now, according to reports, Sophie Turner and Joe Jonas are heading to India already.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-countdown-has-begun-sophie-turner-joe-jonas-head-to-india-for-priyanka-chopra-nick-jonas-wedding-357421.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/sophie_turner__joe_jonas_head_to_india_for_priyanka_chopra__nick_jonas_wedding_1543233775_800x420.png"}