{"text": "Political drama films are the latest fad in Bollywood. Beginning the year with The Accidental Prime Minister, Thackeray to now Vivek Oberoi starrer PM Narendra Modi, this genre of films are being made in abundance. Needless to say, the reason is the Lok Sabha Elections 2019 that have kick-started in the country.\nWhile the first two saw its release, EC yesterday stalled PM Modi till polling doesn't get over. Another such movie that has run into troubled waters is The Tashkent Files. The movie is a thriller being helmed by Vivek Agnihotri.\nThe Tashkent Files revolves around the mysterious death of India's 2nd Prime Minister Shri Lal Bahadur Shastri and attempts to uncover if he had actually died a natural death or as alleged assassination.\nYoutube/Screengrab\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAnd that has what has lead to Lal Bahadur Shastri's grandson Vibhakar Shashtri sending a legal notice.\nTwitter\n“Last night we have been served a legal notice seeking to stop the release of the film by the prominent Congress member and also ex-Secretary of Congress who also happens to be Lal Bahadur Shastri’s grandson and a close aide of the top family,” Agnihotri said in a statement on Wednesday.\nGrandsons of late #PrimeMinister Lal Bahadur Shastri have served a legal notice on @vivekagnihotri & the production house against release of movie #TashkentFiles. Vibhakar & Diwakar Shastri say timing of movie is suspect & no permission was sought from the immediate family. — Utkarsh Anand (@utkarsh_aanand) April 10, 2019\nNot only has the filmmaker sought permission, the family is even questioning the timing of the film. The Tashkent Files features Mithun Chakraborty, Naseeruddin Shah, Shweta Basu, Pankaj Tripathi, Vinay Pathak, Mandira Bedi, Pallavi Joshi, Ankur Rathee and Prakash Belawadi.", "title": "The Tashkent Files Lands In Trouble, Lal Bahadur Shashtri's Grandson Sends Legal Notice To The Makers", "date_publish": "11/04/2019, 14:00:02", "description": "“Last night we have been served a legal notice seeking to stop the release of the film by the prominent Congress member and also ex-Secretary of Congress who also happens to be Lal Bahadur Shastri’s grandson and a close aide of the top family,” Agnihotri said in a statement on Wednesday.“Last night we have been served a legal notice seeking to stop the release of the film by the prominent Congress", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/the-tashkent-files-lands-in-trouble-lal-bahadur-shashtri-s-grandson-sends-legal-notice-to-the-makers-365238.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/tashkent_files_1554965663_800x420.jpg"}