{"text": "Warner Bros. Pictures dropped the first teaser trailer of Todd Phillips’ Joker, starring Joaquin Phoenix last night. The trailer for Joker rolls out the story of Arthur Fleck — the man who will eventually become the Joker and his epic transitions from happy-go-lucky clown to a cynical monster.\nScreengrab\nIn the trailer, Fleck says, \"I used to think my life was a tragedy. But now I realize it’s a comedy.”\nWarner Bros\nAfter stupendous performances by Jack Nicholson in 1989’s Batman and Heath Ledger in 2008’s The Dark Knight, the expectations built up after watching Joaquin Phoenix in the trailer are evidently high.\nWarner Bros\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nThe two and a half minutes of the teaser trailer of the film was enough for all of us to raise our expectations and be eager for October.\nFans are excited and the love that the trailer has received since it's release proves that people can't wait to watch Joaquin Phoenix. Read on!\nthe way he lifts the corner of his mouth just a little bit to form this subtle smile. joaquin outsold. pic.twitter.com/9l8HnT5Tpt — kaz. (@galensdeathstar) April 4, 2019\nI can't stop watching that joker trailer it's fucking perfect pic.twitter.com/0glaedge3L — Benjamin 🇲🇽 (@01Benrivera) April 4, 2019\nThe new joker movie looks pretty dope pic.twitter.com/kKNbykDR2t — Jimmy XY (@logan_cannon107) April 4, 2019\nThe new joker movie looks pretty dope pic.twitter.com/kKNbykDR2t — Jimmy XY (@logan_cannon107) April 4, 2019\nJoker looks fucking great, caught me off guard — Matt Watson The Fifth (@matthwatson) April 4, 2019\nAnd last but not least, my favorite shots that sold me on #Joker\nThis film feels like goodfellas 🤡👏🏼 pic.twitter.com/MMyxtfZ1JD — John Aaron Garza 🦅🌙 (@Ser_Jon_Arryn) April 4, 2019\nI always believed in this actor, and i never had a shred of doubt. Joaquin will deliver a deadly Joker performance. This... looks... Phenomenal!!!!!!! #Joker #DC #JoaquinPhoenix https://t.co/tGw4UfdGRt — Platinum Equinox 💫🎧 (@PlatinumEquinox) April 3, 2019\nI gotta say, I wasn’t sure on how I felt about a Joker origin movie... however having said that, Joaquin Phoenix’s performance is clearly going to be incredible. And the dude NAILED that laugh. This made me way more excited than I ever thought it would. https://t.co/Td7SicdaLV — Mario Piacquadio (@MarioNotBros) April 3, 2019\nTHE JOKER TRAILER LOOKS AMAZING. I AM SO EXCITED. JOAQUIN IS COMING FOR THAT OSCAR. pic.twitter.com/bXjnkl7pIN — kaz. (@galensdeathstar) April 3, 2019\nTHIS SHOT! THE VERY FINAL SCENE OF THE TRAILER. CHILLS. #JOKER pic.twitter.com/LsVRETYlHY — *⋆˚ 𝙝𝙖𝙮𝙖𝙩 ˚⋆* (@yvngrani) April 3, 2019\nNot gonna like that Phoenix looks incredible in this trailer. But an origin story of the Joker is not high on the list of things I want in the world. https://t.co/amghyQy6I3 — Jamie Greene (@theroarbots) April 3, 2019\nThe new #Joker trailer is simply mesmerizing. Chills. — Brad Jennings (@BradCJennings) April 3, 2019", "title": "The Trailer Of 'Joker' Has Sent The Internet Into A Tizzy & Everyone Is Saying The Same Thing!", "date_publish": "04/04/2019, 12:00:30", "description": "Warner Bros. Pictures dropped the first teaser trailer of Todd Phillips’ Joker, starring Joaquin Phoenix. The trailer for Joker rolls out the story of Arthur Fleck — the man who will eventually become the Joker and his epic transitions from happy-go-lucky clown to a cynical monster.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/hollywood/the-trailer-of-joker-has-sent-the-internet-into-a-tizzy-everyone-is-saying-the-same-thing-364832.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/joker_1554358982_800x420.jpg"}