{"text": "The Cast Of Avengers: Endgame Gets Emotional As They Attend The World Premiere In L.A\nThe Cast Of Avengers: Endgame Gets Emotional As They Attend The World Premiere In L.A\nAvengers: Endgame premiered in Los Angeles and the day was not just sentimental for the fans who were there to attend but it was a emotional evening for the entire cast.\nAvengers: Endgame is the 22nd film from the Marvel Cinematic Universe, the latest after Captain Marvel, which released last month. The film stars Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson and Brie Larson, amongst others.\nApart from meeting their fans and enjoying a chill time together, the cast took over the stage and got all emotional.\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\n1. Mark Ruffalo, who plays the Hulk spoke shared his feelings after the 3-hour screening of the film.\nIt’s been an amazing ride and so moving, I love all of you guys so much. It’s been the trip of a lifetime, and what you did up there tonight was so beautiful. My brother and sister Avengers, I love you so much.\n2. Chris Evans revealed that he cried about 6 times during the film!\nI have a lot of my friends and family here tonight, and a lot of them are right up here. We have this bond that transcends what we do for a living … I cried like six times.\n3. Godfather of the MCU, Robert Downey Jr.kept it simple and sweet. He said,\n\"We’ve got a lot of parties and after parties to get to, so we’re just going to say we love you.\"\nHave a look at some more pictures and videos from the premier.\nAgencies\nAgencies\nAgencies\nThere’s Chris Hemsworth making a short speech at the end of #AvengersEndgame. pic.twitter.com/WRzD2TXHqH — Ramin Setoodeh (@RaminSetoodeh) April 23, 2019\nAgencies", "title": "The Cast Of Avengers: Endgame Gets Emotional As They Attend The World Premiere In L.A", "date_publish": "23/04/2019, 18:47:14", "description": "Avengers: Endgame is the 22nd film from the Marvel Cinematic Universe, the latest after Captain Marvel, which released last month. The film stars Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson and Brie Larson, amongst others.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-cast-of-avengers-endgame-gets-emotional-as-they-attend-the-world-premiere-in-l-a-365976.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/avengers_endgame_1556028225_800x420.jpg"}