{"text": "The Winter Will Last Really Long! Runtime Of Game Of Thrones Season 8 Episodes Has Been Leaked\nThe Winter Will Last Really Long! Runtime Of Game Of Thrones Season 8 Episodes Has Been Leaked\nWinter is coming soon! Finally, we have a date – April 14 – when Game of Thrones season 8 will air. After a really long wait, the final season of the epic American fantasy series will reveal who sits on the Iron Throne and how it will all end. Who will die and who will survive remains to be seen.\nMeanwhile, after Game of Thrones makers unveiled the first teaser of season 8 giving rise to a lot of interesting theories, some crucial information about the final season has also been leaked.\nAccording to reports, French TV channel Orange Cinéma Séries hosted a presentation to tease Game of Thrones season 8. The presentation accidentally leaked the runtime of each episode. The episodes won’t be as long as we thought they would be.\nRemember showrunner David Nutter had said that there will only be six episodes in the final season of the show, but they’ll be longer, “longer than 60 minutes. They'll be dancing around the bigger numbers, I know that for sure.”\nPrécision utile : @OCSTV a expliqué oralement que les deux premiers épisodes de la saison finale de #GameOfThrones allaient durer 60 minutes, et les quatre suivants 80 mn d'après les dernières infos de HBO https://t.co/UIDwB7xtvU — Première (@PremiereFR) January 22, 2019\nDon't Miss 596 SHARES 246 SHARES 3.1 K SHARES 4.5 K SHARES 1.9 K SHARES\nAccording to the Game of Thrones season 8 leak, the first two episodes will last up to 60 minutes each. However, the final four, will last up to 80 minutes. In the previous season, the final episode was almost 81 minutes long.\nThe runtimes for each of the six episodes in Game of Thrones ⁠season 8! pic.twitter.com/tX7gxCC5vc — King Jon Snow (@LordSnow) January 23, 2019\nHow true this information is remains to be seen. The runtime has not been confirmed by HBO or official source. Game of Thorones season 8 will air on April 14. Save the date!\nAlso Read: 9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale!", "title": "The Winter Will Last Really Long! Runtime Of Game Of Thrones Season 8 Episodes Has Been Leaked", "date_publish": "24/01/2019, 12:15:23", "description": "According to reports, French TV channel Orange Cinéma Séries hosted a presentation to tease Game of Thrones season 8. The presentation, it is said, accidentally leaked the runtime of each episode. The episodes won’t be as long as we thought they would be.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-winter-will-last-really-long-runtime-of-game-of-thrones-season-8-episodes-has-been-leaked-360962.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/runtime_of_game_of_thrones_season_8_episodes_has_been_leaked_1548311539_800x420.jpeg"}