{"text": "Since the time the trailer of The Accidental Prime Minister has been released, it has shaken the political landscape in India. Based on the book of the same name by Singh's media advisor Sanjaya Baru, the book, just like the trailer, was controversial.\nThe movie details the political career of Dr Manmohan Singh. The film is being called anti-Congress propaganda and it has ruffled quite some feathers of the Congress.\nYesterday, the trailer of the upcoming controversial film was apparently removed from YouTube. Anupam Kher, expressing his concern on the same, had blasted the platform in a tweet.\nDear @YouTube!!! I am getting messages & calls that in parts of our country if you type, trailer of #TheAccidentalPrimeMinister, it is either not appearing or at 50th position. We were trending at No.1 yday. Please help. #HappyNewYear. #37millionviews 😊https://t.co/TUu4AtaRzk pic.twitter.com/KhoZJuxmmu — Anupam Kher (@AnupamPKher) January 1, 2019\nSince the movie’s trailer had raised political temperatures in the country with Congress questioning BJP’s motive behind promoting the movie and also raised objections to “incorrect presentation of facts”, the political party demanded a private screening before the release of the movie.\nOn this, Anupam Kher who plays the lead role said that even though he wants Manmohan Singh to watch the movie first, he can’t let Congress attend a special screening of the film.\nDon't Miss 271 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nOn the other hand, Anupam Kher’s wife, even before the release of the movie, has stated that she feels the movie should be India's official entry to Oscars this year.\nBJP MP, Kirron Kher: It’s a pathbreaking film. People who speak of freedom of speech i.e Rahul Gandhi, must now practice what he preaches.Anupam told me people will fall in love with Manmohan Singh ji. It should be India’s official entry to the Oscars. #TheAccidentalPrimeMinister pic.twitter.com/SUduFtq0Ue — ANI (@ANI) December 29, 2018\nWhile the political debate on the movie is still on, a case has been filed against actor Anupam Kher and 14 others associated with the movie in a Bihar court for damaging the reputation of some top bureaucrats.\nLawyer Sudhir Kumar Ojha has filed the case in Muzaffarpur's Chief Judicial Magistrate (CJM) court. The case will be heard in Sub Divisional Judicial Magistrate court on Jan 8.\nTwitter\nOjha in his petition complained that Anupam Kher and Akshaye Khanna, who have played the role of former Prime Minister Manmohan Singh and his press advisor Sanjaya Baru in the film, have damaged the image of both of them. \"It hurt me and many others,\" he said.\nIn his complaint, Ojha said others who have played the role of UPA chairperson Sonia Gandhi, Rahul Gandhi and Priyanka Vadra also damaged their image. He has also complained against the film director and producer.\nWith inputs from IANS", "title": "The Accidental Prime Minister Lands In Trouble, Petition Filed Against Anupam Kher & 14 Others", "date_publish": "03/01/2019, 12:49:44", "description": "Lawyer Sudhir Kumar Ojha has filed the case in Muzaffarpur's Chief Judicial Magistrate (CJM) court. Ojha in his petition complained that Anupam Kher and Akshaye Khanna, who have played the role of former Prime Minister Manmohan Singh and his press advisor Sanjaya Baru in the film, have damaged the image of both of them. \"It hurt me and many others,\" he said.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-accidental-prime-minister-lands-in-trouble-petition-filed-against-anupam-kher-14-others-359759.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/the_accidental_prime_minister_lands_in_trouble_petition_filed_against_anupam_kher__14_others_1546500083_800x420.png"}