{"text": "Dreams come true when you least expect them to and for the team of Period-end of sentence, dreams became reality when the short film won the Oscar for Best Documentary Short.\nThe team claimed that easy task for the makers of India-based documentary Period. End of Sentence as it required hard work and struggle of 20 years, said Sneha and Suman, who have featured in the short film.\nScreengrab\nPeriod. End of Sentence, which tackles the stigma of menstruation in the country, created history at the 91st Academy Awards after winning in the best documentary short category.\n“This was not a day’s struggle, the award bears testimony to 20 years of hard labour. Shabana, Usha, Shashi, Shushila and Anita. Our unit team included seven workers — Sneha, Rakhi, Sushma, Rinki, Preeti, Ruksana and Arsi. It would have been difficult to make this film and fight for this cause without them,” Sneha told ANI.\nDon't Miss 263 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n“We have received success today on a topic on which we can’t even talk about in public. Periods, which are looked down upon in the society, we have been able to work towards raising awareness about it. Our aim is not just to sell sanitary napkins. Our aim is to make people accept cleanliness during periods. We want all women to understand this and take care of their hygiene. If our voice reaches to a single girl, then we feel we have received success,” Suman added.\nFor generations, the women of the village did not have access to sanitary pads, which lead to health issues among them. When a sanitary pad is installed in their village, the women learn to manufacture and market their own pads, naming it ‘FLY.’\nSneha’s family also expressed their joy over the win. Sneha’s brother Kapil while speaking to ANI, said, “It is based on my sister’s life, but not just my sister, everyone related to the film should get credit for the film’s win. The director and actors of the film, all deserve the award. It’s a very happy moment for all of us.”\nTwitter\nSneha’s friend and co-worker Sushma also expressed her happiness and said, “I am feeling very happy and proud. We come from a small village and we didn’t know about this earlier. We had worked very hard on this and so we are feeling very proud. We are very happy that the movie based on our company and our work has got an award.”\nThe 26-minute short documentary, co-produced by Guneet Monga and directed by 25-year-old Rayka Zehtabchi, follows a group of women in Hapur, India who lead a quiet revolution as they fight against the stigma of menstruation that is deeply rooted in society. The film was nominated along with Black Sheep, End Game, Lifeboat and A Night At The Garden in the category.\nCongratulatory messages poured in for the team and this includes messages from Akshay Kumar, Priyanka Chopra, Vicky Kaushal and Neha Dhupia to Dia Mirza and Mini Mathur, various B-Town celebrities. They took to Twitter to congratulate the film’s team on the big win.\n(With agency inputs)", "title": "The Oscar Win Is Testimony Of 20 Years Of Hard Work, Say Sneha-Suman Of Period. End of Sentence", "date_publish": "27/02/2019, 11:40:31", "description": "Oscar is testimony of 20 years of hard work, say Sneha and Suman of Period. End of Sentence Period. End of Sentence which won an award at the Oscars on Sunday, deals with the stigma of menstruation in India. Sneha and Suman feature in the said short film.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-oscar-win-is-testimony-of-20-years-of-hard-work-say-sneha-suman-of-period-end-of-sentence-362864.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/oscars_2019_1551248866_800x420.jpg"}