{"text": "Kangana Ranaut is a firebrand and an utterly honest celebrity in the industry. She is unlike her contemporaries who are almost always diplomatic. However, if Kangana Ranaut has an opinion on something, she would express it without any hesitation and without mincing any words.\nTwitter\nOnce again, she made headlines yesterday when she revealed on a show that she was asked to dress in just a robe for a photoshoot for a Pahlaj Nihalani film.\nResponding to Kangana Ranaut’s statement, here’s what Pahlaj Nihalani said:\n“I had spent one-and-a-half crore on that picture advertisement and shot for three songs. She did the reading post the photoshoot, but with my advertisement and the poster, she got Mahesh Bhatt’s film Gangster and backed out of my film as she requested me to let her do Gangster as we were under a three-movie deal. She should not play with me, otherwise, I have a lot of things to play with her,” he told Cineblitz magazine.\nTwitter\nFurthermore, Nihalani revealed that Amitabh Bachchan was also approached for the role. The film was on the lines of Cheeni Kum, he said.\nDon't Miss 126 SHARES 336 SHARES 2.1 K SHARES 542 SHARES\n“It was a youth film; she was married in that movie. I had approached Amitabh Bachchan for that role. It was on the lines of Cheeni Kum. I gave the narration to Amitji too; he pulled out due to him already doing something similar. It was never a porn film and neither am I interested in those kinds of movies.\"\nAccording to Kangana, it was a “soft-porn sort of character” who had to lust for her middle aged boss, she told Mid-Day. It is after this that she was offered Gangster, her debut film, for which Kangana Ranaut won several awards as well.", "title": "The War Of Words Begin! Pahlaj Nihalani Hits Back At Kangana For Her ‘Soft-Porn’ Allegations", "date_publish": "29/03/2019, 11:39:13", "description": "According to Kangana it was a “soft-porn sort of character” who had to lust her middle aged boss. It is after this that she was offered Gangster, her debut film, for which Kangana Ranaut won several awards as well. Responding to Kangana Ranaut’s statement, here’s what Pahlaj Nihalani said!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-war-of-words-begin-pahlaj-nihalani-hits-back-at-kangana-for-her-soft-porn-allegations-364522.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/kangana_ranaut_says_pahlaj_nihalani_approached_her_for_a_softporn_role_he_hits_back_at_her_1553839123_800x420.png"}