{"text": "'The Dude' Jeff Bridges' Glorious Golden Globes Speech Gets A Big Thumbs Up From The Internet!\n'The Dude' Jeff Bridges' Glorious Golden Globes Speech Gets A Big Thumbs Up From The Internet!\nJeff Bridges became the recipient of the Cecil B. DeMille Award at the 2019 Golden Globes on Sunday night. The actor invoked his most iconic role \"The Dude\" as he accepted this year's Cecil B DeMille Award for career achievement at the Golden Globes.\nApart from his victory, it was his 'dude' speech that made everyone root for him.\nHe was also presented with the honor by the Hollywood Foreign Press Association, which was bestowed upon presenter-actor Oprah Winfrey last year.\nAgencies\nThe 69-year-old actor gave a rambling and emotional speech in which he expressed gratitude to the directors who have influenced his career, author Buckminster Fuller and his family, including wife Susan Geston, brother Beau and sister Cindy. He even spoke about the planet and everything else that crossed his mind.\nIn his speech, he revealed a special tribute to his father, actor Lloyd Bridges. \"Wearing your cuffs, dads,\" he said. \"Wearing your cuff links.\" He further thanked his brother, fellow actor Beau Bridges, and sister Cindy, saying how \"lucky\" they were to have their parents, Lloyd and Dorothy.\nThanking his wife, he said,\nAgencies\n\"I gotta thank my sweetheart, Sue. My god, 45 years of support and love, I wouldn't be up here without you me dear.\"\nBut the highlight of the speech was when he thanked the film's writer-directors Joel and Ethan Cohen for creating the iconic role. said,\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAgencies\n\"If I’m lucky I’ll be associated with The Dude for the rest of my life.\"\nIn Bridges' speech, he included \"trim tabs\" on ocean liners that hinted at all the possibilities of how individuals can make a difference.\nIn his address, Bridges likened his life and career to that of a trim tab -- a small feature on boats and airplanes that assists in controlling the direction of the vessel. \"I like to think of myself as trim tab, and all of us trim tabs,\" he said. \"We may not seem like we're up to the task, but we are. We're alive! We can make a difference. We can turn this ship in the way we want to go, toward love, toward creating a healthy planet for all of us,\" he added.\nJoining the list of recipients of Cecil B. DeMille Award like Walt Disney, Judy Garland, Frank Sinatra, Elizabeth Taylor, Robin Williams, Meryl Streep and last year's honoree, Oprah Winfrey, this one's surely a big achievement.\nNeedless to say, his speech got a big thumbs up from the audience.\nJulianne Moore is all of us during that Jeff Bridges speech. #GoldenGlobes pic.twitter.com/BmuTdEBG4Z — Derek Lewis (@dereklew) January 7, 2019\njeff bridges taking his time with this acceptance speech #GoldenbGlobes\npic.twitter.com/SH07jtUAtL — dani 🕷 (@uglynipz) January 7, 2019\npretty sure Jeff Bridges' blood type is CBD#GoldenGlobeAwards — Damian Holbrook (@damianholbrook) January 7, 2019\nThat Jeff Bridges acceptance speech had me like: pic.twitter.com/vAoLPUBJVP — Victor Kusche-Iglesias (@Kuschee) January 7, 2019\nI'm realizing, as I watch this, that Jeff Bridges maybe wasn't really *acting* in Big Lebowski? — Chris Hayes (@chrislhayes) January 7, 2019\nHard to tell if Jeff Bridges is drunk or just Jeff Bridges #GoldenGlobes — katie zetts (@kikizetts) January 7, 2019\n(With agency inputs)", "title": "'The Dude' Jeff Bridges' Glorious Golden Globes Speech Gets A Big Thumbs Up From The Internet!", "date_publish": "07/01/2019, 11:32:59", "description": "In his acceptance speech, he revealed a special tribute to his father, actor Lloyd Bridges. \"Wearing your cuffs, dads,\" he said. \"Wearing your cuff links.\" He further thanked his brother, fellow actor Beau Bridges, and sister Cindy, saying how \"lucky\" they were to have their parents, Lloyd and Dorothy.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-dude-jeff-bridges-glorious-golden-globes-speech-gets-a-big-thumbs-up-from-the-internet-359963.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/jeff_bridges_1546842236_800x420.jpg"}