{"text": "Living up to the hype that all the previous films of the same franchise managed to create, the first trailer for Annabelle Comes Home is finally here! Apart from all the cliche elements that Annabelle franchise boasts of, the seventh movie looks more promising and thrilling!\nWarner Bros. Pictures\nThe film is helmed by screenwriter Gary Dauberman, who has earlier written Annabelle, Annabelle: Creation and The Nun among others, which definitely means that our money is worth betting!\nThe next chapter in the Conjuring Universe arrives in cinemas on June 28. #AnnabelleComesHome pic.twitter.com/uHlMr8vuQx — Warner Bros. India (@warnerbrosindia) March 26, 2019\nThe film stars: Mckenna Grace, Madison Iseman, Katie Sarife, Patrick Wilson and Vera Farmiga in pivotal roles.\nWarner Bros. Pictures\nThe official synopsis of the film reads, “Determined to keep Annabelle from wreaking more havoc, demonologists Ed and Lorraine Warren bring the possessed doll to the locked artifacts room in their home, placing her “safely” behind sacred glass and enlisting a priest’s holy blessing. But an unholy night of horror awaits as Annabelle awakens the evil spirits in the room, who all set their sights on a new target—the Warrens’ ten-year-old daughter, Judy, and her friends.”\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nWithout further ado, watch the trailer here.\nPeople have been receptive towards the trailer and here are first few initial reactions. Read on.\n||: #AnnabelleComesHome looks good AF. You got The Queen herself Vera Farmiga & the king Patrick Wilson and LAWDDD McKenna Grace who’s literally a great child actor An is going places. Also YOU DONT FUCK WITH EVIL SPIRITS. You just don’t. — -`Jαcк´- (@AmazingGumball) March 31, 2019\nI have seen all the parts of conjuring and Annabelle but this one really scared me i almost dropped my phone on my face cannot wait to see it 😂😂😂 #AnnabelleComesHome https://t.co/4CbK43gwYh — Kash 🌺 (@Kashish39286794) March 31, 2019\nTHE WARRENS ARE BACK YALL MY PARENTS OUT HERE STILL TRYNA DEFEAT THIS BAD DEMON #AnnabelleComesHome pic.twitter.com/RdPHLFqz4m — lala (@believemorning) March 31, 2019\ny’all saying this bitch is back to scared the shit out of me and my friends again #AnnabelleComesHome — frisca (@likeingold) March 31, 2019\nIS IT ME OR THEY ARE GRABBING HANDS? OMG STOP IMNOTREADY #AnnabelleComesHome pic.twitter.com/EkKjSfIgrj — Vale☕️ (@divergent_yeah) March 31, 2019\nI don’t wanna I’m crying but IM FUCKINGCRYING I missed them so much #AnnabelleComesHome pic.twitter.com/GFVlTNGXPG — Mary✨ (@evangelina_dell) March 31, 2019\nmckenna grace as judy warren is gonna be the best thing #AnnabelleComesHome pic.twitter.com/c1an8MFidw — lauren 13 (@regrdingdean) March 31, 2019\nIf you are a sucker for great horror plots, you will still have to wait till June 28.", "title": "The Trailer Of 'Annabelle Comes Home' Is Here And It'll Send Chills Down Your Spine!", "date_publish": "31/03/2019, 12:40:53", "description": "The film is helmed by screenwriter Gary Dauberman, who has earlier written Annabelle, Annabelle: Creation and The Nun among others, which definitely means that our money is worth betting!The film is helmed by screenwriter Gary Dauberman, who has earlier written Annabelle, Annabelle: Creation and The Nun among others, which definitely means that our money is worth betting!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/hollywood/the-trailer-of-annabelle-comes-home-is-here-and-it-ll-send-chills-down-your-spine-364625.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/annabelle_1554020228_800x420.jpg"}