{"text": "The Cat Is Finally Out Of The Bag! Anup Jalota Confesses There’s No Love Story With Jasleen\nThe Cat Is Finally Out Of The Bag! Anup Jalota Confesses There’s No Love Story With Jasleen\nFrom the day Bigg Boss 12 had premiered, Bhajan singer Anup Jalota and his alleged love affair with his co-contestant Jasleen Matharu had set many tongues wagging. After all, a 65-year-old man was in love with a 28-year-old. While some were shocked to hear that, others refused to believe it and called it a publicity stunt.\nVoot\nAnup Jalota and Jasleen Matharu entertained the audiences together inside Bigg Boss 12 house for quite some time. However, in the last night’s episode, Anup along with Saba Khan was evicted from the show. But what came as a shocker is that right after his eviction from Bigg Boss 12, Anup Jalota took no time to accept that there was no “love story” between him and Jasleen Matharu.\nTwitter\n“People are not able to understand our relationship. We don't have any kind of love story. We just share a musical relationship. She is my student and I am her teacher. I help her in learning music. There is no girlfriend-boyfriend kind of relationship between us and we are also not involved in any romantic and physical relation,” he was quoted a saying by IANS.\nAlso Read: Rhea Chakraborty Posts A Picture With Mahesh Bhatt, Fans Troll & Compare Him To Anup Jalota\ntimesnownews.com\nDon't Miss 129 SHARES 182 SHARES 3.6 K SHARES 3.5 K SHARES\nFurthermore, he said Jasleen’s father Kesar Matharu is his very old friend.\n“I know Jasleen and his family for a long time, A lot of times I have met them at the airport and at their home. But Jasleen and I hardly get time to meet each other. She hasn't even met my family members yet.”\nTwitter\nAnup Jalota’s journey on Bigg Boss 12 lasted only for a month. When asked why he thinks he was evicted, here’s what he said:\n“I have earned huge goodwill and respect in my decades long career. Fighting does not suit me. I cannot abuse someone and cannot even take any abuse from someone. So, I think that's where I lacked and was not able to impress the audience. But I had a lifetime experience in the house. I will miss everyone.”\nMeanwhile, rumours suggest that Neha Pendse will re-enter Bigg Boss 12 as a wild card contestant.\nAlso Read: 9 Facts That Prove Anup Jalota Is Having More Fun Than Any Of Us, #6 The Movie We All Missed", "title": "The Cat Is Finally Out Of The Bag! Anup Jalota Confesses There’s No Love Story With Jasleen", "date_publish": "29/10/2018, 11:29:46", "description": "From the day Bigg Boss 12 had premiered, Bhajan singer Anup Jalota and his alleged love affair with his co-contestant Jasleen Matharu had set the tongue wagging. After all, a 65-year-old man was apparently in love with a 28-year-old. While some were shocked to hear that, others refused to believe it and called it a publicity stunt.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-cat-is-finally-out-of-the-bag-anup-jalota-confesses-there-s-no-love-story-with-jasleen-355629.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/post_eviction_from_bigg_boss_12_anup_jalota_admits_theres_no_love_story_with_jasleen_matharu_1540792105_800x420.jpg"}