{"text": "The Crazy Crowd Outside SRK's Mannat Since Decades Prove He's The Most Loved Celebrity In India\nThe Crazy Crowd Outside SRK's Mannat Since Decades Prove He's The Most Loved Celebrity In India\nEvery year, the sight of midnight on 2nd November outside Mannat is the same: Thousands of SRK fans gather outside Shah Rukh Khan's house just to catch a glimpse of him and wish him on his birthday.\nThe endless groups and fan pages on social media are proof that in India, three things will continue to sell: Sex, cricket, and Shah Rukh Khan. Even with strings of endless flops, being an SRK fan is about accepting, moving on and then being hopeful that better things will follow.\nTwitter\nNo matter how busy SRK is, he follows the ritual of coming to his terrace and waving to his fans, ensuring that they don't go back home disappointed. Being a Shah Rukh Khan fan is not just about loving him or being an ardent fan of his films. For many, SRK is no less than a religion.\nSince decades, fans flock outside Mannat to be there for their favorite star. If you are wondering why 2nd November is no less than a festival for Shah Rukh Khan fans, these pictures and videos will give you an idea of just that.\nTwitter\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nFans crowding outside Mannat just to catch a glimpse of King Khan prove that he is one of the most loved stars today.", "title": "The Crazy Crowd Outside SRK's Mannat Since Decades Prove He's The Most Loved Celebrity In India", "date_publish": "02/11/2018, 12:28:50", "description": "The endless groups and fan pages on social media are proof that in India, three things will continue to sell: Sex, cricket, and Shah Rukh Khan. Even with strings of endless flops, being an SRK fan being accepting, moving on and then being hopeful that better things will follow.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-crazy-crowd-outside-srk-s-mannat-since-decades-prove-he-s-the-most-loved-celebrity-in-india-355917.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/srk_1541143400_800x420.jpg"}