{"text": "The Moment All Of Us Have Been Waiting For! Here Are The First Pictures From DeepVeer's Wedding\nThe Moment All Of Us Have Been Waiting For! Here Are The First Pictures From DeepVeer's Wedding\nThe blockbuster Bollywood wedding finally took place in the stunning locales of Italy. Yes, the reel life Bajirao-Mastani, Ranveer Singh and Deepika Padukone tied the knot in a Konkani style ceremony.\nThe couple is enjoying the three day wedding festivity, which began with their engagement last night. Today, Ranveer-Deepika got married in a private ceremony around Lake Como.\nInstagram/Viral Bhayani\nWhile they tried taking the Rani Mukerji-Aditya Chopra route by keeping it a secret, yes from patrolling boats, taping phones, QR codes, they made the venue a no mobile zone.\nBut where there’s a will, there is a way. Amid heavy security, a few photos from their all white wedding have made its way to the internet.\nDon't Miss 7.9 K SHARES 159 SHARES\nTake a look\n1.\n2.\nInstagram/DeepVeer\n3.\n4.\n5.\n6.\n7.\nAfter seeing the pictures, many fans including us have similar thoughts about their Italy wedding and it's this. But we're happy with whatever has come our way. Congratulations to the newly wed couple.", "title": "The Moment All Of Us Have Been Waiting For! Here Are The First Pictures From DeepVeer's Wedding", "date_publish": "14/11/2018, 20:34:04", "description": "The blockbuster Bollywood wedding finally took place in the stunning locales of Italy. Yes, the real life Bajirao-Mastani Ranveer Singh and Deepika Padukone tied the knot in a Konkani style ceremony. The couple are enjoying the three day wedding festivity, which began with their engagement. Today, Ranveer-Deepika got married in a private ceremony around Lake Como.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/the-moment-all-of-us-have-been-waiting-for-here-are-the-first-pictures-from-deepveer-s-wedding-356688.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_1542208636_800x420.jpg"}