{"text": "The Battle Of Winterfell Wasn’t The Last One! An Epic Fight In Game Of Thrones Is Yet To Begin\nThe Battle Of Winterfell Wasn’t The Last One! An Epic Fight In Game Of Thrones Is Yet To Begin\nYou know the drill, right? If you haven’t watched Game of Thrones episode 3 as of yet, there are spoilers in the article below. Scroll down at your own risk.\nvia GIPHY\nYou didn’t think the Battle of Winterfell was the end, did you?\nThe great war – battle of the Winterfell -- has been won, but that was not the last one. The epic battle that will decide who takes the Iron throne is yet to begin, and looks like the game is going to get dirtier now!\nvia GIPHY\n“We'll rip her out, root and stem.”\nIt’s Daenerys VS Cersei, clearly! Survivors apparently didn’t get much time to celebrate their victory against the dead, and already Daenerys Targaryen is gearing up to fight against Cersei Lannister for the Iron Throne. Meanwhile, Cersei is gearing up with Euron Greyjoy to battle against the Mother of dragons.\nScreengrabs\nTo know more, watch the Game of Thrones season 8 episode 4 promo below.\n“We have won the great war, now we’ll win the last war… We’ll rip her out root and stem,” Danny is all set for the epic war.\nThe end is near! Who do you think will sit on the Iron Throne? We are rooting for Tyrion Lannister, what about you?\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "The Battle Of Winterfell Wasn’t The Last One! An Epic Fight In Game Of Thrones Is Yet To Begin", "date_publish": "29/04/2019, 12:29:12", "description": "The great war – battle of the Winterfell -- has been won, but that was not the last one. The epic battle that will decide who takes the Iron throne is yet to begin, and looks like the game is going to get dirtier now! It’s Daenerys VS Cersie clearly! Survivors apparently didn’t get much time to celebrate their victory against the dead, and already Daenerys Targaryen is gearing up to fight against", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-battle-of-winterfell-wasn-t-the-last-one-an-epic-fight-in-game-of-thrones-is-yet-to-begin-366256.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/daenerys_targaryen_in_game_of_thrones_season_8_episode_4_promo_1556519504_800x420.jpg"}