{"text": "The Gripping Trailer Of Hotel Mumbai Will Make You Relive The Dark Days Of 26/11 Mumbai Attacks\nThe Gripping Trailer Of Hotel Mumbai Will Make You Relive The Dark Days Of 26/11 Mumbai Attacks\nThe horrid 26/11 attacks in Mumbai has left some heartbreaking memories for a lot of us. A lot of people present there have not been able to fully recover from those dark days.\nAnd now, to give you another glimpse of what all conspired that unfortunate night, here is a teaser trailer of Anupam Kher and Dev Patel starrer 'Hotel Mumbai'.\nScreengrab\nIt is a critically acclaimed film that won a lot of appreciation at the TIFF.\nPresenting the Official Teaser Trailer of one of my favourite films #HotelMumbai.\nBased on the true story of the devastating terrorist attack on the Taj Mahal Hotel in 2008. #DevPatel, @armiehammer, @NazaninBoniadi #TildaCobhamHervey @jasonsfolly 🙏😍👇https://t.co/CeL3Xk0UTH — Anupam Kher (@AnupamPKher) December 11, 2018\nThe film revolves around the isolated incident when terrorists laid siege to the Taj Mahal hotel near the Gateway of India. The movie also stars Armie Hammer, who plays one of the foreign guests who was staying at Taj Mahal hotel at that time. The teaser trailer is gripping and will make you feel a lot of things at the same time. Hit play!\nDon't Miss 14.9 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES", "title": "The Gripping Trailer Of Hotel Mumbai Will Make You Relive The Dark Days Of 26/11 Mumbai Attacks", "date_publish": "11/12/2018, 14:23:23", "description": "The film revolves around the isolated incident when terrorists laid siege to the Taj Mahal hotel near the Gateway of India. The movie also stars Armie Hammer, who plays one of the foreign guests who was staying at Taj Mahal hotel at that time. The teaser trailer is gripping and will make you feel a lot of things at one time. Hit play!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-gripping-trailer-of-hotel-mumbai-will-make-you-relive-the-dark-days-of-26-11-mumbai-attacks-358334.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/anupam_kher_1544517596_800x420.jpg"}