{"text": "Bollywood has its game totally up for biopics. After back to back hits like Neerja, Bhaag Milkha Bhaag, Dhoni and Sanju, we have yet another appealing story all set for its cinematic adaptation.\nOne of the stories that is all set to be remade into a biopic is of Major Sandeep Unnikrishnan. He lost his life battling the terrorists during the 26/11 attacks on Mumbai in November 2008.\nAgencies\nFor the uninitiated, Martyr Major Sandeep Unnikrishnan was an Army officer serving with the Special Action Group of the National Security Guards (NSG). Apart from leading a team of NSG commandos to rescue the hostages in Taj Palace Hotel, he was also conferred with the Ashoka Chakra, country’s highest peacetime gallantry award, in 2009.\nReports claim that Sony Pictures Entertainment has already registered two titles with the producers’ association called Major and Major Sandeep.\nDon't Miss 233 SHARES 183 SHARES 185 SHARES 155 SHARES 870 SHARES\nA Deccan Chronicle report quotes a source saying,\nAgencies\n“It is not just about the attack but is more of a biopic. The studio is in talks with the family of Major Sandeep to get the rights personal as well as work-related and are keen to offer a tribute to the late soldier. The story is also interesting as he was trying to rescue an injured comrade when he was shot and later, he succumbed to injuries. There are many layers in the film.\"", "title": "The Brave Story Of 26/11 Martyr Major Sandeep Unnikrishnan To Get A Cinematic Adaptation", "date_publish": "30/01/2019, 14:16:31", "description": "Bollywood has its game totally up for biopics. After back to back hits like Neerja, Bhaag Milkha Bhaag and Dhoni, we have yet another appealing story all set for its cinematic adaptation. One of the stories that is all set to be remade into a biopic is of Major Sandeep Unnikrishnan. He lost his life battling the terrorists during the 26/11 attacks on Mumbai in November 2008.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-brave-story-of-26-11-martyr-major-sandeep-unnikrishnan-to-get-a-cinematic-adaptation-361295.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/martyr_major_sandeep_unnikrishnan_1548837140_800x420.jpg"}