{"text": "The Wedding Festivities Begin As Priyanka Chopra Shines Bright At Her Bridal Shower!\nThe Wedding Festivities Begin As Priyanka Chopra Shines Bright At Her Bridal Shower!\nPriyanka Chopra and Nick Jonas have not yet confirmed their wedding date as of now, but looks like marriage is definitely on the cards soon. They gave a pleasant surprise to their fans announcing their relationship on social media after their Roka ceremony in Mumbai. Will they once again leave fans startled by exchanging the wedding vows in a private ceremony? Only time will tell.\nWhy do we suspect this? Because Priyanka’s friends -- film producer Mubina Rattonsey and Priyanka’s manager Anjula Acharia -- threw a bridal shower for her recently! Don’t believe us? Take a look at the pictures below.\nIn a gorgeous white gown, Priyanka was beaming with happiness. The bridal shower, according to US Magazine, took place at Tiffany’s Blue Box Café in New York. Celebs including Kelly Ripa, Lupita Nyong’o and Kevin Jonas among others also graced the occasion.\nDon't Miss 527 SHARES 106 SHARES 161 SHARES 12.5 K SHARES\nPriyanka Chopra and Nick Jonas have been in New York since last few days. They were spotted watching a Broadway musical together at a restaurant. On Monday, PC shared a picture of Nick Jonas with her Nephew. She wrote, “Nephew and Boo.”\nAlso Read: From Hinting About Having Kids To Chilling With AR Rahman, Here’s What Priyanka Chopra Is Up To\nShe is also bonding quite well with Nick Jonas’ mother.\nBut the million dollar question is when is Priyanka Chopra and Nick Jonas getting married?\nAlso Read: Finally! Ranveer Singh & Deepika Padukone Announce Their Wedding Date, Seek Everyone's Blessings", "title": "The Wedding Festivities Begin As Priyanka Chopra Shines Bright At Her Bridal Shower!", "date_publish": "29/10/2018, 12:42:49", "description": "Priyanka Chopra and Nick Jonas might tie the knot soon. Why do we suspect this? Because Priyanka’s friends -- film producer Mubina Rattonsey and Priyanka’s manager Anjula Acharia -- threw a bridal shower for her! Don’t belleive us? Take a look at the pictures inside.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-wedding-festivities-begin-as-priyanka-chopra-shines-bright-at-her-bridal-shower-355636.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/priyanka_chopra_beams_with_happiness_at_her_bridal_shower_is_she_getting_married_soon_1540796624_800x420.png"}