{"text": "A woman accused Malik saying, “He simply unzipped his pants and asked me to lick him. I told him no and urged him to let me go, but he pulled me by my hair and stuffed my face in his lap, hurling abuses as he did so.\"\nAfter the accusations, Anurag Kashyap tweeted on social media how they're now dissolving their production company Phantom films. Vikas Bahl filed a defamation suit worth Rs 10 crores against his former partners Vikramaditya Motwane, Madhu Mantena and Anurag Kashyap for running an orchestrated smear campaign against him. While the case was being held in the Court, the woman who accused Bahal has reportedly refused to depose before the Judge.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAn excerpt from the suicide note reads, \"Without trying to justify any of my actions, I just want to say that I have tried to be the best person I can be. I didn't have the strength to cope with what happened to me as a child in a healthy way. I never was able to separate sex from power, to make it a part of love, and somewhere along the way, one part of me turned into a monster. Maybe ... I am bipolar.\"\nIn his blog, Big B wrote, \"It has been a most satisfying experience to give some to them the countrymen that sacrificed their lives for us... 44 families diversified into 112 entities were given out in my small way from Maharashtra, the brave hearts , the SHAHEED. More needs to be done from other parts of the country too. It shall be done. Over 350 farmers loans that were difficult to pay off, and to prevent them from committing suicide, was paid off some days back too... Earlier farmer loans from Andhra and Vidarbha had been done... Now a list of over 850 farmers from Uttar Pradesh have been identified and their loans amounting to over Rs 5.5 crore shall be taken care of... The assistance from the bank in question assists in its execution and its benevolence.\"\nAll the 70-odd people injured in the train accident are in critical conditions, officials said on Saturday. This tragic incident has again put a very big question mark on the level of security at public places. Farhan Akhtar wrote, \"Saddened to hear about the loss of life in #Amritsar. Safety in public spaces HAS TO be taken a lot more seriously. Deepest condolences to all families affected by this tragedy.\"", "title": "The Latest Development On #MeToo Movement In India And More From The Ent World!", "date_publish": "20/10/2018, 16:04:42", "description": "1. After Sona Mohapatra & Shweta Pandit, 2 More Women Accuse Anu Malik Of Sexually Harassing Them! A woman accused Malik saying, “He simply unzipped his pants and asked me to lick him. I told him no and urged him to let me go, but he pulled me by my hair and stuffed my face in his lap, hurling abuses as he did so.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-latest-development-on-metoo-movement-in-india-and-more-from-the-ent-world-355135.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/metoo_india_1540031778_800x420.jpg"}