{"text": "The Josh Continues To Be High As Vicky Kaushal's Uri Is All Set To Cross Rs 150 Crore Mark\nThe Josh Continues To Be High As Vicky Kaushal's Uri Is All Set To Cross Rs 150 Crore Mark\nHow's the Josh?\nWell, it's still VERY high.\nYou surely must be living under the rock if you didn't get even a hint of what we are talking about here. Vicky Kaushal, Yami Gautam and Paresh Rawal's film Uri-The Surgical Attack has claimed its spot as 2019's first biggest hit and the buck doesn't stop here.\nThe film continues to break records at the box-office and is inches closer to reaching the 150 crore mark.\n(Also read: Those Who Illegally Download 3.8 GB Of Uri Movie On Torrents Were Victims Of This Genius Strike)\nThe reports have been confirmed by trade analyst Taran Adarsh who shared the figures of the film.\nEven with new releases including Manikarnika The Queen of Jhansi and Thackeray, Aditya Dhar's Uri has continued to be a crowd-puller. Even on republic days, the footfall for Uri for higher than all other films put together.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAgencies\nIn case you are someone who is yet to watch it, if not now, then when will you? Well!\n(Also read: From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood)", "title": "The Josh Continues To Be High As Vicky Kaushal's Uri Is All Set To Cross Rs 150 Crore Mark", "date_publish": "27/01/2019, 16:33:40", "description": "Even with new releases including Manikarnika The Queen of Jhansi and Thackeray, Aditya Dhar's Uri has continued to be a crowd-puller. Even on republic days, the footfall for Uri for higher than all other films put together. In case you are someone who is yet to watch it, if not now, then when will you? Well!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-josh-continues-to-be-high-as-vicky-kaushal-s-uri-is-all-set-to-cross-rs-150-crore-mark-361133.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_1548587198_800x420.jpg"}