{"text": "The Khans Are The Biggest Newsmakers On The Internet Today And More From Entertainment World\nThe Khans Are The Biggest Newsmakers On The Internet Today And More From Entertainment World\nIn his speech, he said, “I believe that charity should be done in silence and with dignity. One cannot speak about their charitable acts because it loses its purpose. I have been privileged to be able to use my status as a public personality to champion causes close to my heart. I actively participate with the causes of women empowerment, rehabilitation of the underprivileged and basic human rights.\"\nReports further claim that a group by the name of Sanyojak Navyuvak Hindu Mitra Mandal expressed that their religious sentiments were hurt as Hindu saints and priests were made to dance for one of Dabangg 3’s songs.\nDon't Miss\nThe actor has started shooting for the sequel to Hindi Medium, titled Angrezi Medium in Udaipur. The team shared the first mahurat pictures from the sets in Udaipur and people are delighted to see Irrfan Khan back in full-form.\nIt's not just a film about Kashmir. It's a tale of a British-Kashmiri girl Noor (Zara La Peta Webb) who visits Kashmir to look for her father, who had disappeared years ago. She gets help from a local teenager, Majid (Shivam Raina), who takes her to a forbidden zone near the Indo-Pak border. However, they get caught and arrested. While Noor gets freedom because she is British, the tale then takes us through the journey of a struggle for Majid's freedom.\nSharing a picture with Divya, he wrote, “You will always be missed, #april5th #1993 #26thdeathanniversary #divyabharti.”", "title": "The Khans Are The Biggest Newsmakers On The Internet Today And More From Entertainment World", "date_publish": "05/04/2019, 16:42:16", "description": "In his speech, he said, “I believe that charity should be done in silence and with dignity. One cannot speak about their charitable acts because it loses its purpose. I have been privileged to be able to use my status as a public personality to champion causes close to my heart. I actively participate with the causes of women empowerment, rehabilitation of the underprivileged and basic human right", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-khans-are-the-biggest-newsmakers-on-the-internet-today-and-more-from-entertainment-world-364949.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_news_1554462813_800x420.jpg"}