{"text": "A beautiful love story, both brave and moving, wrote Alia Bhatt after watching her mother and veteran actor Soni Razdan's film 'No Fathers In Kashmir'. For the uninitiated, it took herculean efforts for the team to release the film.\nIt was After an eight-month battle with the Central Board of Film Certification (CBFC) that Ashvin Kumar's directorial managed to hit the screens today.\nWhat is the film about?\nIt's not just a film about Kashmir. It's a tale of a British-Kashmiri girl Noor (Zara La Peta Webb) who visits Kashmir to look for her father, who had disappeared years ago. She gets help from a local teenager, Majid (Shivam Raina), who takes her to a forbidden zone near the Indo-Pak border. However, they get caught and arrested. While Noor gets freedom because she is British, the tale then takes us through the journey of a struggle for Majid's freedom.\nWhy is it important?\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nJust a few days ago while promoting the film, Razdan told PTI, \"Kashmir deserves our attention. This film deserves to be seen... It will help people understand more about Kashmir. Even I was more curious and interested to know about Kashmir when I came on board.\" Talking about the film, she added,\n\"Ours is a unique film but I hope it should attract the audience to the theatres because it is an entertaining film. It is neither a commercial film nor an art film. It is somewhere in between.\"\nAlong with Soni, the film also stars Ashvin Kumar, Anshuman Jha, and Kulbushan Kharbanda in pivotal roles. In case you are wondering whether to watch the film or not, we have compiled the first reactions. Read on!\nIt takes Herculean efforts to get a film like #NoFathersInKashmir made and released on the big screen. Bravo Team @nofathers_movie! Here’s to the courage and importance of such stories being told..huge respect @ashvinkumar! Please go to the theatres and support such cinema 🙏🏼 — Nimrat Kaur (@NimratOfficial) April 4, 2019\nA beautiful love story, both brave and moving. #NoFathersInKashmir is a story so relevant for our times. A must watch. Mama how amazing are you @Soni_Razdan, you make me soooo proud ❤ @ashvinkumar lots of love to you and the entire team!! — Alia Bhatt (@aliaa08) April 4, 2019\nThe strength of #NoFathersInKashmir is that it does not attempt to provoke a response. It just lays the truth in front of you,unadulterated & bare. Seen through the mesmerising eyes of #ZaraWebb & #ShivamRaina Kashmir breathes,bleeds yet thrives.Respect! @Soni_Razdan @ashvinkumar pic.twitter.com/c34qr6LNKV — Pooja Bhatt (@PoojaB1972) April 4, 2019\nKalki Koechlin\nThe film is a powerful reminder of Kashmir's heartbreaking half state. There is a frightening honesty to scenes, a strong cast, and a special mention goes to Maya Sarao for tugging at our heartstrings with her performance.\nMira Nair\n\"I think its a very brave film and its a timely film, a film that we should see and keep seeing. It’s also a moving film and its beautifully performed and skilfully made. I thinks it's also poignant to see the war through the eyes of the children.\"\nRasika Dugal\n\"The haunting silences and the innocence of ' no fathers in Kashmir' made me revisit the grief of the Kashmir situation. Beautifully made film with some delicate performances\"", "title": "The Film Fraternity Praises Soni Razdan's 'No Fathers In Kashmir'. Here's Why It's Important", "date_publish": "05/04/2019, 14:05:00", "description": "A beautiful love story, both brave and moving, wrote Alia Bhatt after watching her mother and Veteran Actor Soni Razdan's film 'No Fathers In Kashmir'. For the uninitiated, it took herculean efforts for the team to release the film. It was After an eight-month battle with the Central Board of Film Certification (CBFC) that Ashvin Kumar's directorial managed to hit the screens today.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-film-fraternity-praises-soni-razdan-s-no-fathers-in-kashmir-here-s-why-it-s-important-364930.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/no_fathers_in_kashmir_1554456830_800x420.jpg"}