{"text": "Get ready for another hit track in Salman Khan's upcoming film Dabangg 3. One of Salman's most popular and successful franchise is all set to woo the audience with its third installment. The film that will be helmed by Prabhudeva will have a special item song by Kareena Kapoor Khan and a Deccan Chronicle report has confirmed the news.\nJust to jog your memory a little, Kareena's item song Fevicol went on to become a hit and to make sure the audience is impressed again, the makers have locked her for the third installment too.\nA Deccan Chronicle report has quoted a source as saying,\n“Ashwami Manjrekar, Sonakshi Sinha and Salman Khan are already in the cast and other actors too have been pencilled in for their roles. The film is set to roll in March and sets are going to be put up at the earliest. Munni Badnaam Hui was a chartbuster in Dabangg and Fevicol Se was a highlight in Dabangg 2. Keeping with the trend, it was important that there is a blockbuster number in the film and what better name than Kareena to add the oomph needed.\"\nOn the work front, after a blockbuster hit like Veere Di Wedding, Kareena is prepping for her upcoming film Good news and she will share the screen space with her Kambhakt Ishq co-star Akshay Kumar.\nDon't Miss 707 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES", "title": "The Bebo Factor: Kareena Kapoor Khan Will Revive Her 'Fevicol' Magic In Dabangg 3", "date_publish": "03/02/2019, 13:07:24", "description": "Get ready for another hit track in Salman Khan's upcoming film Dabangg 3. One of Salman's most popular and successful franchise is all set to woo the audience with its third installment. The film that will be helmed by Prabhudeva will have a special item song by Kareena Kapoor Khan and a Deccan Chronicle report has confirmed the news.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/bollywood/the-bebo-factor-kareena-kapoor-khan-will-revive-her-fevicol-magic-in-dabangg-3_-361502.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kareena_kapoor_khan_1549179557_800x420.jpg"}