{"text": "The Countdown Has Begun! Deepika Padukone & Ranveer Singh’s Wedding Venue Is No Less Than A Beautiful Dream\nThe Countdown Has Begun! Deepika Padukone & Ranveer Singh’s Wedding Venue Is No Less Than A Beautiful Dream\nIt’s finally happening – the wedding of the year is just a two days away, and fans are already revelling and jumping in excitement. One of the most loved couples of Bollywood, Ranveer and Deepika Padukone will be man and wife soon after they tie the knot on Nov 14-15.\nAlso Read: Here’s When Ranveer Singh & Deepika Padukone Will Make Their First Public Appearance As A Married Couple\nbollywoodshaadis.com\nThe ever-gorgeous couple has chosen an equally stunning location for their wedding. They will tie the knot at Lake Como in Italy – the location which is referred to as “mirror of paradise”, is also home to Hollywood stars including George Clooney, Madonna and Donatella Versace among others, and is the same place where the lavish engagement bash of Isha Ambani and Anand Piramal took place.\nAlso Read: Bollywood Celebs Flock To The Lavish Engagement Bash Of Isha Ambani & Anand Piramal In Italy\nTwitter\nDon't Miss 185 SHARES 460 SHARES 870 SHARES\nConfirming the wedding location, ANI tweeted some pictures of the Villa del Balbianello, the property that overlooks Lake Como in Italy, showing that the wedding preparations at the venue have begun.\nItaly: Visuals from Villa del Balbianello at Lake Como in Lombardy, the venue for the wedding ceremony of Deepika Padukone and Ranveer Singh. Preparations underway. pic.twitter.com/MuuBJXos50 — ANI (@ANI) November 11, 2018\nHere are some of the more pictures from the ultra luxurious resort Villa del Balbianello!\n#1\n#2\n#3\n#4\n#5\n#6\nAccording to a report in India Today, both the families will stay in a resort, which is opposite to the wedding destination Villa Del Balbianello. It is said that 75 rooms have been booked for the wedding. The total estimated cost, according to Pinkvilla, is Rs 1,73,25,000.\nCongratulations, Deepika Padukone and Ranveer Singh!", "title": "The Countdown Has Begun! Deepika Padukone & Ranveer Singh’s Wedding Venue Is No Less Than A Beautiful Dream", "date_publish": "13/11/2018, 13:20:03", "description": "One of the most loved couples of Bollywood, Ranveer and Deepika Padukone will be man and wife soon after they tie the knot on Nov 14-15. Confirming their wedding location, ANI tweeted some pictures of the Villa del Balbianello, the property that overlooks Lake Como in Italy, showing that the wedding preparations at the venue have begun.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/the-countdown-has-begun-deepika-padukone-ranveer-singh-s-wedding-venue-is-no-less-than-a-beautiful-dream-356564.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_padukone_and_ranveer_singhs_wedding_venue_looks_no_less_than_a_beautiful_dream_1542096242_800x420.png"}