{"text": "Tabaah Ho Gaye is not just a song on which Madhuri Dixit, the dancing diva of Bollywood, danced with sheer grace, beauty and magnificence proving that age is just a number. But it is also the reaction of the most of the people who have watched the Dharma film.\nWhen the trailer of Kalank was out, people called it a rip-off of Sanjay Leela Bhansali movie. Some even said that Karan Johar is trying to copy Bhansali. They predicted he will fail, and going by the box office collection and word of mouth, looks like it’s all come true.\nAlso Read: With Grand Sets & Intense Emotions In 'Kalank', Is Karan Johar Trying To Follow In Sanjay Leela Bhansali's Footsteps?\nDon't Miss 117 SHARES 281 SHARES 199 SHARES\nIt has been four days since the Varun Dhawan and Alia Bhatt starrer had released, but it has still not crossed Rs 100 crore mark. The movie has minted only Rs 54 crores.\nA source from multiplex, according to Deccan Chronicle, said that Kalank is going to be another Thugs Of Hindostan, the movie for which Aamir Khan had to apologise to the audiences.\nBut, Thugs Of Hindostan had crossed 100 crore mark in just three days. The movie then fell flat because of bad word of mouth. Kalank, which has minted only 50 crores so far, was made on an estimated budget of Rs 250 crores. And that’s Karan Johar’s one of the most expensive films till date. Is the movie on it’s way to become a disaster? Well, that’s what sources from leading multiplex chains think.\n“Viewers are walking out of the shows. The audience has failed to connect with the plot, characters and dialogues,” Suman Sinha, an exhibitor from Bihar, told the publication.\nWill the movie affect the career of the leading cast that included Aditya Roy Kapoor, Sonakshi Sinha, Alia Bhatt and Varun Dhawan. Alia Bhatt has been on a roll this year with Raazi and Gully Boy. With a strong bad word of mouth, it seems the movie can be a flop.\n#Kalank is the first movie that I have walked out of.\nOn a star based rating, I would give this movie a blackhole — Amit Tandon (@amitandon) April 17, 2019\nInterestingly, Karan Johar recently admitted that he doesn’t care about the commercial success of the movie. The film will always be important to him because it was his father Yash Johar’s dream.\nWhat’s more? According a report on Bollywood Hungama, Dharma Productions along with Fox Star Studios demanded that the rates of Kalank tickets should be 10% more than that of Thugs Of Hindostan. While the exhibitors are still bearing the loss of Thugs, the demand remained unwelcoming.\n\"I don't think a film like Kalank needs to go above blockbuster pricing. It doesn't have that kind of pedigree. Blockbuster pricing is fine but anything more than that is not fair,\" Vishek Chauhan, owner of Roopbani Cinema in Bihar, quoted as saying.\n*watched Kalank\nmust say 2 things i liked in Kalank movie :-\n1. National Anthem playing before movie starts.\n2. Staff opening Exit-Doors after movie finished.#KalankReview — Pradeep Singh Rawat (@OYE_Chowkidar) April 17, 2019\nTrade experts have predicted that Kalak will die at the box office with a lifetime collection of around Rs 80 crores maximum, reports ibtimes.co.in.\nTrade experts have predicted that Kalank’s lifetime collection will be Rs 80 crores maximum.\nThe movie’s collection is dipping low each day. On Wednesday, it earned Rs 21.60 crores. However, on second day, it could only mint Rs. 11.45 crore. Thanks for negative reviews. The third and the fourth day collection of the movie were 11.60 crore and Rs 9.75 crore on Saturday.\nAfter the superstars failed to spread the magic of their charm on screen in films like Zero, Thugs and Race 3, looks like Karan Johar who was once hailed as the hit formula for success, the man who gave us classics like Kabhi Khushi Kabhi Gham and Kuch Kuch Hota Hai, is also losing his power. What do you think?", "title": "The Most Successful Filmmaker Of Recent Times, KJo Might Witness His Biggest Flop With Kalank!", "date_publish": "21/04/2019, 16:52:06", "description": "Tabaah ho gaye is not just a song on which Madhuri Dixit, the dancing diva of Bollywood, danced with sheer grace, beauty and magnificence proving that age is just a number. But it is also the reaction of the most of the people who have watched the Dharma Production film.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/bollywood/the-most-successful-filmmaker-of-recent-times-kjo-might-witness-his-biggest-flop-with-kalank-365849.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/hailed_as_the_hit_formula_for_success_karan_johar_might_witness_his_biggest_flop_with_kalank_1555845686_800x420.jpg"}