{"text": "Did you know, Abhishek Bachchan holds a Guinness book record? No, we are not making this up. And for this one, he has defeated Hollywood actor Will Smith.\nmrpopat.in\nFor the unversed, Abhishek Bachchan holds the record for Most Public Appearances Made By A Film Star in 12 hours. He made this record in the year 2009 when his film Delhi 6 had released. Abhishek Bachhan travelled 1800 kms to promote his films in seven cities.\nmarkallenpeterson.files.wordpress.com\nThe word Nepotism has haunted a lot of star kids. They undoubtedly get easy opportunities to be launched in the industry, but it is there talent that takes them forward. We can’t say that all star-kids are non-deserving. Actors like Alia Bhatt, Ranbir Kapoor and the latest sensation Vicky Kaushal have proved their mettle.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAbhishek Bachchan has often admitted that there is a pressure of being a ‘Bachchan’. From the beginning of his career he has been compared to his megastar father. That is one of the reasons why his acting skills aren’t appreciated much.\n“I am my father’s son. I didn’t ask him, it wasn’t a choice I made.” – Abhishek Bachchan\ni2.wp.com\nYou would be lying if you say that you never really found a fine actor in him. If you still have doubts, don’t you remember his performance in Mani Ratnam’s Yuva, a film in which he played such an intense role with so much ease? He even won a Screen Award for Best Supporting Actor.\nDhoom is almost unimaginable without Abhishek Bachchan, isn’t it? He tasted commercial as well critical success with this movie. And from there on, he delivered quite a lot of hits.\nThe film that defined cool in 2015 – remember Dus? – Abhishek Bachchan was one of the best performers in the movie. Playing a thief, he indeed stole a lot of hearts in Bunty Aur Babli showcasing his quirky side.\nWith every film, he took up a different role, showcasing his versatility, unlike the Khans of Bollywood. If grapevine is to be believed, Shah Rukh Khan has opted out of Rakesh Sharma biopic after Zero failed miserably at the box office. Why, you ask? Because apparently, he doesn’t want to take risks anymore!\nOn the other hand, Abhishek Bachchan has played a variety of roles without any inhibitions. He even did a movie like Dostana. Now that Ek Ladki Ko Dekha Toh Aisa Laga Has released, it is sure a big deal for everyone. But aren’t we forgetting that Dostana was a commercial movie too that revolved around homosexuality.\nA lot of people argue that it reinforced a lot of gay stereotypes, and indeed it did – perhaps because the audiences at that time weren’t ready for such a film. Also, section 377 wasn’t scrapped back then – and being gay was a crime. Now that it has been decriminalised, Karan Johar has expressed his wish to make a proper gay movie as well. Dostana was a tough choice for Abhishek Bachchan, don’t you think?\nYouTube\nAbhishek Bachchan also did films like Sarkar, LOC Kargil, Bluffmaster, but his best performance was in the film Guru. In Paa, Amitabh Bachchan’s Progenitor-afflicted character was a standout but Abhishek Bachchan’s subtle performance as a politician was applause-worthy too. He even won a National Award for producing that movie. Khelein Hum Jee Jaan Sey is yet another underrated film by Ashutosh Gowariker, but there were a lot of scenes in which Abhishek Bachchan touched our hearts.\nIn films like Hum Tum and Main Prem Ki Dewaani Hun or recently released Manmarizyaan, he didn’t play a solo lead but still struck a chord with the audiences and proved himself to be the charming best in whatever screen time he got.\nTwitter\nEven filmmakers like Anurag Basu and Farah Khan have said that Abhishek Bachchan is an underrated actor, and he is amazing.\n“Abhishek Bachchan is a very underrated actor. He is a fabulous actor, especially when it comes to the tapori scenes and all that. He hasn't been used in that too well.” – Farah Khan\n“Abhishek Bachchan is such an underrated actor. Sometimes he is not pushing it or what, I don’t know, but he is amazing.” – Anurag Basu.\nTwitter\nBut Abhishek Bachchan never gave up. He wasn’t a loser. Just imagine being under so pressure, being the song of legendry Amitabh Bachchan, and constantly being under the scanner. We have all been victims of expectations, right? We all know that feeling. There was no escape for Abhishek Bachchan. He was trolled left, right and centre. And every time he handled them all like a boss.\n@mainbhiengineer haha. Good try! \"Least known celebrity\"?Isn't that a bit of a contradiction? Chalo at least you think I'm worthy of a tweet — Abhishek Bachchan (@juniorbachchan) March 20, 2016\nAbhishek Bachchan experienced brief setback in his career, especially after back-to-back flops including Players, Raavan, Game and Khelein Hum Jee Jaan Sey. He is won in his life a lot of times. Did you know that he struggled dyslexia as a child. At the age of 9, he was sent to European school. “Bachpan mein isko bhi padhne likhne mein takleef hoti thi. Lekin ab dekho, kya Dhoom macha raha hai!\" Aamir Khan had said towards the end of Taare Zameen Par.\nYouTube\n“It doesn't matter whose child you are - if you deliver a flop, filmmakers stop taking your calls,” said Abhishek Bachchan and rightly so. He is brutally honest, and also one of the most down to Earth celebrities. He sure deserves more love, don’t you agree?\nTwitter\nHe isn’t a failure, he never was. He is a man with a good heart. He is the best husband and a great brother too. We all saw his camaraderie with sister Shweta Bachchan on KWK recently. Also, he is a protective father to Aaradhya, and here’s proof:\nTwitter\n@Mayankaryan084 don’t like my movies? That’s cool. Will work harder to make movies you like. Bringing my daughter into it is NOT cool. — Abhishek Bachchan (@juniorbachchan) June 16, 2015\nHis tryst with acting might have not worked so well for him, but he took forward his enthusiasm for sports. He bought the Pro Kabaddi League franchise team Jaipur Pink Panthers, which one the first ever championship in 2014. Also, he bought co-bought the Indian Super League football team Chennai FC, which won the ISL 2015 and 2018.\nFurthermore, he is also doing his bit for social causes. In 2011, he promoted awareness of drug abuse as part of citizen education campaign. He leads by example as a socially responsible star.\nHe has a great sense of humour too. He trolled a comedian, after all.\nTwitter\nTwitter\nHe is a gentleman too. Be it speaking to media or his fans, his polite demeanour and punctuality always wins us over. But that doesn’t mean he’ll take nonsensical questions.\nAbhishek Bachchan will next be seen in Anurag Basu's next, which is said to be a dark comic anthology. The movie also stars Rajkummar Rao, Fatima Sana Shaikh and Aditya Roy Kapur and is slated to release in mid-2019.", "title": "The Sassiest Bachchan! Here's Why Abhishek Bachchan Is A Man Of All Seasons In Bollywood", "date_publish": "05/02/2019, 14:34:24", "description": "Abhishek Bachchan has often admitted that there is a pressure of being a ‘Bachchan’. From the beginning of his career he has been compared to his megastar father. That is one of the reasons why his acting skills aren’t appreciated much. “I am my father’s son. I didn’t ask him, it wasn’t a choice I made.” – Abhishek Bachchan", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/celebs/the-sassiest-bachchan-here-s-why-abhishek-bachchan-is-a-man-of-all-seasons-in-bollywood-361621.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/the_most_underrated_bachchan_heres_why_abhishek_bachchan_isnt_a_loser_and_he_never_was_1549357750_800x420.png"}