{"text": "After a long wait, Winter is finally coming.\nTo give all their fans sleepless nights for about a month, HBO dropped the GoT season 8 teaser and it also reveals the dates and other major deets. The show will premiere on April 14.\nHBO\nThe teaser shows three siblings Jon Snow, Sansa Stark and Arya Stark trying to pave their way and reuniting through the crypts of Winterfell.\nHBO\nWhile there is a lot that happens in the teaser, the major highlight is how the teaser ends as Jon, Sansa and Arya are seen drawing their blades. We can gauge that the siblings prepare themselves for a deadly fight. Without further ado, watch the teaser right here.\nDon't Miss 842 SHARES 12.5 K SHARES\nFans can't contain their excitement and these reactions are proof.\nWow the game of thrones teaser pic.twitter.com/cNtNAq4xsE — dewek (@DerekMHayes) January 14, 2019\n#GameofThrones\nMe hearing Ned and Catelyn's voices in the teaser\nMe seeing Jon, Sansa, and Arya together\nMe freaking out because the white walkers are really here\nMe because it's the last season #GOT pic.twitter.com/5WJOSVmTZc — olivia 🌹 (@LIVtheVIRGO) January 14, 2019\n#GameOfThrones⁠⁠ i was thinking about the trailer and i got to the conclusion that my girl sansa is too beautiful to die\nthis must be illegal\ni mean, this kind of thing just doesn’t happen to beautiful people\nthanks for coming to my TED talk pic.twitter.com/i3VFyp4iL8 — marina nonsense bot (@lokiasgardd) January 14, 2019\nThere will never be another show that will rule over the world like #GameofThrones did. They had 90% of the population being hysterical over it. So, here’s to its legacy and an amazing final season, I can’t wait to see how they will conclude this epic story. #ForTheThrone pic.twitter.com/wf67FasDKS — part of the journey is the end (@bcozofdylan) January 14, 2019", "title": "The New Teaser Of Game Of Thrones Final Season Shows The Stark Children Reuniting", "date_publish": "14/01/2019, 10:35:25", "description": "After a long wait, Winter is finally coming. To give all their fans sleepless nights for about a month, HBO dropped the GoT season 8 teaser and it also reveals the dates and other major deets. The show will premiere on April 14. We can gauge that the siblings prepare themselves for a deadly fight. Without further ado, watch the teaser right here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/the-new-teaser-of-game-of-thrones-final-season-shows-the-stark-children-reuniting-360360.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/game_of_thrones_1547443707_800x420.jpg"}