{"text": "The spine-chilling Nirbhaya rape case had jolted the entire nation's conscience in 2012, after the details of the horrific rape case, in which a woman was gang-raped inside a moving bus. The grave details that included an iron rod being inserted in her private parts which led to her demise later, after she was taken to Singapore's Mount Elizabeth Hospital by the government for her treatment, still gives goosebumps to all of us.\nNow, a film has been made on the chilling story and director Sharique Minhaj says it’s a tribute to the brave woman.\nDirector Sharique Minhaj says his film \"Delhi Bus\" is a tribute to a young Delhi professional who came to be known as Nirbhaya after the horrific gang rape in 2012.\nMinhaj's film is based on the incident when she was brutally gang-raped in a bus in New Delhi on December 16, 2012. A Vipul Shah Production, the plot of the film is inspired by the charge sheet which was filed in a Delhi fast track court detailing the roles of the accused. It also raises questions about women's safety in the country.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Atrocities against women is one of the major topics of discussion in the country today. So, we thought of making (something) which can make a difference to the society, highlighting the problems in an artistic manner,\" Minhaj said in a statement.\n\"We want to dedicate it to Nirbhaya who fought for her life and dignity. We are paying a tribute to her with the film,\" he added.\nThe film, which will release on January 25 next year, stars Divya Singh, Aanjjan Srivastav, Neelima Azeem and Sanjay Singh.\nWith inputs from IANS", "title": "The Trailer Of ‘Delhi Bus’, A Film Based On Delhi’s Nirbhaya Rape Case Will Give You Goosebumps", "date_publish": "16/12/2018, 12:31:24", "description": "Director Sharique Minhaj says his film \"Delhi Bus\" is a tribute to a young Delhi professional who came to be known as Nirbhaya after the horrific gang rape in 2012. Minhaj's film is based on the incident when she was brutally gang-raped in a bus in New Delhi on December 16, 2012. A Vipul Shah Production, the plot of the film is inspired by the charge sheet which was filed in a Delhi.", "authors": [], "url": "https://www.indiatimes.com/entertainment/the-trailer-of-delhi-bus-a-film-based-on-delhi-s-nirbhaya-rape-case-will-give-you-goosebumps-358697.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/tribute_to_nirbhaya_1544944180_800x420.jpg"}