{"text": "The One Where Ross Wasn't The Thief! David Schwimmer Spoofs The Robbery Video To Clear His Name\nThe One Where Ross Wasn't The Thief! David Schwimmer Spoofs The Robbery Video To Clear His Name\nThe one where no one knows who the real thief is.\nPopular American sitcom Friends'star David Schwimmer is trending on the internet since last two days and everyone knows why. It was after a Facebook post put up by the Blackpool Police went crazy viral.\nAccording to the post, the thief in the screenshot of CCTV footage looks exactly like David Schwimmer better known as Ross from popular sitcom F.R.I.E.N.D.S. Instead of helping the cops find the real thief, people started cracking jokes.\n\"It's not been his day, his month or even his year,\" one user joked on Blackpool Police's original.\nOther hilarious responses to the post were,\n1. \"There are rumors he had some accomplices. Miss Chenandler Bong, Regina Phalange and Ken Adams were all seen in the area,\" referring to pseudonyms the characters Chandler, Phoebe and Joey use in the show.\n2. Someone even gave it a name, \"The One Where Ross Became a Thief.\"\n3. Another Friends fan couldn't help but talk about Ross' special skills that include unagi. He wrote, \"He is known to have studied Karate and we believe he has mastered the art of Unagi, the state of total awareness.\"\n4. \"I heard his getaway driver was stuck in 2nd gear,\" wrote another.\nAnd that was when the man himself entered the scene and decided to provide an alibi. Talking about the striking resemblance to his US sitcom's character Ross Geller, he posted a spoof of the video.\nScreengrab\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nIn the video, David can be seen re-enacting the alleged crime.\nPosting the video, he wrote,\nOfficers, I swear it wasn't me.\nAs you can see, I was in New York.\nTo the hardworking Blackpool Police, good luck with the investigation.#itwasntme pic.twitter.com/EDFF9dZoYR — schwim (@DavidSchwimmer) October 24, 2018\n\"Officers, I swear it wasn't me. As you can see, I was in New York. To the hardworking Blackpool Police, good luck with the investigation #itwasntme.\"\nJust before David confirmed, Blackpool Police wrote how the actor was not even under suspicion. They wrote,\n\"Thank you to everyone for your speedy responses. We have investigated this matter thoroughly and have confirmed that David Schwimmer was in America on this date. We're so sorry it has to be this way.\"\nThe post that went viral has over 100,000 comments and has been shared more than 65,000 times.", "title": "The One Where Ross Wasn't The Thief! David Schwimmer Spoofs The Robbery Video To Clear His Name", "date_publish": "25/10/2018, 12:37:20", "description": "And that was when the man himself entered the scene and decided to provide an alibi. Talking about the striking resemblance to his US sitcom's character Ross Geller, he posted a spoof of the video.The one where Ross wasn't the thief.David Schwimmer Spoofs The Viral Robbery Video, Says 'I Didn't steal Beer' From Blackpool Shop", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/the-one-where-ross-wasn-t-the-thief-david-schwimmer-spoofs-the-robbery-video-to-clear-his-name-355414.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/david_schwimmer_1540448982_800x420.jpg"}