{"text": "#1 Not The Night King, Fans Are Convinced That Bran Stark Is The Real Villain Of Game Of Thrones. Here's Why\nThis Reddit User’s theory that Bran is the real villain of Game Of Thrones pretty convincing and insane. He says, “I think there’s more going on than what meets the eye. Why else was Bran warged for so long? Could it be going back in time to prevent all this bloodshed? Could he have been making a deal with the Night King? When the Night King walked up to Bran, he looked like he accepted his fate. I just feel like the Night King is Bran, the Night King was going to kill Bran to destroy himself. I mean, the way the Night King just looked at Bran, it felt like he had to do it when he didn’t want to. Arya ruined the plans for Bran.”\n#2 Kangana Is A 'Bachchi' Who Started Her Journey With Us: Mahesh Bhatt Responds To Rangoli's Claims\n\"...she (Kangana) is a 'bachchi', started her journey with us. Just because her relative (sister Rangoli) is attacking me, I won't comment.\"\n3. Fans Turn College Dome Into Captain America's Shield & Chris Evans Is Mighty Impressed!\nDon't Miss 159 SHARES 126 SHARES\nA group of students, who call themselves hackers, from Institute of Technology (MIT) in Massachusetts transformed the university’s Great Dome into Captain America’s shield.\n4. Josh Brolin AKA Thanos Wants To Snap Up Avengers:Endgame Box Office Collection, Says He Should Get Half Of It!\n“How much of that $1.2 billion do you get?,” asked Jimmy Kimmel, adding that “there are a lot of superheroes but there’s only one super villain.”\n5. Remember The Mystery Teen At The End Of Avengers: Endgame? Here’s Why He Is Super Important!\nThe face of a teen that shows up at the end of the Avengers: Endgame, at Tony Stark's/Iron Man's funeral – oh yeah, he is dead – might have been ignored because you were crying, but the adolescent who was seen at the back of the grieving crowd is super important. Here’s why!", "title": "Theory Suggests Bran Is Villain, Mahesh Bhatt Calls Kangana Ranaut ‘Bachchi’ & More From Ent", "date_publish": "01/05/2019, 18:19:19", "description": "Things have been sour between the Bhatt family and sisters Kangana and Rangoli Chandel. The duo has time and again targeted and accused the Bhatt family. From Soni Razdan, Alia Bhatt to Mahesh Bhatt, Kangana and Rangoli have called all of them out for different reasons.", "authors": [], "url": "https://www.indiatimes.com/entertainment/theory-suggests-bran-is-villain-mahesh-bhatt-calls-kangana-ranaut-bachchi-more-from-ent-366434.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/theory_suggests_bran_is_villain_mahesh_bhatt_calls_kangana_ranaut_bachchi__more_from_ent_1556714205_800x420.png"}