{"text": "These Pictures Of Sunny Leone Will Make You Fall In Love With Her Again\nThese Pictures Of Sunny Leone Will Make You Fall In Love With Her Again\nSunny Leone has carved a niche for herself in the Indian entertainment industry. She was named by Maxim as one of the top 12 porn stars in 2010 and has also won the Penthouse Pet of the Year in 2003 title. The Canadian-born Indian-American actress and model became a household name when she participated in the 2011 edition of Indian reality TV show Bigg Boss. She has also hosted a reality show Splitsvilla.\nSunny has played roles in Bollywood films and television series. She entered the mainstream media in 2005 where she worked as a reporter for the MTV Video Music Awards on MTV India.\nShe has worked in movies like Jism 2, Ragini MMS 2, Jackpot and also has a few South Indian films to her credentials. She has also several item songs to her name. She featured in an item number in the 2013 Bollywood flick Shootout at Wadala. She also was part of the popular number Pink Lips and Shake That Booty opposite Mika Singh from the movie Balwinder Singh Famous Ho Gaya.\nHer autobiography titled \"Karenjit Kaur – The Untold Story of Sunny Leone\" also released last year in July. It was web series that narrates her journey from a middle-class girl in Canada to becoming India's most googled celebrity.\n#1\n#2\n#3\n#4\n#5\n#6\n#7\n#8\n#9\n#10\n#11\n#12\n#13\n#14\n#15\n#16\nDon't Miss 1.4 K SHARES 3.8 K SHARES 117 SHARES\n#17\n#18", "title": "Sunny Leone:Sunny Leone Hot & Sexy Photos, Instagram Images, Pictures", "date_publish": "03/02/2019, 21:50:20", "description": "Karenjit Kaur Vohra known by her stage name Sunny Leone is a Canadian-born Indian-American actress and model, currently active in Indian film industry. She was named Penthouse Pet of the Year in 2003, was a contract performer for Vivid Entertainment, and was named by Maxim as one of the 12 top porn stars in 2010.", "authors": [], "url": "https://www.indiatimes.com/entertainment/these-pictures-of-sunny-leone-will-make-you-fall-in-love-with-her-again-361527.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/sunny_leone_1549211766_800x420.jpg"}