{"text": "Who knew that six years ago, on the sets of Ram Leela, a kiss that was a part of the script would have resulted in a fairytale wedding? That magical kiss, can be rightfully called the beginning of forever for Ranveer Singh and Deepika Padukone.\nFrom what started as a mutual attraction and admiration for each other, later culminated into romance, followed by a solid rock relationship, which they finally solemnized by exchanging vows at Lake Como in Italy.\nInstagram\nIt was a wedding that wasn't just lavish and 'extra' in terms of set up and arrangements but from their emotions to their love, everything was so extra that you can't help but gush over them.\nWe have seen them making a public appearance a lot of times but the pictures from the ceremony are so full of love and joy that you feel like you're a part of their love story too. There wasn't anything pretentious about them. The wedding must have taken place in Italy but everything was Desi - right from the ceremonies to the photographs that were shared on social media.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nViral Bhayani\nEven if you missed seeing the pictures from the wedding, we have got you covered. Here are all the photographs from their ceremony to the after-wedding appearance in India that truly make them one of the most loved couples of Bollywood.\n#1\nerrikosandreouphoto\n#2\nerrikosandreouphoto\n#3\nerrikosandreouphoto\n#4\nerrikosandreouphoto\n35\nerrikosandreouphoto\n#6\nerrikosandreouphoto\n#7\nerrikosandreouphoto\n#8\nerrikosandreouphoto\n#9\nerrikosandreouphoto\n#10\nerrikosandreouphoto\n#11\nerrikosandreouphoto\n#12\nerrikosandreouphoto\n#13\nerrikosandreouphoto\n#14\nerrikosandreouphoto\n#15\nInstagram/Shaleena Nathani\n#16\ninstagram/Nitasha Gaurav\nThe magic didn't end there. The couple returned to India and greeted the media.\n#17\nViral Bhayani\n#18\nViral Bhayani", "title": "These 18 Frame-Worthy Photos From DeepVeer Wedding Reflect How Smooth-Sailing Their Love Is", "date_publish": "21/11/2018, 16:10:02", "description": "This magical kiss is what we can call the beginning of forever for Ranveer Singh and Deepika Padukone. From what started as a mutual attraction and admiration for each other, later culminated into romance, followed by a solid rock relationship, which they solemnized by exchanging vows at Lake Como in Italy.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-18-frame-worthy-photos-from-ranveer-deepika-s-wedding-reflect-how-smooth-sailing-their-love-is-357092.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542795445_800x420.jpg"}