{"text": "The one where we take you on a nostalgia trip...\nWell, FRIENDS is one of the best TV shows and people who have an opinion that contradicts with this one are the ones who haven't watched it. No matter how bad a day gets, there is nothing in life that can't be fixed with an episode of FRIENDS.\ntwitter\nIt's an antidote to monotony of life. It's been more than a decade that the show ended but the madness around Joey, Phoebe, Monica and Chandler still remains the same.\nTwitter\nThey redefined friendship goals and gave us important lessons in life.\nFrom why Joey Doesn't Share Food to Ross' crazy obsession with the sandwich that his boss ends up finishing- the show gave us endless memorable moments that we will remember forever.\nDon't Miss 1 K SHARES 738 SHARES 699 SHARES 1.2 K SHARES 16.6 K SHARES\nAs much as we love the show, the cast of the show too is attached to the show that made their careers! From Courtney Cox to Jennifer Aniston, the Friends stars are friends in real-life and their mini-reunions over the years have proved that: They will indeed be there for each other-FOREVER.\nRecently, Courteney Cox took to social media and posted a photograph with Jennifer Aniston and the fans had a mini deja-vu! The internet couldn't handle the Monica-Rachel PDA and they dropped some really adorable lovey-dovey comments on their bond!\nThe thing that caught people's attention was Monica's caption for Rachel :\n“The world definitely got brighter the day this girl was born. Happy birthday sweetheart! I Love you!”\nThe cast is still connected and they bond often when they meet for personal and work commitments.\nInstagram\nTo take you to a nostalgia trip, here are the deets on some of the major reunions of the cast!\n1. In order to help Courteney Cox promote her new show and Instagram, Ellen DeGeneres created a Friends set. She invited Lisa Kudrow for a surprise appearance and the pictures went viral on the internet.\nTwitter\n2. In December 2018, Courtney Cox supported her friend and made an appearance at premiere event for her Netflix movie Dumplin'.\n3. In June 2018, Courtney and Anniston attended the Chanel Dinner Celebrating Our Majestic Oceans benefit for NRDC Malibu.\nAgencies\n4. In June 2018, Jennifer Aniston were spotted together as they attended the American Film Institute's 46th Life Achievement Award Gala Tribute to George Clooney.\nAGENCIES\n5. In 2016, everyone's beloved Joey and Chandler reunited in London. LeBlanc and Mathew Perry had a reunion backstage after the latter star's performance in his play The End Of Longing. This also marked his play-writing debut.\nInstagram\n6. The Biggest Reunion Ever: Lisa Kudrow, David Schwimmer, Courteney Cox, Matt LeBlanc and Jennifer Aniston reunited for a 2016 NBC special dedicated to Friends director James Burrows. The only sad thing about the reunion was that Matthew Perry couldn't attend it as he was in London to star in his play The End of Longing. But his videotaped message for the entire cast sort of made up for his absence.\nInstagram\n7. In January 2016, a major reunion happened when the cast of Friends met the cast of The Big Bang Theory. Kaley Cuoco was elated with the reunion and she took to Instagram and wrote: \"Ummmm NIGHT MADE. Can't breathe #friends meets #bbt @bigbangtheory_cbs I died and went to heaven.\"\n8. Monica and Joey reunion: The two reunited at the 2016 WGA Awards. They appeared together onstage to present an award.", "title": "These Reunions Of FRIENDS Cast Over The Years Prove They Are Indeed 'Friends Forever'!", "date_publish": "18/02/2019, 12:36:56", "description": "As much as we love the show, the cast of the show too is attached to the show that made their careers! From Courtney Cox to Jennifer Aniston, the Friends stars are friends in real-life and their mini-reunions over the years have proved that: They will indeed be there for each other-FOREVER.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-reunions-of-friends-cast-over-the-years-prove-they-are-indeed-friends-forever-362339.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/friends_1550476835_800x420.jpg"}