{"text": "These Videos Of Rajinikanth Dancing At Daughter’s Wedding Will Warm The Cockles Of Your Heart\nThese Videos Of Rajinikanth Dancing At Daughter’s Wedding Will Warm The Cockles Of Your Heart\nSuperstar Rajinikanth's daughter Soundarya Rajinikanth married actor-businessman Vishagan Vanangamudi in Chennai today. After an intimate pre-wedding party, the couple tied the knot amidst their close relatives and friends.\nJust to jog your memory a little, Tamil Nadu chief minister Edappadi K Palaniswami and actor Kamal Haasan, were invited for another intimate wedding celebration last week.\nThe pictures from their wedding celebrations are all over the internet. The ceremony took place today and the couple tied the knot. Have a look at the first pictures.\nInstagram\nDon't Miss 282 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nTamil Nadu: Newly married couple Soundarya Rajinikanth and Vishagan Vanangamudi, the two tied knot at The Leela Palace hotel in Chennai today. pic.twitter.com/2Vo6N8KTiK — ANI (@ANI) February 11, 2019\nTamil Nadu: Newly married couple Soundarya Rajinikanth and Vishagan Vanangamudi, the two tied knot at The Leela Palace hotel in Chennai today. pic.twitter.com/2Vo6N8KTiK — ANI (@ANI) February 11, 2019\nBut it is Rajinikanth who is winning the internet and everyone's hearts-thanks to his special dance moves at the wedding.", "title": "These Videos Of Rajinikanth Dancing At Daughter’s Wedding Will Warm The Cockles Of Your Heart", "date_publish": "11/02/2019, 16:45:23", "description": "Superstar Rajinikanth's daughter Soundarya Rajinikanth married actor-businessman Vishagan Vanangamudi in Chennai today. After an intimate pre-wedding party, the couple tied the knot amidst their close relatives and friends. The pictures from their wedding celebrations are all over the internet. The ceremony took place today and the couple tied the knot. Have a look at the first pictures.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-videos-of-rajinikanth-dancing-at-daughter-s-wedding-will-warm-the-cockles-of-your-heart-361968.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/rajinikanth_1549883864_800x420.jpg"}