{"text": "These Pics Of Varun, Madhuri & Katrina Prove Their Holi Was The Right Mix Of Crazy & Classy!\nThese Pics Of Varun, Madhuri & Katrina Prove Their Holi Was The Right Mix Of Crazy & Classy!\nHoli as a festival is all about chilling, splashing colors and gorge on unlimited sweets apart from spreading love, peace and happiness. From commoners to celebrities, everyone goes in a party mode and rightly so!\nTwitter\nRight from Varun Dhawan, Madhuri Dixit to Siddharth Malhotra, everyone celebrated this day with filled with love and happiness.\nVarun Dhawan posted the picture of himself with girlfriend Natasha Dalal which went viral within minutes. The actor has openly spoken about his love for Natasha and has no qualms in making his relationship public anymore. Rumour has it, the couple will soon tie the knot. Don’t they look just lovely together?\nInstagram\nWhile Madhuri Dixit’s Holi looked super special with her entire family. The actress shared a beautiful picture of herself with her hubby and kids, she looked gorgeous with her million dollar smile.\nDon't Miss 207 SHARES 161 SHARES 699 SHARES 1.1 K SHARES\nSidharth Malhotra looked a bit high with enthusiasm. He shared the video of himself enjoying the Holi rhythm playing in his head. Looks like the actor thoroughly enjoyed the Holi party.\nA day to let loose, spread love & add a splash of colour to our lives! Wishing everyone a happy and joyful Holi ❤ 🌈 #HappyHoli pic.twitter.com/X5KgvBQjnl — Sidharth Malhotra (@SidMalhotra) March 21, 2019\nSunny Leone posted a picture with hubby Daniel Weber and her three adorable kids. The picture will definitely give you family goals.\nApart from them, Katrina Kaif had a glamorous one as she attended the Zoom Holi party looking nothing short of a princess. She looked ravishing to say the least.\nTake a look at all the pictures of Bollywood celebs celebrating Holi.\nTwitter\nArjun Rampal was papped with girlfriend Gabriella celebrating their first Holi together.\nWishing everyone a happy and safe Holi! #HappyHoli pic.twitter.com/ekWCcj3kwW — Saiyami Kher (@SaiyamiKher) March 21, 2019", "title": "These Pics Of Varun, Madhuri & Katrina Prove Their Holi Was The Right Mix Of Crazy & Classy!", "date_publish": "22/03/2019, 15:29:18", "description": "Holi is a festival where you ease yourself, splash with colors, gulp unlimited sweets and spread love peace and happiness. From layman to celebrities everyone goes crazy on this day and it’s totally legit. This year’s Holi too was as fascinating and extremely colorful and joyful. Right from Varun Dhawan, Madhuri Dixit, Siddharth Malhotra, every celebrity celebrated this day with full of love and h", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/these-pics-of-varun-madhuri-katrina-prove-their-holi-was-the-right-mix-of-crazy-classy-364123.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/happy_holi_1553244639_800x420.jpg"}