{"text": "Valar morghulis!\nIt’s difficult to digest the fact that Game Of Thrones is coming to an end, right? Just imagine, in less than two months, you will be watching the ending of your favourite TV show. Sitting on the edge of your seat, tears will roll down your eyes. It will leave a void in your heart.\nvia GIPHY\nFor so many years, we all waited to see who will sit on the Iron Throne, and how the Night King will be defeated. What will go down in the finale episodes, fans cannot stop speculating. Here are some of the fan theories on how Game of Thrones season 8 will end, they will all blow your mind. Take a look!\nvia GIPHY\n#1 Jon Snow will kill Daenerys Targaryen\nvia GIPHY\nGame Of Thrones season 7 ended with subtle hints that Daenerys Targaryen is pregnant with Jon Snow’s child. Is another royal baby on its way? Well, that remains to be seen but there is a hint of love blooming between the two for sure.\nWhat has that got to do with this theory? According to another popular theory Jon Snow is Azor Ahai, the Lord of Light who is to be reborn as the The Prince That Was Promised. If Jon Snow is indeed Azor Ahai, then you must know that he sacrificed his own wife Nissa Nissa. Why? Because he was facing a tough time forging his fabled flaming sword Lightbringer, and to tame it down, he realised, he had to put it into the heart of his wife in order to imbue its power.\nSo, if Jon Snow is Azor Ahai, will he stab Daenerys Targaryen? Because according to his logic killing a powerful woman would turn him into a hero.\nDon't Miss 161 SHARES 842 SHARES\nThe makers had said that the end of GoT will leave a lot of people disappointed. Is that the reason why? Only time will tell.\n#2 Arya Stark Will Kill Cersei\nvia GIPHY\nA lot of fans are already convinced with the theories suggesting that Jaime will kill Cersei. Remember Maggy the witch had also predicted the same for Cersei. She said that a volanqar (younger sibling) will kill her. “And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you,” she had said.\nBut would that be so simple? According to this theory, Arya Stark will kill Cersei, wearing Jaime’s face. So, she will kill Jaime first and use his face to kill Cersei.\n#3 Bran will be in coma until the very end.\nvia GIPHY\nIs Bran the Night King? A lot of people have been speculating that. Game of Thrones can’t be so predictable, right? According to this theory, Bran will remain in coma until the very end. He will only imagine what’s happening on the show, and try to put all his family into the plot of Old Nan's stories. These theories are not from the past but about the present, suggests this theory. So, she has been warning him all this while.\n#4 Not Jaime Lannister, but Euron Greyjoy is the father of Cersei’s unborn child\nvia GIPHY\nIf Cersei’s incestuous relationship with his brother Jaime Lannister and their unborn child wasn’t shocking enough, this theory will leave your mind blown. According to this theory, in the end it will be revealed that the unborn child was that of Euron Greyjoy. Some people aren’t actually able to digest the fact that Cersei has let her brother Jaime ride North to fight the White Walkers. Why would she take that risk knowing that the father of her child might just die and never come back? Also, remember Cersei and Euron had cooked up a plan to betray Jon Snow and Daenerys? What was she doing with him behind his back? That’s a crazy theory, right?\n#5 Everyone will die in the end!\nvia GIPHY\nIf you remember The God’s Eye, the God’s eye is the largest lake of the Seven Kingdoms. According to this theory, The God’s Eye is actually a volcano waiting to erupt.\n“A volcano is beneath Winterfell you can tell because the ground isn't level, the door to the crypt is awkwardly slanted and the hot springs. The Crypts are cold because they were built with ice magic by Bran the Builder like the wall was, in order to keep the Volcano beneath Winterfell tame,” explains the Reddit user.\nAlso, Melisandre had earlier said War for the Dawn had said that it will be a war for life itself.\n#6 Game of Thrones is all about Bran!\nvia GIPHY\nFans believe that Bran has major role in how Game of Thrones and its characters have been shaped. And he is responsible for almost everything that is happening on the show. Is he the Night King? Yes. Did he build the wall? Yes. And fans have derived this from the books. Here’s the excerpt.\n“I could tell you the story about Brandon the Builder,\" Old Nan (an elderly servant at Winterfell who is known for her storytelling) said. \"That was always your favorite.\" Thousands and thousands of years ago, Brandon the Builder had raised Winterfell, and some said the Wall. Bran knew the story, but it had never been his favorite. Maybe one of the other Brandons had liked that story. Sometimes Nan would talk to him as if he were her Brandon, the baby she had nursed all those years ago, and sometimes she confused him with his uncle Brandon, who was killed by the Mad King before Bran was even born. She had lived so long, Mother had told him once, that all the Brandon Starks had become one person in her head.”\nWhat do you think?\n#7 Night's Watch will destroy the Night King!\nvia GIPHY\nYou are all aware of the Azor Ahai prophecy, right? – the Prince Who Was Promised will kill the Others with his Lightbringer, sword of light.\nNow, do you remember the Night's Watch vow? “I am the sword in the darkness. I am the watcher on the walls. I am the fire that burns against the cold, the light that brings the dawn.”\nDo you see the connection? According to this theory, Night’s Watch is the Lightbringer, and it will destroy the Night King.", "title": "These Mind-Blowing Theories About Game Of Thrones S8 Will Prepare You For Every Possible End!", "date_publish": "02/03/2019, 14:55:10", "description": "It’s difficult to digest the fact that Game Of Thrones is coming to an end, right? Just imagine, in less than two months, you will be watching the ending of your favourite TV show. Sitting on the edge your seat, tears will roll down your eyes. It will leave a void in your heart. Here are some of the fan theories on how Game of Thrones season 8 will end, they will all blow your mind.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/these-mind-blowing-theories-about-game-of-thrones-s8-will-prepare-you-for-every-possible-end-362421.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/game_of_thrones_season_8_theories_fans_predict_how_the_muchawaited_show_will_come_to_its_end_1550573166_800x420.png"}