{"text": "Before fighting their own battles to claim the Iron Throne, the lead characters in Game of Thrones season 8 have a more pressing issue to deal with first - the White Walkers led by the Night King.\nJon Snow (played by Kit Harington) and Daenerys Targaryen (Emilia Clarke) have already witnessed the power of the Night King and they are desperately looking for a way to kill him.\npinimg.com\nWill the Night King kill them all or will they be killed in the final season of Game Of Thrones? There are endless questions in the minds of Game of Thrones’ fans, and therefore speculations and discussions are only going to end once the season comes on air.\npinimg.com\nDon't Miss 1 K SHARES 264 SHARES 161 SHARES\nIn the last season we saw, Jon and Danny asking for Cersei’s help to kill the army of the dead, but she denies the aliance since Jon decides not to bend the knee. However, after a lot of coaxing and convincing by Tyrion and Jamie, she gives in only to betray them in the end. This has obviously opened the door to a lot of speculative theories. Check out some of the legit ones, right here:\nTheory 1\nJaime Lannister (Nikolaj Coster-Waldau) will kill the Night King, think people while discussing it on a Reddit thread.\ntimedotcom\n“Throughout the entire series Jaime has been defined by his past; he is the Kingslayer… My prediction is what a better way to redefine yourself and kill the Kingslayer name that has lived with him since he was a boy, than to become the Kingslayer; the Night Kingslayer”\nTheory 2\nAnother fan theory says that the dragon fire will be used to break down the iron throne, which is made of Valyrian blade. The swords from the throne will be used to arm thousands of men, who will kill the white walkers.\ncroatia-times.com\nWell, if that happens, it would be a historic end, right?\nAlso Read: Sophie Turner Predicts ‘Game Of Thrones’ Finale Will Divide Fans, Leaving Many ‘Disappointed’\nTheory 3\nAnother theory suggests that since the throne has Valyrian blade, Night King will die on its own attempting to sit on the Iron Throne.\nWhich of these theories sound believable to you? Tell us in the comments section below.\nAlso Read: From Winterfell To King’s Landing, Now You Can Take A Tour Of The Game Of Thrones' World IRL", "title": "These Fans Theories Suggest Night King Might Die A Shocking Death In ‘Game Of Thrones’ Season 8", "date_publish": "15/10/2018, 14:32:50", "description": "Jon Snow (played by Kit Harington) and Daenerys Targaryen (Emilia Clarke) have already witnessed the power of the Night King and they are desperately looking for a way to kill him. Will the Night King kill a few, or will be killed soon in the finale season of Game Of Thrones? There are endless questions in the minds of Game of Thrones’ fans, and so speculations and discussions are already on.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/these-fans-theories-suggest-night-king-might-die-a-shocking-death-in-game-of-thrones-season-8_-354807.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/these_fans_theories_suggest_night_king_might_die_a_shocking_death_in_game_of_thrones_season_8_1539592443_800x420.png"}