{"text": "These Happy Pictures Of Irrfan Khan From The Sets Of 'Angrezi Medium' Is Making The Internet Happy\nThese Happy Pictures Of Irrfan Khan From The Sets Of 'Angrezi Medium' Is Making The Internet Happy\nOut of many good things that happened in 2o19, the news of Irrfan Khan returning to films is probably on the top. The actor was abroad for a long period of time, where he was getting treated for Cancer. The news in itself was devastating enough and then Irrfan Khan's absence from films just made it more worrisome for all his fans and the people from the film fraternity.\nHowever, when he returned to India, everyone was relieved. The actor returned from London last month after undergoing treatment for neuroendocrine tumour. The actor is healthier and fit and is on his toes to fulfill his professional commitments.\nJust a few days ago, pictures from the first day of the shoot of Angrezi Medium and fans flooded social media with welcome back messages for their favourite actor.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nIrrfan is currently in Udaipur for the shoot and everyday, the updates from the sets are making way on the internet.\nJust recently, Khan posed for a picture with Radhika Madan (Who will be playing the role of his daughter) and the entire team of the film and it's perfect!\nReplacing Saba Qamar , Kareena Kapoor Khan would be seen as Irrfan Khan's wife in the film. On Thursday, an official confirmation was also made.\nRevealing more about Kareena’s character in the film, producer Dinesh Vijan had said,\n“Kareena is a great addition to our franchise! Angrezi medium is a very special film, and I’m excited that she’s going to be a part of it. We wanted to introduce this character who would be taken forward in the franchisees to come,and she’s perfect for it. Here she plays a cop, a role she’s actually never done before! We will be shooting in London this June, and it will be great to be back on set with her.”\nThe film is slated to release in 2020.", "title": "These Happy Pictures Of Irrfan Khan From The Sets Of 'Angrezi Medium' Is Making The Internet Happy", "date_publish": "26/04/2019, 11:56:28", "description": "Out of many good things that happened in 2o19, the news of Irrfan Khan returning to films is probably on the top. The actor was abroad for a long period of time, where he was getting treated for Cancer. The news in itself was devastating enough and then Irrfan Khan's absence from films just made it more worrisome for all his fans and the people from the film fraternity.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-happy-pictures-of-irrfan-khan-from-the-sets-of-angrezi-medium-is-making-the-internet-happy-366123.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/irrfan_khan_1556260078_800x420.jpg"}