{"text": "Long gone has the time when love in Hindi films were about two flowers blooming or hero-heroine running around trees, chasing each other and then suddenly falling down to cheesy hugs.\nRomance on the big-screen has evolved from heroines drenched in the water wearing a white saree to hero and heroine smiling at each other just because they are having their first meal together post-marriage (Film in context: Sui Dhaaga).\nFilmmakers have realized that to keep up with the pace of millennial love-stories, you need more emotions with a little 'tadka' of realism. It's not just about two people falling in love and living happily-ever-after anymore.\nIt's about meeting-getting closer-things getting complicated-breaking up-stalking on social media-patching up and then marriage might just be one of the options but it still doesn't become an obvious next step.\nThis year, films gave us some unconventional love stories, proving that love isn't as simple as it used to look in films of 80's-90's.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n1. Badhaai Ho\nJunglee Pictures\nBadhaai Ho isn't just one of the most commercially successful films of the year. It is special for reasons more than one. It normalized an elderly couple's sex-life and made it acceptable for the kids too.\nThe film wasn't just about Ayushmann Khurrana and Sanya Malhotra's on-screen romance. The moments between Neena Gupta and Gajraj Rao were all about love and romance. The way he steals her glance while attending a wedding or how he takes care of his pregnant wife and stands up for her during the crisis is what makes this one of the most adorable love stories of the year. Because love is all about sticking together at every and any situation. Isn't it?\n2. Sui Dhaaga\nYashraj Films\n\"Tum ro kyun rahi ho Mamta?\"\n\"Shaadi ke baad pehli baar sath mein khana kha rahe hain..\"\nThis scene between Mamta and Mauji must have left several teary-eyed and why not? After marriage, every girl has certain set of expectations from the man she loves but not every time you can express what you want. However, these exchanges between Mamta and Mauji became the core of this heart-warming yet predictable film. From supporting each other to falling in love with every success and failure, Sui Dhaaga gave us a closer look on how real the struggles are in love and how it's important to stick around.\n3. Raazi\nSehmat and Iqbal's love story neither starts on a normal note neither ends but just like love in real life, it's perfect in parts. Sehmat is forced to marry Iqbal as part of a larger conspiracy planned by his ailing father but they end up falling for each other.\nIn one of the scenes of the film, Iqbal gifts Sehmat anklets and they consummate their marriage. While Alia led the film like a boss, their love story managed to move many.\n4. Love Per Square Foot\nNetflix\nTaking a dig at Mumbai's unreasonable residential policies, this film was a heartwarming tale of Sanjay and Karina. They come together for a reason but fall in love unreasonably. The film that was released on Netflix received rave reviews and Vicky Kaushal and Angira Dhar's on-screen romance was refreshing and vibrant.\n5. Pari\nClean Slate Films\nIn India, for the first time ever we saw a horror film that had shades of love and affection. Startled? Well, you might have missed out on watching Anushka Sharma's Pari but the way film wrapped around a love story around its horror plot was extremely commendable. In one of the scenes, Arnab cuts Ruksana's nails and the way their affection blossom for each other is what makes this an unconventional love story.\n6. October\nDan's unconditional love for Shiuli broke a lot of hearts this year. October was a film that broke hearts only to sew it back together with the kind of affection that the story reeked of. They never interacted much or spoke about each other's feelings but Dan becomes an inseparable part of Shiuli's almost-fatal tragedy. Love is not about words or conversations. Sometimes it's about silence and being there for each other and October managed to capture it all really well.\n7. Padmaavat\nThis year's most controversial movie Padmaavat went on to become one of the biggest blockbusters. The romance between Maharawal Ratan Singh and Rani Padmavati wasn't just graceful, but it was dignified. From standing up for her to protecting her privacy and dignity, Bhansali's love-story was impressive and intriguing. Who would have ever thought that Shahid Kapoor and Deepika Padukone might end up creating this sizzling chemistry on the silver-screen?", "title": "These 7 Love Stories Of 2018 Proved Romance In Cinema Is No Longer About Running Around Trees!", "date_publish": "03/11/2018, 13:22:20", "description": "In India, for the first time ever we saw a horror film that had shades of love and affection. Startled? Well, you might have missed out on watching Anushka Sharma's Pari but the way film wrapped around a love story around its horror plot was extremely commendable. In one of the scenes Arnab cuts Ruksana's nails and the way their affection blossom for each other is what makes this an unconventional", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-7-love-stories-of-2018-proved-romance-in-cinema-is-no-longer-about-running-around-trees-355858.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/cinema_1541070925_800x420.jpg"}