{"text": "These Three Characters Will Most Likely Meet Their End In Game Of Thrones Season 8 Episode 3\nThese Three Characters Will Most Likely Meet Their End In Game Of Thrones Season 8 Episode 3\nWhile the entire nation is basking in the glory of the epic movie that Avengers: Endgame was, we all sort of forgot about Game Of Thrones, didn’t we?\nIn Game of Thrones episode 2 of the show which will soon come to an end was perhaps the last time we saw all the characters alive and together. The battle will begin soon, and our favourite characters will meet their end.\nPeople have been speculating as to who will die first in this finale season. Some fans have even prepared a list, which is quite viral on social media.\nTwitter\nBut, when the winter finally arrives in Winterfell, some of the key characters will die. Among the characters in dangers, these ones will likely breathe their last in Game of Thrones season 8 episode 3.\nDon't Miss 246 SHARES 1.9 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nYou know the drill, right? The information below could be potential Game of Thrones season 8 episode 3 spoilers. Scroll down at your own risk.\n#1 Theon Greyjoy\nAs per bets on Sportsbetting.ag, which is online sports betting site, chances of Theon Greyjoy dying in episode 3 are the highest. Bets put 4-to-1 odds on him dying first.\n#2 Jaime Lannister\nPopular theories might suggest that Jaime Lannister will kill Cersei, but according to Sportsbetting.ag, odds on Jaime dying first are 5-to-1.\n#3 Brienne of Tarth\nBrienne of Tarth, who recently became the first woman knight of the show’s Seven Kingdoms, fetches 12-to-1 odds on dying first.\nAlso Read: This Baby Dressed Up As Brienne Of Tarth To Welcome Game Of Thrones Season 8 & We Can’t Stop Swooning\nWho do you think will die first in Game Of Thrones season 8 episode 3? Meanwhile, do you know that this episode will be 82 minutes long, and that it took 55 nights to film the episode. It will mark the beginning of the bloodiest finale battle at the Winterfell. Are you all ready?\nAlso Read: Blood Bath Is About To Begin & These Latest Pics Of Game Of Thrones Show Jon Snow Is Terrified!\nWith inputs from Reuters", "title": "These Three Characters Will Most Likely Meet Their End In Game Of Thrones Season 8 Episode 3", "date_publish": "28/04/2019, 13:18:26", "description": "In the episode 2 of the show which will soon come to an end was perhaps the last time we saw all the characters alive and together. The battle will begin soon, and our favourite characters will meet their end. But, when the winter finally arrives in Winterfell, some of the key characters will die. Among the characters in dangers, these ones will likely breathe their last in Game of Thrones season", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/these-three-characters-will-most-likely-meet-their-end-in-game-of-thrones-season-8-episode-3_-366229.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/these_three_characters_will_most_likely_meet_their_end_in_game_of_thrones_season_8_episode_3_1556435974_800x420.png"}