{"text": "These Pictures Of Deepika Attending Her Friend's Wedding As A Bridesmaid Are Surreal & Gorgeous!\nThese Pictures Of Deepika Attending Her Friend's Wedding As A Bridesmaid Are Surreal & Gorgeous!\nFor every woman, girlfriends hold a very special place in her life. Especially when someone decides to get married, girlfriends are someone the bride totally depends and counts on.\nJust to jog your memory a little, Deepika Padukone and Ranveer Singh had flown to Sri Lanka for a friend's wedding last year and now after a really long wait, the pictures are finally out.\nInstagram\nWhile we gushed over the #DeepVeer wedding pictures for months, we now have a fresh batch of pictures that will make you wish, you had a friend like Deepika on your wedding day too. Fashion designer Sabyasachi Mukherjee shared pictures from Deepika's friend Srila Rao's wedding who was also his client.\nThe couple tied the knot in a private beach wedding at Villa Bentota in Sri Lanka.\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nFrom helping her get ready to giving her a pep talk about the new journey of her life, the pictures are surreal and dreamy. Have a look at the pictures that prove Deepika was the perfect bridesmaid at her friend's wedding.", "title": "These Pictures Of Deepika Attending Her Friend's Wedding As A Bridesmaid Are Surreal & Gorgeous!", "date_publish": "22/01/2019, 16:40:49", "description": "While we gushed over the #DeepVeer wedding pictures for months, we now have a fresh batch of pictures that will make you wish you had a friend like Deepika on your wedding day too. Fashion designer Sabyasachi Mukherjee shared pictures from Deepika's friend Srila Rao's wedding who was also his client.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-pictures-of-deepika-attending-her-friend-s-wedding-as-a-bridesmaid-are-surreal-gorgeous-360860.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/deepika_padukone_1548155632_800x420.jpg"}