{"text": "These Pics Of Suhana Khan Dressed As Juliet For Her College Play Proves She Is A Born Actor!\nThese Pics Of Suhana Khan Dressed As Juliet For Her College Play Proves She Is A Born Actor!\nSuhana Khan may not be in Bollywood yet but all her energies, creativity and focus seems to be around that already. Acting seems to be her forte ad she is truly excelling in it. In her College, Suhana is in the dramatics society and we are not surprised.\nPlaying the role of Juliet, Suhana recently stole the show in her University. Despite that, her father Shah Rukh Khan is clear that Suhana needs to complete her education before taking up full-fledged acting. Suhana is obedient and balancing the two in her own little way.\nSometime ago, SRK had even shared her picture in the poster of Romeo and Juliet. And now more photos have surfaced from that play and rehearsals. Take a look.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nTwitter\nTwitter\nTwitter\nTwitter\nSuhana looks beautiful in some of these black and white pictures in her silky long tresses and off shoulder top.\nSpeaking about her daughter, SRK had recently said, “My daughter is sanwli (dusky), and she’s the most beautiful girl in the world.” Clearly the pictures are proof that Suhana is ready to take on the world of Bollywood anytime soon.", "title": "These Pics Of Suhana Khan Dressed As Juliet For Her College Play Proves She Is A Born Actor!", "date_publish": "06/12/2018, 14:01:48", "description": "Suhana Khan may not be in Bollywood yet but all her energies, creativity and focus seems to be around that. Acting seems to be forte ad she is excelling in it. In her College, Suhana is in the dramatics society and we are not surprised.Suhana Khan may not be in Bollywood yet but all her energies, creativity and focus seems to be around that. Acting seems to be forte ad she is excelling in it. In h", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/these-pics-of-suhana-khan-dressed-as-juliet-for-her-college-play-proves-she-is-a-born-actor-358044.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/suhana_1544079564_800x420.jpg"}