{"text": "These Funny Memes On Alia Bhatt & Varun Dhawan’s Kalank Are More Entertaining Than The Trailer\nThese Funny Memes On Alia Bhatt & Varun Dhawan’s Kalank Are More Entertaining Than The Trailer\nKalank’s trailer released yesterday and within 24 hours it became a meme fest on social media which will definitely tickle your funny bone. Tthe trailer looks visually rich and royal and some even compared the look and feel to Sanjay Leela Bhansali's movies, but more than the trailer, the audience is enjoying the memes made on it.\n#Kalanktrailer\nWhen Sharma Ji Ka beta scores more marks then you.🤦\nYour Parents- pic.twitter.com/S7jcbJeRPy — Chuski🥃 (@chuski08) April 3, 2019\nAlia Bhatt once mentioned that she enjoys memes on her films, in fact she feels memes on the films means it’s a super hit. Wel, she could be right as her last release Gully Boy has some rib-tickling memes and the film turned out to be one of the biggest hits of the year. We hope this continues with Kalank too.\nAlso read: With Grand Sets & Intense Emotions In 'Kalank', Is Karan Johar Trying To Follow In Sanjay Leela Bhansali's Footsteps?\nTwitter\nTalking about the trailer, Alia and Varun look promising as a couple, Aditya Roy Kapur indeed mesmerizes us and we can't wait to watch him after a long gap, but Kunal Kemmu’s cameo definitely takes you by surprise. Sanjay Dutt and Madhuru Dixit reunite after almost 2 decades and it seemed like a beautiful reunion. Last but not the least Sonakshi Sinha looked gorgeous and the most beautiful character so far.\nThe movie is slated to release on 17th April, 2019. Do drop your thoughts or memes about Kalank’s trailer in the comment box below.", "title": "These Funny Memes On Alia Bhatt & Varun Dhawan’s Kalank Are More Entertaining Than The Trailer", "date_publish": "04/04/2019, 12:34:59", "description": "Finally, Kalank’s trailer was out yesterday and within 24 hours it became a meme fest on social media which will definitely tickle your funny bone. Well, the trailer looks visually spectacular, but more than the trailer, audiences are enjoying the memes made on it because it’s damn hilarious.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/these-funny-memes-on-alia-bhatt-varun-dhawan-s-kalank-are-more-entertaining-than-the-trailer-364852.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/kalank_1554362331_800x420.jpg"}