{"text": "These Pics Of Alia-Deepika & Ranveer-Ranbir Bonding Prove That Friendships Do Last In Bollywood\nThese Pics Of Alia-Deepika & Ranveer-Ranbir Bonding Prove That Friendships Do Last In Bollywood\nIn an industry where everything changes with the blink of an eye, not every friendship passes the test of time. The industry is competitive and ruthless and uncertainty remains the center point of it all. However, there have been examples recently that prove how with little effort and maturity, you can find your people to lean on!\nTwitter\nBe it being there for someone when they are receiving an award or just turning up at their film screenings to extend support, the trend seems to be changing and this is definitely a delightful change.\nFor instance, last night, at the Zee Cine Awards, Ranbir Kapoor-Ranveer Singh and Alia Bhatt-Deepika Padukone's reunion was all about hugs, kisses and lots of laughter.\nWhile Deepika and Alia were seen posing for the paps, Ranveer's hug to Ranbir Kapoor after winning the best actor trophy is winning everyone's hearts! In case you are wondering what we are talking about, have a look at the pictures and videos.\nTwitter\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nConsidering the very fact that all of them have had a past, all of us can learn a thing or two on handling friendship and moving on in life.", "title": "These Pics Of Alia-Deepika & Ranveer-Ranbir Bonding Prove That Friendships Do Last In Bollywood", "date_publish": "20/03/2019, 11:48:29", "description": "In an industry where everything changes faster than a blink, not every friendship stands the test of time. The industry is competitive and ruthless and uncertainty remains the center point of it all. However, there have been examples recently that prove how with little effort and maturity, you can find your people to lean on!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/these-pics-of-alia-deepika-ranveer-ranbir-bonding-prove-that-friendships-do-last-in-bollywood-363995.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/deepika_and_alia_1553061163_800x420.jpg"}