{"text": "Things She Hate About Ranveer Singh To His Best Qualities, Deepika Padukone Gushes About Her Husband-To-Be Over 'Koffee'\nThings She Hate About Ranveer Singh To His Best Qualities, Deepika Padukone Gushes About Her Husband-To-Be Over 'Koffee'\nIt was on the sets of Ram-Leela that Ranveer Singh and Deepika Padukone fell in love with each other. Their chemistry was so strong and real that they went on to become the most spectacular couple of B-town.\nSix years later, they have finally made their relationship official. Confessing that they have been in love since six years and are getting married in on November 14-15, they left fans gushing over their love once again.\nBut did you know why the wedding date that they have chosen is so special? Because it is the same date on which their first film Ram-Leela had released. November 15 is the day when Ram-Leela, the film that brought these two lovely people together in reel and real life, was released.\nWhile everyone knew that Ranveer Singh and Deepika Padukone are truly, madly and deeply in love with each other, they were eagerly waiting for them to announce their love for each other officially. Their mushy-gushy comments on each other’s pictures and their lovely chemistry at events was nothing but a proof of 'happily ever after'.\nYesterday, after seeking everyone’s blessings and announcing that they are getting married, Deepika made several revelations about their relationship on Koffee With Karan season 6. Here is everything that she said about Ranveer Singh on the show:\nDon't Miss 365 SHARES 161 SHARES 862 SHARES\n#1 Deepika Padukone finally publicly confessed about dating Ranveer Singh. When Karan Johar said that she has been with Ranveer Singh since five years, she corrected him and said “six.”\n#2 She also revealed the thing she loves about Ranveer Singh the most. She said that she loves Ranveer for his emotional capabilities and that he is extremely expressive.\nTwitter\n#3 What is that she hates about Ranveer Singh? Deepika Padukone said she hates his lifestyle sleeping patterns.\n#4 What is one thing that she has to tolerate about Ranveer Singh? His eccentric fashion sense.\n#5 Ranveer Singh will make the best husband to Deepika Padukone, we know. But Deepika thinks he’ll always be a mamma’s boy first.\nWhen she was asked what kind of husband Ranveer Singh will be – a mumma’s boy or male chauvinist, Deepika said, “mumma’s boy”.\nWhat’s more? Karan asked Deepika Padukone to show her a picture of her family, and the one she picked was of Ranveer Singh posing with Anaita Shroff Adajania and her kids. Isn’t that just adorable?\nAlso, in the next episode of the show, Ranveer Singh will be seen sharing the couch and revealing some more secrets with Akshay Kumar. Take a look at the promos below.", "title": "Things She Hate About Ranveer Singh To His Best Qualities, Deepika Padukone Gushes About Her Husband-To-Be Over 'Koffee'", "date_publish": "22/10/2018, 11:44:17", "description": "It was on the sets of Ram-Leela that Ranveer Singh and Deepika Padukone fell in love with each other. Their chemistry was so strong and real that they went on to become the most spectacular couple of the B-town. Six years later, they have finally made their relationship official. Confessing that they have been in love since six years and are getting married in on November 14-15, they left fans gu", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/things-she-hates-about-ranveer-singh-to-his-best-qualities-deepika-padukone-gushes-about-her-husband-to-be-over-koffee-355184.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/what_she_hates_to_what_she_tolerates_about_ranveer_deepika_spills_secrets_about_husbandtobe_1540187627_800x420.png"}