{"text": "Think You've Seen Some Gory Deaths On GoT? Makers Say The Most Brutal One Didn't Make The Cut!\nThink You've Seen Some Gory Deaths On GoT? Makers Say The Most Brutal One Didn't Make The Cut!\nThe bloodier the deaths, the better. That’s how the world of Game of Thrones operates. The American fantasy drama series is all about who gets killed and who survives.\nIf you think you have seen the most gruesome deaths on the show, you may be wrong. From Oberyn Martell’s skull being crushed into pieces to Ramsay Snow’s own dogs mauling him to death, from Ser Rodrik Casse being beheaded to Catelyn Stark’s blood oozing out of her throat at the Red Wedding, it’s all about blood and gore on GoT.\nBut do you know that the cruelest death of the show so far didn’t make to the cut? Showrunner David Benioff, in conversation with Entertainment Weekly, revealed that this death of a character was so brutal and tragic that they decided to not showcase it.\nIt was the death of King Tommen's beloved cat, Ser Pounce.\nTwitter\n“Cersei hated the name 'Ser Pounce' so much she could not allow him to survive. So she came up with her most diabolical (execution). Ser Pounce's death was so horrible we couldn't even put it on the air,” he said.\nTwitter\nDon't Miss 623 SHARES 264 SHARES 161 SHARES\nTo jog your memory a little, Ser Pounce wasn’t liked by Joffrey Baratheon. He even threatened that he would skin the cat alive and mix its inwards up in Tommen's food, so he wouldn’t even know that he would be eating his own pet. In Game of Thrones season 4, when Tommen succeeds as the king after Joffrey’s death, and Margaery Tyrell sneaks into his room in order to get to know him better before Cersei turns him against her, Ser Pounce jumps on the bed and nuzzles up to Margaery.\nAlso Read: 9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale", "title": "Think You've Seen Some Gory Deaths On GoT? Makers Say The Most Brutal One Didn't Make The Cut!", "date_publish": "13/02/2019, 15:43:48", "description": "But do you know that the cruelest death of the show far didn’t make to the cut? Showrunner David Benioff, in conversation with Entertainment Weekly, revealed that this death of a character was so brutal and tragic that they decided to not showcase it. It was the death of King Tommen's beloved cat, Ser Pounce.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/think-you-ve-seen-some-gory-deaths-on-got-makers-say-the-most-brutal-one-didn-t-make-the-cut-362090.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/which_was_the_cruelest_death_on_got_david_benioff_says_the_most_brutal_one_wasnt_shown_to_you_1550051866_800x420.jpg"}