{"text": "Are you also a crazy Marvel/Superhero fan? Are you also pondering over every detail of Avengers: Endgame theory to decode what we’ll see in the movie? What will the remaining heroes face in the movie – are you also trying to figure out what will happen next?\nThe fan theory machine is apparently operating at full speed. The eager fans are leaving no stone unturned.\nSo, this theory takes us back to Avengers: Age Of Ultron. Remember, in the movie, when Ultron escapes the Stark Tower, Tony Stark tells his team, “A hostile alien army came charging through a hole in space. We’re standing 300 feet below it. We’re the Avengers. We can bust arms dealers all the livelong day but that up there, that’s... That’s the endgame. How were you guys planning on beating that.” Of course, Tony Stark was referring to Thanos and his army.\nTo This, Steve replies, “Together,” and Tony says, “we’ll lose,” to which Steve responds, “then we’ll do that together too.”\nThe Reddit user feels this conversation is foreshadowing the future? Is it so? We’re sobbing already.\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES 2.5 K SHARES", "title": "This Avengers: Endgame Theory Confirms A Shocking Death & We Don’t Want To Believe This", "date_publish": "19/12/2018, 13:26:43", "description": "Avengers Endgame theory machine is apparently operating at full speed. So, this theory takes us back to Avengers: Age Of Ultron. Remember, in the movie, when Ultron escapes the Stark Tower, Tony Stark tells his team, “A hostile alien army came charging through a hole in space. We’re standing 300 feet below it. We’re the Avengers. We can bust arms dealers all the livelong day but that up there, tha", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-avengers-endgame-theory-confirms-a-shocking-death-we-don-t-want-to-believe-this-358893.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/this_shocking_avengers_endgame_theory_confirms_who_all_will_die__we_dont_want_to_believe_it_1545206272_800x420.png"}