{"text": "Valar morghulis!\nWinter is precisely two months away. As the release date of season 8 is inching closer, the expectations of the fans are soaring higher than ever. How will the show end? Who will die and who will survive, there are so many questions that will finally be answered. And the excitement has given rise to some interesting theories.\nBut this one has simply blown our mind. According to this new Game of Thrones theory, Cersei might end up giving her unborn child to the Night King, in lieu of the throne and ruling the Westeros.\nIf you remember, in Game of Thrones season 7, Cersei had hinted to her brother Jamie Lannister that she is pregnant. Some fans even say that she is using this as a ploy to manipulate Jamie into staying at the Kings Landing and not join Jon Snow and Daenerys Targaryen in the fight with the army of the dead.\nbustle.com\nDon't Miss 161 SHARES 842 SHARES\nWell, another theory suggests that Jon Snow and Daenerys Targaryen might also offer their unborn child to the Night King. But will the twists and turns in Game of Thrones season 8 will be this simple? Only time will tell. Game of Thrones finale season will air on April 2019.", "title": "Game of Thrones season 8 spoilers:This Game Of Thrones Season 8 Theory About Cersei Making A Deal With The Night King Will Simply Blow Your Mind", "date_publish": "14/02/2019, 16:24:01", "description": "According to this new Game of Thrones theory, Cersei might end up giving her unborn child to the Night King, in return to ruling the Westeros. If you remember, in Game of Thrones season 7, Cersei had hinted to her brother Jamie Lannister that she is pregnant. Some fans even say that she is using this as a ploy to manipulate Jamie into staying at the Kings Landing and not join Jon Snow and Daener", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-game-of-thrones-season-8-theory-about-cersei-making-a-deal-with-the-night-king-will-boggle-your-mind-362170.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/cersei_lannister_might_offer_her_unborn_child_to_the_night_king_says_this_got_season_8_theory_1550139579_800x420.png"}