{"text": "‘This Is 2018 For Me’, Varun Dhawan Sums Up His Year With An Adorable Photo Of His Niece\n‘This Is 2018 For Me’, Varun Dhawan Sums Up His Year With An Adorable Photo Of His Niece\nFrom becoming a Chachu to giving two blockbuster films like October and Sui Dhaaga, 2018 has been quite a happening year for Varun Dhawan. And he is apparently happy about it too. Sharing his picture with the greatest love of his life, Varun Dhawan summed up his year in a picture recently.\nBollywood powerhouse Varun Dhawan shared a cute snap with his father David Dhawan, brother Rohit Dhawan and niece and thanked his fans for all the love they gave to his films released in 2018.\nTaking to his Instagram account the Badlapur actor posted a candid click and captioned it as, \"3 men and a baby. All I want for Christmas is u. Thank u so much for the love this year for #October and #suidhaaga. Mauji and Dan will always live on cause u guys gave me so much love and confidence to do something new. This picture is 2018 for me. My niece every day teaches me something new.\"\nDon't Miss 207 SHARES 161 SHARES 1.7 K SHARES\nThe 31-year-old actor had a wonderful 2018 as he was seen in a never-seen-before avatar in two of his films- October and Sui Dhaaga.\nVarun played the role of Dan in Shoojit Sircar's film October and won million hearts with his innocent acting. Later this year, he delivered amazing performance as a tailor named Mauji in Sharat Katariya's Sui Dhaaga - Made in India opposite Anushka Sharma.\nVarun also tweeted a collage of his looks from both of his films and wrote, \"Thank u so much this year for the love you guys gave to #October and #suidhaaga. Mauji and Dan will always remain very close to me. Thank u for making me brave enough to explore these characters #2018 learnt a lot about myself. 2019 o boy already got me moving.\"\nThe actor will next be seen in multi starrer Kalank, which features Madhuri Dixit, Sonakshi Sinha, Alia Bhatt, Kunal Khemu, Aditya Roy Kapur, and Sanjay Dutt. It is slated to release in April 2019.\nWith inputs from ANI", "title": "‘This Is 2018 For Me’, Varun Dhawan Sums Up His Year With An Adorable Photo Of His Niece", "date_publish": "30/12/2018, 18:26:42", "description": "From becoming a Chachu to giving two blockbuster films like October and Sui Dhaaga, 2018 has been quite a happening year for Varun Dhawan. And he is apparently happy about it too. Sharing his picture with the greatest love of his life, Varun Dhawan summed up his year in a picture recently.", "authors": [], "url": "https://www.indiatimes.com/entertainment/this-is-2018-for-me-varun-dhawan-sums-up-his-year-with-an-adorable-photo-of-his-niece-359529.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/this_is_2018_for_me_writes_varun_dhawan_as_he_shares_an_adorable_photo_with_his_niece_1546172936_800x420.png"}