{"text": "This BTS Video Of Zero Shows The Hard Work That Went Behind Creating SRK's Dwarf Character\nThis BTS Video Of Zero Shows The Hard Work That Went Behind Creating SRK's Dwarf Character\nShah Rukh Khan's Zero was one of the most anticipated films of the year. However, due to negative word of mouth, the film ended up being one of the mega-disasters of the year. Audience dissed the film and this also led to a dip in the box-office collections.\nMany failed to notice how a lot of hard-work went behind making this film. A new video shared by Red Chillies gives all of us a glimpse of the hard work that went behind making this dream project a reality.\nIn the video, the VFX producer Ketan Saini says,\n“We realized that this film couldn’t be shot in a normal way.” And we quite agree.\nHe added that on an average, every shot had to be taken five times and this was possible only because a team of 600 passionate people were shooting for this project.\nThe major challenges involved with the film include creating Lego-like sets and replacing the floor with movable boxes, that were placed so that Shah Rukh’s character could be placed at a lower right. Have a closer look at all the preparations right here.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES", "title": "This BTS Video Of Zero Shows The Hard Work That Went Behind Creating SRK's Dwarf Character", "date_publish": "28/12/2018, 15:11:17", "description": "Shah Rukh Khan's Zero was one of the most anticipated films of the year. However, due to negative word of mouth, the film ended up being one of the mega-disasters of the year. Audience dissed the film and this also led to a dip in the box-office collections.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/this-bts-video-of-zero-shows-the-hard-work-that-went-behind-creating-srk-s-dwarf-character-359419.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/srk_bauua_1545990244_800x420.jpg"}