{"text": "This Is What A Dream Job Looks Like! A Website Is Offering $1000 To Binge-Watch Marvel Films\nThis Is What A Dream Job Looks Like! A Website Is Offering $1000 To Binge-Watch Marvel Films\nMarvel fans, you have only some time left before Avengers: Infinity War releases on April 26. And if you are thinking that this is the time when you would want to commit yourself to binge watching all the films, how about also getting paid for it – $1,000/ ₹68,650 in cash?\nvia GIPHY\nEven if you are not a Marvel fan, this offer seems a lot compelling, right? All you have to do is sit through it and watch 20 movies back-to-back. And along with the money, you will get some MCU merchandise and goodies as well – like Thanos’ Infinity Gauntlet mug, Captain America popcorn popper, Iron Man snuggie and all the films on Blu-Ray as well. So, are you up for the job?\nvia GIPHY\nHere are the films you’ll be watching in a span of about two days.\nMCU Phase 1\nIron Man (2008)\nThe Incredible Hulk (2008)\nIron Man 2 (2010)\nThor (2011)\nCaptain America: The First Avenger (2011)\nThe Avengers (2012)\nMCU Phase 2\nIron Man 3 (2013)\nThor: The Dark World (2013)\nCaptain America: The Winter Soldier (2014)\nGuardians of the Galaxy (2014)\nAvengers: Age of Ultron (2015)\nAnt-Man (2015)\nMCU Phase 3\nCaptain America: Civil War (2016)\nDoctor Strange (2016)\nGuardians of the Galaxy Vol. 2 (2017)\nSpider-Man: Homecoming (2017)\nThor: Ragnarok (2017)\nBlack Panther (2018)\nAvengers: Infinity War (2018)\nAnt-Man and the Wasp (2018)\nvia GIPHY\nObviously, it isn’t going to be as easy as you think. You don’t only have to be a lazy bum to win this, but also an ardent Marvel fan.\nThey want to hire a person who has all these qualities:\n#1 You’ll have to be at least 18 years-old and living in America. (Sorry, Indians)\n#2 The person should be an active social media personality who’ll enthusiastically live-tweet their experience during Marvel Marathon. Also, you’ll have to tag CableTV in their tweets.\n#2 You’ll also have to share your takeaway from the movies after you’ve watched them, so that Cable TV can “can make some beautiful, badass rankings together.”\nDon't Miss 2.9 K SHARES 4.3 K SHARES\n#3 And last, you have to be a Marvel movie enthusiast who knows every minute detail.\nvia GIPHY\nThat’s indeed a dream job, isn’t it?", "title": "This Is What A Dream Job Looks Like! A Website Is Offering $1000 To Binge-Watch Marvel Films", "date_publish": "22/03/2019, 14:02:46", "description": "Marvel fans, you have only some time left before you Avengers: Infinity War releases on April 26. And if you are thinking that this is the only moment you would want to commit yourself to binge watching all the films, how about also getting paid for it – $1,000/ ₹68,650 in cash? Even if you are not a Marvel fan, this offer seems a lot compelling, right? All you have to do is sit through at watch", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-is-what-a-dream-job-looks-like-a-website-is-offering-1000-to-binge-watch-marvel-films-364119.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/this_website_is_offering_a_whopping_1000_to_binge_watch_20_marvel_films_1553242668_800x420.png"}