{"text": "This Game Of Thrones Season 8 Theory About Jaime Lannister Is The Only Ray Of Hope For His Survival!\nThis Game Of Thrones Season 8 Theory About Jaime Lannister Is The Only Ray Of Hope For His Survival!\nAs the Long Night approaches, a lot of characters will meet their end in Game of Thrones season 8. There are a lot of answered questions that are bothering the fans right now, and one of them about the existence of Azor Ahai.\nReddit\nFrom Beric Dondarrion to Hot Pie, fans have been speculating with theories as to who is Azor Ahai, the legendary hero who wielded a burning sword called Lightbringer and ended the Long Night the first time it came around. Azor Ahai is prophesied to return one day and save the world all over again. Is he Jon Snow? Nobody knows for sure.\nfsmedia.imgix.net\nHe is the Lord of Night who is worshipped by many. There's a prophecy in Game of Thrones that states, \"There will come a day after a long summer when the stars bleed and the cold breath of darkness falls heavy on the world. In this dread hour, a warrior shall draw from the fire a burning sword.\"\nDon't Miss 246 SHARES 3.1 K SHARES 4.5 K SHARES 1.9 K SHARES 565 SHARES\nWhile Game of Thrones season 8 theories also suggest that Jaime will kill his sister Cersei and later will get himself killed by Bronn, this new theory suggests that he could be the Azor Ahai.\nAccording to a Reddit user, “Jaime (Azor Ahai) will wield Lightbringer (his golden right hand) to somehow defeat Bran/defeat the Night King and the army of the dead, making the story come full circle.\nWhat do you think about this? Tell us in the comments section below.\nAlso Read: 9 Insanely Convincing ‘Game Of Thrones’ Season 8 Theories That Will Pump You Up For The Finale", "title": "Jaime Lannister Azor Ahai:This Crazy Game Of Thrones Season 8 Theory About Jaime Lannister Is The Only Hope For His Survival", "date_publish": "06/02/2019, 18:33:11", "description": "While Game of Thrones season 8 theories also suggest that Jaime will kill his sister Cersei and later will get himself killed by Bronn, this new theory suggests that he could be the Azor Ahai. While Game of Thrones season 8 theories also suggest that Jaime will kill his sister Cersei and later will get himself killed by Bronn, this new theory suggests that he could be the Azor Ahai.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-game-of-thrones-season-8-theory-about-jaime-lannister-is-the-only-ray-of-hope-for-his-survival-361706.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/jaime_lannister_azor_ahai_game_of_thrones_season_8_theory_1549457058_800x420.png"}