{"text": "This happens only when you are truly, madly and deeply in love with someone, and your life only revolves around him.\nTwitter\nAlia Bhatt who is in a Ishq Waala Love with beau Ranbir Kapoor seems like she hasn't got enough of him yet. And this latest video is proof. The actress, who is busy promoting her upcoming film, Kalank with her co-stars Varun Dhawan, Aditya Kapur and Sonakshi Sinha accidentally called Varun 'Ranbir' in one of the interviews.\nNeedless to say, it was captured and now being circulated on social media.\nTwitter\nIn the video, Varun, who is not only Alia’s co-star but a friend, is seen playing with Alia's hair. While she asked him to stop but in the process ended up calling him Ran but soon she realised her little goof up and asked Varun not to do and busted into laughter. Infact, Sona, Adi, and Varun too had a hearty laugh on Alia’s adorable mistake.\nDon't Miss 336 SHARES 207 SHARES 247 SHARES 699 SHARES\nIn fact, her laughter is winning the internet’s heart.\nI love love love Alia's laugh. It's so real, it'll automatically put up a smile on my face.\nWeird how y'all have issues on how someone laughs 😂pic.twitter.com/pFamOP7iFU — Abhishek Varman Stan. (@Ciiimonex) April 13, 2019\nWonder how will RK react to Alia’s this adorable galti se mistake. Alia and Ranbir are in a relationship since a year now and the couple doesn’t seem to be hesitant in expressing their love in public.\nRanbir who always preferred to keep his personal relationships away from the media glare has no qualms in openly hugging, kissing and holding his girlfriend Alia's hand in public. Looks like the couple has found their comfortable zone.", "title": "This Video Of Alia Bhatt Accidentally Calling Varun Dhawan 'Ranbir' Is Proof She's In Love", "date_publish": "16/04/2019, 17:18:06", "description": "Alia Bhatt who is in a ishq waala love with beau Ranbir Kapoor seems like doesn’t have got enough off him yet. And this latest video is proof. Alia who is busy promoting Kalank with her co-stars Varun, Aditya and Sonakshi accidentally called Varun Ranbir in one of the interviews and that video is going viral.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/this-video-of-alia-bhatt-accidentally-calling-varun-dhawan-ranbir-is-proof-she-s-in-love-365572.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/alia_bhatt_1555416201_800x420.jpg"}