{"text": "This Baby Dressed Up As Brienne Of Tarth To Welcome Game Of Thrones Season 8 & We Can’t Stop Swooning\nThis Baby Dressed Up As Brienne Of Tarth To Welcome Game Of Thrones Season 8 & We Can’t Stop Swooning\nThe frenzy of Game Of Thrones is so high that a mother who had miracle baby after being told that she could never get pregnant again, named her daughter after all her favourite characters from Game of Thrones, Harry Potter and Star Wars.\nTwitter\nThe little bundle of joy has recently been named Bellatrix Daenerys Leia!\nTwitter\nAnd this isn’t all! In another part of the world, right before the premiere of the finale season, in all the excitement, a couple dressed up their little daughter as another character from Game Of Thrones.\nYou have met Brienne of Tarth in GoT, right? Now meet 'Brienne - the cutie!'\nShe is just two years old and so so adorable!\nimgur.com\nDon't Miss 159 SHARES 842 SHARES\nWe are sure, she will grow up to be a brave child, just like Brienne of Tarth.\nimgur.com\nBrienne of Tarth doesn’t smile so often, but this one melts our heart with her sparkling grin.\nimgur.com\nWant to know how her armour was designed?\nimgur.com\nHer parents used her playing mat.\nimgur.com\nThis is how it was done!\nimgur.com\nSeems unbelievable, right?\nimgur.com\nJust look at her shine!\nimgur.com\nMeanwhile, just a suggestion -- the net is dark and full of spoilers. Watch the first episode of Game Of Thrones season 8 soon, if you haven’t already, and let us know what you feel about it in the comments section below. Valar Morghulis, my friends!", "title": "This Baby Dressed Up As Brienne Of Tarth To Welcome Game Of Thrones Season 8 & We Can’t Stop Swooning", "date_publish": "15/04/2019, 12:30:02", "description": "right before the premiere of the finale season, in all the excitement, a couple dressed up their little baby dressed like Brienne of Tarth. You have met Brienne of Tarth in Got, right? Now meet “Brienne the cutie!” Brienne of Tarth doesn’t smile so often, but this one melts our heart with her sparkling grin.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-baby-dressed-up-as-brienne-of-tarth-to-welcome-game-of-thrones-season-8-we-can-t-stop-swooning-365451.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/baby_dressed_like_brienne_the_tarth_ahead_of_game_of_thrones_season_8_premiere_1555309572_800x420.png"}