{"text": "This Singing Banter Between Big B & SRK On 'Ek Dusre Se Karte Hai Pyaar Hum' Will Leave You In Awe\nThis Singing Banter Between Big B & SRK On 'Ek Dusre Se Karte Hai Pyaar Hum' Will Leave You In Awe\nNow, who isn’t a fan of Amitabh Bachchan, almost everyone? Even Bollywood’s Badshah Shah Rukh Khan is in awe of the Big B.\nTwitter\nThey have done a number of films together and over the years their bond has become stronger.\nTwitter\nAmitabh will be next seen in Badla which is produced by SRK’s production Red Chillies and they are having a gala time promoting it together. Don't believe us? Well, take a look at the video right here.\nTwitter\nDon't Miss 343 SHARES 814 SHARES 555 SHARES 144 SHARES 263 SHARES\nSRK is seen expressing his admiration for Mr. Bachchan while Big B too returns the favour in the hilarious way possible, but it doesn’t end there. Both the stars sing a song from Hum and you just cannot miss how Amitabh corrects SRK to sing in tune. The video is just too funny and adorable, and you would want to watch it again and again.\nTwitter\nIn fact, Big B shared the video on Twitter:", "title": "This Singing Banter Between Big B & SRK On 'Ek Dusre Se Karte Hai Pyaar Hum' Will Leave You In Awe", "date_publish": "08/03/2019, 11:29:22", "description": "Now, who isn’t a fan of this megastar Amitabh Bachchan, almost everyone? Even Bollywood’s Badshah Shah Rukh Khan is the biggest fan of Big B and has always shown his admiration for him. They have done a number of films together and over the years their bond has become only stronger. Amitabh will be next seen in Badla which is produced by SRK’s production Red Chillies and they are having a gala", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/this-singing-banter-between-big-b-srk-on-ek-dusre-se-karte-hai-pyaar-hum-will-leave-you-in-awe-363368.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/amitabh_bachchan_1552025351_800x420.jpg"}