{"text": "If you think movies don’t affect people in real life, you maybe wrong. Remember when Avengers: Infinity War had released, fans all over the world went gaga over the ending which sought the death of many superheroes. They were shattered processing the end of the movie. For months, they speculated on the possibilities that could save their favourite stars.\nAlso Read: 'Avengers: Infinity War' Directors Tell Which Character Might Never Die & The Answer Will Shock You\nAnd then, when the trailer of the much-awaited Avengers: End Game was released a few days ago, it created a storm on social media. So much so, that seeing Tony Stark in a traumatic situation, they even appealled to NASA to save him from space, and NASA indeed responded to fans’ plea.\nAlso Read: NASA Responds To Fans' Plea About Saving Tony Stark From Space & It Couldn’t Get Funnier\nAs expected, the trailer hasn’t really offered anything new in terms of the plot. And so, fans are still discussing if Avenger heroes are still dead or if the remaining ones will bring them back to life.\nAmid all the discussions, this crazy fan theory suggests the possibility of these dead Avengers not being dead in the first place. Wait, what?!\nDon't Miss 264 SHARES 233 SHARES 4.3 K SHARES 4.3 K SHARES\nA Reddit user which goes by the name Joethehamface thinks that when Thanos said the death was not necessary, when you can change the reality using Infinity Gauntlet, he meant exactly that.\nFurthermore, Joethehamface explains, “What if the snap killed none of them. It’s possible. We have all been making fun of Thanos for saying that death wasn't necessary with the near infinite power of the gauntlet. What if it simply split the reality in two taking half of everyone into each version missing the other half but retaining the same resources.\ni’m trying to hold it together but i’m geeking out today🤟🏾 #AvengersEndgame pic.twitter.com/PYat7UGVRq — Cjeezy.Doom (@cjeezy_26) December 7, 2018\n“The two parallel realities could be joined by a sort of bridge in the quantum realm. Since Scott was in the quantum realm at the time of the split, he was unaffected by the snap and not bound to either reality leaving him free to travel from one to the other over this bridge. Maybe this leaves him free to travel through to the parallel dimensions created by Thanos splitting the time stream. He would be the only way for them to communicate with the other. Maybe he exists in both realities and gains knowledge from both due to some strange form of quantum entanglement,” the user added to the theory.\nThat’s quite marvellous, don’t you think? We totally want to believe this. What are your thoughts on this? Tell us in the comments section below.", "title": "This Crazy Avengers Endgame Theory Suggests No Hero Really Died & We Totally Want To Believe It", "date_publish": "12/12/2018, 15:57:05", "description": "This crazy Avengers Endgame theory suggests no one really died in Avengers Infinity War. A Reddit user which goes by the name joethehamface thinks that when Thanos said that death was not necessary when you can change the reality using Infinity Gauntlet, he meant exactly that.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-crazy-avengers-endgame-theory-suggests-no-hero-really-died-we-totally-want-to-believe-it-358435.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/this_crazy_theory_suggests_no_one_died_in_avengers_infinity_war__we_totally_want_to_believe_it_1544610450_800x420.png"}