{"text": "There is always some light at the end of the tunnel and for 200,000 bees inhabiting hives in Notre-Dame cathedral, this came in the form of their survival.\nAccording to news reports, close to 200,000 bees inhabiting hives in Notre-Dame cathedral survived the inferno that engulfed the heritage landmark in a miraculous escape, their beekeeper said Thursday.\n\"The bees are alive. Until this morning, I had had no news,\" said beekeeper Nicolas Geant who looks after the hives which are kept on top of a sacristy that adjoins the cathedral.\nTalking AFP, Geant said,\n\"At first I thought that the three hives had burned but I had no information. Then I saw from satellite images that this was not the case and then the cathedral spokesman told me that they were going in and out of the hives.\"\nDon't Miss 2.8 K SHARES 19.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nHe also added that he is taken aback by calls of support from all corners of the world. Each hive at Notre-Dame on average produces some 25 kilogrammes of honey each year which is sold to Notre-Dame staff.\nThe miraculous tale of the survival-\nTwitter\nHe said that this kind of bee does not abandon its hive, instead gorging on honey and not abandoning the queen bee. Each hive at Notre-Dame on average produces some 25 kilograms of honey each year which is sold to Notre-Dame staff.\nColony Collapse Disorder?\nAccording to United States Environmental Protection Agency, \"Colony Collapse Disorder is the phenomenon that occurs when the majority of worker bees in a colony disappear and leave behind a queen, plenty of food and a few nurse bees to care for the remaining immature bees and the queen. Once thought to pose a major long term threat to bees, reported cases of CCD have declined substantially over the last five years.\"\nFor those who don't know, It has become increasingly customary in the French capital for bee hives to be introduced at seemingly unlikely locations, including also at the Paris Opera.\n(With AFP updates)", "title": "This Is The Miraculous Story Of How 1.8 Lakh Bees Survived The Notre Dame Fire", "date_publish": "20/04/2019, 18:31:47", "description": "He said that this kind of bee does not abandon its hive, instead gorging on honey and not abandoning the queen bee. Each hive at Notre-Dame on average produces some 25 kilograms of honey each year which is sold to Notre-Dame staff. He said that this kind of bee does not abandon its hive, instead gorging on honey and not abandoning the queen bee.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/this-is-the-miraculous-story-of-how-1-8-lakh-bees-survived-the-notre-dame-fire-365819.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/notre_dame_1555765597_800x420.jpg"}