{"text": "This Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together\nThis Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together\nIt hasn’t happened in a very long time that a Bollywood movie trailer sent the entire nation into a frenzy. From the film fraternity to Bollywood buffs, people couldn’t stop raving about Gully Boy on social media, where it seemingly brought in a storm of praises. Not just the dialogues and Ranveer Singh’s amazing Asli hip hop rap, every frame of the trailer stole the hearts of the people.\nKya trailer hai bc!!! I got goosebumps, tears, adrenaline rush, probably a mini orgasm too. All at once. Kudos https://t.co/MQtmdDUN23 — Ayushmann Khurrana (@ayushmannk) January 9, 2019\nOne thing that people noticed soon after the trailer of Ranveer Singh’s Gully Boy was released, was its uncanny resemblance to 2002 film 8 Mile. A lot of fans were instantly reminded of the Eminem-starrer film, which was loosely based on his life story, upbringing and rise to fame. A boy from poor family faces intense hardships as he wins against the odds making it big in the unknown world of hip hop – that’s what pretty much summarises the story of both the films, don’t you agree?\nNow, a Facebook page called Indian Rap Memes has quite remarkably superimposed some clips from 8 Mile on Gully Boy’s trailer to make a mashup. The similarities between the two are astonishing. Take a look!\nStarring Ranveer Singh, Alia Bhatt and Kalki Koechlin, Zoya Akhtar’s Gully Boy is slated to hit the screens on Feb 14.\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES", "title": "This Mash-Up Of Ranveer Singh’s Gully Boy & Eminem’s 8 Mile Will Make You Want To See Them Rap Together", "date_publish": "12/01/2019, 11:46:50", "description": "One thing that people noticed soon after the trailer of Ranveer Singh’s Gully Boy was released, was it’s uncanny resemblance to 2002 film 8 Mile. A lot of fans were instantly reminded of the Eminem starrer film, which was loosely based on his life story, upbringing and rise to fame. A boy from poor family faces intense hardships as he wins against the odds making it big in the unknown world of hi", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/this-mash-up-of-ranveer-singh-s-gully-boy-eminem-s-8-mile-will-make-you-want-to-see-them-rap-together-360274.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/this_mashup_of_ranveer_singhs_gully_boy__eminems_8_mile_will_make_you_want_to_see_them_rap_toget_1547271985_800x420.png"}