{"text": "Thor And Daenerys Targaryen's Epic Face-Off On Twitter Has Sent Fans Into A Meme Frenzy!\nThor And Daenerys Targaryen's Epic Face-Off On Twitter Has Sent Fans Into A Meme Frenzy!\nIn the last week, Avengers: Endgame, a film that was the culmination of about 11 years of MCU and 22 films, was released and fans were in awe of it. It was like the end of an era.\nAlso Read: 9 Instances That Prove The Frenzy For ‘Avengers: Endgame’ Was Too Much For Cinemas To Handle!\nAFP\nThen came Game of Thrones’ season 8’s episode four with the ultimate Battle of Winterfell – which was highly anticipated and the one which gave goosebumps to fans out and out.\nTwitter\nThat’s a lot to digest in just a weekend, right? But have you ever imagined a crossover of Avengers and Game Of Thrones. Well, that’s what happened on Twitter recently.\nAlso Read: Bow Down To The ‘Real Queen’! Fans Declare Arya Stark As The Ultimate Hero Of Game Of Thrones\nDon't Miss 3.1 K SHARES 406 SHARES 923 SHARES 518 SHARES\nSo seemingly, Chris Hemsworth AKA Thor and Emilia Clarke AKA Daenerys Targaryen had an epic face off with pictures in which they have similar reactions, and that of course, became a butt of jokes on Twitter. It’s now a viral meme and people can't get over it. Take a look!\n#1\n\"Can I speak to your manager please?\"\n\"I AM the manager\" pic.twitter.com/uA3ZXizJtH — JD (@Jonny_Dodds) April 26, 2019\n#2\nWho did it better?\nLike for Thor\nRetweet for Daenerys pic.twitter.com/u2OgzLbT0f — Charbel (@deeb_charbel) April 26, 2019\n#3\nI am LIVING for these Daenerys/Thor memes ugh!!! Hahahahahaha https://t.co/5kFMJ3wKCE — denise (@denisexdenephew) April 28, 2019\n#4\nBetween this and the “is he tho” comparison between Dany/Thor, someone should do a “Daenerys as MCU characters” thread. — julia 🤔 alexander (@loudmouthjulia) April 27, 2019\n#5\nDaenerys is obviously the first speaker. Thor is the manager. I am Thor. https://t.co/Triok37umO — Jessica Rossana Sawin ✨ (@jessicajrossana) April 26, 2019\n#6\n#7\nHow much I love them both 😂😂 now we have two sources of “is it though?” memes #Thor #Daenerys https://t.co/Y0ATlj0Jhp — Enje Jawher (@EnjeJawher) April 24, 2019\n#8\nThe same caption can be used for both images.\n\"Stark is a good man.\"\n\"Is he, though?\"#Endgame #GameofThrones — Charles Lee (@Goofyfan_Chuck) April 24, 2019\n#9\n\"...I don't like hulk, I prefer you...\" — Ernest Wanyama 🇺🇬 (@ErnestWanyama) April 27, 2019\n#10\nHappened just last weekend at work with a very rude customer. My boss, unfortunately for him, doesn't take shit like that and gave him a piece of her mind. Satisfying to see. — Magdalena Golomb (@Sonoel90) April 26, 2019\n#11\n\"Jon is the true heir.\"\n\"Is he though?\" — Xapdos (@Xapdos) April 24, 2019\n#12\nHe's your nephew\nIs he, though? — Jack Allen (@jallen2226) April 24, 2019\n#13\nWhen it’s Avengers week and game of thrones fans are trying to steal your thunder. pic.twitter.com/YNVTvJEwkn — 𝐉𝐚𝐤𝐞’𝐬 𝐌𝐚𝐧𝐧𝐞𝐪𝐮𝐢𝐧 (@jake0790) April 25, 2019\nJust a sad reminder – after Avengers, Game of Thrones will come to its end too.\nAlso Read: Not Jon Snow Or Daenerys Targaryen, But Looks Like This GoT Character Is Azor Ahai, Here’s Why!", "title": "Thor And Daenerys Targaryen's Epic Face-Off On Twitter Has Sent Fans Into A Meme Frenzy!", "date_publish": "29/04/2019, 18:53:27", "description": "In the last week, Avengers: Endgame, a film that was the culmination of about 11 years of MCU and 22 films, was released fans were in awe of it. It was like the end of the era. Then came Game of Thrones’ season 8’s episode four with the ultimate Battle of Winterfell – the which was highly anticipated and the one which gave goosebumps to fans all through it. That’s a lot to digest in just a weekend", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/thor-and-daenerys-targaryen-s-epic-face-off-on-twitter-has-sent-fans-into-a-meme-frenzy-366295.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/thor_and_daenerys_targaryen_had_an_epic_faceoff_on_twitter__that_has_sent_the_fans_in_a_tizzy_1556540932_800x420.png"}