{"text": "It's a known fact that Tiger Shroff is a huge fan of Hrithik Roshan. Tiger has time and again mentioned how much he looks upto his acting mentor and dance idol. Hrithik celebrated his 45th birthday recently.\nInstagram\nAnd Tiger ensured he gives a birthday tribute to the celebrity crush. Picking up a song from Hrithik's first film Kaho Na Pyaar Hai, Tiger performed on Ek Pal Ka Jeena with his other two boys.\nIt instantly caught the attention of many stars from Bollywood. From Jacqueline Fernandez to Kriti Sanon, they were blown away by his dance moves.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nInstagram\nCaptioning the video, Tiger wrote, \"Blessed to be working with my inspiration. Thank you for being born and giving direction and inspiration to so many of us! \" Among many celebrities, one Hollywood star also commented on the video.\nYes, Gwyneth Paltrow took to the video and wrote, \"So good.\" Although Tiger is yet to respond to that but fans have been favouriting her comment since.\nInstagram\nOn the work front, Tiger will be seen in Student Of The Year and in an untitled project alongside Hrithik Roshan.", "title": "Tiger Shroff's Birthday Tribute Video To Hrithik Roshan Catches Gwyneth Paltrow's Attention, Calls It 'So Good'", "date_publish": "13/01/2019, 15:27:55", "description": "It's a known fact that Tiger Shroff is a huge fan of Hrithik Roshan. Tiger has time and again mentioned how much he looks upto his acting mentor and dance idol. Hrithik celebrated his 45th birthday recently.It's a known fact that Tiger Shroff is a huge fan of Hrithik Roshan. Tiger has time and again mentioned how much he looks upto his acting mentor and dance idol.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/tiger-shroff-s-birthday-tribute-video-to-hrithik-roshan-catches-gwyneth-paltrow-s-attention-calls-it-so-good-360345.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/tiger_1547374550_800x420.jpg"}