{"text": "“Deewana hai dekho… Bekaraar who… Sambhalo sambhalo… Na pyaar ho”\nDoes this song play in your head too, when you spot a hot guy? And do you also wait for the back dancers to assemble behind you soon while your best friend besides you sings “Jhoom chiki chiki jhoom… Tum bolo hai woh kaun jo…”? This was simply an epic song from a cult film called Kabhi Khushi Kabhie Gham!\nvia GIPHY\nEven after years, when you watch it, you can’t help but praise how effortlessly Hrithik Roshan danced to it. I mean, who can dance better than him, right? We thought so too, until we saw Tiger Shroff shaking a leg on the song, and boy, we are left awestruck.\nFor the uninitiated, Tiger Shroff is a great fan of Hrithik Roshan and his dance. He often posts his dance videos on his songs. He even paid him a tribute to his favourite star on his birthday.\nBlessed to be working with my inspiration 🙏🙏🙏😇😇 thank you for being born and giving direction and inspiration to so many of us! #HappyBirthdayHrithikRoshan ❤ @iHrithik pic.twitter.com/QrCYsrhCJN — Tiger Shroff (@iTIGERSHROFF) January 10, 2019\nDon't Miss 1.1 K SHARES 3.1 K SHARES 353 SHARES 12.5 K SHARES 5.5 K SHARES\nJust imagine how it would be to see Hrithik Roshan and Tiger Shroff dancing together in a movie? Well, that is going to be a reality soon. Hrithik Roshan and Tiger Shroff are collaborating for a yet-to-be-titled Yash Raj banner movie, and he is on cloud nine.\n“It was like a dream come true moment for me. After every shot, when I see him on the monitor, I feel like I am dreaming because it has been my childhood fantasy working with him. When we do a high speed shot or an action scene then it feels amazing,” he had earlier said.\nWe want to see a dance face-off between Hrithik Roshan and Tiger Shroff. Do you want that too? Meanwhile, watch Deewana Hai Dekho below and get nostalgic!", "title": "Tiger Shroff’s Epic Dance On ‘Deewana Hai Dekho’ Is Making Our Hearts Go ‘Sambhalo Sambhalo Na Pyaar Ho’", "date_publish": "28/03/2019, 17:13:40", "description": "For the uninitiated, Tiger Shroff is a great fan of Hrithik Roshan and his dance. He often posts his dance videos on his songs. He even paid him a tribute to his favourite star on his birthday. And this time when he danced to Deewana hai dekho, our hearts sanfg Sambhalo Sambhalo na pyaar ho.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tiger-shroff-s-epic-dance-on-deewana-hai-dekho-is-making-our-hearts-go-sambhalo-sambhalo-na-pyaar-ho-364498.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/tiger_shroff_dancing_to_hrithik_roshans_k3g_song_deewana_hai_dekho_1553770830_800x420.png"}