{"text": "Tiger Shroff Shares First Look Of Baaghi 3, Ranveer Talks About Marriage And More From Ent.\nTiger Shroff Shares First Look Of Baaghi 3, Ranveer Talks About Marriage And More From Ent.\nRanveer Singh says being best friends with one’s spouse is “key to sustaining a romantic relationship”. Ranveer tied the knot with his girlfriend of six years, actor Deepika Padukone in an intimate twin wedding ceremony in Italy last month.\nJust like the previous film, the third one will also be directed by Ahmed Khan. The first installment, however, was directed by Sabbir Khan.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n15 years ago, Jadoo Ki Jhappi became a catchphrase for every commoner. The ‘Dude’ used to be ‘Mamu’ back then. Bhaigiri used to be a fad. Munnabhai MBBS released a decade and a half ago on this very day and changed the face of cinema. When movies like Footpath, Company and Ghulam paved a wave for dark gangster movies, it was Sanjay Dutt who made the audiences believe that a gangster can be affable too!\nA few inside pictures from their post-wedding celebrations have made way on the internet and they are magical and dreamy! Have a look at the pictures.\n5. Sona Mohapatra Slams Sonu Nigam For Supporting Anu Malik During #MeToo Allegations\nShe tweeted, “So much sympathy for a millionaire losing work? So much empathy for his privileged family being ‘tortured’?How about the scores of girls & women he tortured?Multiple testimonies not proof enough?”", "title": "Tiger Shroff Shares First Look Of Baaghi 3, Ranveer Talks About Marriage And More From Ent.", "date_publish": "19/12/2018, 18:05:19", "description": "Reviews might not be outstanding but audiences have always had a thunderous response to Tiger Shroff starrer Baaghi. Tiger Shroff’s high-octane stunts and his sizzling chemistry with real-life girlfriend Disha Patani always strikes the right chord with the audiences.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/tiger-shroff-shares-first-look-of-baaghi-3-ranveer-talks-about-marriage-and-more-from-ent-358938.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/bollywood_trending_1545223167_800x420.jpg"}