{"text": "Tiger Shroff Can’t Stop Fanboying Over Hrithik Roshan, Says It’s Dream Come True To Work With Him\nTiger Shroff Can’t Stop Fanboying Over Hrithik Roshan, Says It’s Dream Come True To Work With Him\nA lot of people have been speculating if Tiger Shroff the next Hrithik Roshan. From Ek Pal Ka Jeena to Main Aisa Kyu Hoon and Dhoom, every time Hrithik Roshan shakes a leg in a film, the dance moves become rage and fans can’t stop gushing over this dancing skills.\nTiger Shroff, who is also known for leaving fans floored with his sleek dance moves is a big fan of Hrithik Roshan. He has got some killer dance moves and there’s no denying that fact.\nTiger Shroff recently paid a tribute to Hrithik Roshan on his birthday. He was so good that even Hollywood actress Gwyneth Paltrow left a comment on it praising the star. “So good,” wrote the Avengers and Oscar-winning actress.\nBlessed to be working with my inspiration 🙏🙏🙏😇😇 thank you for being born and giving direction and inspiration to so many of us! #HappyBirthdayHrithikRoshan ❤ @iHrithik pic.twitter.com/QrCYsrhCJN — Tiger Shroff (@iTIGERSHROFF) January 10, 2019\nJust imagine how it would be to see Hrithik Roshan and Tiger Shroff dancing together in a movie? Well, that is going to be a reality soon. Hrithik Roshan and Tiger Shroff are collaborating for a yet-to-be-titled Yash Raj banner movie, and he is on cloud nine.\n“It was like a dream come true moment for me. After every shot, when I see him on the monitor, I feel like I am dreaming because it has been my childhood fantasy working with him. When we do a high speed shot or an action scene then it feels amazing,” he said.\nTwitter\nDon't Miss 949 SHARES 1.1 K SHARES 3.1 K SHARES 353 SHARES 12.5 K SHARES\nAsk him what is that he learned from Hrithik Roshan while working with him, and he says, “I have learnt many things from him. If I have to say one thing then, it would be working on minute details of everything. Hrithik sir thinks a lot before giving every shot from every aspect so, understanding his mind-set and his thought process in a scene or in an action sequence has been a great learning for me.”\nWe want to see a dance face-off between Hrithik Roshan and Tiger Shroff!", "title": "Tiger Shroff Can’t Stop Fanboying Over Hrithik Roshan, Says It’s Dream Come True To Work With Him", "date_publish": "30/01/2019, 13:32:17", "description": "Just imagine how it would be to see Hrithik Roshan and Tiger Shroff dancing together in a movie? Well, that is going to be a reality soon. Hrithik Roshan and Tiger Shroff are collaborating for a yet-to-be-titled Yash Raj banner movie, and he is on cloud nine.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tiger-shroff-can-t-stop-fanboying-over-hrithik-roshan-says-it-s-dream-come-true-to-work-with-him-361288.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/tiger_shroff_cant_stop_fanboying_over_hrithik_roshan_says_its_dream_come_true_to_work_with_him_1548835065_800x420.jpg"}