{"text": "Tiger Shroff and Hrithik Roshan are coming together for a film and fans already have really high expectations. Considering two of the most popular stars will be seen together in an action film, it's already one of the most anticipated films.\nTiger Shroff, who will be facing off against Hrithik Roshan in his upcoming action film, says the idea of the project is like having a battle between Tom Cruise's Mission Impossible character Ethan Hunt and iconic British spy James Bond.\nDirected by Siddharth Anand, the yet-to-be-titled action film is backed by Yash Raj Films. Actor Vaani Kapoor also stars in it and this is the first ever film in which Hrithik and Tiger will be sharing the screen space.\n\"I feel that film is going to be something cool. The idea is to get Tom Cruise's Ethan Hunt of Mission Impossible versus James Bond, together in the same film. That's the idea,\" Tiger said in a group interview.\nDon't Miss 1.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 2.5 K SHARES\nThe film's shoot is almost over, with dance potions still remaining to be shot. The Baaghi 2 star admitted that he was like a typical fan boy, who was enamoured shooting with his idol, Hrithik, that he often forgot his dialogues.\n\"It has been an amazing experience. A lot of the times it used to happen that, because I was looking at my hero, I used to just forget my dialogues and go blank. I couldn't believe I was working with him.\"\nApart from this, the actor will also be seen in the Bollywood remake of Rambo. When asked, how does the team plan to go about the film, considering the climax of Baaghi 2 was also set in the Rambo zone, Tiger said the setting has now been changed. He adds,\n\"Yes, that was a bit of a problem. Luckily Rambo has a different terrain altogether now, a different world, something people won't expect.\"\nIn one of the earlier interviews, where they announced the film, Tiger had said,\n\"Hrithik sir is coming in top form. I have seen him train day and night, I have seen him work hard on a set and I have seen his work ethic so, I think, if he is not the same as he was in Kaho Na Pyaar Hai, he must be even better and younger looking now.\"\nCurrently, Tiger is busy with the promotions of his upcoming film 'Student Of The Year'!\n(With agency inputs) | Pictures: Tiger and Hrithik's fan pages.", "title": "Tiger Shroff Describes His & Hrithik Roshan's Movie, Says It'll Be Like 'Ethan Hunt Vs James Bond'!", "date_publish": "01/05/2019, 11:48:29", "description": "Tiger Shroff, who will be facing off against Hrithik Roshan in his upcoming action film, says the idea of the project is like having a battle between Tom Cruise's Mission Impossible character Ethan Hunt and iconic British spy James Bond. Directed by Siddharth Anand, the yet-to-be-titled action film is backed by Yash Raj Films. Actor Vaani Kapoor also stars in it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/tiger-shroff-describes-his-hrithik-roshan-s-movie-says-it-ll-be-like-ethan-hunt-vs-james-bond-366381.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/tiger_shroff_1556691107_800x420.jpg"}