{"text": "Tiger Shroff Is Back With A Bang In The First Look Of Baaghi 3 & Fans Are Excited!\nTiger Shroff Is Back With A Bang In The First Look Of Baaghi 3 & Fans Are Excited!\nReviews might not be outstanding but audiences have always had a thunderous response to Tiger Shroff starrer Baaghi. Tiger Shroff’s high-octane stunts and his sizzling chemistry with real-life girlfriend Disha Patani always strikes the right chord with the audiences.\nAfter the first two installments ran successfully at the box office, Tiger Shroff is back for another round. The first look of Baaghi 3 is out and going by the looks of it, Tiger Shroff is back with a bang.\nJust like the previous film, the third one will also be directed by Ahmed Khan. The first installment, however, was directed by Sabbir Khan.\nTwitter\nBaaghi 3 will be produced by Sajid Nadiadwala and Fox Star Studios.\nDon't Miss 1.1 K SHARES 3.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe makers haven’t announced the female lead for the movie? Will they rope in Disha Patani this time? The first one starred Shraddha Kapoor.\nRumours are also rife that Sara Ali Khan will be seen alongside Tiger Shroff in Baaghi 3. However, she has denied the report. So, the speculations are still on. Who do you want to see opposite Tiger in the third installment?\nTwitter\nWell, fans are very excited!\nindustry needs actors like TIGER — MANISH JOSHI (@MANISHJ33068930) December 19, 2018\nWow it's a great news so excited it's a baaghi time — SJ BOY (@Sarojraaz41) December 19, 2018\nYeahh He Is Back ...Can't wait — TIGER SHROFF Planet™ (@TIGERSPLANET) December 19, 2018\nSuper hit movie — Tirth Kumar Garg (@TirthGarg) December 19, 2018\n2020 when u coming ??\nPlzzz come quickly can't wait more for #Baaghi3 🙌🙌🙌. — Arsho Cricket Lover (ABD 17) (@ArshoLover) December 19, 2018\nWe are sure that just like the previous two installments, Baaghi 3 will rule at the box office too. The movie is scheduled to release on March 6, 2020. There’s going to be a long wait!", "title": "Tiger Shroff Is Back With A Bang In The First Look Of Baaghi 3 & Fans Are Excited!", "date_publish": "19/12/2018, 13:58:51", "description": "The first look of Baaghi 3 is out and going by the looks of it, Tiger Shroff is back with a bang. Just like the previous film, the third one will also be directed by Ahmed Khan. The first instalment, however, was directed by Sabbir Khan. The makers haven’t announced the female lead for the movie? Will they rope in Disha Patani this time? The first one starred Shraddha Kapoor.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tiger-shroff-is-back-with-a-bang-in-the-first-look-of-baaghi-3-fans-are-excited-358898.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/tiger_shroff_is_back_with_a_bang_in_the_first_look_of_baaghi_3__fans_are_excited_1545208336_800x420.png"}