{"text": "\"Yeh Baburao Ka style hai\"- As Babu Bhaiya, Paresh Rawal tickled our funny bones several years ago.\nAnd now, for all Hera Pheri fans, there is a news that will make you all excited. Thirteen years after Phir Hera Pheri released, the comedy franchise is finally being revived for the third installment.\nThe film will star Akshay Kumar, Suniel Shetty, Paresh Rawal and they will reprise their roles as Raju, Shyam and Baburao Ganpatrao Apte! A Mumbai mirror report has confirmed that the story will take a leap and all the actors will play almost their age in the film. A source was quoted as saying,\n\"It takes off from from where Phir Hera Pheri ended, but fast-forwards into the present.\"\nAccording to reports, producer Firoz Nadiadwala has roped in Priyadarshan for the third installment, who also made the first part of the film. Talking about the film, Priyadarshan was quoted as saying,\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\n\"I am currently busy with my Malayalam film, Marakkar: The Lion of Arabian Sea. It is a huge film and I will only think about Hera Pheri after this one is out of my system. Nothing is concrete as of yet.\"\nThe reports of Hera Pheri 3 have been floating since last few years but we finally have a confirmation now!", "title": "Time Leap For Raju, Ghanshyam And Baburao As Hera Pheri 3 Is On Its Way!", "date_publish": "19/04/2019, 11:12:25", "description": "The reports of Hera Pheri 3 have been floating since last few years but we finally have a confirmation now!The reports of Hera Pheri 3 have been floating since last few years but we finally have a confirmation now!The reports of Hera Pheri 3 have been floating since last few years but we finally have a confirmation now!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/time-leap-for-raju-ghanshyam-and-baburao-as-hera-pheri-3-is-on-its-way-365728.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/hera_pheri_3_1555652729_800x420.jpg"}