{"text": "Tinaa Datta Shares Details Of Her Abusive Relationship, Says Her Boyfriend Used To Beat Her Up\nTinaa Datta Shares Details Of Her Abusive Relationship, Says Her Boyfriend Used To Beat Her Up\n2018 saw the mega #MeToo movement in India. It gained momentum after many Bollywood celebrity names were called out in public. From Alok Nath, Sajid Khan, Nana Patekar and Vikas Bahl among others, the movement was a revolution.\nInstagram\nAnd looks like, it's not going to die down anytime soon. But this was a harassment of a different nature. TV actress Tinaa Datta spoke to Bombay Times and opened up about her abusive relationship.\nSpeaking to Bombay times Tinaa said, \"I was in a relationship with a non-industry guy for five years. We had met through common friends. But I called time on it, because he was extremely abusive, verbally and physically. I would get bashed up even in front of my friends.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nThe actress who was always looking to settle down in a love marriage set up was shocked something like this could happen to her. But it did and she dealt with it for five long years.\n\"I went bonkers to an extent that my confidence took a beating. I never wanted to go public with my relationship, but I feel that it’s time to speak up,” added Tinaa.\nDespite dating a non-industry guy, Tinaa shares she still wants to settle down with someone who is not from the industry. Speaking with the daily, Tinaa says, \"I want to settle down and not go about having affairs and then nursing heartbreaks. I have always wanted a love marriage, but God is not sending anyone my way. I don’t want to marry someone from the industry, especially an actor, as the relationship will be marred by insecurities. I have seen several failed marriages between actors.\"\nMore power to Tinaa and hope she has a spectacular 2019.", "title": "Tinaa Datta Shares Details Of Her Abusive Relationship, Says Her Boyfriend Used To Beat Her Up", "date_publish": "02/01/2019, 18:49:01", "description": "Tinaa Dutta Shares A Painful Story About Her Abusive Relationship, Says Her Boyfriend Used To Beat Her UpTinaa Dutta Shares A Painful Story About Her Abusive Relationship, Says Her Boyfriend Used To Beat Her UpTinaa Dutta Shares A Painful Story About Her Abusive Relationship, Says Her Boyfriend Used To Beat Her UpTinaa Dutta Shares A Painful Story About Her Abusive Relationship, Says Her Boyfriend", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/tinaa-datta-shares-details-of-her-abusive-relationship-says-her-boyfriend-used-to-beat-her-up-359728.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/tinaa_1546434759_800x420.jpg"}