{"text": "To Avoid Paps And Media Spotlight, PC-Nick To Land At The Wedding Venue In A Chopper Plane\nTo Avoid Paps And Media Spotlight, PC-Nick To Land At The Wedding Venue In A Chopper Plane\nThere is magic in mystery but not when you are dying to catch a glimpse of your favorite celebrity all decked up as a bride for her own wedding.\nAfter DeepVeer, PC and Nick Jonas too are trying to keep their wedding a private affair, owing to which the couple will fly from Udaipur to Jodhpur in a Chopper. Ditching a flight where paps would stand and hound her and Nick for pics, she has decided to opt for a charter plane.\nAgencies\nAccording to a report in Times of India, Priyanka has decided to avoid paps and the media spotlight, when she's en route Jodhpur Rajasthan. After flying from Mumbai to Udaipur, she will make a special detour in a charter plane to Umaid Bhawan.\nA source has been quoted in the report as saying,\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n“Only one helicopter has been booked for November 29 and December 3. Priyanka will be boarding the helicopter from Udaipur and the helicopter will directly land at Umaid Bhawan Palace on November 29. We are yet to receive the names of the people boarding the helicopter from Udaipur. Nick Jonas might join her as well. The same helicopter has also been booked to ferry guests from Jodhpur airport to Umaid Bhavan Palace.\"\nPC and Nick's wedding celebrations will kick start from November 29, 2018, with a Mehendi ceremony followed by a sangeet ceremony at Mehrangarh Fort. Later, Priyanka Chopra and Nick Jonas will host a cocktail party for close friends and family and post the cocktail party, a haldi function will take place.\nAgencies\nThe couple will exchange their vows on December 2, 2018.\nInstagram\nAfter tying the knot, PC and Nick will host two receptions, one in Delhi and one in Mumbai.", "title": "To Avoid Paps And Media Spotlight, PC-Nick To Land At The Wedding Venue In A Chopper Plane", "date_publish": "24/11/2018, 17:09:30", "description": "After DeepVeer, PC and Nick Jonas too are trying to keep their wedding a private affair, owing to which the couple will fly from Udaipur to Jodhpur in a Chopper. Ditching a flight where paps would stand and hound her and Nick for pics, PC decided to go with a more discrete option.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/to-avoid-paps-and-media-spotlight-pc-nick-to-land-at-the-wedding-venue-in-a-chopper-plane-357314.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/pc_and_nick_1543060090_800x420.jpg"}