{"text": "A lot of people have argued that the #MeToo movement that is taking India by storm has turned into a witch movement. While everyone is supporting the women who are gathering courage and sharing their stories, the possibility of fake allegations and the misuse of the movement is a concern that a lot of people are debating about currently, especially in those cases when victims have not revealed their identity.\nBCCL\nTalking about the same, actress Kriti Sanon has appealed to anonymous women to either reveal their identity or file a legal case so that the #MeToo movement is not misused.\nHere’s what she wrote:\ntwitter/kritisanon\ntwitter/kritisanon\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nShe wants everyone to handle the #MeToo movement responsibly.\nKriti Sanon, is a part of Houseful 4, which was to be directed by Sajid Khan before sexual harassment allegations against him were levied by several women including Bipasha Basu, Mandana Karimi and Amriti Puri.\nAlso Read: As More Sexual Misconduct Stories Of Sajid Khan Surface, Amrita Puri Says No Way His Family Was Unaware", "title": "To Ensure #MeToo Isn’t Misused, Kriti Sanon Urges Women To Reveal Their Identity Or File A Case", "date_publish": "15/10/2018, 13:01:27", "description": "In the wake of the #MeToo movement that has taken the entire nation by storm, a lot of Bollywood celebrities are extending their support to the victims. Supporting the women, Kriti Sanon said that it takes courage to come out and talk about #MeToo. At the same time, she urged anonymous women to reveal their identity or file a complaint before sharing their #MeToo stories.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/to-ensure-metoo-isn-t-misused-kriti-sanon-urges-women-to-reveal-their-identity-or-file-a-case-354801.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/to_ensure_metoo_isnt_misused_kriti_sanon_urges_women_to_reveal_their_identity_or_file_a_case_1539588091_800x420.png"}