{"text": "Sexual harassment is currently one of the most important issued in prevalent in the entertainment industry, in India as well as abroad. While Hollywood saw the #MeToo movement gaining momentum earlier this year, India is currently facing the same situation. People are expecting that it will all lead to safer working environment for women.\nContributing to it, HBO is making sure that the sex scenes in its shows are safe for the actors, as the channel is hiring intimacy coordinator for all shows, according to The Huffington Post.\nAs reported in @RollingStone, all @HBO programs with intimate scenes will be staffed by an intimacy coordinator: https://t.co/sdQww5PFrt — HBO PR (@HBOPR) October 25, 2018\nIt all started after actor Emily Meade who plays a sex worker turned porn star in The Deuce asked the showrunners to install an “advocate purely for the sexual scenes” on set.\nhbo.com\nDon't Miss 193 SHARES 161 SHARES\nAnd that’s how Alicia Rodis, the associate director of Intimacy Directors International -- a non-profit that normalises a high-standard “high standard for directing intimacy and sexual violence to prevent abuse and harassment” – was brought on board.\nrefinery29\nAfter the counselling program was successful, HBO decided to keep her on sets for its shows.", "title": "To Protect Actors From Harassment, HBO Hires Intimacy Coordinator To Make Sex Scenes Safer", "date_publish": "28/10/2018, 14:47:49", "description": "HBO is making sure that the sex scenes in its shows are safe for the actors, as the channel is hiring intimacy coordinator for all shows, according to The Huffington Post. It all started after actor Emily Meade who plays a sex worker turned porn star in The Deuce asked the showrunners to install an “advocate purely for the sexual scenes” on set.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/to-protect-actors-from-harassment-hbo-hires-intimacy-coordinator-to-make-sex-scenes-safer-355590.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/to_protect_actors_from_harassment_hbo_hires_intimacy_coordinator_to_make_sex_scenes_safer_1540710997_800x420.jpg"}