{"text": "To Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17\nTo Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17\nBollywood celebrities stand in solidarity with the families of the martyrs. Everyone is shaken and angry. Pulwama Terror Attack was the worst ever in Jammu and Kashmir since militancy erupted in 1989. At least 44 troopers were killed after a Jaish-e-Mohammed (JeM) suicide bomber rammed an explosives-laden vehicle into a CRPF bus.\nAlso Read: Bollywood Celebs Condemn Pulwama Terror Attack That Claimed The Lives Of Atleast 44 CRPF Jawans\nThe entire nation including the Bollywood celebs have strongly condemned the ghastly terror attack. In order to pay tribute to the martyrs, Bollywood celebs have decided to observe February 17 as black day.\nAlso Read: Javed Akhtar And Shabana Azmi Cancel Karachi Arts Council Event After Pulwama Terror Attack\nNo work will be carried out between 2pm to 4pm.\n“The Federation of Western India Cine Employees has requested everyone observe a black day. Work in studios, on edit tables, and at shoot locations will be halted from 2 pm to 4 pm tomorrow (February 17). This is being done to show solidarity. During this period, the FWICE along with members of all the 24 crafts will assemble outside Film City (Goregaon, Mumbai) to condemn the Pulwama attack,” FWICE President B.N. Tiwari was quoted as saying by Cine Blitz Online.\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nAlso Read: Government Is Capable Enough To Tackle Situation, Says Manoj Bajpayee On Pulwama Terror Attack", "title": "To Pay A Tribute To CRPF Martyrs Of Pulwama Attack, Bollywood Will Observe Black Day On Feb 17", "date_publish": "16/02/2019, 14:42:23", "description": "The entire nation including the Bollywood celebs have stood out strongly to condemn the ghastly terror attacks. In order to pay tribute to the martyrs, Bollywood celebs have decided to observe February 17 as black day. No work will be carried out between 2pm to 4pm. “The Federation of Western India Cine Employees has requested everyone observe a black day. Work in studios, on edit tables, and at", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/to-pay-a-tribute-to-crpf-martyrs-of-pulwama-attack-bollywood-will-observe-black-day-on-feb-17_-362264.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/bollywood_celebs_to_observe_black_day_on_feb_17_in_respect_of_crpf_martyrs_of_pulwama_attack_1550306624_800x420.png"}