{"text": "How real is the life of reel-life celebrities? As an outsider, we can only imagine and think of how these stars live. How big are their houses? How grand are their cars? While the luxurious lives of these celebrities always appeal to us, commoners, there's much more to these celebrities that we are unaware about.\nWe heavily rely on what we see and how these stars conduct themselves publicly, what we don't see is how real their emotions are! They too fall in love, have their share of heartbreaks, fall in love with their co-stars and have their share of personal and purely private love-stories.\n2018 has been a year when many of these love-stories took a beautiful turn in the form of marriage. Three leading ladies of Bollywood and women who have always taken a stand for feminism and equality took the plunge and registered themselves in the married actresses club!\nIn May, Sonam Kapoor got hitched with her longtime boyfriend Anand Ahuja. This was followed by a special winter wedding in November for love-birds Ranveer Singh and Deepika Padukone and we close this year by a very special cross-culture wedding of Priyanka Chopra and Nick Jonas. A year of happy endings INDEED! Here's a quick flashback of 2018 where we picked our favorite moments from these celebrity weddings. Have a look!\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\n1. Sonam Kapoor and Anand Ahuja\nEverything was indeed 'phenomenal' about this wedding. Lovebirds Sonam Kapoor and Anand Ahuja dated for three years before finally taking the plunge. It was a big-fat Punjabi wedding with both families coming together for this special union of love.\nIt wasn't just one of the most 'popular' events of the year on the internet but it made us collectively gush.\n#1\n#2\n#3\n#4\n#5\n2. Priyanka Chopra and Nick Jonas\nDescribing the most special moment from her wedding, Priyanka Chopra said, “The most special moment was when the curtains opened and I saw him at the altar and life was okay at that moment.”\nWell, doesn't this sound like an opening scene of a true-blue romantic film? PC and Nick Jonas dated for less than a year but decided to begin their forever this very year. Their celebrations were grand, royal and adorable!\nFrom their Christian wedding ceremony to Hindu ceremony, the pictures from their wedding celebrations are more than dreamy!\n#6\n#7\n#8\n#9\n#10\n3. Ranveer Singh and Deepika Padukone\nIf we ever take a poll on Bollywood's most special love story, a lot of people will vote in favor of Ranveer Singh and Deepika Padukone. From being co-stars to falling in love on the sets of their film to making their rock solid relationship last for six years, DeepVeer have continued to give some serious relationship goals for years now. Away from media spotlight, the couple flew down to Italy and got hitched at Lake Como, amidst their favorite set of people. After coming back to India, they hosted two wedding receptions, in one Bengaluru and two in Mumbai for their media family and fraternity friends.\n#11\n#12\n#13\n#14\n#15\n#16\n#17\n#18\n#19\n#20\n#21\n#22\n#23\n#24\n(Photos have been sourced from agencies and fan-pages)", "title": "Top 25 Photographs That Prove How 2018 Has Been A Year Of Magical Celebrity Weddings", "date_publish": "08/12/2018, 15:08:35", "description": "How real is the life of reel-life celebrities? As an outsider, we can only imagine and think of how these stars live. How big are their houses? How grand are their cars? While the luxurious lives of these celebrities always appeal to us, commoners, there's much more to these celebrities that we are unaware about.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/top-25-photographs-that-prove-how-2018-has-been-a-year-of-magical-celebrity-weddings-358069.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/celebrity_weddings_1544089261_800x420.jpg"}