{"text": "If you think you’ve seen it all, you might want to take another guess. Deepika Padukone-Ranveer Singh’s and Priyanka Chopra-Nick Jonas’ weddings might have had us all excited, swooning and obsessing over the minutest details, but the wedding season isn’t over yet. There’s a lot that you are yet to witness.\nIn case you are wondering what then picture this - Hillary Clinton has arrived in India to attend the wedding of Isha Ambani and Anand Piramal. From Lakshmi Mittal to Sachin Tendulkar, and Shah Rukh Khans to Bachchans, you name and Udaipur has them all at the wedding location.\nWhat’s more? Well, Shan Rukh Khan performed with his wife Gauri Khan at the Sangeet ceremony of the duo. And not just them, even Aishwarya Rai Bachchan-Abhishek Bachchan and newly-wed Priyanka Chopra gave a breathtaking performance, it is said.\nDon't Miss 343 SHARES 555 SHARES 263 SHARES 12.5 K SHARES 5.5 K SHARES\nAnd if that wasn’t enough, Queen Bey is here in India. Yes, the Grammy-award winning singer Beyonce has arrived in the city of lakes. What for? Well, a private concert of course!\nAnd fans are going bonkers!\nSo @Beyonce is in India to perform at Isha Ambani's wedding and I am not ok I am going crazy bye. — Vipin | TN Follows (@vipinheartstay) December 9, 2018\nIf y’all thought Priyanka-Nick wedding was extra, wait for ambani wedding 💀 Beyoncé is performing for wedding guests pic.twitter.com/pxgrYyaVVr — Sascha Holidayerer (@samstennis189) December 9, 2018\nSome says #TheRoyalWedding was the biggest wedding of this year some says #DeepVeer some #priyankaNick hold on bitches #Beyoncé is performing at Ambani’s daughter wedding and Hillary Clinton is attending it in India. So everyone else can shut up now #weddingofyear — Annie Dutta (@AnnieDutta1) December 9, 2018\nBeyonce gonna sing Channa Mereya at the Ambani's wedding💉💉💉💉💉💉 pic.twitter.com/7VWncIhbhR — Krishna (@SolariSznn) December 9, 2018\nBeyonce is at Isha Ambani's wedding?!! What the fuck!! 😂😂 — Meowshi (@zoowaker) December 9, 2018\nBeyonce is in India... Weeps... That too for a wedding... Weeps... An Ambani wedding... Weeps... — Muskaan Gupta (@imuskaang) December 9, 2018\nAmbani uncle thoda concert ke liye bhi bolona @Beyonce didi ko — ✨𝓟𝓮𝓻𝓾✨ (@pretaehyungah) December 9, 2018\nBeyonce to perform at Ambani’s wedding??🙄\nPlease use very border-crossing loud speakers. It’s the closest I’ll ever get to her😔 — Shizza (@Shizza_hashmi) December 9, 2018\nBeyonce performing at the Ambani wedding. That's what real money buys. Destroyed Priyanka's and Deepika's wedding in one move. — RAJ SAHOTA (@1RajSahota) December 9, 2018\nNow, this is what we call dream come true.", "title": "Beyonce:All Hail Queen Bey! Beyonce Lands In Udaipur To Amp Up Isha Ambani-Anand Piramal’s Wedding", "date_publish": "09/12/2018, 17:36:07", "description": "Beyonce AKA Queen Bey is here in India. Yes, the grammy-award winning singer Beyonce has landed in the city of lakes. Wondering what for? Of course, for a private concert! What’s more? Well, Shan Rukh Khan performed with his wife Gauri Khan at the Sangeet ceremony of the duo. And not just them, even Aishwarya Rai Bachchan-Abhishek Bachchan and newly-wed Priyanka Chopra gave a breathtaking performa", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/touchdown-beyonce-lands-in-udaipur-to-spice-up-isha-ambani-anand-piramal-s-wedding-358241.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/all_hail_queen_bey_beyonce_lands_in_udaipur_to_amp_up_isha_ambanianand_piramals_wedding_1544356038_800x420.png"}