{"text": "After the grand success of Baahubali, things changed in the world of Indian cinema. The SS Rajamouli magnum opus acted like a tonic that the industry needed, and perhaps that is why Mohanlal’s long-awaited project titled Randamoozham was revived again.\nAlso Read: KRK Calls Superstar Mohanlal 'Chota Bheem,' Twitter Rips Him To Shreds\nBP.BLOGSPOT.COM\nThe project was in the works since a long time but then, the producers (Gokulam Gopalan) had backed out to bankroll the expensive two-part movie. However, in 2017, soon after Baahubali 2: The Conclusion was released, UAE-based filmmaker announced to invest a whopping Rs.1000 crore on the project based on the epic saga of Mahabharata.\nNow, it has been announced that the project which was to be narrated from the perspective of Bheema, the central character, to be played by Malayalam superstar Mohanlal, has been shelved again.\ni.imgur.com\nUAE-based billionaire businessman, Bavaguthu Raghuram Shetty, in a conference said he has backed out of the project as the conflict between director Srikumar Menon and writer MT Vasudevan Nair remains unsolved. Shetty said that Shrikumar was unable to reach down to a conclusion, and that forced him to pull the plug, according to Indian Express.\nTitled Randamoozham, the movie was supposed to be based on MT Vasudevan Nair’s award-winning novel of the same name. The shooting of the two-part film was supposed to begin in September 2018. With Oscar-winning crew members on board, the movie was to be released sometime in 2020, it was earlier said.\nMeanwhile, Aamir Khan is also gearing up to make a film on Mahabharata. (Read More: Aamir Khan’s Rs 1000 Cr Mahabharata Will Be A 7-Part Series & He’ll Reportedly Play Lord Krishna)\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES", "title": "Touted As India’s Most Expensive Movie, Mohanlal’s Rs 1,000 Cr Mahabharata Shelved Again!", "date_publish": "03/04/2019, 13:49:43", "description": "Mohanlal’s long-awaited project titled Randamoozham has been shelved again. The producers (Gokulam Gopalan) backed out to bankroll the expensive two-part movie. However, in 2017, soon after Baahubali 2: The Conclusion was released, UAE-based filmmaker announced to invest a whopping Rs.1000 crore on the project based on the epic saga of Mahabharata.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/touted-as-india-s-most-expensive-movie-mohanlal-s-rs-1-000-cr-mahabharata-shelved-again-364794.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/touted_as_indias_most_expensive_movie_mohanlals_rs_1000_cr_mahabharata_gets_shelved_again_1554276647_800x420.png"}