{"text": "Have you ever spent time with a dead body? Even if it is of a loved one? It’s terrifying, harrowing and much more than that, right?\nNow just imagine a two-year-old girl, who is left alone at home with her mother’s dead body? The story sure sounds almost too horrific to seem real, but the fact is that it is based on a true story. Can you even imagine the trauma this child would have gone through?!\nPihu, a forthcoming movie whose trailer has been released, is making rounds on social media. Not only fans even the film fraternity is raving about the trailer of Pihu. Watch the terrifying story of the kid, who doesn’t even know what’s safe for her but is left home alone with her mother's dead body:\nWondering how this little girl played the role? Named Myra Vishwakarm, she was indeed two years old when she shot for Pihu.\nTalking about the experience shooting for the movie, director Vinod Kapri said: “We gave her time to acquaint herself with the space as well as the crew. We would shoot for two hours a day. There were three cameras placed on the set because you can’t ask a two-year-old to give another take. The toys that you see in the film all belong to Myra,” he told Indian Express.\nDon't Miss 527 SHARES 5.1 K SHARES 284 SHARES 1.4 K SHARES\nProduced by Ronnie Screwvala, Siddharth Roy Kapur and Shilpa Jindal, Pihu is all set to release on Nov 16.", "title": "Trailer Of 'Pihu' Shows A 2-YO Kid Home Alone With Her Mother’s Dead Body & It's Spine-Chilling", "date_publish": "25/10/2018, 17:21:16", "description": "Based on the true story, Pihu, a forthcoming movie, whose trailer has been released, is making rounds on social media. Not only fans, the film fraternity is also raving about the trailer of Pihu. Watch the terrifying story of the kid, who doesn’t even know what’s safe for her, below.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/trailer-of-pihu-shows-a-2-yo-kid-home-alone-with-her-mother-s-dead-body-it-s-spine-chilling-355455.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/what_happens_when_a_2yo_kid_is_left_alone_with_mothers_dead_body_pihu_trailer_is_terrifying_1540466797_800x420.png"}