{"text": "Trailer Of Salman Khan’s Bharat Is Out & It Has Already Sent The Internet On A Trolling Spree!\nTrailer Of Salman Khan’s Bharat Is Out & It Has Already Sent The Internet On A Trolling Spree!\nAfter the Race 3 debacle, Salman Khan is back on the big screen with Bharat – a movie in which he is playing a character whose journey will unfold over several years.\nIt’s a period drama and the trailer opens with Jawaharlal Nehru's Tryst with Destiny speech. Salman’s character lives a journey which is no less than a roller coaster ride. And so, we get to see different shades of his character.\nFrom a motorcycle stuntman to an oil-mining employee, from fighting off pirates as a navy officer to saving co-workers from blasts dust storms and locating missing immigrants from across the border, Salman's character journey’s through 71 years of Indian history.\nWithout further ado, watch Bharat trailer below.\nDon't Miss 699 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nIt took no time for the creative minds on the internet to kick-start a meme fest.\n#BharatTrailer\nFood blogger Friend: I ate crispy fried bread with a dollop of butter and mashed potato curry with mint\nMe : What's that?\nFriend : Pav Bhaji\nMe : pic.twitter.com/yit3wCXw0M — Sagar (@sagarcasm) April 22, 2019\nWhenever someone talks about physics to salman khan#BharatTrailer pic.twitter.com/5PBgrnvPqf — Marwadi Bhoot (@rajpalpurohit) April 22, 2019\n*When grammar nazi starts giving you lecture over minor mistake*#BharatTrailer pic.twitter.com/hrR4QHTzs6 — Raj (@iamrajt) April 22, 2019\n#BharatTrailer\nWhen you troll Salman khan's movie bor being logic less.\nLe bhoi fanboi :- pic.twitter.com/HuidHAPNtw — Kri Sh Na 🇮🇳 (@Chrisnastic) April 22, 2019\nBharat is a remake of Korean movie titled Ode To My Father, which is a story about a man separated from his father during war, desperately longs to reunite with him and his missing sister. This will be Salman Khan’s third collaboration with Ali Abbas Zafar after Sultan and Tiger Zinda Hai.\nThe Korean film – Ode To My Father – was a classic hit. Will Bharat live up to the expectations? Only time will tell. Also starring Tabu, Disha Patani and Jackie Shroff, Bharat is scheduled to hit the screens on June 5 (of course around Eid).", "title": "Trailer Of Salman Khan’s Bharat Is Out & It Has Already Sent The Internet On A Trolling Spree!", "date_publish": "22/04/2019, 16:54:11", "description": "After the Race 3 debacle, Salman Khan is back on the big screen with Bharat – a movie in which he is playing a character whose journey will unfold over several years. It took no time for the creative minds on the internet to kick-start a meme fest. Check out Bharat memes here.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/trailer-of-salman-khan-s-bharat-is-out-it-has-already-sent-the-internet-on-a-trolling-spree-365898.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/bharat_trailer_has_given_rise_to_memes_1555930722_800x420.png"}