{"text": "Arbaaz Khan and Malaika Arora ended their 18 years of marriage. Of course, it raised a lot of eyeballs in shock. This was something nobody expected. Fans were jolted after Arbaaz Khan and Malaika Arora announced their divorce in 2017.\nSince then, a lot has changed. While Malaika Arora is reportedly dating Arjun Kapoor, Arbaaz Khan has already confessed that he has found love again in Italian model Giorgia Andriani. Before he made it official, Arbaaz was linked to quite a few women.\nTwitter\nPerhaps, this is why a troll recently said that he has become a “khula saand” after his divorce with Malaika. Reacting to this, on his own chat show, here’s what Arbaaz Khan said.\nDon't Miss 389 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Arre bhai, 21 years ka relationship khatam hua. Kuch hadd tak iski baaton mein sachchai hai isliye mujhe bura bhi nahi laga. Ek time aa gaya tha, after making my efforts at reconciliation or whatever...We both tried, didn't happen. After a time, I had to move on in life,” he said.\nOn the khula saand comment, in particular, Arbaaz said that remark is true to some extent but not completely. “I was, to some extent. There's some truth in that, not all,” he said.\nTalking about his relationship with Giorgia, Arbaaz had told Deccan Chronicle, “If I had to hide my affair, I would not have brought it in open. I unhesitatingly admit that Giorgia is there in my life at this point in time. Somebody who I have at his time in my life is a friend who I am also dating. Where it is going to go? Only time will tell. Yes, undoubtedly, we are together.”\n“Divorce is a huge step. It gave me freedom in the sense that I could make a choice that I stand by. It is a choice that is not applauded by many but it gives you the freedom to move on, to make new choices, to go ahead in the world with your head held high and without feeling the past baggage,” Malaika Arora has said about her divorce in an interview to Film Companion.\nRead More: Malaika Arora Felt Free After Divorce With Arbaaz Khan, Says She Is Happy To Make New Choices", "title": "Troll Calls Arbaaz Khan ‘Khula Saand’ After Divorce & He Agrees, Says There’s Some Truth In It!", "date_publish": "14/03/2019, 11:44:57", "description": "Arbaaz Khan and Malaika Arora ended their 18 years of marriage. Of course, they raised a lot of eyeballs in shock. This was something nobody expected. Fans were jolted after Arbaaz Khan and Malaika Arora announced their divorce in 2017. Since then, a lot has changed. While Malaika Arora is reportedly dating Arjun Kapoor, Arbaaz Khan has already confessed that he has found love again in Italian m", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/troll-calls-arbaaz-khan-khula-saand-after-divorce-he-agrees-says-there-s-some-truth-in-it-363685.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/troll_says_arbaaz_khan_is_khula_saand_after_divorce_with_malaika_he_agrees_theres_some_truth_i_1552542541_800x420.png"}