{"text": "The sleepy hill station of Panchgani is famous for three things — boarding schools, strawberries and Freddie Mercury.\nIf you ask locals, they will tell you that these three features converge at one point, and then point you towards a dusty road where a bearded, bespectacled man looks down from a painted billboard.\nThe mystery deepens when you read the lines beneath the portrait, ‘Witty and charismatic Peter Patrao won hearts and minds of people bringing strawberry fields forever to Panchgani. Peter Baba.’\nafp\nWhen I studied there in the eighties, New Era High School, though overlooking a picturesque valley, was akin to a war zone. Students emerged from old dented buses into a world of regimented dormitories, fighting over everything, including who gets the lower bunk beds.\nI remember almost having my nose broken by a plump boy called Abdullah, but that didn’t hurt as much as some crackpot defecating in the bucket in which I had soaked my favourite dress. Forty girls and only three bathrooms meant that she could not hold on any longer apparently.\nDon't Miss 9.8 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nBoarding school changed many things for me but one thing I swore never to do again was share my bathroom. I even told my prospective husband, ‘I will share my life with you, my genes with you, even my food albeit a little reluctantly but I will never share a bathroom.’ Our own version of Toilet Ek Prem Katha.\nAnd one more thing — Enid Blyton is a big fat liar. All those dreamy Malory tales and midnight feasts were a far cry from reality.\ntoi\nFood was a scarce commodity, and friendships were based on what someone was hoarding in their tuck cupboard. The girl on the upper bunk bed would only pull out her snacks after lights out so the next half hour all I would hear was the sound of her chewing and feel a light drizzle of crumbs raining on me from above.\nMy parents, of course, had not sent me here to wash clothes, clean crumbs or grab other people’s food but ostensibly to study, so that’s what I did, with the help of some good teachers and a few really terrible ones like the creepy math tutor who was always propositioning the ninth grade girls. But there was one teacher who truly stood out — he taught chemistry and his name was Peter Patrao.\nHave you seen Dead Poets’ Society? Well Mr Patrao was a sprightlier and possibly smarter version of Robin Williams, though his poetry was all about the periodic table. One went something like this: ‘Potassium, Sodium, Calcium, damn, are bigger flirts than any MAM (Magnesium, Aluminium, Manganese). Zincing Irons Lead right down. Call a Cop (copper) with a frown.’\nLily Habte, my old school mate, sent me an email recently. We are friends now thanks to the wonders of Facebook but we have had our share of fights. A memorable one is when we ran towards each other from opposite ends of the dorm, she grunting almost as loud as Serena Williams and me trying to do my best impression of a frightened tennis ball.\nHer email was about Mr Patrao and how he always encouraged students to think outside the box. “He had this method of testing where students would move up a seat if they got the right answer. I have still not forgotten the day I moved all the way to the front row.’\nWhen my sister found out I was writing a piece on Mr Patrao, she wanted to put in her two bits. ‘You must write about how he was ahead of his time. I remember the sex ed discussion he had in our class even though he was our chemistry teacher. He made it sound so natural!’\nA ten-minute walk from New Era’s gates was another school, St Peter’s. We, with an international mix of students of both genders believed we were far superior, and the St Peter’s boys refuted this fiercely with ‘Stupid New Era morons! Freddie Mercury was from St Peter’s. What famous people has your school produced?’\nSt Peter’s was also Mr Patrao’s former place of employment and according to an old newspaper report, Mr Patrao was the only teacher with any memory of Freddie the schoolboy.\nI recall waylaying Mr Patrao once on his way home, badgering him with questions about his former student. ‘He wasn’t very different from any of you, though he was quite a shy boy,’ I recall Mr Patrao saying. ‘Wasn’t his real name Farrokh?’ another classmate asked and Mr Patrao said, ‘Yes, but the boys would bully him and call him Bucky because he had protruding teeth. Poor chap, it was probably to deflect attention from that name that he started calling himself Freddie.’\nbccl\nBohemian Rhapsody, the biopic on Queen, releases this week and I am curious to see if it will cover Freddie’s life in Panchgani and the band he formed at school. Mr Patrao had once told us it was called The Hectics.\nThe chemistry teacher could never complete all his stories though; his swift feet matched his mind and off he would go to the aid of a local resident or a farmer waiting for his advice.\nBesides his chemistry skills, Mr Patrao, who had started growing strawberries in the seventies, had become quite the expert, and was able to teach the locals a thing or two about farming. Strawberry plantations were reportedly failing at that point of time. In a short documentary Mr Patrao’s wife, sporting a jaunty white hat, says, ‘Farmers would come around to see our thriving strawberry crop. Peter encouraged one or two to try his method and it worked for them, then it just took off, one after the other.’\nAnother school mate, Priya Singh wrote to me mentioning the time Mr Patrao set up a computer training room for a neighbouring village. ‘He treated everyone as equal,’ she recalled, ‘the locals had skills they could teach him and vice versa.’\nA regular teacher educates students only within the confines of a classroom, belting out a tired set of instructions between school bells. But there was nothing regular about Mr Patrao, including his classes, which seemed to have stretched all across the hill station and his lifetime.\nThe maverick educator passed away in 2012 but Mr Patrao continues to smile gently from the confines of his painted epitaph, keeping an eye on the strawberries he helped plant in Panchgani’s soil and the seeds of learning he sowed in the hearts of its inhabitants.\nMy sister and I were lucky to be one of his students, and I suppose so was good old Freddie Mercury.", "title": "Twinkle Khanna Blogs About Her Life In Boarding School & Her Chemistry With Freddie Mercury", "date_publish": "28/10/2018, 16:24:23", "description": "The sleepy hill station of Panchgani is famous for three things — boarding schools, strawberries and Freddie Mercury. If you ask locals, they will tell you that these three features converge at one point, and then point you towards a dusty road where a bearded, bespectacled man looks down from a painted billboard. The mystery deepens when you read the lines beneath the portrait, ‘Witty and charism", "authors": ["Twinkle Khanna"], "url": "https://www.indiatimes.com/entertainment/twinkle-khanna-blogs-about-her-life-in-boarding-school-her-chemistry-with-freddie-mercury-355607.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/twinkle_khanna_1540729791_800x420.jpg"}