{"text": "The baby belongs to a reading class called The Joy of Reading. Every Saturday, this group of six-year-olds usually sits in my guest room and reads aloud from their library books. The beleaguered teacher not only has to get productive work from these creatures with the attention span of a goldfish, but is made ‘den’ when they play hide and seek.\nThis Saturday, the guest room was occupied but that did not deter these four-foot-tall monsters. They jumped on the bed and realising that it contained a gently snoring woman, they decided to find another hiding place — the bathroom. Unfortunately, my friend’s husband, busy with his morning ablutions, had neglected to lock the door. Seeing the door being pushed open, he desperately began pushing it back while half crouched over the toilet seat. This tug of war continued till the three children were dragged away by who else but their hapless teacher.\nBCCL\nLater that morning, I asked him, ‘How come a 50-year-old man didn’t have the strength to push and keep the door shut?’ Pat came the reply, ‘I had only one hand free!’\n‘Jeez, I don’t even want to know what you were doing with the other!’ I said. He sighed, ‘Not what you think! I had a book in my other hand.’\nDon't Miss 9.8 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nConsidering that there have been numerous times when even the call of nature could not pull me away from the printed page, I completely empathised with him. The two of us are not alone though in our choice of reading spot. A survey by the Imperial Cancer Research Fund found that 4 out of 10 people read in the bathroom, while the legendary writer Henry Miller went as far as to say, ‘All my good reading was, in fact, done in the toilet. ‘\nIn the spirit embodied by Mr Miller, I have decided to make a list of five books that I loved so much this year that I took them with me everywhere this year — to planes, trains and especially to the toilet.\n1. Less By Andrew Sean Greer\nThis is about an author who is particularly self-aware of his apparent mediocrity. Arthur Less has lived with genius in the form of an older self-absorbed Pulitzer-winning poet in the past and so he recognises that he, in fact, has none. This is also corroborated by people he cares about, like his ex-lover Freddy who tells him, “All you do is write gay Ulysses.” The book begins with Andrew Less learning that Freddy is about to get married and to avoid the embarrassment and heartbreak that would be an inevitable part of being a wedding guest, he decides to accept any and every invitation he has received in his capacity as a second-rate writer. A journey that takes him around the world including on a detour to our good old India on a series of farcical book readings and teaching assignments.\nBCCL\nWhen I finished Less, I just sat there, feeling the narrative expanding within my ribs, filling up pockets of space I didn’t know were empty.\nLess in this case is certainly more.\n2. If You See Me Don’t Say Hi By Neel Patel\nA peculiar title was all I thought when I got this book, adding it to the towering pile of books sitting on my desk. One afternoon, sick of writing hunched over the laptop — which is often both literally and figuratively a pain in the neck — I decided to lie down and give Patel’s debut short story collection a shot. I didn’t get off the couch for a long time. Patel’s protagonists, often eponymously named Patels as well, are flawed, relatable and broken in myriad ways. The wonderful stories have a kernel of loss at the epicentre but are not without a wry humour that made this book unputdownable.\n3. Good night stories for Rebel Girls By Elena Favilli and Francesca Cavallo\nThis book came as a birthday present for my daughter. Pint-sized biographies of a hundred extraordinary women who are an inspiration not just for little girls but also for grown-ups like me. This book does the rounds of the house, with my little one and I reading it together in bed but it is also a book that she takes to the loo. It did make me wonder why we keep telling our children fairy tales where the woman does more waiting than accomplishing. I would rather read about a Grace Hopper who opened up all seven clocks in her house. And more importantly, her mother let her; it’s a fact I remind myself when the baby starts taking our alarm clock apart. Let Cinderella wait for her Prince, Snow White for a kiss, and go get this book instead.\n4. Florida By Lauren Groff\nThe imagery in these well-crafted stories is so powerful that you almost feel like your hair is frizzing up as you are submerged in Florida’s humid sunshine. Groff has lurking reptiles, sinkholes and, more often than not, absconding parents. The writing is luminous and the stories have an underlying layer of a sense of quiet desperation, one that most women will find very familiar.\n5. Convenience Store Woman By Sayaka Murata\nThe protagonist, Keiko, is inherently oblivious of the rules which govern society. The only place she fits in is the convenience store where she works. It gives her structure and rules to follow. Shouting out ‘Irasshaimasé!’ to customers or stacking the shelves in a regimented order are the only things that Keiko can accomplish which are deemed somewhat normal. Murata has used Keiko to illustrate the often bizarre and unfathomable rituals of human conditioning. Even when you shut this strangely compelling book, you remain immersed in the fluorescent lights of the convenience store and a voice shouting out promotions for mango custard.\nBCCL\nNow that you’ve become acquainted with the pile in my bathroom, let’s admit they come in handy in more ways than one. You can use them to kill time as you wait for engines to rev up, you can use them to murder spiders lurking over the toilet roll and, sometimes, you can use them to smack down awkward questions. One day I remember my little one asking me a question while I was waiting for her to finish in the toilet. ‘Mom, you say God is everywhere and not just in temples, so if God is everywhere then when I am doing potty am I doing potty on him?’\n‘Err… Why don’t you read Peppa Pig instead,’ I said handing her a book from the basket on the side. But later that evening, after having mulled over the question, I did tell her, ‘I am not sure if God lurks around in bathrooms, but I am convinced that Saraswati, the goddess of knowledge, doesn’t care where you read. All you need to get her blessings is to continue being a lifelong member of the joy of reading club.’\nToodles folks! I now leave you and 2018 with one of Baba Twinkdev’s sayings: A fool walks around with his nose in the air while the wise keep theirs firmly buried in books. Happy reading!", "title": "Twinkle Khanna Blogs About Five Books That She Loved Reading In 2018, Even In The Loo!", "date_publish": "30/12/2018, 18:53:48", "description": "The baby belongs to a reading class called The Joy of Reading. Every Saturday, this group of six-year-olds usually sits in my guest room and reads aloud from their library books. The beleaguered teacher not only has to get productive work from these creatures with the attention span of a goldfish, but is made ‘den’ when they play hide and seek.", "authors": ["Twinkle Khanna"], "url": "https://www.indiatimes.com/entertainment/twinkle-khanna-blogs-about-five-books-that-she-loved-reading-in-2018-even-in-the-toilet-359520.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/twinkle_khanna_blogs_about_five_books_that_she_loved_reading_in_2018_even_in_the_toilet_1546176089_800x420.jpg"}