{"text": "1. From Fat-Shaming To Women’s Weight Stigma, Twinkle Khanna Blogs About ‘Weighty Matters’\nThe question still remains why women are body shamed, especially in a field like politics where physical form has absolutely no role to play. I remember a laughing Renuka Chowdhury once making a self-deprecatory joke about her weight (By the way, most chubby girls, including me, joke about our weight as part of our defence mechanism). But Venkaiah Naidu told her, ‘My simple suggestion is, reduce your weight and make efforts to increase the weight of the party’. Then during a cabinet shuffle, Smriti Irani was shifted to the textile ministry. While none of the other ministers, all men to be noted, were lampooned, the size of her blouse became a butt of jokes on Twitter.\nThe spine-chilling Nirbhaya rape case had jolted the entire nation's conscience in 2012, after the details of the horrific rape case, in which a woman was gang-raped inside a moving bus. The grave details that included an iron rod being inserted in her private parts which led to her demise later, after she was taken to Singapore's Mount Elizabeth Hospital by the government for her treatment, still gives goosebumps to all of us.\n3. After A Doll, A Film Called Taimur Is In The Works & Madhur Bhandarkar Has Registered The Title\nAnd also, Ranveer Singh, who wants to play his father in his future films, was greeted with a Taimur doll on the same reality TV show. The obsession is quite huge, you see.\nDon't Miss 346 SHARES 4.5 K SHARES 135 SHARES 699 SHARES 9.8 K SHARES\nReplying to a fan, Abhishek Bachchan revealed it is a part of a tradition called “sajjan ghot\" where the bride’s family feeds groom’s family.\n5. Sara Ali Khan Aspires To Keep It Real, Says She’s Trying To Be As Organic As She Can\n“People appreciate the fact that I am real. I endeavour to be most real person. I don't think too much and try to be as organic as I can. I do make mistakes. With the same token you get appreciation and criticism as well and you have to take it the same way,” she said.", "title": "Twinkle Khanna Blogs About Fat Shaming, The Trailer Of ‘Delhi Bus’ Is Out & More From Ent", "date_publish": "16/12/2018, 18:09:53", "description": "The spine-chilling Nirbhaya rape case had jolted the entire nation's conscience in 2012, after the details of the horrific rape case, in which a woman was gang-raped inside a moving bus. The grave details that included an iron rod being inserted in her private parts which led to her demise later, after she was taken to Singapore's Mount Elizabeth Hospital by the government for her treatment, still", "authors": [], "url": "https://www.indiatimes.com/entertainment/twinkle-khanna-blogs-about-fat-shaming-the-trailer-of-delhi-bus-is-out-more-from-ent-358729.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/twinkle_khanna_blogs_about_fat_shaming_the_trailer_of_delhi_bus_is_out__more_from_ent_1544964051_800x420.png"}