{"text": "In a disappointing turn of events, filmmaker Rajkumar Hirani has been accused of sexual assault by a woman who worked with him on his 2017 film \"Sanju\".\nWhile Hirani has categorically denied the allegations and his lawyer Anand Desai termed the allegations \"false, mischievous, scandalous, motivated and defamatory\", his fans are definitely crestfallen.\nWhistling Woods\nWith an enviable 100% successful track record of delivering hit films, this definitely comes as a shocker for many.\nTwitter\nIn an article on HuffPost India, the woman, who calls herself as \"an assistant\", alleged that Hirani sexually abused her more than once between March and September 2018.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n(Read more: An Assistant Who Worked On Sanju Accuses Rajkumar Hirani Of Sexually Harassing & Abusing Her)\nThe news spread like wildfire and there have been several reactions. People are clearly divided after the allegations. Here's what happened.\nHere is how people reacted.\nSHOCKING!! Bollywood’s most successful Director-Writer @RajkumarHirani accused of sexual assault during making of #Sanju #RajkumarHirani has denied the accusations in a statement issued by his lawyer..Most shocking #MeToo revelation which everyone want to be proved wrong! — Box Office Today (@Boxoffice_Today) January 13, 2019\nHearing most cases of #MeToo has been disturbing but this one breaks my heart. #RajkumarHirani gets accused... are there no heroes left? — Vineeta Kumar (@aslivineeta) January 13, 2019\nRajkumar Hirani accused of Sexual harassment.\nNow he has to make a biopic of his own to clear his image #Rajkumarhirani — Subham (@subhsays) January 13, 2019\ni think many women should know the meaning of sexual assault before they accuse anyone. ur past broken relationships and someone who is trying to flirt with u and ur personal grudges they dont come under #MeToo stop playing women card #RajkumarHirani — Vikram_rangineni (@Vikram_aditya17) January 13, 2019\nThere's Some Truth In The Allegations Or Else Why Would This Happen When One Was Called Producer Of The Film And Was In Posters Mentioned Even During Teaser Release Time #RajkumarHirani #RHF\nCheck This Picture Out\nLink Of Teaser Time Post https://t.co/1FbNxpH2Gt pic.twitter.com/gYFsEJEPRQ — अNMOL K MAHTANI (@aKm07) January 13, 2019\nBehind every white washer of a convicted criminal is a criminal. Take #RajkumarHirani as example. India's finest director and 300 crore Blah! Blah! Blah! and #MeTooIndia accused is allegedly pits and sexual predator in real life. — Tanya (@UrbanRangoli) January 13, 2019", "title": "Twitter Stands Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!", "date_publish": "13/01/2019, 18:50:36", "description": "Twitter Is Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!Twitter Is Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!Twitter Is Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!Twitter Is Divided After Rajkumar Hirani Gets Accused Of Sexually Harassing A Female Assistant!Twitter Is Divided A", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/twitter-stands-divided-after-rajkumar-hirani-gets-accused-of-sexually-harassing-a-female-assistant-360354.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hirani_1547385959_800x420.jpg"}