{"text": "Peter Dinklage AKA Tyrion Lannister is one of the most loved characters on Game of Thrones. We have his look-alike in India as well. The man named Tariq Mir was apparently spotted by filmmaker Imtiaz Ali in Kashmir. And now, another doppelganger of the star has been spotted in Pakistan.\nAFP\nThe man named Rozi Khan is a waiter by profession. He had never heard about the show Game of Thrones and its popularity. He didn’t even know he looked like an actor from the show, Peter Dinklage. He got to know about it when he was working at the restaurant and people asked if they could get clicked with him.\nAFP\nRozi Khan is 25-years-old, and he is loving all the attention that he gets these days. He says, now he gets stopped in the streets regularly for pictures and he simply loves it.\nAFP\nDon't Miss 837 SHARES 159 SHARES\n“I don't mind. A lot of my pictures have been taken, that's why I have become very famous everywhere. Wherever I go, someone says to me: 'Sir, who is this man with you on Facebook', I say that he is my friend. 'He looks like you'. I tell them he is my brother. It's not a bad thing,” Rozi Khan was quoted as saying by AFP.\nAFP\nKhan works at small Kashmiri restaurant down a narrow lane in Rawalpindi and serves hearty dishes such as mutton and spinach curries. The owner of the restaurant Malik Aslam Pervez says he is an hard-working employee. “When he takes a day off or gets sick, people look for him and ask where did he go? They get upset. They love him. There is always a crowd here but it has boomed because of him,” he said.\nAFP\nRozi Khan now wants to meet Peter Dinklage one day and we can't wait for it to happen!\nWith inputs from AFP", "title": "Peter Dinklage look alike:Tyrion Lannister’s Pakistani Look-Alike Who Is A Waiter By Profession Has Never Heard Of Game Of Thrones", "date_publish": "23/03/2019, 14:13:34", "description": "The man named Rozi Khan is a waiter by profession. He had never heard about the show Game of Thrones and its popularity. He didn’t even know he looks like an actor from the show, Peter Dinklage. He got to know about it when he was working at the restaurant and people asked if they could get clicked with him.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/tyrion-lannister-s-look-alike-rozi-khan-has-never-heard-of-got-but-hopes-to-meet-the-man-who-made-him-famous-364174.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/meet_rozi_khan_peter_dinklage_aka_tyrion_lannisters_pakistani_lookalike_a_waiter_by_profession_1553326539_800x420.png"}