{"text": "Uday Chopra Asks If We’re Allowed To Be ‘Atheists’ In India, Farhan Akhtar Gives An Epic Reply!\nUday Chopra Asks If We’re Allowed To Be ‘Atheists’ In India, Farhan Akhtar Gives An Epic Reply!\nDo you believe in God? In a country which is hailed as the land of many religions and languages, is it okay to be an atheist?\nUday Chopra had a similar question recently. To his 1.48 million followers on Twitter, Uday Chopra asked, “Are we allowed to be Atheists in India?”\nAre we allowed to be Atheists in India? — Uday Chopra (@udaychopra) March 22, 2019\nInterestingly, Farhan Akhtar was one of the people who responded to his tweets. Farhan wrote, “God knows,” with an eye-rolling emoticon.\nGod knows. 🙄 — Farhan Akhtar (@FarOutAkhtar) March 23, 2019\nAnd this wasn’t all, Uday Chopra then went on a rant about “unproved imaginary beings.” In one of his tweets, he wrote, “People are fighting over each other’s unproved imaginary beings and yet that’s all ok but the moment one says I don’t really believe in an an imaginary unprovable sky daddy, I’m the weird one.”\nHere’s a thought: you can hold a gun to my head a force me to believe in your god. I’ll even say yes I do...cause let’s face it I want to live, but how do you know what I really believe in my head? I don’t think even your god knows, most likely cause it’s imaginary — Uday Chopra (@udaychopra) March 22, 2019\nPeople are fighting over each other’s unproved imaginary beings and yet that’s all ok but the moment one says I don’t really believe in an an imaginary unprovable sky daddy, I’m the weird one! — Uday Chopra (@udaychopra) March 22, 2019\nDon't Miss 2.4 K SHARES 2.5 K SHARES 132 SHARES\nHere’s how people reacted to his tweets.\nPick your battles wisely, some are not worth it. — Jolie Sohi (@jolie_sohi) March 22, 2019\nDid you come to India today? — Sudip Dhiren (@sudipd_ABpos) March 23, 2019\nYes, we can be.. problem arises when we boast it!! 😎 — Murali Nair (@MuraliCRNair) March 23, 2019\nunder the current regime, you're not allowed to be anything but hindu — cool and good (@TheHedgehog123) March 22, 2019\nIf you are strong enough to handle dirty looks thrown at you or the frequent eye rolls, be one. — Varsha Patil (@DrVarshaa) March 23, 2019\nYou can be what you like as long as you don't announce it on social media! — Mini Ribeiro (@MiniRib) March 23, 2019\nIt is allowed but u'll have to be hard in listening abuses — Shubham Khandelwal (@shubham_2107) March 22, 2019\nMeanwhile, Uday Chopra had also tweeted about his mental health recently. Last night, taking to Twitter, he wrote, “Confession: I am not ok! I am trying but so far I’m failing. For a few hours, I De-activated my twitter account. It felt as close to death as I could get. Was phenomenal! I think this is a good option for suicide. I might be doing it permanently soon.” However, he soon deleted his tweet.", "title": "Uday Chopra Asks If We’re Allowed To Be ‘Atheists’ In India, Farhan Akhtar Gives An Epic Reply!", "date_publish": "23/03/2019, 18:12:35", "description": "Uday Chopra had a similar question recently. To his 1.48 million followers on Twitter, Uday Chopra asked, “Are we allowed to be Atheists in India?” Interstingly, Farhan Akhtar was one of the people who responded to his tweets. Farhan wrote, “God knows,” with an eye-rolling emoticon.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/uday-chopra-asks-if-we-re-allowed-to-be-atheists-in-india-farhan-akhtar-gives-an-epic-reply-364197.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/uday_chopra_asks_if_were_allowed_to_be_atheists_in_india_farhan_akhtar_gives_an_epic_reply_1553344050_800x420.png"}