{"text": "Madam Tussauds Delhi has received yet another celebrity. After SRK, Anil Kapoor and Ranbir Kapoor, the next superstar to get a wax statue at the Delhi outlet is singer-actor Diljit Dosanjh.\nInstagram\nThe figurine has been unveiled today at the wax museum. The statue was initially scheduled to be revealed on February 28 but was postponed in the wake of mourning over the Pulwama terror attack.\nAhead of the release of his figurine, Diljit shared the news with his pic on Instagram. \"Tomorrow #Madametussauds Dosanjhanwala in DELHI TOMORROW Nu LOVE MY FANS @madametussauds@madametussaudsdelhi,\"he captioned the post.\nThe ‘Udta Punjab’ actor had earlier said that amidst rising tensions between India and Pakistan, he would stand with the Indian Army and thus will reschedule the unveiling of his statue.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAnd now it's unveiled and open to public access. Wearing a black turban and a Gucci sweatshirt, statue Diljit is nailing his look at the museum. He launched his statue with a cool black and white tuxedo and it was tough to identify the real Diljit Dosanjh.\nThe Delhi Madame Tussauds showcases the wax statues of many Bollywood and international celebrities. Diljit’s statue will stand amongst the likes of Amitabh Bachchan, Shah Rukh Khan, Salman Khan, Katrina Kaif, Kareena Kapoor Khan, Sonu Nigam, Lady Gaga, Justin Beiber, David Beckham, Virat Kohli, Michael Jackson, among others.", "title": "'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madame Tussauds Delhi", "date_publish": "28/03/2019, 18:11:55", "description": "'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madam Tussauds Delhi'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madam Tussauds Delhi'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madam Tussauds Delhi. 'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madam Tussauds Delhi'Udta Punjab' Actor Diljit Dosanjh Unveils His Wax Statue At Madam Tussaud", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/udta-punjab-actor-diljit-dosanjh-unveils-his-wax-statue-at-madame-tussauds-delhi-364506.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/diljit_1553775472_800x420.jpg"}