{"text": "Undeterred By Criticism, Sonu Nigam Compares ‘Opinion’ To An A**hole, Says Everyone Has One\nUndeterred By Criticism, Sonu Nigam Compares ‘Opinion’ To An A**hole, Says Everyone Has One\nSinger Sonu Nigam somehow or the other makes headlines. More than his music, he grabs eyeballs for his controversial statements and extreme opinions on social and political issues.\nWhen asked whether it’s a conscious choice or does it happen on it’s own he said,\nnewsmobile\n\"Look, opinion is like an a**hole, everyone has it. Some refuse to understand that. And the fact is honest opinion stinks, but that does not stop me to say it, why should I say something dishonest?\".\nAfter questioning the use of loudspeakers by mosques for Azaan, he recently received a lot of flak for supporting one of his colleagues who was an accused in one of the #MeToo incidents.\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nIn an interview with IANS, he was asked why he doesn’t channelize his anger and opinions in the form of his music, he said,\n\"I keep music separate from politics, but I am a musician by profession who has an interest in world affairs and everything that is happening around us in the society. I read books, I interact with wise people who have in-depth knowledge of many things. So of course, if people and media ask me on things, I will react.\"\nyoutube\nWhile we do believe in to each their own, it wouldn’t be a bad thing if people think before making comments in a haste about anything and everything, don’t you agree?\n(With inputs from IANS)", "title": "Undeterred By Criticism, Sonu Nigam Compares ‘Opinion’ To An A**hole, Says Everyone Has One", "date_publish": "18/01/2019, 18:57:25", "description": "When asked whether it’s a conscious choice or does it happen on it’s own he said, \"Look, opinion is like an a**hole, everyone has it. Some refuse to understand that. And the fact is honest opinion stinks, but that does not stop me to say it, why should I say something dishonest?\". After questioning the use of loudspeakers by mosques for Azaan, he recently received a lot of flak for supportin", "authors": [], "url": "https://www.indiatimes.com/entertainment/celebs/undeterred-by-criticism-sonu-nigam-compares-opinion-to-an-a-hole-says-everyone-has-one-360671.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/sonu_nigam_1547817504_800x420.jpg"}