{"text": "Unlike Ranveer-Deepika, PC's Wedding Will Be Attended By A Bevy Of Celebs Including Salman!\nUnlike Ranveer-Deepika, PC's Wedding Will Be Attended By A Bevy Of Celebs Including Salman!\nThe year started with a big bang for Bollywood fans when Sonam Kapoor and Anand Ahuja tied the knot. Looks like it will also end on a bigger one. From Deepika Padukone-Ranveer Singh's Italy wedding in November to Priyanka Chopra-Nick Jonas' big fat royal wedding in December, Bollywood has kickstarted the shaadi season with full fervour.\nDeepika-Ranveer announced on social media that the two are tying the knot and Priyanka threw the most fashionable bridal shower in New York to announce to the world that she's getting married.\nPriyanka has always broken stereotypes, whether it's her career choices or the man of her life, Nick Jonas. Her fans were rooting that she may get married to an Indian celebrity, but she surprised everyone by taking the plunge with singer-actor of the West - Nick Jonas.\nDon't Miss 153 SHARES 161 SHARES 862 SHARES\nKeeping it traditional like her engagement, Priyanka will marry Nick in India. As per reports, the duo has finalised the Umaid Bhawan Palace in Jodhpur as their wedding venue.\nUnlike other celebs who keep their wedding a private affair, PC will be inviting her friends from Bollywood.\nAs per sources of Filmfare, PC has invited Salman Khan along with the other Khan family members. As many of you know, Priyanka was supposed to star opposite Sallu in his upcoming film, Bharat but she walked out of the project last minute citing a clash with her impending wedding.\n“Besides Salman, invitations will also be sent out to his family members Arpita-Aayush, Arbaaz Khan, Sohail-Seema, Alvira-Atul Agnihotri and Salim Khan. The couple plans to host a 3-day grand celebration at Umaid Bhawan Palace, Jodhpur and 1500-2000 guests are expected to turn up,” a source close to the bride-to-be shared with the publication.\nApart from them, Alia Bhatt, Ranbir Kapoor, Katrina Kaif, Farhan Akhtar and Siddharth Roy are also in the list of invitees. We're wondering if King Khan would be called for the royal wedding.", "title": "Unlike Ranveer-Deepika, PC's Wedding Will Be Attended By A Bevy Of Celebs Including Salman!", "date_publish": "01/11/2018, 13:43:29", "description": "The year started with a big bang for Bollywood fans when Sonam Kapoor and Anand Ahuja tied the knot and looks like it will end also with a bigger bang From Deepika Padukone-Ranveer Singh's Italy wedding in November to Priyanka Chopra-Nick Jonas' big fat royal wedding in December, Bollywood has kickstarted the shaadi season with full fervour.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/unlike-ranveer-deepika-pc-s-wedding-will-be-attended-by-a-bevy-of-celebs-including-salman-355845.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/priyanka_1541055348_800x420.jpg"}