{"text": "Was it a love story or a tale of abuse? Salman Khan and Aishwarya Rai dated for about two years but the controversies surrounding the two went on for years that followed.\nInstagram\nIt is said that the two stars of the entertainment industry who barely talk to each other now, were madly in love at one point in time. But because of Salman Khan’s violent behaviour, she called it quits.\nInstagram\nShe was reportedly then dating Vivek Oberoi, who also had to bear the brunt of her past relationship. According to Vivek, Salman drunk called him 41 times in a night and threatened him. He called a press conference to reveal about it to the world, and his career took a turn for the worse thereafter.\nAlso Read: Did Vivek Oberoi Just Take A Sly Dig At Salman Khan As He Said ‘I Am Still Here & Unbreakable'\nInstagram\nDon't Miss 812 SHARES 3 K SHARES 4 K SHARES 449 SHARES 12.5 K SHARES\nIt is said that Sanjay Leela Bhansali, who has worked with Salman Khan and Aishwarya Rai in Hum Dil De Chuke Sanam, wanted to cast them both in Bajirao Mastani, which why the project was on hold for the longest time. Bhansali later, cast Ranveer Singh and Deepika Padukone. Salman Khan and Aishwarya Rai still avoid each other.\nInstagram\nBut the movie buffs seemingly cannot forget their love story. Internet recently dug out an old picture of the duo, which is now going viral on the internet. Just like us, fans have a mixed reaction to this. Take a look!\nInstagram\nWill they ever bury the hatchet? Only time will tell.", "title": "Unseen Picture Of Ex-Flames Salman Khan & Aishwarya Rai Emerges On The Internet, Goes Viral!", "date_publish": "14/04/2019, 17:31:13", "description": "Was it a love story or a tale of abuse? Salman Khan and Aishwarya Rai dated for about two years but the controversies surrounding the two went on for years later. Was it a love story or a tale of abuse? Salman Khan and Aishwarya Rai dated for about two years but the controversies surrounding the two went on for years later.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/unseen-picture-of-ex-flames-salman-khan-aishwarya-rai-emerges-on-the-internet-goes-viral-365438.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/unseen_picture_of_salman_khan_and_aishwarya_rai_is_going_viral_1555241953_800x420.png"}