{"text": "It’s very difficult to digest the fact that a star like Govinda is not getting movie theatres to release his film. There was a time when audience and fans used to fight to get his movie ticket to watch him on the silver screen and today he is struggling to get theatres.\nTwitter\nAfter leaving politics, Govinda made a comeback in Bollywood and this time, he tried different genres. He did films like Kill Dill, Happy Ending and Raavan which were a dud at the box office. And now he is trying to make a comeback with a film as a hero titled Rangeela Raja, written and produced by ex-Chief of Censor Board Pahlaj Nahlani.\nThe film trailer released long ago but the struggle to get the theatres for its release has prolonged for a long time now. The Board of Censor has rejected the film and has demanded 20 cuts as they feel Govinda’s character is completely misogynistic and cannot let such kind of films to release in the movie halls.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nGovinda is extremely unhappy with this decision of Censor and feels that they are taking out personal grudge from Pahlaj as he also had created lots of hurdles for other film releases.\nTwitter\nIn a conversation with us, Govinda on Censor Board not giving their go-ahead for Rangeela Raja, he said,\n“I don’t understand what’s the problem with the film, if there is some unwanted dialogues or scenes which cannot be shown, it is understood to say no to it, but I feel it’s a personal vendetta, the world is watching what Censor Board is doing with my film. I am not liking how people are removing personal grudges over cinema; it’s not a good example. I feel cinema should be liberal.”\nTalking about his collaboration with Pahlaj, he said, “I started my filmy career with Pahlaj and it is very important for me to tell Censor that they should not remove personal grudge with him and let the film release smoothly and set a good example.”\nTwitter\nWe asked him how hurtful it is to deal with such bias behaviour, Govinda said,\n“I am not taking it personally at all, the problem with cinema now is, it has mixed with politics and it’s not good. We should learn something from the south industry they always have unity.”\nHe further added, “ They have demanded 20 cuts which are impossible to remove, and if we remove it we have to re-shoot it and that will take a long time, either the makers will have to take a flop film ahead or it needs to be re-shot, that’s the option we have been left with. It is a very dangerous situation for him (Pahlaj) right now. We have seen so many bold films nowadays where there is use of abusive languages, it’s a real cinema, even Pahlaj ji has seen it, Also he has been the chief of Censor so he knew what kind of films will get a green signal from the Censor and he has made that kind of film only, but despite being so careful, he has to face this from the Censor Board.”\nTwitter\nGovinda even highlighted how today Bollywood has formed individual groups and support only their people,\n“The pattern right now in Bollywood is very bad. There are groups who will only favour their favourite person, so this is clearly politics. As I said cinema should be liberal. The current environment in the film industry is not good.”\nTwitter\nGovinda on his failures,\n“Reacting to your success or failure is a sign of weak people. When I started my career I was extremely poor, I didn’t have money to buy tickets to watch a film, but today I am working on films and people buy tickets to watch me, God gave me a huge success and I am very thankful. Success and failure keep on going, that’s nature, but if I let myself affect with my failures that will be working, I will never stop working hard, I always say God was very kind on me to give me birth in this world and then make me a star.”\nTwitter\nWhen we asked if he ever regrets his latest films choices, he said, “I never regret doing any of my films. When I left politics and came back to films, I did Kill Dill and Happy Ending and Raavan they all were different genres films. And now I am back again with Aa Gaya Hero film as a hero, and there are more films lined up where I will be playing a hero. I am okay to do any kind of cinema, I am getting work and I will work.”\nTwitter\nWe hope the directors are listening and they should cast Govinda in some relevant scripts where he can show his acting skills.", "title": "Upset With Censor Board's Policing, Govinda Feels His Movie 'Rangeela Raja' Is Deliberately Being Targeted", "date_publish": "23/11/2018, 15:12:21", "description": "It’s very difficult to digest the fact that a star like Govinda is not getting movie theatres to release his film. There was a time where audiences and fans used to fight to get his one movie ticket to watch him on the silver screen and today he is struggling to get theatres. After leaving politics Govinda made a comeback in Bollywood and this time he tried different genres, he did films like Kil", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/upset-with-censor-board-s-policing-govinda-feels-his-movie-rangeela-raja-is-deliberately-being-targeted-357248.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/govinda_1542976000_800x420.jpg"}