{"text": "After celebrating Christmas together, Priyanka Chopra and Nick Jonas are now on a couples’ vacation with Joe Jonas and Sophie Turner. The couples are enjoying family time in Verbier, Switzerland.\n2. 'Uri: The Surgical Strike' Trailer Gets Censored, Dialogue With Reference To ‘72 Virgins’ Removed\nWeeks later, the makers of the movie RSVP Productions have removed the old trailer and uploaded a new one that has a minor change in it. Looks like one of the dialogues from the movie has been censored.\n3. Kader Khan's Son Sarfaraz Rubbishes Rumours Of His Death, Confirms He's Alive & In The Hospital\n“It is all a lie. It (is) just a rumour. My father is in the hospital,” Mr. Sarfaraz told PTI.\n4. 10 Bollywood Directors Select Their Favourite Films Of 2018 & AndhaDhun Is A Clear Winner!\nBe it black comedy thriller AndhaDhun, light-hearted film Badhaai Ho or horror comedy Stree, the year of 2018 saw a string of content driven and small budget movies which have outperformed at the box-office, and proved that Bollywood not just runs on starry ventures and big-budget production. So before the year ends, many renowned filmmakers from the industry have shared their favourite films of 2018.\nRam Charan, Rana, Prabhas at Rajamouli event pic.twitter.com/NCBQMxrAjU — Nitish Shekhar (@nitzrulzx412) December 31, 2018\nIt was a star-studded affair. From Ram Charan and Jr NTR to Baahubali stars Prabhas and Rana Dagubbati, everyone graced the occasion. Everyone danced, laughed and enjoyed together making our hearts all mushy.", "title": "Uri Trailer Gets Censored, Priyanka Chopra-Nick Jonas’ Switzerland Vacation & More From Ent", "date_publish": "31/12/2018, 18:03:38", "description": "From Uri trailer getting censored to Priyanka Chopra, Nick Jonas, Joe Jonas and Sophie Turner vacationing in Switzerland, here’s all that rocked the world of entertainment. “Apni 72 hooron ko hamara salaam bolna! Kehna daawat par intezar karein, aaj bahut saare mehmaan bhejne wale hain.(Convey our greetings to the 72 virgins! Tell them to wait for the feast, we are going to send a lot of guests)”", "authors": [], "url": "https://www.indiatimes.com/entertainment/uri-trailer-gets-censored-priyanka-chopra-nick-jonas-switzerland-vacation-more-from-ent-359596.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/uri_trailer_gets_censored_priyanka_chopranick_jonas_switzerland_vacation__more_from_ent_1546258943_800x420.png"}