{"text": "Reacting to the heartbreaking Pulwama attack that killed over 40 of our soldiers in Pulwama, Bollywood actor Vicky Kaushal described the episode as \"sad\". Condemning the incident, Kaushal said,\nRSVP Films\n\"It is a great loss of human lives. If in any possible way, we can support the family of martyrs, it would be a great contribution from our end, as a society. The whole incident should not be forgiven and forgotten.\"\nIn his latest release Uri: The Surgical Strike, Vicky played the role of an army officer. He received a lot of praise from the audience for his performance in the film.\nDon't Miss 837 SHARES 2.1 K SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nThe actor made the remarks on the sidelines of the final day of Act Fest, organised by Cine and TV Artistes' Association (CINTAA) and the 48 Hour Film Project. Actress Kubra Sait also condemned the attack and urged people to be kind towards humanity. Sait said,\n\"The film fraternity is coming together to say that what happened is incorrect... it is extremely heartbreaking and shocking. I will not support terrorism in any way especially when terrorism is faked in the mask of faith. I'm not somebody who agrees to this. I think its high time that humans started loving each other with kindness with respect and just with love.\"\n(With agency inputs)", "title": "Uri Actor Vicky Kaushal Reacts To Pulwama Attack, Says It Shouldn't Be Forgotten Or Forgiven", "date_publish": "18/02/2019, 11:08:21", "description": "\"It is a great loss of human lives. If in any possible way, we can support the family of martyrs, it would be a great contribution from our end, as a society. The whole incident should not be forgiven and forgotten,\" he told the media on Saturday. Read more here.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/uri-actor-vicky-kaushal-reacts-to-pulwama-attack-says-it-shouldn-t-be-forgotten-or-forgiven-362328.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vicky_kaushal_pulwama_attack_1550468906_800x420.jpg"}