{"text": "Uri Director Reveals The Origin Of 'How's The Josh?' & The Story Is As Interesting As The Film!\nUri Director Reveals The Origin Of 'How's The Josh?' & The Story Is As Interesting As The Film!\n“How’s the Josh? High Sir” – This one line has hit a chord with the entire nation. Mouthed by Vicky Kushal in Uri The Surgical strike, from Prime Minister Narednra Modi to Indian cricket team players, almost everyone has been using this phrase with immense pride.\nBut did you know how this popular dialogue was coined?\nDirector of Uri: The Surgical Strike Aditya Dhar recently revealed that this has links to his childhood.\n“I had some friends from defence background, so with them, I used to go to a lot of Army clubs. There was one in Delhi where we used to go for Christmas or New Year parties. There used to be a retired Brigadier who would line up all the kids in front of him and have a chocolate in his hand,” he said.\n“He would say ‘How’s the josh?’ and we were to respond with ‘High Sir!’ The kid who was the loudest got the chocolate. Being a foodie, I used to be the loudest and always got the chocolate,” he added.\nAditya Dhar said that he never anticipated that this line would acquire a life of its own.\n“I have heard very few Army people use the phrase. It is not something which is used extensively. What I did was I used the line in the right way in the film and now it has taken off to another level.”\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nFrom the first day itself, he says, he was sure that he had to include this line in the movie.\n“The line was there right from the first draft. As a writer, we write according to our personal experiences, our memories. It is an amalgamation of everything. I had the line with me in my memory and this was the perfect film for it to come out.”\nSo, how’s the josh, everyone?\nWith inputs from IANS", "title": "Uri Director Reveals The Origin Of 'How's The Josh?' & The Story Is As Interesting As The Film!", "date_publish": "06/02/2019, 18:12:22", "description": "But did you know how this popular dialogue was coined? Director of Uri: The Surgical Strike Aditya Dhar recently revealed that this has links to his childhood. Aditya Dhar said that he never anticipated that this line would acquire a life of its own.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/uri-director-reveals-the-origin-of-how-s-the-josh-the-story-is-as-interesting-as-the-film-361703.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/uri_director_aditya_dhar_explains_origin_of_hows_the_josh_1549455511_800x420.png"}