{"text": "In today's episode, KJo will brew another cup of piping hot Koffee with some gossip and anecdotes and two stars in the spotlight today would be Bhumi Pednekar and Rajkummar Rao. Known for their unconventional choice of roles and delivering some memorable performances, both actors will grace KJo's couch today.\nThe film continues to break records at the box-office and is inches closer to reaching the 150 crore mark.\nSince his debut in Bollywood in mid-1990s, the National Award-winner has acted in mainstream as well as indie films. Last year, the Bandit Queen actor featured in seven films - Aiyaary, Baaghi 2, Missing, Satyameva Jayate, Gali Guleiyan, Love Sonia and Bhonsle.\nDon't Miss 3.4 K SHARES 3.1 K SHARES 155 SHARES 343 SHARES 870 SHARES\nHe said, “We would constantly speak about the indie scene in India. Ranveer has rapped earlier, so that made things easier for him. Apart from that, he is a great observer. He would study us — from our body language, to how we create lyrics for our songs and the kind of language we use in them. When you look at him in the film, it feels as if he has become one of us.\"\nKJo said, “Being a leading filmmaker, I can make movies on the subject. I would love to make a homosexual love story and would want to cast two leading actors in the film. I don’t have in mind specific names of the actors I want to cast in the film, but I surely want to make such a film.\"", "title": "Uri To Enter 150 Crore Club, Bhumi-Rajkummar Rao To Brew A Special 'Koffee' And More From Ent", "date_publish": "27/01/2019, 17:12:09", "description": "In today's episode, KJo will brew another cup of piping hot Koffee with some gossip and anecdotes and two stars in the spotlight today would be Bhumi Pednekar and Rajkummar Rao. Known for their unconventional choice of roles and delivering some memorable performances, both actors will grace KJo's couch today.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/uri-to-enter-150-crore-club-bhumi-rajkummar-rao-to-brew-a-special-koffee-and-more-from-ent-361136.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_1548589583_800x420.jpg"}