{"text": "Small budgets have taken Bollywood by storm. Right from Raazi, Uri, Tumbbad, Badhaai Ho, the films proved content is king and A-listers are now best if content is solid.\nUri was not only Vicky Kaushal's first big solo film, it was also based on real life surgical strike that won the hearts of the audience. So much so, that the signature dialogue of the film, 'How's The Josh' became a popular one and people still use it for college and school kids.\nTwitter\nBut did you know, the lead actor of the film, Vicky Kaushal was not convinced about the line. Yes, the film's director Aditya Dhar says that at one point during the shoot, he was about to change the line following a suggestion from actor Vicky Kaushal.\nRecalling the incident, Dhar said: \"We first shot the line 'How's the josh?' during the Myanmar sequence. Two minutes before the camera rolled, Vicky came to me and asked me to change the line because he thought somewhere the 'feel' was not coming. I tried to explain that to motivate their team, army commanders talk like that, so let's give it a try.\"\nViral Bhayani\nDon't Miss 106 SHARES 7.4 K SHARES\n\"I still remember when Vicky said that line for the first time, 30 members of our team had goosebumps on hearing it,\" added the 36-year-old director during a conversation with veteran screenplay writer Robin Bhatt as part of a programme titled \"Wartalaap\" by the Screenwriters Association (SWA) here on Sunday.\nWhat was the story behind the line? \"I used to visit the Army club in Delhi along with my friends when I was a little boy. There used to be a former Army officer, who would ask all of us children to stand in a queue and ask us 'How's the josh?'. The game was, one by one, all children have to reply, 'High, Sir'. Whoever would say it the loudest and the best would get chocolate. Most of the time I used to win the chocolate,\" Dhar recounted.\nIt was just a memory that stayed with me, shared the film director. When Dhar started writing the script of Uri: The Surgical Strike, he wrote the dialogue as part of Vihaan's character without realising that the dialogue will become such a hit.\nscreengrab\nThe director has also realised that following the release of the film, other directors are also making war films as that's the flavour of the season. \"If a war film is hit, people will start making many of that. When I made Uri... war film was not a commercially successful genre of the present time.\"\nWell, we couldn't be more thankful to Aditya for making such an impact film with such power packed dialogues and performances.\nInputs from IANS", "title": "'Uri' Director Aditya Dhar Reveals Vicky Kaushal Asked Him To Change Signature Dialogue 'How's the Josh?'", "date_publish": "09/04/2019, 11:44:42", "description": "'Uri' Director Aditya Dhar Reveals Vicky Kaushal Asked Him To Change Signature Dialogue 'How the Josh?''Uri' Director Aditya Dhar Reveals Vicky Kaushal Asked Him To Change Signature Dialogue 'How the Josh?''Uri' Director Aditya Dhar Reveals Vicky Kaushal Asked Him To Change Signature Dialogue 'How the Josh?'", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/uri-director-aditya-dhar-reveals-vicky-kaushal-asked-him-to-change-signature-dialogue-how-s-the-josh-365098.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/aditya_1554791841_800x420.jpg"}