{"text": "Filmmaker Kabir Khan is all geared up for one of the most ambitious projects of his life. Based on 1983 world cup win, Kabir Khan admitted that it is one of the best stories he's ever heard. A media report had quoted the director saying,\n“It’s probably the best story I’ve heard in my life. But there’s a dearth of writing about it. I had to go to Lord’s library and search all the books to finally get all the material together. There’s such less material written on it despite the fact that it was such an iconic moment in the history of our country.”\nTo make sure that the film turns out to be as good as the real story, Kabir Khan is focusing on the right casting of the film. The final casting is still in process and the actors who have been confirmed till now are:\n1. Pankaj Tripathi will be playing PR Man Singh (Team Manager)\n2. Harrdy Sandhu as Madan Lal\n3. Saqib Saleem as Mohinder Amarnath\n4. Chirag Patil as dad Sandeep Patil\n5. Jiiva as Kris Srikanth\n6. Tahir Raj Bhasin as Sunil Gavaskar\n7. Ammy Virk as Balvinder Singh Sandhu\n8. Sahil Khattar as Syed Kirmani\nAnd now, there is another addition to the casting of the film. According to a report, Uri actor Dhairya Karwa has been roped in to play the role of Ravi Shastri.\nDhairya was last seen as Captain Sartaj Singh Chandok in Vicky Kaushal and Yami Gautam starrer recent blockbuster Uri.\nDon't Miss 185 SHARES 544 SHARES 411 SHARES 12.5 K SHARES 5.5 K SHARES\nThe shooting of the film will begin in mid-May and will have a 100-day schedule in London and Scotland. The film will be produced by Reliance Entertainment and will be helmed by Kabir Khan. The film will release on April 10, 2020.", "title": "Uri Actor Dhairya Karwa All Set To Play Ravi Shastri In Ranveer Singh Starrer '83", "date_publish": "22/02/2019, 16:16:49", "description": "And now, there is another addition to the casting of the film. According to a report, Uri actor Dhairya Karwa has been roped in to play the role of Ravi Shastri. Dhairya was last seen as Captain Sartaj Singh Chandok in Vicky Kaushal and Yami Gautam starrer recent blockbuster Uri.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/uri-actor-dhairya-karwa-all-set-to-play-ravi-shastri-in-ranveer-singh-starrer-83_-362610.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/uri_actor_1550831199_800x420.jpg"}