{"text": "1. Despite Attempting A Surgical Strike On Piracy, ‘Uri’ Gets Leaked Online By TamilRockers\nThat was indeed the most creative way to curb piracy so far. But seemingly, this couldn’t change the fate of the film in terms of piracy. TamilRockers.com have managed to leak the film, despite the attempt of the makers of a surgical strike on piracy.\n2. Soaking Up The Sun! Virat Kohli And Wifey Anushka Sharma Enjoy A Date At Australian Open 2019\nSoaking in the sun, the lovebirds clicked a selfie together at Australian Open 2019 in Melbourne. Like always, their fans couldn’t stop gushing. Take a look at how the couple looked ravishing twinning in white.\n3. Guru Randhawa Serenaded A Girl With 'Ban Ja Tu Rani' But She Rejected Him After He Sang It To Her\nDon't Miss 3.4 K SHARES 870 SHARES 518 SHARES\nYears after, when his song became superhit, the girl came back into his life. She confessed her love for him, but this time Guru Randhawa rejected her proposal. Sounds like a Bollywood film, right?\n4. Recounting Sexual Harassment By A Director, Swara Bhasker Says It Took Her Years To Realise It\n“It took me six to eight years to realise when I heard someone else talk about their experience of harassment at a panel discussion like this. I was like God, what happened to me three years ago was actually sexual harassment at workplace! I never realised it because like you said, I escaped. Because the person did not touch me and I managed to ward it off,” Swara Bhasker was quoted as saying by PTI.\n5. Karni Sena Denies Involvement In Manikarnika Protests After Kangana Threatens To 'Destroy' Them\nIn a shocking development, now Karni Sena has refuted the claims made by Kangana Ranaut that the group is opposing the release of the biopic on the freedom fighter. Dr Himanshu, Karni Sena’s national spokesperson and ex-major rubbished the reports and said that group’s name is being used for personal vested interests.", "title": "Uri Gets Leaked Online, Virat-Anushka Attend Australian Open 2019 & More From Entertainment", "date_publish": "19/01/2019, 18:15:32", "description": "From Vicky Kaushal starrer Uri The Surgical strike getting leaked online by TamilRockers.com to Virat Kohli and Anushka Sharma attending Australia Open 2019 in Melbourne, here is all that rocked the world of entertainment and Bollywood today. Take a look.", "authors": [], "url": "https://www.indiatimes.com/entertainment/uri-gets-leaked-online-virat-anushka-attend-australian-open-2019-more-from-entertainment-360718.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_gets_leaked_online_viratanushka_attend_australia_open_2019__more_from_entertainment_1547901964_800x420.png"}