{"text": "'Uri: The Surgical Strike' Trailer Gets Censored, Dialogue With Reference To ‘72 Virgins’ Removed\n'Uri: The Surgical Strike' Trailer Gets Censored, Dialogue With Reference To ‘72 Virgins’ Removed\nOne of the most brutal attacks from Pakistan, Uri attacks had taken the whole nation by storm. An Army camp near the Line Of Control in Uri was stormed by Pak militants at around 4AM on 18 Sept 2016 and 19 soldiers were killed.\nIn a strong and a brave response, Indian army carried out a surgical strike at LoC of Pakistan-occupied Kashmir, hitting Pakistan where it hurts the most.\nTwitter\nWhen the trailer of Uri: The Surgical Strike was released, it made waves. It sent shivers down the spines of the viewers watching the story of our bravehearts.\nScreengrab\nWeeks later, the makers of the movie RSVP Productions have removed the old trailer and uploaded a new one that has a minor change in it. Looks like one of the dialogues from the movie has been censored.\nThis is the dialogue that has been removed.\n“Apni 72 hooron ko hamara salaam bolna! Kehna daawat par intezar karein, aaj bahut saare mehmaan bhejne wale hain.(Convey our greetings to the 72 virgins! Tell them to wait for the feast, we are going to send a lot of guests)”\nDon't Miss 346 SHARES 870 SHARES 4.5 K SHARES 135 SHARES 699 SHARES\nIf reports are to be believed, the dialogue has been removed to avoid hurting religious sentiments.\nAlso starring Paresh Rawal and Yami Gautam, Uri: The Surgical Strike is scheduled to release on Jan 11.", "title": "'Uri: The Surgical Strike' Trailer Gets Censored, Dialogue With Reference To ‘72 Virgins’ Removed", "date_publish": "31/12/2018, 15:27:21", "description": "When the trailer of Uri: The Surgical Strike was released, it made quite some waves. It sent shivers down the spines of the viewers watching the story of bravehearts. Weeks later, the makers of the movie RSVP Productions have removed the old trailer and uploaded a new one that has a minor change in it. Looks like one of the dialogues from the movie has been censored.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/uri-the-surgical-strike-trailer-gets-censored-dialogue-with-reference-to-72-virgins-removed-359574.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/uri_the_surgical_strike_trailer_gets_censored_dialogue_with_reference_to_72_virgins_removed_1546250471_800x420.jpg"}