{"text": "Valentine Week Is Here! Farhan Akhtar Pens Down A Poetic Note For Lady Love Shibani Dandekar\nValentine Week Is Here! Farhan Akhtar Pens Down A Poetic Note For Lady Love Shibani Dandekar\nLove is all about spending time together and exchanging smiles and for Shibani Dandekar and Farhan Akhtar, this holds perfectly true.\nFarhan and Shibani have been seeing each other since 2018 and their social media PDA has caught attention of all their fans and for all the right reasons. From holidaying together to spending sundays together, the couple is making the most of their courtship days.\nRumor mills have also claimed that, wedding bells might ring soon for the couple in the first quarter. However, neither of the two have given an official nod in the media. However, their PDA says it all.\nRecently, Farhan posted a picture with Shibani and his poetic avatar is what turned our hearts into a pool of mush.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nHe wrote,\nTum muskuraado zaraa Chiraag jalaado zaraa andhera hataado zaraa roshni phailaado zaraa ❤️⭐️ @shibanidandekar The news of them dating came into spotlight when Shibani accompanied him for his Canada tour in 2018. View this post on Instagram ❤️ A post shared by Farhan Akhtar (@faroutakhtar) on Oct 14, 2018 at 11:43pm PDT Since then, they have been very comfortable with social media PDA and making public appearances together.", "title": "Valentine Week Is Here! Farhan Akhtar Pens Down A Poetic Note For Lady Love Shibani Dandekar", "date_publish": "11/02/2019, 11:20:45", "description": "Farhan and Shibani have been seeing each other since 2018 and their social media PDA has caught attention of all their fans and for all the right reasons. From holidaying together to spending sundays together, the couple is making the most of their courtship days.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/valentine-week-is-here-farhan-akhtar-pens-down-a-poetic-note-for-lady-love-shibani-dandekar-361929.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/farhan_and_shibani_1549868890_800x420.jpg"}