{"text": "We don’t need one specific day to celebrate our love for closed ones. Today on Valentine's Day every individual is celebrating this special day in their own way. Every individual is making their loved ones feel special and that’s the sweetest thing to do, isn’t it?\nInstagram\nEven our Bollywood celebrities are showering their love on their loved ones. But Aishwarya’s way of celebrating the day has melted our heart. Well, she shared a lovely picture of her with darling husband Abhishek Bachchan and her life Aaradhya Bachchan. The picture will instantly make you go aww. Ash looks gorgeous as usual, while Abhishek is making the ladies go weak at the knees in his tuxedo but the star of the picture is little Aaradhya who’s slaying in her pretty red dress.\nWe have seen over the years how Aishwarya has been the extremely protective mother for Aaradhya. Howeve,r she has been trolled for it too, but the actress doesn’t give a damn about it. In an interview she had said,\nInstagram\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“People will have an opinion. That's not changing what I'm doing na, how I'm taking care of my daughter in a public space. Judge it. It's my daughter, I love her. I'll be protective or I'll be loving or I'll embrace her. It's my daughter and my life.”", "title": "Valentine’s Day Is All About Family Love For Aishwarya Rai Bachchan", "date_publish": "14/02/2019, 17:55:22", "description": "Even our Bollywood celebrities are showering their love on their beloved ones. But Aishwarya’s way of celebrating the day has melted our heart. Well, she shared a lovely picture of her with darling husband Abhishek Bachchan and her life Aaradhya Bachchan. The picture will instantly make you go aww. Ash looks gorgeous as usual, while Abhishek is making the ladies go weak at the knees in his tuxedo", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/valentine-s-day-is-all-about-family-love-for-aishwarya-rai-posts-pics-with-abhishek-aaradhya-362184.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/aishwarya_rai_bachchan_1550146113_800x420.jpg"}