{"text": "Varun Dhawan Is Aware He Will Face Failure Someday But Is Hoping It Does Not Happen With Kalank\nVarun Dhawan Is Aware He Will Face Failure Someday But Is Hoping It Does Not Happen With Kalank\nVarun Dhawan is one of the most bankable actors after Ranveer Singh. He is one star who hasn’t given a single flop in his career and is super proud of his career choices. But with success, he is also aware that one day he will face failures and is ready for it.\nTwitter\nThe actor, who will be seen next in a period drama Kalank as Zafar, met us for interaction in Sun N Sand hotel, Juhu, Mumbai. Looking handsome as ever in a full-sleeve grey t-shirt paired with black jeans, the actor spoke his heart out.\nFirstly, Varun was asked if he had ever thought or imagined to be the most bankable actor one day and he confidently replied, “I think I did imagine because if I wouldn’t have, it wouldn’t have happened. I have certain expectations from myself and I have to believe in myself if I don’t believe, then how will others do.”\nDon't Miss 336 SHARES 207 SHARES 161 SHARES 247 SHARES\nTwitter\nThe actor has never seen a flop or failure in his 7 years of career but he knows he will face the low blow one day,\n\"I think 100 percent that happens but I hope it’s not Kalank because there is a lot of hard work gone in this film, sometimes you have not done hard work for a film and then something happens, that explains automatically. But with this film, every member has put their heart and soul. In fact, Abhishek Verman (director of the film) hasn’t slept for years for this film.\"\nTwitter\nHe was quizzed, if he has a pressure on him around this film and he said, “ The pressure is there regardless, and when you are doing a film like Kalank with such a big scale and star cast, so the crazy expectations automatically comes, so you want people to come and see it and certain number is very important.”\nTwitter\nTalking about Kalank being made on a large scale, he elaborated, “People are familiar to see magnum opus films or shows, be it Sanjay Leela Bhansali’s Padmaavat or Bajirao Mastani and even Game Of Thrones, people are obsessed with all that, a new generation of India likes all this and I think Abhishek has done a spectacular job.”\nWe also asked him about the comparisons with SLB movies and he said, “ It’s a good comparison, he is a very big name. Every generation, you have an iconic director and you can’t escape that, he is a genre in himself.”\nAfter Student Of The Year, Varun did commercial hits like Main Tera Hoon and Judwaa, but he also did content driven cinema like Badlapur and October. He was counted as a masala hero, but proved critics wrong by doing a non masala film and excelling in it. When asked Varun about his versatility, he said, “ It’s just me as a person, because when I was in Barry John, I used to love drama, it is said there are 9 emotions in acting which you have to show, so I enjoy doing that. There are some scenes in the film where you have to do the imagination like for e.g. the bullfight in Kalank. I think I love doing this kind of cinema and I am getting it to do the way I want to do.”\nHe further added, “An actor should be able to do anything and everything, then you are an actor, otherwise if you are stuck to one genre then you will be known only for that one genre which I don’t want. Like you take Sanjeev Kumar, he did everything”.\nVarun will next be seen in Coolie No. 1 remake. When asked if he is ready to step in Govinda’s shoes, he said, \"The idea is to be myself and not anyone, when I was doing Main Tera Hero and Judwaa 2, people compared me with Salman Khan, but I am just doing films which are an adaptation, in fact, Collie No 1 is not a total remake but an adaptation.”\nClearly, the actor has his vision in place and is definitely here to stay.", "title": "Varun Dhawan Is Aware He Will Face Failure Someday But Is Hoping It Does Not Happen With Kalank", "date_publish": "09/04/2019, 12:34:58", "description": "Varun Dhawan is one of the most bankable actors after Ranveer Singh, he is one star who hasn’t given a single flop in his career and is super proud of it. But he is also aware that one day he will face failure and is ready for it. The actor who will be seen next in a period drama Kalank as Zafar, met us for interaction in Sun N Sand Juhu. Looking handsome as ever in a grey full t-shirt paired wit", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/varun-dhawan-is-aware-he-will-face-failure-someday-but-is-hoping-it-does-not-happen-with-kalank-365108.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/varun_dhawan_1554801892_800x420.jpg"}