{"text": "The day the news of Varun Dhawan and Katrina Kaif working together was out, fans couldn’t contain their excitement, but fate had different plans. The film landed to Shraddha Kapoor as Katrina couldn’t manage the dates for the film.\nThe film in question is Remo D’souza’s Street Dancer 3D, and we all know Kat’s prowess in dancing and how apt she would have been for this role. But there’s always a next time.\nVarun, who too was damn excited to work with Kat, reveals how the actress wanted to be a part of this film, but she couldn’t. In an interview with Midday, the Kalank star said, “It would have been a wonderful opportunity, but things didn't work out due to the unavailability of dates.\nShe was keen to do the film and even requested us to postpone it slightly. But logistically, that wouldn't have been possible since a lot of arrangements was already done.”\nThe actor even revealed how Kat had personally called him before making the quits to the film, “She called me and discussed why she would have to exit the film.\nDon't Miss 207 SHARES 699 SHARES 1.1 K SHARES 12.5 K SHARES\nThat shows her maturity and respectfulness, and it means a lot to me. I am sure we will work together in the future.”\nClearly their camaraderie is beyond films and we all saw it in Koffee With Karan season 6.\nIn fact, earlier Varun was not very fond of Katrina and were jokingly in a Hate club of Kat along with Arjun Kapoor, but today, after many years, they both formed a 'I love Katrina' club. Indeed, time changes everything.\nCurrently, Katrina is busy with Salman Khan’s Bharat, while Varun’s Kalank released this week to mixed responses. The actor is now gearing for Street Dancer 3D with Shraddha Kapoor and Kat will definitely be missed.\nWho do you think would look better opposite Varun Dhawan in a dance film? Tell us in the comment section below.", "title": "Varun Dhawan Justifies Katrina Kaif’s Sudden Exit From Street Dancer 3D, Says She Made A Mature Decision", "date_publish": "19/04/2019, 16:03:45", "description": "The day the news of Varun Dhawan and Katrina Kaif working together was out fan couldn’t contain their excitement, but the fate had different plans, the film landed to Shraddha Kapoor as Katrina couldn’t manage her dates for the film. The film in question is Remo D’souza’s Street Dancer 3D, now we all know Kat’s prowess in dancing and how apt she would be for this role. But there’s always a next ti", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/varun-dhawan-justifies-katrina-kaif-s-sudden-exit-from-street-dancer-3d-says-she-made-a-mature-decision-365761.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/varun_dhawan_justifies_katrina_kaifs_exit_from_street_dancer_3d_film_1555670472_800x420.jpg"}