{"text": "In just less than a decade of being in the film industry, Varun Dhawan has already managed to establish a huge fan base. People love him and his fan pages on social media proves that people love him!\nHe is known for being a nice guy and we have time and again seen proof of the same. Yesterday, the actor and his father and filmmaker David Dhawan were seen at the polling station during the fourth phase of ongoing 2019 Lok Sabha elections.\nPTI\nThe Indian film fraternity showed up in high numbers to exercise their franchise in the fourth phase of the Lok Sabha elections. Actors Aamir Khan, Shabana Azmi, Farhan Akhtar, Kangana Ranaut, filmmaker Madhur Bhandarkar and several other celebrities on Monday thronged polling stations in Mumbai to exercise their franchise in the fourth phase of the Lok Sabha elections.\nFlashing her ink-stained finger, Kangana Ranaut had also urged people to make use of the day and cast their vote.Taking a dig at the Congress party, Ranaut said: \"The political leaders used to chill in London and the country used to suffer from an array of issues like poverty, pollution, rapes etc. The situation in our country was worst when Congress was in power. Now that our time has come, we should vote in large number.\"\nDon't Miss 207 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nWhile a lot of other actors were clicked while they turned up for casting their votes, there was something special that people noticed about his pictures. In some of the pictures, he was seen helping an elderly woman climb the steps of the polling station.\nHere is how his fans reacted after the pictures went viral on the internet.\nAfter enjoying back to back superhits, Dhawan's last release Kalank proved to be a big disaster. He is currently focusing on his upcoming film Street dancer 3. The makers of the film kick-started promotions by using #3, and eventually revealed the title of the film. Along with the lead pair, the upcoming film also features Nora Fatehi, Aparshakti Khurana and Shakti Mohan in pivotal roles.", "title": "Varun Dhawan Helps An Elderly Lady Cast Her Vote And Fans Can't Stop Praising His Humility!", "date_publish": "30/04/2019, 15:46:43", "description": "In just less than a decade of being in the film industry, Varun Dhawan has already managed to establish a huge fan base. People love him and his fan pages on social media proves that people love him! He is known for being a nice guy and we have time and again seen proofs of the same. Yesterday, the actor and his father and filmmaker David Dhawan were seen at the polling station during the fourth", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/varun-dhawan-helps-an-elderly-lady-cast-her-vote-and-fans-can-t-stop-praising-his-humility-366350.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/varun_dhawan_1556622021_800x420.jpg"}