{"text": "Actor of many iconic films of the '90s, Kader Khan is admitted to hospital and is critical. The health of the veteran actor has deteriorated in the last few months.\nApart from acting, Kader Khan has also written 12 films that also includes Aunty No 1 being his last. His most iconic roles include Dulhe Raja, Haseena Maan Jayegi and Mujhse Shaadi Karogi. The actor last appeared in a 2015 film Ho Gaya Deemag Ka Dahi.\nTwitter\nThe actor shifted to Canada since last few years and has been living with his son and daughter-in-law. A spotboye report claims that Kadar Khan is now on BiPAP ventilator after he complained of breathing issues.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nTwitter\nDoctors have reported that he is showing symptoms of pneumonia that includes him being conscious and is being able to maintain eye contact. However, the actor has stopped talking.\nThe veteran actor suffers from progressive supranuclear palsy (PSP), a degenerative disease that causes loss of balance, difficulty in walking and dementia. The actor had to go through surgeries in his knees in 2017. Talking to Spotboye, his friend and Bollywood actor Shakti Kapoor said,\nPinterest\n“Yes, Kader Khan is now on a wheelchair. It’s so so sad to be talking about this...”\nThe actor was shifted from a normal ventilator to a special ventilator.", "title": "Comedy King Kader Khan’s Health Worsens, Admitted To A Hospital In Canada", "date_publish": "28/12/2018, 14:35:03", "description": "Apart from acting, Kader Khan has also written 12 films that also includes Aunty No 1 being his last. His most iconic roles include Dulhe Raja, Haseena Maan Jayegi and Mujhse Shaadi Karogi. The actor last appeared in a 2015 film Ho Gaya Deemag Ka Dahi.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/veteran-actor-kader-khan-s-health-worsens-admitted-to-a-hospital-in-canada-359414.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/kadar_khan_1545988051_800x420.jpg"}