{"text": "Bollywood actress Kangana Ranaut has been embroiled into controversies ever since she paved her way into the industry. And this time around, during the release of her film Manikarnika, more troubles came through. The director of the film left mid way, Sonu Sood declined the movie and she took charge of the movie on her shoulders.\nTwitter\nThe movie released to great box office numbers and has been doing really well. While many filmmakers are putting allegations on her for harassing them and over-powering them, but her performance on the silver screen is proving otherwise.\n#Manikarnika shows solid trending on weekdays... ₹ 60 cr [+/-] total [Week 1] is excellent... #RepublicDay holiday contributed majorly... Fri 8.75 cr, Sat 18.10 cr, Sun 15.70 cr, Mon 5.10 cr, Tue 4.75 cr, Wed 4.50 cr. Total: ₹ 56.90 cr. India biz. #Hindi #Tamil #Telugu — taran adarsh (@taran_adarsh) January 31, 2019\nAnd fans are not the only ones, the Bollywood actresses are loving the film too. Waheeda Rehman and Asha Parekh saw the special screening of the film and they were in awe of Kangana Ranaut.\nDon't Miss 862 SHARES 126 SHARES 346 SHARES\nYoutube/screengrab\nSpeaking to IANS, veteran actress Waheeda ji said: \"I called Kangana to show me this movie because I was very keen. I really liked the film. She has done a really good job -- acting and directing.\n\"She is also looking very beautiful in the film. I am so happy and proud of her that she has made this film and given a great performance as well,\" said the actress, who ruled the silver screen for decades.\nInstagram\nAsha Parekh too added, \"She has done a lot of hard work for the film and she has done a really nice job. She looks exactly like the Rani of Jhansi, regal in every aspect. I hope the film runs for a very long time.\"\nWell, you can hate her, like her, criticise her but she surely is at the top of her game.", "title": "Veteran Actresses Waheeda Rehman & Asha Parekh Are All Praises For Kangana Ranaut's Manikarnika", "date_publish": "31/01/2019, 15:58:20", "description": "Veteran Actresses Waheeda And Asha Parekh Praise Kangana Ranaut's Role In ManikarnikaVeteran Actresses Waheeda And Asha Parekh Praise Kangana Ranaut's Role In ManikarnikaVeteran Actresses Waheeda And Asha Parekh Praise Kangana Ranaut's Role In ManikarnikaVeteran Actresses Waheeda And Asha Parekh Praise Kangana Ranaut's Role In Manikarnika", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/veteran-actresses-waheeda-rehman-asha-parekh-are-all-praises-for-kangana-ranaut-s-manikarnika-361366.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/manikarnika_1548927898_800x420.jpg"}