{"text": "Vicky Kaushal has begun 2019 with a big bang and the success of Uri proves just that. The 'josh' around the film is still high and the film has managed to get a big nod from people in lot many ways.\nRecently, Vice President of the country, M Venkaiah Naidu watched the film as a special screening was organized.\nThe pictures were posted from VP’s official Twitter handle. The pictures were posted with a caption:\nHappy to have watched the movie 'Uri-Surgical Strikes' today along with Indo-Tibetan Border Police Personnel who guard the Vice President's Residence in New Delhi. It was an inspiring movie. I congratulate the cast & crew of #Urimovie for showcasing the valour of #IndianArmy. pic.twitter.com/BR1zlXGpUO — VicePresidentOfIndia (@VPSecretariat) January 29, 2019\n\"Happy to have watched the movie ‘Uri-Surgical Strikes’ today along with Indo-Tibetan Border Police Personnel who guard the Vice President’s Residence in New Delhi. It was an inspiring movie. I congratulate the cast & crew of #Urimovie for showcasing the valour of #IndianArmy.”\nThe film has also managed to cross 200 crore worldwide. A report claims,\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n“Till now, the film has grossed Rs 200.97 crore (nett Rs 160.78 crore) in India and Rs 23 crore in the international circuits. It now stands with the grand total of Rs 223.97 crore. It is expected to enter the Rs 250 crore by the end of its fourth weekend at the global market.”", "title": "Vicky Kaushal's Uri Enters Rs 200 Crore Club Worldwide & Gets A Thumbs Up From Vice President", "date_publish": "30/01/2019, 16:15:08", "description": "Vicky Kaushal has begun 2019 with a big bang and the success of Uri proves just that. The 'josh' around the film is still high and the film has managed to get a big nod from people in lot many ways. Recently, Vice President of the country, M Venkaiah Naidu watched the film as a special screening was organized.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-s-uri-enters-rs-200-crore-club-worldwide-gets-a-thumbs-up-from-vice-president-361311.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/uri_1548843664_800x420.jpg"}