{"text": "One of the posts read, “He doesn’t have hero face...a common punjabi ladka yes but he has filmy background bas utna hi kaafi hai aaj bollywood me.” Reacting to his Vicky Kaushal said, “Okay, so apart from the last line, ‘utna hi kaafi hai Bollywood mein,’ I think there’s nothing wrong in what he said. I don’t have a filmy face, hero face.”\nShe said, “I watched Manikarnika in the theatre and I was blown away by the amount of hard work that has gone into it. It's there for everyone to see and the war sequences are among the best that I have seen in any Indian film. Congratulations to the entire team.”\nDon't Miss 10.9 K SHARES\nIf you think you have seen the most gruesome deaths on the show, you may be wrong. From Oberyn Martell’s skull being crushed into pieces to Ramsay Snow’s own dogs mauling him to death, from Ser Rodrik Casse being beheaded to Catelyn Stark’s blood oozing out of her throat at the Red Wedding, it’s all about blood and gore on GoT.\nIn the pictures, Dalai Lama can be seen blessing the couple. Not many know that Gere is a Buddhist and has been a friend to Tibet's exiled spiritual leader. Richard and Alejandra got married last year after dating each other for over three years.\nThe trailer of Sujoy Ghosh trailer was unveiled yesterday and the reaction to the trailer proves that people are indeed looking forward to the film. While cinema lovers gave a big thumbs up to the film, a few chose to have a field day as they converted dialogues from the trailer into hilarious memes.", "title": "Vicky Kaushal Talks About Nepotism, Vidya Is All Praises For Manikarnika And More From Ent", "date_publish": "13/02/2019, 18:03:40", "description": "Vicky Kaushal Shows How To Kill ‘Em With Kindness, Slams Troll Who Called Him Out For Nepotism One of the posts read, “He doesn’t have hero face...a common punjabi ladka yes but he has filmy background bas utna hi kaafi hai aaj bollywood me.” Reacting to his Vicky Kaushal said, “Okay, so apart from the last line, ‘utna hi kaafi hai Bollywood mein,’ I think there’s nothing wrong in what he said.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-talks-about-nepotism-vidya-is-all-praises-for-manikarnika-and-more-from-ent-362115.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/top_bollywood_news_1550060482_800x420.jpg"}