{"text": "Vicky Kaushal Is Excited For Uri, Calls It The Most Physically Demanding Role He’s Ever Played\nVicky Kaushal Is Excited For Uri, Calls It The Most Physically Demanding Role He’s Ever Played\nIt takes sheer talent to emerge out at the best performer in the movie starring Ranbir Kapoor in the lead role. Vicky Kaushal who played the role of Sanjay Dutt’s best friend in Rajkumar Hirani’s Sanju, made several heads turn with his impeccable performance in the biopic.\nIn his next titled Uri, which is based on India’s surgical strike, he is playing the lead role of an Indian commando who is involved in the 2016 surgical strike.\nScreengrab\nVicky Kaushal is quite excited about the movie. When recently he got to know about the families of Uri martyrs who lived in Lucknow, he requested the makers to meet them personally.\nTwitter\nUri has been the toughest role for Vicky Kaushal so far.\n“It was really nice experience to work in the film. In a short span of my of career, 'Uri' has been the most physically demanding film for me… I am very excited to know audience reaction to the film,” he was quoted as saying by IANS.\nDon't Miss 837 SHARES 233 SHARES 169 SHARES 638 SHARES 4.3 K SHARES\nWhen asked to comment on Naseeruddin Shah’s controversial remarks that drew a lot of flak on social media, Vicky Kaushal said that he is not aware of what he said in detail but he believes that everyone should be heard and respected for their opinions.\n“I feel a human causing harm to another human is a very sad state. It is something we need to introspect, question. Lynching is something I would say is wrong. We are part of a democratic country but that doesn't mean we take law in our hands. Law has to step forward to see such incidents don't happen,” he told PTI.\nMeanwhile, Vicky Kaushal is gearing up for the release of Uri on Jan 11. Apart from Vicky, the movie also stars Paresh Rawal, Yami Gautam and popular TV actor Mohit Raina in prominent roles.\nWith inputs from IANS and PTI", "title": "Vicky Kaushal Is Excited For Uri, Calls It The Most Physically Demanding Role He’s Ever Played", "date_publish": "31/12/2018, 13:44:17", "description": "It takes sheer talent to emerge out at the best performer in the movie starring Ranbir Kapoor in the lead role. Vicky Kaushal who played the role of Sanjay Dutt’s best friend in Rajkumar Hirani’s Sanju, made several heads turn with his impeccable performance in the biopic. In his next titled Uri, which based on India’s surgical strike, he is starring the lead role of Indian commando who is involve", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vicky-kaushal-is-excited-for-uri-calls-it-the-most-physically-demanding-role-he-s-ever-played-359563.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/vicky_kaushal_is_excited_for_uri_calls_it_the_most_physically_demanding_role_hes_ever_played_1546244312_800x420.jpg"}