{"text": "Vicky Kaushal Shines In The Trailer Of Uri, Gives A Glimpse Of Indian Army’s Surgical Strike\nVicky Kaushal Shines In The Trailer Of Uri, Gives A Glimpse Of Indian Army’s Surgical Strike\nRevenge and Action-dramas have always been one genre that has managed to grab a lot of eyeballs. A strong plot-line and intense action sequences make it one of the most popular genres.\nThe latest offering in this genre is Vicky Kaushal's next, Uri.\nRSVP Films\nThe trailer of Uri: The Surgical Strike released today and it gives us a closer look at the 2016 surgical strikes conducted by the Indian Army in retaliation to an alleged terror attack in the Kashmir region of Uri.\nStarring Vicky Kaushal, Yami Gautam, and Paresh Rawal, this 2.24-minute trailer looks gripping enough to have our expectations set high. The trailer begins with a voice-over:\n“On 18 September 2016, 19 unarmed Indian soldiers were martyred at Uri base came, Kashmir.\"\nThen we get a look at Vicky Kaushal’s character and how he claims that he is always up for challenges and will never let any of his brothers of army die.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nYami Gautam plays the role of an intelligence officer, who is seen interrogating a terror suspect.\nRSVP Films\nAnother high point of the trailer is when a vengeful Vicky delivers a powerful message to his team. He screams and says,\nRSVP Films\n“Indian Army didn’t start this war, but we will bloody hell finish it.\"\nWithout further ado, watch the trailer of the film right here!\nDirected by Aditya Dhar, the film is produced by Ronny Screwvala and will hit the theaters on January 11th.", "title": "Vicky Kaushal Shines In The Trailer Of Uri, Gives A Glimpse Of Indian Army’s Surgical Strike", "date_publish": "05/12/2018, 13:43:23", "description": "The first trailer for Uri: The Surgical Strikes, starring Vicky Kaushal, Yami Gautam and Paresh Rawal, and based on the 2016 surgical strikes operation, has been released online. Watch it here. Vicky on Tuesday had shared a new poster for the film, which showed a group of soldiers being parachuted down into enemy territory, presumably, to carry out the strikes.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-shines-in-the-trailer-of-uri-gives-a-glimpse-of-indian-army-s-surgical-strike-357981.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/vicky_kaushal_1543996260_800x420.jpg"}