{"text": "Vicky Kaushal Shares How He Gained 15 Kgs Of Muscle Weight For ‘Uri’ & It’ll Make You Sweat\nVicky Kaushal Shares How He Gained 15 Kgs Of Muscle Weight For ‘Uri’ & It’ll Make You Sweat\nHe is a heartthrob and currently a national crush of all the ladies out there. Vicky Kaushal is one of the most sought after and finest actors of the B-town.\nAfter impressing us all with his acting mettle with his flawless performances in films like Raazi, Sanju and Manmarziyaan, Vicky Kaushal is all set to enthrall the audiences playing the solo lead role for the first time in Uri – a film based on India’s surgical strikes of 2016.\nInstagram screengrab\nVicky Kaushal will be portraying the role of Indian commando in Uri: The Surgical Strike. Describing his character as the toughest of his career so far, Vicky Kaushal says he had to work out in the gym in order to gain 15kgs, which was very difficult for Vicky, as he has “this very beautiful problem that he doesn’t gain weight”.\nInstagram screengrab\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nEarlier as well, Vicky Kaushal had shared a video in which he showed how he prepped up for the role.\nAlso starring Yami Gautam and Paresh Rawal in prominent roles, Uri: The Surgical Strike is slated to hit the screen on Jan 11.\nFACEBOOK TWITTER REDDIT SAVE 962 SHARES\n“There is no role for which I have gone through a process to change myself physically,” he says in the video, which you can watch below.", "title": "Vicky Kaushal Shares How He Gained 15 Kgs Of Muscle Weight For ‘Uri’ & It’ll Make You Sweat", "date_publish": "05/01/2019, 12:05:31", "description": "Vicky Kaushal who’ll be portraying the role of Indian commando in Uri: The Surgical Strike. Describing his character as the toughest of his career so far, Vicky Kaushal says he had to work out in the gym in order to gain 15kgs, which was very difficult for Vicky, as he has “this very beautiful problem that he don’t gain weight”.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vicky-kaushal-shares-how-he-gained-15-kgs-of-muscle-weight-for-uri-it-ll-make-you-sweat-359880.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/vicky_kaushal_shared_how_he_prepped_up_for_his_role_in_uri_the_surgical_strike_how_he_gained_15kgs_1546669356_800x420.png"}