{"text": "“How’s the Josh? High Sir!” – This line has gripped the entire nation. From Prime Minister Narendra Modi to Indian cricket team, this dialogue has been used by almost everyone in moments of celebrations. Who would have imagined that it will catch the fancy of the fans so much that it will go insanely viral!\nFor Vicky Kaushal, it isn’t a line anyone. ‘How’s the Josh’ is an emotion.\n“From people fighting the cold in minus temperatures to people sweating it out in the gym. From conference meetings to marriage ceremonies, from a 92-year-old grandmother to a 2 years old kid... From our jawaans to the armed forces. It's not just a line anymore, you all have turned it into an emotion... An emotion so strong and special, I'm going to cherish for life,” he had written in a social media post.\nDid you know when Vicky Kaushal had first heard the line, he didn’t like the dialogue at all.\n“I read the script and the first talking line was 'how's the josh, high, sir, how's the josh, high sir'. I didn't feel it. Mujhe laga bada cool ban raha hai (I thought he was trying to be too cool). I wasn't sure if the Army really functions this way.”\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nBut rest, as they say, was history.\nVicky Kaushal starrer Uri: The Surgical Strike is unstoppable. It is officially a blockbuster now. The movie has crossed Rs. 200 crore mark at the box office.", "title": "Vicky Kaushal Tells Fans ‘Aapke Josh Ko Salaam’ As Uri Makes A Double Century At The Box Office", "date_publish": "09/02/2019, 13:21:51", "description": "Vicky Kaushal starrer Uri: The Surgical Strike is unstoppable. It is officially a blockbuster now. The movie has crossed Rs. 200 crore mark at the box office. Did you know when Vicky Kaushal had first heard the line 'How's the Josh', he didn’t like the dialogue at all.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vicky-kaushal-tells-fans-aapke-josh-ko-salaam-as-uri-makes-a-double-century-at-the-box-office-361841.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vicky_kaushal_tells_fans_aapke_josh_ko_salaam_as_uri_makes_double_century_at_the_box_office_1549698838_800x420.png"}