{"text": "Vicky Kaushal To Reunite With Uri Director For A Film Based On Ashwatthama, Claim Reports\nVicky Kaushal To Reunite With Uri Director For A Film Based On Ashwatthama, Claim Reports\nAfter the phenomenal success of Uri, Vicky Kaushal and Aditya Dhar are reuniting for another interesting project. According to a Mumbai Mirror report, Vicky and Aditya are now on-board for a period-war drama based on the mythological character of Ashwathama from the Mahabharata.\nThe film will be produced by Ronnie Screwvala, who had also produced Uri. For the upcoming untitled film based on Ashwatthama, the son of Dronacharya, Vicky Kaushal be seen in the titular role.\nThe film will be shot in multiple locations across the country and will be going on the floors later this year and the team is targeting for a mid-year release in 2020.\nThe report quotes a source close to the project saying,\nAgencies\n“The film will be mounted on a big scale and will be shot later this year. Aditya is already neck-deep in research and will go on a recce soon. The film will be shot all over India and the makers are targeting a mid-2020 release.”\nOn work front, Vicky has some interesting line up of films in his kitty.\nPinterest\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nApart from Karan Johar’s Takht alongside Kareena Kapoor Khan, Ranveer Singh, Alia Bhatt, Bhumi Pednekar, Anil Kapoor and Jhanvi Kapoor, Kaushal will also be playing the lead role in Shoojit Sircar’s biopic on the freedom fighter Shaheed Udham Singh.", "title": "Vicky Kaushal To Reunite With Uri Director For A Film Based On Ashwatthama, Claim Reports", "date_publish": "16/04/2019, 13:35:51", "description": "After the phenomenal success of Uri, Vicky Kaushal and Aditya Dhar are reuniting for another interesting project. According to a Mumbai Mirror report, Vicky and Aditya are now onboard for a period-war drama based on the mythological character of Ashwathama from the Mahabharata. The film will be produced by Ronnie Screwvala, who had also produced Uri.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-to-reunite-with-uri-director-for-a-film-based-on-ashwatthama-claim-reports-365535.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vicky_kaushal_1555402078_800x420.jpg"}