{"text": "Vicky Kaushal Shows How To Kill ‘Em With Kindness, Slams Troll Who Called Him Out For Nepotism\nVicky Kaushal Shows How To Kill ‘Em With Kindness, Slams Troll Who Called Him Out For Nepotism\nVicky Kaushal is the next big star of Bollywood. One of the most sought after actors who is also the crush of many women across the nation has been enthralling fans with his spectacular performances one after the other. From Masaan to Sanju to his latest film Uri: The Surgical Strike, he has made his own league in the industry.\nAlso Read: From Supporting Roles To A Solo Lead In Uri, Vicky Kaushal Is On His Way To Becoming The Next Big Star Of Bollywood\nNot many people know that he is the son of well-known stunt director Shyam Kaushal. But that didn’t give him a sure shot ticket to stardom. Unlike other star kids, Vicky Kaushal hadn’t stepped on to the sets of films until he started assisting Anurag Kashyap on Gangs Of Wasseypur.\nRecently, when Vicky Kaushal appeared on the talk show Famously Filmfare, he was asked to react to some of the comments about him on social media.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nOne of the posts read, “He doesn’t have hero face...a common punjabi ladka yes but he has filmy background bas utna hi kaafi hai aaj bollywood me.”\nReacting to his Vicky Kaushal said, “Okay, so apart from the last line, ‘utna hi kaafi hai Bollywood mein,’ I think there’s nothing wrong in what he said. I don’t have a filmy face, hero face.”\nHe showed discomfort on being called a product of nepotism.\n“Sir, you are most welcome in Bollywood and try and survive a week and we will have a cup of coffee together and I will ask you the same question,” he added.\nAlso Read: Vicky Kaushal Talks About Dating Harleen Sethi And How It Felt Right From The 'Beginning'", "title": "Vicky Kaushal Shows How To Kill ‘Em With Kindness, Slams Troll Who Called Him Out For Nepotism", "date_publish": "13/02/2019, 12:32:45", "description": "Recently, when Vicky Kaushal appeared on the talk show Famously Filmfare, he was asked to react to some of the comments about him on social media. One of the posts read, “He doesn’t have hero face...a common punjabi ladka yes but he has filmy background bas utna hi kaafi hai aaj bollywood me.” Reacting to his Vicky Kaushal said, “Okay, so apart from the last line, ‘utna hi kaafi hai Bollywood m", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vicky-kaushal-shows-how-to-kill-em-with-kindness-slams-troll-who-called-him-out-for-nepotism-362061.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vicky_kaushal_shows_how_to_kill_em_with_kindness_slams_troll_who_called_him_out_for_nepotism_1550039851_800x420.jpg"}