{"text": "Vicky Kaushal Gets Injured, Rajkummar Rao To Star In 'Chupke Chupke' Remake And More From Ent\nVicky Kaushal Gets Injured, Rajkummar Rao To Star In 'Chupke Chupke' Remake And More From Ent\nVicky Kaushal, who is currently shooting for his untitled Horror Film in Gujarat has met with an accident. Kaushal was shooting for an action sequence but he broke his cheekbone and had to get 13 stitches.\nHrishikesh Mukherjee’s iconic comedy Chupke Chupke, starring Dharmendra, Amitabh Bachchan, Sharmila Tagore and Jaya Bachchan in lead roles is a film that is still remembered by everyone. Be it their performances or the dialogues, the film turned out to be a cult hit.\nDon't Miss 10.9 K SHARES\nFurthermore, the reports suggested that things are bitter between the two actors. But amidst all these reports, Kriti and Kartik's social media activities hint that all's well.\nOn Thursday, Trump put out a tweet with a GOT-inspired meme after US Attorney General Bill Barr reiterated that there was no collusion between the president’s 2016 election campaign and Russia. He, however, tweeted well before the report was made public.\nTalking about the film, she said, \"I have never won a medal in school. Who would have thought about a biopic being made on me? I am thankful to Meghna Ji for considering my work worthy enough to be converted into a film.\"", "title": "Vicky Kaushal Gets Injured, Rajkummar Rao To Star In 'Chupke Chupke' Remake And More From Ent", "date_publish": "20/04/2019, 18:12:27", "description": "Hrishikesh Mukherjee’s iconic comedy Chupke Chupke, starring Dharmendra, Amitabh Bachchan, Sharmila Tagore and Jaya Bachchan in lead roles is a film that is still remembered by everyone. Be it their performances or the dialogues, the film turned out to be a cult hit.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-gets-injured-rajkummar-rao-to-star-in-chupke-chupke-remake-and-more-from-ent-365817.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/top_news_1555764767_800x420.jpg"}