{"text": "Vicky Kaushal, who is currently shooting for his untitled Horror Film in Gujarat has met with an accident. Kaushal was shooting for an action sequence but he broke his cheekbone and had to get 13 stitches.\nAccording to reports, Vicky Kaushal was shooting inside a ship for Bhanu Pratap Singh’s film and the film also stars Bhumi Pednekar.\nAccording to a report in Mumbai Mirror, Vicky was shooting a night sequence that involved him opening a door and running but unfortunately, the door fell on him. A source close to the film was quoted in the Mirror report as saying,\nTwitter\n\"He was rushed to a local hospital by the crew and flown to Mumbai on Friday morning\".\nVicky Kaushal gets injured while filming an action sequence... Shooting for director Bhanu Pratap Singh's horror film in #Gujarat... Vicky fractured his cheekbone and got 13 stitches on his cheek. — taran adarsh (@taran_adarsh) April 20, 2019\nThe tabloid added that Vicky will return to Mumbai where he will consult a doctor again.\nApart from this film, Vicky is still enjoying the success of his last film Uri: The Surgical Strike, that was based on the Indian Army’s 2016 surgical strikes in Pakistan following the attacks in Jammu and Kashmir’s Uri town. It wasn't just Vicky's most successful film as a lead hero but the film also turned out to be the biggest hits of the year.\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES", "title": "Vicky Kaushal Gets Injured During An Action Sequence, Breaks Cheekbone & Gets 13 Stitches", "date_publish": "20/04/2019, 16:14:27", "description": "Vicky Kaushal, who is currently shooting for his untitled Horror Film in Gujarat has reportedly met with an accident. Kaushal for shooting for an action sequence but he broke his cheekbone and had to get 13 stitches. According to reports, Vicky Kaushal was shooting inside a ship for Bhanu Pratap Singh’s film and the film also stars Bhumi Pednekar.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-gets-injured-during-an-action-sequence-breaks-cheekbone-gets-13-stitches-365812.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vicky_kaushal_1555757530_800x420.jpg"}