{"text": "Vicky Kaushal Explains How 2018 Changed His Life, Glad He's No Longer Known As The 'Masaan' Guy!\nVicky Kaushal Explains How 2018 Changed His Life, Glad He's No Longer Known As The 'Masaan' Guy!\n2018 has been a year of good cinema, power-packed performances and the #MeToo movement in the Indian film industry. The year has been a life-changer for a lot of actors and this includes Bollywood actor Vicky Kaushal.\nWith back-to-back hits in 2018, Vicky Kaushal may have become one of the most sought-after actors from the younger lot, but he is aware that success and failure go hand-in-hand.\nAgencies\nIn 2018, Vicky was a part of some of the most successful films including Raazi, Sanju, Manmarziyaan and Netflix's Lust Stories and Love Per Square Foot, the actor said that he does not repeat himself. Talking to PTI, Kaushal said,\nInstagram\n\"My only attempt is to keep surprising the audience. I want to be honest to a character that I play. I have started, I might fall, might get up, then again fall and rise and this will continue to happen. But I will never stop trying.\"\nThe actor made a mark for himself as a versatile performer in the year gone by and he feels blessed to have received the love from the audience.\nDrishyam Films\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\n\"On most occasions before 2018, I was referred to as the 'Masaan' guy and the biggest change is I got my identity as Vicky Kaushal, the actor. I feel blessed and fortunate to have been working with some great directors.\"\nFor Vicky, the whole stardom feels surreal and he is thankful for all the love. He added,\nTwitter\n\"I have learned a lot as an actor and that will reflect in my work henceforth. It is a beautiful thing to be loved. It makes me feel I am the best version of myself. I feel gratified, surreal. It feels great to be respected as an actor.\"\nFor the uninitiated, Kaushal is also the action director Sham Kaushal, said he feels proud to see his parents happy with his career graph.\n\"My parents have seen me in time of struggle... They supported me. They have seen that my life was not moving forward for a couple of years and I was struggling. Finally, they saw that my work is liked by the audience and I am working with big people, so they are very happy. I just want to keep working harder and harder for everyone,\" he said.\nVicky is currently promoting his upcoming film Uri: The Surgical Strike. The film, which releases on January 11 and which also marks his first mainstream solo outing.\nFor him, the next big project is Karan Johar's multi-starrer Takht.\n(With PTI inputs)", "title": "Vicky Kaushal Explains How 2018 Changed His Life, Glad He's No Longer Known As The 'Masaan' Guy!", "date_publish": "07/01/2019, 13:46:57", "description": "2018 has been a year of good cinema, power-packed performances and the #MeToo movement in the Indian film industry. The year has been a life-changer for a lot of actors and this includes Bollywood actor Vicky Kaushal. With back-to-back hits in 2018, Vicky Kaushal may have become one of the most sought-after actors from the younger lot, but he is aware that success and failure go hand-in-hand.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vicky-kaushal-explains-how-2018-changed-his-life-glad-he-s-no-longer-known-as-the-masaan-guy-359981.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/vicky_kaushal_1546850133_800x420.jpg"}