{"text": "Each day a new name gets encompassed in the #MeToo controversy. A lot of names including Vikas Bahl, Alok Nath, Sajid Khan and Rajat Kapoor have been accused of sexual harassment by several women across the nation. Another name joining the bandwagon is of Vicky Kaushal’s father Sham Kaushal, who is a renowned stunt director of the film industry.\ndesimartini.com\nA woman named Nameeta Prakash, who has worked an assistant director on movies including Manorama Six Feet Under, Ab Tak Chhappan and Honeymoon Travels Pvt. Ltd has accused Sham Kaushal.\nThe woman says he called her to join him in his room to drink vodka. However, according to her, when she “stuck her ground” and declined the offer, he showed her an adult MMS clip on his phone.\nRead her entire post here.\nBy Nameeta Parekh. About Shyam Kaushal, Bollywood stunt director. pic.twitter.com/b5bLeALFMF — Mahima Kukreja 🌱🌈✊🏽 (@AGirlOfHerWords) October 14, 2018\nDon't Miss 193 SHARES 233 SHARES 862 SHARES\nSham Kushal took to Twitter to issue an apology.\nYesterday, while speaking about the #MeToo movement, Sham Kaushal’s son Vicky Kaushal had said that it is necessary to believe women and pay attention to their stories.\n“It is an important cultural shift. It is a beautiful shift happening. It is so amazing to see so many women coming out with their stories of what happened with them. It doesn't matter whether it is one day or one year or ten years or 100 years. It is a still very difficult for women to come out with a story like this and place it front of the entire world in it's most naked form.\nAP\n“The least we can do is we can hear them and give them a platform and dignity to say what happened with them and assure them that it will be taken seriously. It is high time something like this happened,” Vicky Kaushal told PTI.\nAlso Read: Slamming ‘Feminist Of Convenience’ Kangana Ranaut, Gauahar Khan Says #MeToo Is For Real Women", "title": "Vicky’s Father Sham Kaushal Accused Of Sexually Harassing An Assistant Director, Issues Apology", "date_publish": "15/10/2018, 11:52:04", "description": "Another name from Bollywood who has been accused of sexual harassment in the light of #MeToo movement is of Vicky Kaushal’s father Sham Kaushal, who is a stunt director. The woman says he called her to his room to join him in his room to drink vodka. However, according to her, when she “stuck her ground”, he showed her an adult MMS clip on his phone.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vicky-s-father-sham-kaushal-accused-of-sexually-harassing-an-assistant-director-issues-apology-354787.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/vicky_kaushals_father_sham_kaushal_accused_of_sexual_harassment_victim_says_he_showed_an_adult_mms_1539583044_800x420.png"}