{"text": "Vidhu Vinod Chopra Is Excited For Munna Bhai 3, Plans To Start Shooting For The Film This Year!\nVidhu Vinod Chopra Is Excited For Munna Bhai 3, Plans To Start Shooting For The Film This Year!\nThe magic of 'Jaadu Ki Jhappi' still lingers in the mind of the audience and why not? Vidhu Vinod Chopra's film remains one of the most successful franchises of Indian Cinema. After two solid hits, it's time to shoot up your expectations as the third installment is all set to go on the floors this year.\nTalking to Indian express, VVC has confirmed that the film will indeed go on the floors this year. He was quoted in a report as saying,\nTwitter\n“I haven’t yet made my next Munna Bhai because I didn’t get a proper script. I hope I make it this year.\"\nThis news was also confirmed by Circuit AKA Arshad Warsi in January when he spoke to PTI confirming the reports. He had said,\n“I do know that the script is pretty much ready. I do know from Raju that the film will go on floors this year- either mid or the end of the year. The work on the script is going on. As of now, yes it’s Sanju and me. These are the things I’ve been told.”\nThe reports of the third installment has been doing rounds since two years and now that all the actors are available, the film might surely get officially announced very soon.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Vidhu Vinod Chopra Is Excited For Munna Bhai 3, Plans To Start Shooting For The Film This Year!", "date_publish": "03/02/2019, 17:13:42", "description": "The magic of 'Jaadu Ki Jhappi' still lingers in the mind of the audience and why not? Vidhu Vinod Chopra's film remains one of the most successful franchises of Indian Cinema. After two solid hits, it's time to shoot up your expectations as the third installment is all set to go on the floors this year. Talking to Indian express, VVC has confirmed that the film will indeed go on the floors this", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vidhu-vinod-chopra-is-excited-for-munna-bhai-3-plans-to-start-shooting-for-the-film-this-year-361521.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/munnabhai_1549194316_800x420.jpg"}