{"text": "Vidya Balan Is Impressed With Manikarnika, Says The War Sequences Are The Best She's Ever Seen\nVidya Balan Is Impressed With Manikarnika, Says The War Sequences Are The Best She's Ever Seen\nWith Manikarnika, Kangana Ranaut proved that even as a lone warrior, there is no battle that she can't fight. From co-directing the film partially to promoting the film all by herself, Kangana has given her best in making Manikarnika.\nThe film is doing wonders at the box-office and even though it ran into troubled waters because of certain controversies, it still managed to emerge as a big winner. The film fraternity failed in extending any kind of support to Kangana but looks like she never needed it.\nShe is on a mission to call out the film fraternity for their hypocrisy and in many of her recent interviews, she took some real nasty digs at a few people.\nAll said and done, Kangana's film is getting some organic support from a few people and Vidya Balan has joined the Manikarnika Fan club too. Vidya was attending an event where she addressed the media and expressed how she felt after watching Manikarnika. Talking about her experience of watching the film, she said,\nTwitter\n“I watched Manikarnika in the theatre and I was blown away by the amount of hard work that has gone into it. It's there for everyone to see and the war sequences are among the best that I have seen in any Indian film. Congratulations to the entire team.”\nWell, this only proves that good films always get noticed and even when more than half of Bollywood has chosen to ignore the film's success, there are genuine people out there who are liking the film and congratulating the entire team for making a good movie.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Vidya Balan Is Impressed With Manikarnika, Says The War Sequences Are The Best She's Ever Seen", "date_publish": "13/02/2019, 16:20:53", "description": "The film is doing wonders at the box-office and even though it ran into troubled waters because of certain controversies, it still managed to emerge as a big winner. The film fraternity failed in extending any kind of support to Kangana but looks like she never needed it.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vidya-balan-is-impressed-with-manikarnika-says-the-war-sequences-are-the-best-she-s-ever-seen-362098.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/kangana_1550055194_800x420.jpg"}