{"text": "Twitter\nRadhika Apte has proved her mettle of acting with every film. In fact, the ace director Vikram Aditya Motwane has given her the title of female Rajkummar Rao and she obliged his compliment. And now after impressing the Indian audience with the terrific talent, she is winning global applause for her outstanding performance in The Wedding Guest.\nEven in 2019, women are fighting for the basic rights which need to be addressed. Today the world is celebrating Women’s Day and even Bollywood celebrities had their messages. Some made a regular wish while others encouraged women to empower each other. But Ayushmaan Khurrana and Vidya Balan’s messages are something that need instant attention. Ayushmaan narrates a hard-hitting poem on women which every woman can relate to, while Vidya talks about body shaming. A woman is judged for anything and everything, she is brutally trolled because of her skin and body among other things.\nDon't Miss 862 SHARES 322 SHARES 336 SHARES 197 SHARES 247 SHARES\nEvery Bollywood celebrity feels paparazzi has a tendency to go overboard. Some like it, some hate it but no one can do anything about it. The constant media glare on celebrities has left them a tad irritated which is understandable. Be it at the gym, airport, salon, restaurant or even home, they are followed. Nobody can deny that their personal space has been killed. But one can't help it.\nTwitter\nThe Nepotism debate was flagged by Bollywood queen Kangana Ranaut and it has not ended yet. However, Alia Bhatt’s sensible take on it might rest the debate once for and all.\nSRK is seen expressing his admiration for Mr. Bachchan while Big B too returns the favour in the hilarious way possible, but it doesn’t end there. Both the stars sing a song from Hum and you just cannot miss how Amitabh corrects SRK to sing in tune. The video is just too funny and adorable, and you would want to watch it again and again.", "title": "Vidya Balan's Powerful Message On Women’s Day, Radhika Wins Global Applause For The Wedding Guest & More From Ent", "date_publish": "08/03/2019, 18:28:07", "description": "Radhika Apte Leaves The Global Audience & Critics Amazed With Her Outstanding Performance In The Wedding Guest Radhika Apte has proved her mettle of acting with every film. In fact, the ace director Vikram Aditya Motwane has given her the title of female Rajkummar Rao and she obliged his compliment. And now after impressing the Indian audience with the terrific talent, she is winning global app", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/vidya-balan-s-powerful-message-on-women-s-day-radhika-wins-global-applause-for-the-wedding-guest-more-from-ent-363407.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/radhika_apte_1552050243_800x420.jpg"}