{"text": "Vidyut Jammwal & His 'Junglee' Friends Will Take You On An Action-Packed Ride In The New Teaser\nVidyut Jammwal & His 'Junglee' Friends Will Take You On An Action-Packed Ride In The New Teaser\nUnlike other aspiring actors, when Vidyut Jammwal had come to Mumbai, his only ambition was to become the best action hero in the industry. With films like Commando and Baadshaho, he proved his mettle too. He is loved by the audiences and already considered one of the best action hero in Bollywood.\nIn his next film titled Junglee, Vidyut Jammwal will apparently land in the world of animals. A Junglee Pictures production, Junglee is directed by Chuck Russell, who has directed Hollywood films like The Mask and Scorpion King among others. As the title suggests, Vidyut’s character can be seen being trained to become “Junglee.” The trailer will give you Tarzan feels.\nTo play this role, Vidyut Jammwal had communicated with a lot of elephant whisperers in order to emotionally connect with his character onscreen. He also mastered the art of Kalaripayattu.\nDon't Miss 151 SHARES 1.5 K SHARES 2.8 K SHARES 130 SHARES\n“Kalaripayattu is a discipline that has encouraged people to pick up on strength, sensibility and personality traits of various fantastic animals. It was amazing for me to extend my knowledge of Kalaripayattu by practicing animal flow. Most of the conventional exercises in the gym isolate only two muscles at a time. However, training like an animal functionally overcomes this one way to optimize strength, flexibility, mind-body control,” he was quoted as saying by theindianwire.com.\n“Humans are emotional beasts and hence face trouble in being in the moment. That is why we are not natural fighters like the leopard or the tiger who do not get paralyzed by fear. These animals do not get paralyzed by guilt situation. This awareness, apart from additional strength from animal flow helped me be at ease with the animals I shot with for ‘Junglee’. I was awed by the depth of this stream of martial arts and wanted to bring on the big screen with ‘Junglee’,” he added.\nThe trailer is slated to release on March 6.", "title": "Vidyut Jammwal & His 'Junglee' Friends Will Take You On An Action-Packed Ride In The New Teaser", "date_publish": "28/02/2019, 12:29:22", "description": "In his next film titled Junglee, Vidyut Jammwal will apparently land in the world of animals. A Junglee Pictures production, Junglee is directed by Chuck Russell, who has directed Hollywood films like The Mask and Scorpion King among others. As the title suggests, Vidyut’s character can be seen being trained to become “Junglee.” The trailer will give you Tarzan feels.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vidyut-jammwal-his-junglee-friends-will-take-you-on-an-action-packed-ride-in-the-new-teaser-362911.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/junglee_teaser_vidyut_jammwal__his_elephant_friends_will_give_you_an_actionpacked_ride_1551337299_800x420.png"}