{"text": "The sexual harassment charges on Vikas Bahl has affected the entire Phantom Films, which now has also been dissolved. The unidentified woman employee alleged that Bahl sexually assaulted her in Goa during a promotional tour for the movie \"Bombay Velvet\" in 2015. Just to jog your memory a little, Phantom Films was established in 2011 by Anurag Kashyap, Vikramaditya Motwane, Vikas Bahl and Madhu Mantena.\nPinterest\nThe company's productions include Lootera, Hasee Toh Phasee, and the blockbuster Queen. Right after Bahl was named by a former employee of Phantom Films amid the MeToo campaign, Mr. Kashyap and Mr. Motwane dissolved the production house.\nAgencies\nAccording to fresh agency reports, Filmmaker Vikas Bahl, accused of sexual assault by a former employee of Phantom Films, has filed an Rs. 10 crore defamation suit against Anurag Kashyap and Vikramaditya Motwane, his former partners in the production house.\nThe report further claims that the court, during the hearing Wednesday, directed Bahl to make the woman employee a respondent to the suit and adjourned the hearing to October 19.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nPhantom Films\nBahl, the director of Kangana Ranaut-starrer Queen, has sought an interim direction from the court seeking to restrain Kashyap and Motwane from making any statements, either to the media or on social media platforms, against him.\nThe suit, filed Tuesday, alleged that Mr. Kashyap and Mr. Motwane made \"defamatory, slanderous and baseless allegations\" against him due to which he has suffered irreversible damage to the reputation. It demanded damages of Rs. 10 crores from Mr. Kashyap and Mr. Motwane.\nHe labelled his former partners as opportunists, who allegedly orchestrated the whole campaign against him, making him look like the person responsible for the production house's fall.\nPinterest\nJustice SJ Kathawalla, who heard arguments on Bahl's application for an interim order, asked if the parties were open to sort out the issue amicably. \"Is there any way to end this matter? Just check if the parties are willing for this,\" he asked the lawyers.\nThe court also directed Bahl to make the woman who has leveled allegations against him a respondent to the application, saying it was pertinent to hear her too.\nJustice Kathawalla directed Bahl, Mr. Kashyap, Mr. Motwane and the woman to appear in person in his chamber on Friday when the matter would be heard. Bahl's counsel Sharan Jagtiani argued that even after the alleged incident, the woman was in touch with Bahl.\nTo this, Mr. Kashyap's counsel Venkatesh Dhond said Bahl cannot trivialize the woman's allegations on this ground, as she had to continue working with Phantom Films. Justice Kathawalla, while adjourning the matter, noted that while the #MeToo movement was good, there should be guidelines in place so that authorities know how to handle such cases. The judge passed no order on Bahl's plea.\n(With PTI inputs)", "title": "Vikas Bahl Files Rs 10-Crore Defamation Suit Against Former Phantom Partners Anurag Kashyap & Vikramaditya Motwane", "date_publish": "18/10/2018, 11:16:01", "description": "Director Vikas Bahl has filed a Rs 10-crore defamation suit against his former Phantom Films partners Anurag Kashyap and Vikramaditya Motwane. and has sought direction from the court to restrain the two from making any statement about him to the media or via social media.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vikas-bahl-files-rs-10-crore-defamation-suit-against-former-phantom-partners-anurag-kashyap-vikramaditya-motwane-354995.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/phantom_1539841904_800x420.jpg"}