{"text": "Vikas Gupta Slams Kubbra Sait For Praising Tik Tok Ban, Says The Artists Are As Talented As Her\nVikas Gupta Slams Kubbra Sait For Praising Tik Tok Ban, Says The Artists Are As Talented As Her\nTikTok, a video creating and sharing platform, is the current top of discussion on social media after Madras High Court ordered a ban on the app. Tech giants Google and Apple have removed the application from the Android and iOS play store.\nFollowing this, while some of the people expressed joy, others were unhappy. One of them was Kubbra Sait who took to Twitter to write she has never been happier about a ban so much.\nI can’t begin to express my joy to hearing about Tik Tok being banned in India. The state of derangement was exceedingly painful.\nI haven’t been happier about a ban. — Kubbra Sait (@KubbraSait) April 17, 2019\n“I can’t begin to express my joy to hearing about TikTok being banned in India. The state of derangement was exceedingly painful. I haven’t been happier about a ban,” she wrote.\nHowever, this didn’t go down well with ex-Bigg Boss contestant Vikas Gupta who slammed her saying that the artistes on the platform are as talented as she is.\nState of derangement is extremely painful for the people who have to live in the environment of the mentally ill. With all due respect some of the people making these Tiktoks or musically are as talented an artist as you are if not more. Coming from an artist of your caliber it’s https://t.co/4QlNAi2xtq — Vikas Gupta (@lostboy54) April 18, 2019\nDon't Miss 745 SHARES 961 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nVery dissapointing. Content made on any platform can be good and bad. Be it Television, Films, Web series or theatre for that matter or Tiktok. Some of the amazing work done by Individuals on Tiktok can be at par with the so called good work on either of the platforms 😊 — Vikas Gupta (@lostboy54) April 18, 2019\n& about the state of derangement, in the search column of #Tiktok type Family and you might find some 2 billion videos including parents kids acting together to 80 years olds dancing to just plain funny videos. Yes there are bad content also but that’s on tv films and web aswell — Vikas Gupta (@lostboy54) April 18, 2019\n& finally coming to the artists working day in and out to create multiple 15 seconder content is one of the toughest things to do. @jannat_zubair29 @HeyAhsaasChanna #AvneetKaur #Faisalshiekh #Ashikabhatia #siddharthNigam list is huge and all of them put their heart and head with\n— Vikas Gupta (@lostboy54) April 18, 2019\nFor the uninitiated, TikTok has been banned for “pornographic and inappropriate content” that may be accessible to kids. While new users cannot download the app. However, users who had the app will continue to be able to use it.\nIn a statement, TikTok had said, \"We welcome the decision of the Madras High Court to appoint Arvind Datar as Amicus Curae (independent counsel) to the court. We have faith in the Indian judicial system and we are optimistic about an outcome that would be well received by over 120 million monthly active users in India, who continue using TikTok to showcase their creativity and capture moments that matter in their everyday lives.\"", "title": "Vikas Gupta Slams Kubbra Sait For Praising Tik Tok Ban, Says The Artists Are As Talented As Her", "date_publish": "18/04/2019, 14:15:49", "description": "Vikas Slams Kubbra For Supporting Tik Tok Ban, Says Artistes On The Platform Are As Good As HerVikas Slams Kubbra For Supporting Tik Tok Ban, Says Artistes On The Platform Are As Good As HerVikas Slams Kubbra For Supporting Tik Tok Ban, Says Artistes On The Platform Are As Good As HerVikas Slams Kubbra For Supporting Tik Tok Ban, Says Artistes On The Platform Are As Good As HerVikas Slams Kubbra F", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vikas-gupta-slams-kubbra-sait-for-praising-tik-tok-ban-says-the-artists-are-as-talented-as-her-365680.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/ex_bigg_boss_contestant_vikas_gupta_expresses_his_opinion_on_tik_tok_ban_in_india_slams_kubbra_sait_1555573146_800x420.png"}