{"text": "Vikrant Massey is not only an outstanding actor, but an outspoken celebrity. He never holds back when speaking his mind, unlike many actors. Indiatimes had a candid conversation with Vikrant where he spoke about films, failure, success and lot more.\nInstagram\nWe also quizzed him about the impact one of the biggest movements of 2018 –#MeToo – had on Bollywood and the impression it made on him. This year, we saw lots of women coming out in open and sharing their #MeToo stories, and the dark underbelly of the industry was stripped bare. But the truth needed to be told.\nInstagram\nImpact Of the #MeToo Movement\nVikrant said that the #Me Too Movement that started in Bollywood in 2018 has a lot of room to grow. “I think only 0.5 percent people have come out and spoken about it. Such a small number has created so much of impact. Imagine what can happen when we everyone comes together, supports each other and talks about it. Just imagine the impact.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nInstagram\nPeople Are Scared To Share Their #MeToo\nHe even revealed that while 2018 was a springboard, lots of people are still scared to talk about their #MeToo as they have a lot of financial responsibilities, “One drop of water bought the tsunami. Only 0.5 percent of people who have come out have spoken about it. Even today, there are lots of people who haven’t shown the courage, and people in the industry still follow this unfortunate pattern. There are people who haven’t spoken about it because they want to run their homes, and pay their bills. They can’t show courage because they have a lot of responsibility on them. It is a good change and it was very necessary, but we have to see how long will it stay, we have to see the momentum of it.”\nInstagram\nWhy #MeToo Is Only Limited To Bollywood\nThe Mirzapur star has a pertinent question as we move into a new year, “Why is it only limited to Bollywood? Exploitation and disrespect towards woman happens in all professions. How many are willing to stand it, and how long will this movement sustain? It is so unfortunate that today we talk about going to the moon and Mars, but we still cannot make people feel happy or secure on earth. At least this change has started, and I want to see how long it will go on. We cannot just sit and talk about it, there has to be requisite action towards the name out in the public domain. The sad thing is even in 2018, we are fighting for the basic rights of women.”\nInstagram\nWe could not agree more with the Mirzapur star.", "title": "Vikrant Massey Reveals Even Today People Are Scared To Talk About Their #MeToo As They Might Lose Their Job", "date_publish": "19/12/2018, 12:08:51", "description": "Vikrant Massey who is an outstanding actor is also outspoken. He holds no barriers in speaking his mind, unlike many actors. Indiatimes had a candid conversation with Vikrant in large about films, failure success and lot more. We also quizzed him about what impact did the #MeToo Movement in Bollywood made on him. This year we saw lots of women coming out in open and sharing their #MeToo Movement", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/vikrant-massey-reveals-even-today-people-are-scared-to-talk-about-their-metoo-as-they-might-lose-their-job-358110.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/vikrant_1544165327_800x420.jpg"}