{"text": "When #MeToo movement took the nation by storm, a lot of people doubted if all the women coming to the forefront and narrating their stories were legitimate. One of them that took everyone by surprise was writer-producer Vinta Nanda, who has accused Alok Nath of rape, about 20 years ago. Taking her fight forward, she even filed a case seeking justice.\nHowever, the session’s court granted bail to the Bollywood actor last week saying that rape against him was lodged on the basis of a \"defamatory\" and \"false\" report of complainant Vinta Nanda, as per a report in PTI.\nGranting relief to Nath on a surety bond of Rs 5 lakh, Additional Sessions Court Judge S S Oza said the rape complaint filed by the screenwriter is a \"personal vendetta\". The judge noted that the allegation raised by the complainant might have been inspired by her \"unrequited and un-reciprocated love\" for Alok Nath.\nTOI\nReacting to this, Vinta Nanda says she respects the court's order and adds that the entire industry knows the truth.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n“Everyone who knows me and who knows Alok Nath personally also knows the truth and there is nothing in the world that will change those facts. I may be fighting this battle in court alone but my family, my friends and my industry all know what the truth is. CINTAA has already expelled Alok Nath after having concluded that I am telling the truth, after having heard not just what Alok Nath had done to me but after having heard what he has done with all the other victims of his assaults and such behaviours,” she was quoted as saying by Spotboye.com.\nFurthermore, she questioned the order that doubted if all the women who accused the actor of sexual harassment could be lying.\n“Can it be that all of us Sandhya Mridul, Navneet Nishan, Himani Shivpuriji, Deepika Amin and the so many other women who have still not gathered the strength to come out publicly with what they have been through because of him are lying and the one and only Alok Nath is telling the truth?,” she added.\nAlso Read: After Filing Rape Case Against Alok Nath, Vinta Nanda Says Onus Is On Her To Prove Her Story", "title": "Vinta Nanda Reacts To Session Court Granting Bail To Alok Nath In The #MeToo Rape Case", "date_publish": "10/01/2019, 15:05:49", "description": "When #MeToo movement took the nation by storm, a lot of people doubted if all the women coming to the forefront and narrating their stories were legitimate. One of them that took everyone by surprise was writer-producer Vinta Nanda, who has accused Alok Nath of rape, about 20 years ago. Taking her fight forward, she even filed a case seeking justice.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vinta-nanda-reacts-to-session-court-granting-bail-to-alok-nath-in-the-metoo-rape-case-360164.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/vinta_nanda_reacts_to_session_court_granting_bail_to_alok_nath_in_the_metoo_rape_case_1547111957_800x420.jpg"}