{"text": "After accusing the \"most Sansakari\" man of rape in a Facebook post, writer-producer took the entire nation by storm. Finally, she has registered a police complaint against Alok Nath yesterday.\nAlso Read: 'Tara' Actors Deven Bhojani & Navneet Nishan Support Vinta Nanda On Her Rape Allegations Against The 'Most Sanskari' Man\nThe complaint was lodged at the Oshiwara police station, Nanda said in a statement.\n\"The police was very co-operative and they took my statement. It was not easy for me to give my statement as it is like reliving your pain. We have given a written complaint against Alok Nath and they registered the same,\" Nanda said, adding that she gave her statement to a female police sub-inspector.\nap\nAmid the #MeToo movement that got sparked in India after Tanushree Dutta renewed a decade-old allegation against Nana Patekar, Nanda of Tara fame came out about her unsavoury experience with Alok, who has for years enjoyed a holier than thou image on-screen.\nDon't Miss 6.8 K SHARES 4 K SHARES 12.5 K SHARES 5.5 K SHARES\nSeveral others also came out about their experiences with Alok, leading film and television associations like CINTAA (Cine and Television Artistes Association) and IFTDA (Indian Film and Television Directors' Association) to send him notices.\nbccl\nAlok had rejected IFTDA's notice on the ground that no police complaint had been filed against him. Instead, he filed a civil defamation suit against Nanda, demanding a written apology and compensation of one rupee.\nNanda's lawyer had said on Monday that her client will remain undaunted in her fight against the sexual violation she faced even if defamation suits come her way.\nInputs From IANS", "title": "Vinta Nanda Takes The Legal Route & Files Police Complaint After Accusing Alok Nath Of Rape", "date_publish": "18/10/2018, 11:55:25", "description": "Writer-producer Vinta Nanda on Wednesday filed a police complaint against actor Alok Nath, whom she has accused of sexually violating her 19 years ago. The complaint was lodged at the Oshiwara police station, Nanda said in a statement. \"The police was very co-operative and they took my statement. It was not easy for me to give my statement as it is like reliving your pain. We have given a written", "authors": [], "url": "https://www.indiatimes.com/entertainment/vinta-nanda-takes-the-legal-route-files-police-complaint-after-accusing-alok-nath-of-rape-354999.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/vinta_nanda_files_police_complaint_against_alok_nath_1539844064_800x420.jpg"}