{"text": "They say when you love someone you love every single thing about them – the good as well as the bad – and even the flaws. Like beauty, love lies in the eye of the beholder.\nAnd who better than Virat Kohli and Anushka Sharma can teach you that? The way the lady cheers for him at every cricket match she watches live, despite the trolling, speaks volume about their love. On the other hand, Virat Kohli also never leaves an opportunity to praise his ladylove.\nSo, recently, when Virat Kohli, who is in Australia for the test series, watched Shah Rukh Khan, Anushka Sharma and Katrina Kaif starrer Zero, he couldn’t stop gushing over the love of his life.\nThe movie, which has otherwise been receiving flak and getting trolled, was praised by Virat Kohli. Here’s what he said!\nDon't Miss 5.1 K SHARES 3.4 K SHARES 153 SHARES\nSaw @Zero21Dec and loved the entertainment it brought. I enjoyed myself. Everyone played their parts well. Loved @AnushkaSharma performance because I felt it was a very challenging role and she was outstanding. 👌👌 — Virat Kohli (@imVkohli) December 23, 2018\nAnd then the trolling began.\nSir, please money waste mot korwau.\nBhavi ka acting awesome tha.\nBut movie 3rd class 😠😠 — Ab devilliers (@anukuldas1800) December 23, 2018\nOhoo.. Bibi ka drr😂😂😍😍 — Virender Sehwag (@SirURFake) December 23, 2018\nThank god you chose cricket over reviewing films coz you're pathetic at that — babu bisleri (@PUNchayatiii) December 23, 2018\nChalo kisi ko to acha laga 😂😂 — Vimal Kirti (@VimalPC) December 23, 2018\nMovie bilkul humare openers ki tarah tatti thi — CrictechInfinity (@cric_infinity) December 23, 2018\nLadki ka chakkar babu bhayya...ladki ka chakkar 😬 — The Sarcastic Indian (@shahwarma) December 23, 2018\nBhai fully focused lag rahe ho 3rd Test match se pehle — Chacha Lame Monk (@oldschoolmonk) December 23, 2018", "title": "Virat Kohli Calls Anushka Sharma’s Performance In Zero ‘Outstanding’ & Trolls Can’t Keep Calm", "date_publish": "23/12/2018, 18:14:33", "description": "So, recently, when Virat Kohli, who is in Australia for the test series, watched Shah Rukh Khan, Anushka Sharma and Katrina Kaif starrer Zero, he couldn’t stop gushing over the love of his life. The movie, which has otherwise been receiving flak and getting trolled, was praised by Virat Kohli. Here’s what he said!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/virat-kohli-calls-anushka-sharma-s-performance-in-zero-outstanding-trolls-can-t-keep-calm-359147.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/virat_kohli_finds_anushka_sharmas_performance_in_zero_outstanding__trolls_cant_keep_calm_1545567743_800x420.png"}