{"text": "Birthdays are special and when you have your soulmate and the love of your life by your side to celebrate this day, it becomes all the more special. For Anushka Sharma, turning 31 was special as husband Virat Kohli had a surprise for her that were executed perfectly. It wasn't a fancy date but it had all the elements that are important.\nThe celebrations were all about a perfect sunset, lakeside view and togetherness! The couple spent the day together at an undisclosed location and Kohli took to social media to share some glimpses of the day and they were beautiful. After tying the knot in Tuscany, Italy December 2017, the couple has been enjoying marital bliss along with balancing their work-commitments.\nInstead of opting for an exotic vacation, Virushka spent their evening by a lakeside, listening to romantic songs and sharing cuddles. In the video that Virat shared, the couple is seen listening to Bob Marley’s ‘Is This Love’. The pictures and videos from the birthday celebrations look straight out of a fairy-tale.\nDon't Miss 518 SHARES 235 SHARES 613 SHARES\nVirat Kohli and Anushka Sharma dated for over four years before they decided to take the plunge. They tied the knot in an intimate ceremony in Italy’s Tuscany in 2017. Since their wedding, the couple has been spending a lot of time with each other apart from managing their professional commitments.\nBoth Anushka and Virat share a healthy relationship with each other and they have time and again expressed how important it is for them to spend time together. In an interview last year, Anushka had said,\n\"We are both very awkward with the fame that we have we don’t embrace stardom and fame and that’s why, I think, we connect so much. We run away, sometimes, from these things. Sometimes, we find a need to be in our own cocoon. And that’s the reason why we are so self-sufficient. And when I see self, I mean both of us because we don’t see each other as two different people. He and I are male and female versions of each other.\"\nVirat and Anushka have been very supportive of each other's career choices. While Anushka takes time out of her schedule to accompany him on his cricket tours, we have time and again seen Virat attending movie premieres and supporting his ladylove.\n(Pictures: Virat and Anushka's Instagram accounts and fanpages)", "title": "Virat Plans A Special Date On Anushka's Birthday & It's A Scene Straight Out Of A Romantic Film!", "date_publish": "02/05/2019, 11:16:36", "description": "For Anushka Sharma, turning 31 was special as husband Virat Kohli had special plans for her that were executed perfectly. It wasn't a fancy date but it had all the elements that were important. The celebrations were all about a perfect sunset, lakeside view and togetherness! The couple spent the day together at an undisclosed location and Kohli took to social media to give share some glimpses of t", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/virat-plans-a-special-date-on-anushka-s-birthday-it-s-a-scene-straight-out-of-a-romantic-film-366449.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/virushka_1556776175_800x420.jpg"}