{"text": "\"About time someone started talking about this silent success! Because neither the producer, nor the distributor, nor the line producer, or any else in the industry, in general, has even spent a nano second to compliment the success of this film 'Badla'. Thank you,\" Big B tweeted.\nIf you’ve spent some time on Twitter since the release of Avengers Endgame, you will see not many people are tweeting, writing or talking about spoilers.\nThe couple visited Virat Kohli's restaurant Nueva in New Delhi last evening and they were joined in by the team players of Royal Challengers Bangalore. Even with their friends around, it was a perfect date night for Virushka, who were seen kissing, hugging and just having a good time with each other.\nReality shows might be a hit among the audience, but what happens behind the scenes in a reality show is a mystery. We see the glamorous side that is telecast - weather it's Love School, Splitsvilla, Bigg Boss, Power Couple or celebrity Swayamvar; but reality shows are nightmare for people featuring in it. The controversial Rakhi Sawant, who is a constant in many reality shows, feels nothing you see on TV is true. She was one of the first contestants to be shortlisted for Bigg Boss season 1 and even kick-started the Swayamvar series.\nFrom Iron Man to Captain America to Hulk to Black Widow to Thor -- Marvel superheroes have assembled one last time in \"Avengers: Endgame\" to save the world and fight against Thanos. As conjectured by trade analysts, the movie is not only turning out to be an emotional affair for fans but also soaring high at the box office globally.\nDon't Miss 264 SHARES 233 SHARES 862 SHARES", "title": "Virat-Anushka's Special Night With RCB Players, Avengers Has Earned Rs 53 Crore & More From Ent.", "date_publish": "27/04/2019, 18:33:11", "description": "If you’ve spent some time on Twitter since the release of Avengers Endgame, you will see not many people are tweeting, writing or talking about spoilers.If you’ve spent some time on Twitter since the release of Avengers Endgame, you will see not many people are tweeting, writing or talking about spoilers.If you’ve spent some time on Twitter since the release of Avengers Endgame.", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/virat-anushka-s-special-night-with-rcb-players-avengers-has-earned-rs-53-crore-more-from-ent-366210.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/wrap_1556370576_800x420.jpg"}