{"text": "1. Virat Plans A Special Date On Anushka's Birthday & It's A Scene Straight Out Of A Romantic Film!\nBirthdays are special and when you have your soulmate and the love of your life by your side to celebrate this day, it becomes all the more special. For Anushka Sharma, turning 31 was special as husband Virat Kohli had a surprise for her that were executed perfectly. It wasn't a fancy date but it had all the elements that are important.\n2. Neither Targaryen Nor Stark! Here’s Who The Night King Was & What He Wanted The Whole Time\nSo, the Night King can fly a dragon and is also immune to fire. Why wouldn’t the fans think he is a Targaryen. And if he is, what’s his purpose?\n3. After A Power-Packed Jonas Brothers Performance, Joe Ties The Knot With Sophie Turner In Vegas!\nDon't Miss 159 SHARES 842 SHARES\nGame Of Thrones Star Sophie Turner surprised her fans after she tied the knot with her long time boyfriend Joe Jonas. In an impromptu ceremony, the actress exchanged wedding vows in Las Vegas. As per Eonline, it is confirmed that Joe and Sophie are officially husband and wife after obtaining a marriage license on Wednesday, May 1\n4. #AryaChallenge Takes Over The Internet, Fans Give Hilarious Twist To Her Badass Moves From The Battle Of Winterfell\nAnd people are so impressed and curious that they are now trying it on their own. And so, #AryaChallenge has taken over the internet.\n5. Salman’s Die-Hard Fan In Argentina Names Restaurant After Dabangg, Decorates It With His Posters\nSalman Khan has found a great fan in Argentina as well. This man has named his restaurant after his film Dabangg. In the restaurant named Gran Dabbang (Great Dabbang), the walls are decorated with Salman Khan’s posters.", "title": "Virat Kohli’s Special Date With Anushka Sharma, Night King’s Real Identity & More From Ent", "date_publish": "02/05/2019, 18:05:53", "description": "From Virat Kohli’s special date with Anushka Sharma for her birthday to Game Of Thrones’Night King’s real identity and his purpose on the show, here is all that rocked the world of entertainment today. For the longest time, right after the season 7, it was rumoured that Night King could be a Targaryen. After all, he could ride the ice dragon.", "authors": [], "url": "https://www.indiatimes.com/entertainment/virat-kohli-s-special-date-with-anushka-sharma-night-king-s-real-identity-more-from-ent-366504.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/May/virat_kohlis_special_date_with_anushka_sharma_night_kings_real_identity__more_from_ent_1556797546_800x420.png"}