{"text": "Earlier this year, Supreme Court accepted that government’s suggestion to play National Anthem before a film in a movie theatre isn’t mandatory. However, a lot of cinema halls still play it before the screening of movies. That is what happened at the MAMI film festival as well.\nBCCL\nVishal Bhardwaj who attended the festival noticed an error in the national anthem that was played there. He said that there was a technical glitch in the National Anthem produced by Films Division and Ministry of Information & Broadcasting.\nBCCL\nComplaining about the same and urging I&B ministry to rectify it, here’s what he posted on Twitter.\nHeard our national anthem produced by @Films_Division and @MIB_India during @MumbaiFilmFest. There is a technical glitch at \"Gahe Tav Jai Gaatha\", seems to be a sound transfer issue. Goes off tune and hurts ear and soul. Can @MIB_India please get this rectified? — Vishal Bhardwaj (@VishalBhardwaj) October 29, 2018\nVishal Bhardwaj is basking in the success of Pataakha starring Sanya Malhotra and Radhika Madan. He will soon come up with a crime thriller titled Sapna Didi, which will star Deepika Padukone and Irrfan Khan. However, the movie is halted because of Irrfan Khan’s health condition. Recently, Vishal Bhardwaj said that he will most probably start with the shoot of the movie next year.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES", "title": "Vishal Bhardwaj Points Out Error In National Anthem, Tells I&B Ministry To Get It Rectified", "date_publish": "29/10/2018, 17:46:45", "description": "Vishal Bhardwaj who attended the festival noticed an error in the national anthem that was played there. He said that there was a technical glitch in the National Anthem produced by Films Division and Ministry of Information & Broadcasting. Complaining about the same and urging I&B ministry to rectify it, here’s what he posted on Twitter.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vishal-bhardwaj-points-out-error-in-national-anthem-tells-i-b-ministry-to-get-it-rectified-355673.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/vishal_bhardwaj_points_out_error_in_national_anthem_tells_ib_ministry_to_get_this_rectified_1540815486_800x420.png"}