{"text": "1. Vishal Dadlani Slams Prime Minister Narendra Modi Over His Claim Of Hanging Rapists, Calls It A Lie\nAt the Youth Conclave on Wednesday, Prime Minister Narendra Modi said this and he was immediately attacked by a lot of people for his blatant lies concerning the speed of trails in rape cases.\n2. Ranveer Wiping Dust Off Deepika’s Pant & Kissing Her Will Make Single People Pine For A Lover!\nRecently, Ranveer Singh and Deepika Padukone were clicked after a dinner date, and they both left us in awe of their love, again. With all the love, Ranveer Singh wiped dust off Deepika Padukone’s pants and then gave a peck on her cheeks, while she had the biggest smile on her face. There was so much love – just take a look at these pictures and videos.\n3. Nick Jonas Has His Eye On Ben Affleck's Role As Batman & The Internet Is In Splits!\nDon't Miss 185 SHARES 460 SHARES 174 SHARES\nAfter the news of Ben Affleck quitting the Batman movie broke, everyone was speculating as to who should/can step into his shoes. A publication called HypeBeast also asked fans the same question.\n4. Beyonce Offers Free Tickets To Her Concerts For Life If Fans Go Vegan & Everyone Is Losing It\nBeyonce has just revealed that there’s a free chance for everyone to win free tickets for her concerts for life. But it’s not as simple as it sounds. There’s a catch. All you have to do is give up meat and turn vegan.\nMeghan Trainor was joyfully shocked when hubby Daryl Sabara started off with his dance routine on Pop! Goes My Heart. “Oh my God”, she screamed.", "title": "Vishal Dadlani Slams PM Modi, Ranveer-Deepika’s Romantic Dinner Date & More From Entertainment", "date_publish": "01/02/2019, 17:53:48", "description": "From singer-composer Vishal Dadlani slamming Prime Minister Narendra Modi for his statement on speedy trail of rape victims to Ranveer Singh and Deepika Padukone’s PDA after a dinner date, here is all that rocked the world of entertainment and Bollywood today.", "authors": [], "url": "https://www.indiatimes.com/entertainment/vishal-dadlani-slams-pm-modi-ranveer-deepika-s-romantic-dinner-date-more-from-entertainment-361437.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vishal_dadlani_slams_pm_modi_ranveerdeepikas_pda_after_a_dinner_date__more_from_ent_1549024052_800x420.png"}