{"text": "Rapists are being \"hanged within three days, seven days, eleven days and a month\" under his administration, said Prime Minister Modi, as quoted by ANI, and it kicked up a storm on social media.\nPM Narendra Modi in Surat: There used to be rapes in this country earlier too, it is a shame that we still hear about such cases. Now, culprits are hanged within 3 days, 7days, 11 days & a month. Steps are being taken continuously to get daughters justice & results are evident. pic.twitter.com/eA1SBipQUH — ANI (@ANI) January 30, 2019\nAt the Youth Conclave on Wednesday, Prime Minister Narendra Modi said this and he was immediately attacked by a lot of people for his blatant lies concerning the speed of trails in rape cases.\nSinger composer Vishal Dadlani, who was also the judge of Indian Idol, was one of those who called out Prime Minister Narendra Modi. Criticising Modi, he called his statement a lie.\n“Lie. Name one rapist who has been hung in your term, Sir. Nirbhaya's rapists, Asifa's rapists, even Unnao child-rape-accused BJP MLA Sengar are still alive and well,” he tweeted.\nLIE! Name one rapist who has been hung in your term, Sir. Nirbhaya's rapists, Asifa's rapists, even Unnao child-rape-accused BJP MLA Sengar are still alive and well.@narendramodi ji, we know elections are near, but don't turn the pain of Indian women & girls into propaganda. 🙏🏽 https://t.co/rJuMMJNef8 — VISHAL DADLANI (@VishalDadlani) January 30, 2019\nDon't Miss 6.8 K SHARES 828 SHARES\n“Narendra Modiji, we know elections are near, but don't turn the pain of Indian women and girls into propaganda,” he added.\nAlso Read: As Jokes On Rising Fuel Prices Break The Internet, Ali Fazal & Vishal Dadlani Join The Bandwagon", "title": "Vishal Dadlani Slams Prime Minister Narendra Modi Over His Claim Of Hanging Rapists, Calls It A Lie", "date_publish": "01/02/2019, 11:52:38", "description": "At the Youth Conclave on Wednesday, Prime Minister Narendra Modi said this and he was immediately attacked by a lot of people for his blatant lies concerning the speed of trails in rape cases. Singer composer Vishal Dadlani, who was also the judge of Indian Idol, was one amongst those who called out Prime Minister Narendra Modi. Criticising Modi, he called his statement a lie.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/vishal-dadlani-slams-prime-minister-narendra-modi-over-his-claim-of-hanging-rapists-calls-it-a-lie-361398.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/vishal_dadlani_slams_prime_minister_narendra_modi_over_his_claim_of_hanging_rapists_calls_it_a_lie_1549001365_800x420.png"}