{"text": "Visuals Of Deepika-Ranveer Exiting The Wedding Venue In A Yacht Is Making Us Eager For The Pictures!\nVisuals Of Deepika-Ranveer Exiting The Wedding Venue In A Yacht Is Making Us Eager For The Pictures!\n14.11.18 was a special day for Bollywood's most adorable lovebirds. The first day of Deepika Padukone and Ranveer Singh's wedding concluded on Wednesday morning in Italy's Lake Como. The couple tied the knot in a traditional Konkani ceremony in presence of close friends and family members.\nTwitter\nWhile the couple took extra efforts in ensuring the privacy and no official media was cover the wedding, there were few people from the media who were present at the location to at least get some information straight from the wedding.\nNews agency ANI tweeted special visuals from Deepika and Ranveer's wedding venue Villa del Balbianello.\nEven though the video is grainy, you can easily spot ladkiwale and ladkewale and the newly-married couple stepping down from the stairs leading to the boats stationed at the private harbor.\nScreengrab\nMost of the family members and friends followed the dress-code and donned white and golden outfits but if you carefully look at the video, Deepika can be seen in an orangish/red Saree.\n#WATCH: Visuals from Villa del Balbianello at Lake Como, the wedding venue of Deepika Padukone & Ranveer Singh, in Italy's Lombardy pic.twitter.com/47Jk1MmU2j — ANI (@ANI) November 14, 2018\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nTo protect the look from media, the couple used huge umbrellas.\n(Also read: From Deepika's Bridal Couture To The Food Menu, Here Are Deets On DeepVeer's Konkani Wedding)", "title": "Visuals Of Deepika-Ranveer Exiting The Wedding Venue In A Yacht Is Making Us Eager For The Pictures!", "date_publish": "15/11/2018, 13:25:27", "description": "The first day of Deepika Padukone and Ranveer Singh's wedding concluded on Wednesday morning in Italy's Lake Como. The couple tied the knot in a traditional Konkani ceremony in presence of close friends and family members. According to reports, the couple will share official pictures at 6 PM today.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/visuals-of-deepika-ranveer-exiting-the-wedding-venue-in-a-yacht-is-making-us-eager-for-the-pictures-356714.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542266984_800x420.jpg"}