{"text": "Vivek Oberoi's Look For Modi Biopic Unveiled, People Say He Neither Looks Like Himself Nor Modi\nVivek Oberoi's Look For Modi Biopic Unveiled, People Say He Neither Looks Like Himself Nor Modi\nThe internet had a field day when the news of Vivek Oberoi playing the role of PM Modi spread on the internet. The film was announced and people couldn't help but crack jokes around it. Today, the news got officially confirmed as 42-year-old Vivek Oberoi took to Twitter to share the first look poster. He wrote,\nजय हिन्द. జై హింద్. ஜெய் ஹிந்த். Jai Hind 🇮🇳🙏 We humbly ask for your prayers and blessings on this incredible journey. #AkhandBharat #PMNarendraModi pic.twitter.com/t0lQVka7mJ — Vivek Anand Oberoi (@vivekoberoi) January 7, 2019\n\"We humbly ask for your prayers and blessings on this incredible journey.\"\nIn the poster, Vivek Oberoi is seen sporting a yellow kurta with tricolour in the backdrop and a tagline, \"Deshbhakti ki meri shakti hai.\"The first look posters were released in 27 languages and the project is being led by Omung Kumar, the man behind biopics like Mary Kom and Sarbjit.\nWhile the film on PM Modi was announced 4 years ago, things materialized this year as the first leg of the shooting will start from mid-January 2019. Films will be shot in multiple locations including Gujarat, Delhi, Himachal Pradesh, and Uttarakhand, among other locations.\nPeople are not very convinced and the internet doesn't look very placed. Here are the first reactions.\nVivek Oberoi has aged a lot in the course of these Masti movies pic.twitter.com/QY3rINJjlR — Shreemi Verma (@shreemiverma) January 7, 2019\nDon't Miss 776 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nNeither He Is Looking Like Modi Nor Vivek Oberoi — Muhammad Hoti (@muhammadhoti) January 7, 2019\nVivek Oberoi to play Modi in biopic.\nCan he match up to Modi’s acting skills is the question. — Sangita Nambiar (@Sanginamby) January 6, 2019\nVivek Oberoi to play Narendra Modi in the Narendra Modi biopic but Vivek Oberoi has already done something the PM is yet to do. A press conference. — Abhishek Singhvi (@DrAMSinghvi) January 7, 2019\nIf Ye Kya Bawaseer Bana diye Ho had a Face..👍👍#PMNarendraModi pic.twitter.com/5MEJ4cq5AU — Ilyas Miyan (@ilyas_miyan) January 7, 2019\nVivek Oberoi always did grt role in negative image\n1. Company\n2. Rakta charitra #PMNarendraModi — Rahul Sharma (@rahulsharmacong) January 7, 2019\n@vivekoberoi #PMNarendraModi movie is a sequel from his previous movies Company, Rakta Charitra and Bank Chor. I'm sure it's just not a coincidence. 😒 pic.twitter.com/Wp3hWhDRtl — 🥧 Nutella 🥧 (@Cheesy_Nut) January 7, 2019\n@vivekoberoi #PMNarendraModi movie is a sequel from his previous movies Company, Rakta Charitra and Bank Chor. I'm sure it's just not a coincidence. 😒 pic.twitter.com/Wp3hWhDRtl — 🥧 Nutella 🥧 (@Cheesy_Nut) January 7, 2019\nthis person in the poster neither looks like @narendramodi nor @vivekoberoi — Tapesh Mitra (@Tapeshspeaks) January 7, 2019\nI was waiting for Modiji's biopic par Vivek Oberoi toh zaraa bhi modi ji jaisa nhi lag rahaa..!! 😑 — ✨Payal✨ (@payal_choksi) January 7, 2019\nNa toh ye bhaisahab Modiji lag rahe hain aur na Vivek Oberoi #PMNarendraModi https://t.co/ZsjbXgVyr4 — Fateem Ahmed (@philosofateem) January 7, 2019\nVivek Oberoi was tired of being a villain in the south Indian movies. So he decided to be a villain for the whole country. https://t.co/REawSL01J9 — Extremus Maximus (@Mercurial_Zen) January 7, 2019", "title": "Vivek Oberoi's Look For Modi Biopic Unveiled, People Say He Neither Looks Like Himself Nor Modi", "date_publish": "07/01/2019, 17:36:51", "description": "While the film on PM Modi was announced 4 years ago, things materialized this year as the first leg of the shooting will start from mid-January 2019. Films will be shot in multiple locations including Gujarat, Delhi, Himachal Pradesh, and Uttarakhand, among other locations. People are not very convinced and the internet doesn't look very placed. Here are the first reactions.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/vivek-oberoi-s-look-for-modi-biopic-unveiled-people-say-he-neither-looks-like-himself-nor-modi-360002.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/modi_biopic_1546865106_800x420.jpg"}