{"text": "Each time Ranveer Singh and Deepika Padukone are spotted at the airport, I am reminded of the Reddit thread in which a security manager for VIPs at Chhatrapati Shivaji airport had spilled a lot of secrets of the Bollywood stars. For Ranveer and Deepika, he had said that they both barely talk to each other and are almost always busy on their respective phones. He added that when the camera arrives, magic happens.\nAlso Read: From Khans To DeepVeer, Reddit User Spills Secrets Of Bollywood Celebs & We’re Shook!\nA lot hides behind this world of glitz and glamour. What appears sparkling is sometimes dull on the inside. We don’t know what’s the truth, we don’t know how authentic this comment was, but we seldom can forget this when we see Ranveer and Deepika’s airport pictures.\nRecently, the lovebirds were spotted at Mumbai airport as they were heading to fly for London, where they will unveil her wax statue at Madame Tussaud's museum. Going the pictures, DeepVeer, as they are fondly called by their fans, couldn’t let go of each other’s hands. They flashed big smiles on their faces. Take a look!\nDon't Miss 183 SHARES\nViral Bhayani\nViral Bhayani\nViral Bhayani\nViral Bhayani\nOn work front, while Deepika Padukone is busy prepping up for Chappak, a film in which she will play the role of a real-life acid attack survivor Laxmi Agarwal., Ranveer Singh is busy preparing for Kabir Khan’s next film titled 83. Ranveer is being trained under the guidance of Kapil Dev and Balwinder Singh Sandhu. The story of the movie revolves around India’s first cricket World Cup win in 1983.", "title": "Walking Hand-In-Hand With Big Smiles On Their Faces, Power Couple DeepVeer Leave For London", "date_publish": "13/03/2019, 11:49:04", "description": "Ranveer Singh and Deepika Padukone were spotted at Mumbai airport as they were heading to fly for London, where they will unveil her wax statue at Madame Tussauds museum. Going the pictures, DeepVeer, as they are fondly called by their fans, couldn’t let go of each other’s hands. They flashed big smiles on their faces. Take a look!", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/walking-hand-in-hand-with-big-smiles-on-their-faces-power-couple-deepveer-leave-for-london-363617.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/walking_handinhand_with_smiles_on_their_faces_ranveer__deepika_leave_for_london_1552457044_800x420.png"}