{"text": "We Are Still Understanding And Growing Up To #MeToo Movement, Says Filmmaker Anurag Kashyap\nWe Are Still Understanding And Growing Up To #MeToo Movement, Says Filmmaker Anurag Kashyap\nAnurag Kashyap might not have been directly accused in the allegations that we saw in #MeToo movement in India but he did get embroiled in a legal battle with his former partner and director Vikas Bahl.\nOn Thursday he said that the #MeToo movement has given voice to years of anger. Bahl has been accused of sexual harassment by an employee of the now-dissolved Phantom Films, the company that was founded by Kashyap, Bahl, Vikramaditya Motwane and Madhu Mantena.\nKashyap and director Motwane have been under fire for the alleged inaction in the sexual harassment allegations against Bahl. Both Kashyap and Motwane have denied the charge.\nKashyap, in an interview to PTI, said there is a need to understand and grow up to the movement, which has taken the industry by storm.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nHere are the excerpts of the interview:\nQ. What would you like to say in general about the movement?\nA. I cannot talk much. Because at this moment whatever I say may be misconstrued or can be taken in any which way and can be used here (in this case). All these years of my silence (was) to protect one person, the victim. I will take the consequences and I have voluntarily taken consequences and stepped back from the work. I will not explain my actions. My priority is something else.\nBCCL\nQ. What is your priority? Is it justice for the victim?\nA. The priority is victim’s peace.\nQ. Tanushree Dutta and Vinta Nanda are the only ones who have taken legal action but not many women have followed a similar route. Your comment.\nA. We are still growing up to it, we are still understanding it. Years of anger will come out and then people will come to know what is the right way. We all will take time to understand. I don’t want to say anything further till my non-complicity is proven, I am not qualified to comment on it.\n(With agency inputs)", "title": "We Are Still Understanding And Growing Up To #MeToo Movement, Says Filmmaker Anurag Kashyap", "date_publish": "26/10/2018, 15:51:37", "description": "Filmmaker Anurag Kashyap, who is embroiled in a legal battle with his former partner and director Vikas Bahl, on Thursday said the #MeToo movement has given voice to years of anger. Bahl has been accused of sexual harassment by an employee of the now-dissolved Phantom Films, the company that was founded by Kashyap, Bahl, Vikramaditya Motwane.", "authors": [], "url": "https://www.indiatimes.com/entertainment/we-are-still-understanding-and-growing-up-to-metoo-movement-says-filmmaker-anurag-kashyap-355512.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/anurag_kashyap_1540549541_800x420.jpg"}