{"text": "PARTNER\nRanbir Kapoor and Deepika Padukone are back in action! The duo may have a few films lined up together (maybe the next Luv Ranjan film?) but before that, they are giving their fans a little sneak peek into the crackling chemistry we've always loved. Last seen together in 'Tamasha', the duo recently came together to shoot a commercial for Asian Paints Royale Health Shield.\nJust like the good old days, their chemistry and banter are just as exciting and we can't help wanting more. In the latest video for Asian Paints Royale Health Shield, the two are a natural even while talking about the bacteria-killing aspects of Asian Paints Royale Health Shield (On a side note, it is a revolutionary paint with anti-bacterial technology and if you're looking at repainting consider this one for sure).\nFrom Ranbir calling Deepika for help to the duo bonding over a shared joke, they are cute as a button and we completely heart them. Just watching them together on-screen irrespective of their new personal relationships gives all their fans a happy high.\nIf you still haven't watched the video, catch their fun chemistry and the magic of the new Asian Paints Royale Health Shield in this commercial.", "title": "We Are All Hearts For This Cute Banter Between Deepika Padukone And Ranbir Kapoor", "date_publish": "19/03/2019, 15:16:20", "description": "Ranbir Kapoor and Deepika Padukone are back in action! The duo may have a few films lined up together (maybe the next Luv Ranjan film?) but before that, they are giving their fans a little sneak peek into the crackling chemistry we've always loved. Last seen together in 'Tamasha', the duo recently came together to shoot a commercial for Asian Paints Royale Health Shield.", "authors": ["Nupur Khanna"], "url": "https://www.indiatimes.com/entertainment/we-are-all-hearts-for-this-cute-banter-between-deepika-padukone-and-ranbir-kapoor-363513.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranbir_kapoor_deepika_padukone_1552291902_800x420.jpg"}