{"text": "We Dug Out Details On What Deepika-Ranveer Might Wear For Their Wedding In Italy!\nWe Dug Out Details On What Deepika-Ranveer Might Wear For Their Wedding In Italy!\nAs we head inches closer to Deepika Padukone and Ranveer Singh's D-day, the excitement is doubling up every single day too. After their appearance today at the airport, it has suddenly gotten more and more difficult for all the single people who are eagerly awaiting for the cupid to change their lives.\nVogue\nWell, the cupid stuck for Ranveer and Deepika six years ago on the sets of Sanjay Leela Bhansali's Ram Leela and their life changed forever.\nViral Bhayani\nThe lovelorn couple has flown down to Italy for exchanging vows and we can only sit back with bated breaths to catch glimpses of what fans call #DeepVeer's wedding.\nWell, thanks to paps who click these celebrities that we are able to feed our curiosity.\nTwitter\nDon't Miss 460 SHARES 1.7 K SHARES 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES\nApart from getting a confirmation that it indeed is a destination wedding for Deepika and Ranveer, looks like we have decoded another mystery.\nImage for representational purpose only.\nOne of the biggest questions has been: What will Deepika and Ranveer wear? While we were relying on Nitasha Gaurav and Shaleena Nathani (Ranveer and Deepika's stylists) to spill the beans, looks like we at least now know what label the couple will be donning.\nA video that is now being circulated on social media gives us a major hint that Deepika and Ranveer might have zeroed down Sabyasachi for their wedding.\nElle India\nA few paper bags in the middle of their luggage and suitcases were spotted, hinting that the couple might have chosen Sabyasachi for the functions in Italy.\nAlso, considering how Deepika chose Orange Sabyasachi suit for Nandi Pooja in Bangalore, we are not really surprised.\nWhile we will eagerly wait for Ranveer and Deepika's official wedding pictures to melt our hearts in a few days, for now, we can only wish them good luck for the years filled with romance and love that lie ahead of them.", "title": "We Dug Out Details On What Deepika-Ranveer Might Wear For Their Wedding In Italy!", "date_publish": "10/11/2018, 16:24:42", "description": "The lovelorn couple has flown down to Italy for exchanging vows and we can only sit back with bated breaths to catch glimpses of what fans call #DeepVeer wedding. At the airport, amidst all the other luggage and trolleys, we noticed number of white 'Sabyasachi' paper bags carried by the couple's staff.At the airport, amidst all the other luggage and trolleys, we noticed number of white 'Sabyasachi", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/we-dug-out-details-on-what-deepika-ranveer-might-wear-for-their-wedding-in-italy-356415.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1541847518_800x420.jpg"}