{"text": "2018 was all about Vicky, Donor, and Rao. Well, startled?\nWhile the bankable Khans failed to attract the audience to the theaters, it was Rajkummar Rao, Vicky Kaushal and Ayushmann Khurrana who changed the game of commercial Bollywood films this year.\nA year full of surprise hits, mega-flops and female-led narratives that managed to pull the crowd.\nDharma Productions\nThis means Badhaai Ho! Ab Audience Raazi Hai for strong characters led by stree-s of Bollywood.\nI picked up 11 films that didn't just manage to rake in box-office numbers but proved that content eventually ends up becoming the strongest USP of a film. If you have missed watching any of these, make sure you watch these before 2018 ends. You have got a week!\n1. Manmarziyaan\n\"Yeh Kaisa Pyaar Hai\"\n\"Yeh Woh Wala Pyaar Hai Jisme Jitna Karo, Kamm Hai..\"\nAnurag Kashyap's first attempt at making a true-blue romance film starring Vicky Kaushal, Taapsee Pannu, and Abhishek Bachchan deserves applause. The film summed up today's millennial relationships that are most about 'Fyaar' and not 'Pyaar'. Rumi, Vicky, and Robby juggle between their heart and mind as they fight a battle within themselves on what's right and what's wrong.\nDon't Miss 183 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\nSomewhere between lust, love, and longing, you end up falling for Robby, Vicky, and Rumi. Watch the film now.\n2. Badhaai Ho\nJunglee Pictures\nBadhaai Ho is proof of the fact that our audience has grown up and can differentiate between a good film and a bad film. Packed with powerful performances, punchy lines and hilarious turn of events, this film became one of India's biggest entertainers and blockbusters. The stunning cast of the film including Surekha Sikri, Neena Gupta, Sanya Malhotra and Gajraj Rao, the film makes you laugh and cry for all the right reasons.\n3. Tumbadd\nA few films don't need a strong PR or marketing budget. The story of the film is its major USP and that's what happened with Tumbbad. This historical period fantasy horror film directed by debutant Rahi Anil Barve and Adesh Prasad has to be on your must-watch list because it is unmissable for reasons more than one. It's gripping but it's much more than those usual horror films that often fail to satisfy your greed as an audience. This was hands down critics' and audience's top favorite picks of 2018.\n4. Andhadun\nSriram Raghavan's thriller drama Andhadhun became Ayushmann Khurrana's gold this year. The film's open-ended ending became a topic of debate and discussing the same, Ayushmann Khurrana spoke to Huffington Post and said, “So, to my mind, I have killed Tabu off and used her cornea to get my sight back. I am in Europe doing what I was trying to do back in Pune, playing a blind pianist”. Also starring Tabu and Radhika Apte, the film became a blockbuster and went on to becoming one of the most-discussed films on social media.\n5. Love Sonia\nThe film revolved the harrowing account of two sisters robbed of their innocence when one is sold by her debt-ridden father, and the other follows after her in the hope of rescuing her but becomes trapped in the flesh trade herself. The film gives us the real glimpse of red light areas of Mumbai, the latent innocence in the younger sister and the grit to rescue her sister and eventually herself stays intact.\nThe film starred a fantastic ensemble cast including Riya Sisodiya, Freida Pinto, Demi Moore, Manoj Bajpayee, Richa Chadda, Anupam Kher, Adil Hussain, Rajkummar Rao, and Sai Tamhankar\n6. Raazi\nDharma Productions\nThis year we saw several female-led films do wonders at the box-office. In the film, Alia Bhatt who played the role of Sehmat, a Kashmiri woman who is made to marry a Pakistani officer with a vested interest of digging out intelligence details, so that those discrete and sensitive details can be passed on to Indian forces. The film was an official adaptation of Harinder Sikka's Calling Sehmat, a novel that was inspired by a real-life woman, and in order to protect her identity, Sikka chose to call her Sehmat.\nBhatt's screen-presence and Vicky Kaushal's brief but important role made it a successful film for Dharma Productions. The film was helmed by Meghna Gulzar.\n7. Stree\nVery rare do we see a comedy horror film in Bollywood that ends up becoming one of the most successful films of the year. The film is directed by Amar Kaushik, written by Raj Nidimoru and Krishna D.K. and produced by Dinesh Vijan and Raj Nidimoru and Krishna D.K. was based on the Indian urban legend Nale Ba, about a spirit who knocks on people's doors at night. The film starred Rajkummar Rao and Shraddha Kapoor. Pankaj Tripathi, Aparshakti Khurrana, and Abhishek Banerjee appears in supporting roles. The film had a slow start but later word of mouth and social media reviews played a huge role in the success of the film.\n8. Mukkabaaz\nThis year was all about power of good content and phenomenal performances. One of the most powerful Indian sports drama film co-written, co-produced and directed by Anurag Kashyap, the film starred Vineet Kumar Singh, debutant Zoya Hussain, Ravi Kishan and Jimmy Shergill in the lead roles. The performances in the film were so good that the film managed to gain numbers purely on the basis of word of mouth.\n9. Manto\nScreengrab\nBased on the life of famous Urdu author Saadat Hasan Manto, Manto was written and directed by Nandita Das. Starring Nawazuddin Siddiqui in the title character of Indo-Pakistani, author, and writer Saadat Hasan Manto. The film had an impactful ensemble cast with Rasika Duggal and Tahir Raj Bhasin playing pivotal roles. The film failed to create an impact at the box-office because of lack of screens but it received a positive response as soon as it was released on Netflix India. Clearly one of the best films of 2018 and a film that was royally owned by Nawazuddin Siddiqui.\n10. Mulk\nScreengrab\nOne of the finest and underrated movies of the year is Mulk. Directed by Anubhav Sinha, the film was shot in Benaras and Lucknow. The film revolved around the lives of a Muslim family, who struggle to reclaim its lost honour. The film starring Taapsee Pannu and Rishi Kapoor failed to fetch box-office numbers but went on to becoming one of the most critically acclaimed films of 2018.\n11. October\nOctober was a film that gently rips apart your heart, only to caress and put it back safely in there. An unapologetic and compassionate story that’s nowhere close to being a usual love story. However, the film ends up being all love, life and everything that unfolds in between. Shoojit Sircar’s October was a film that revolves around Dan and Shiuli and how selfless affection consumes him. This one isn't a usual watch but when you do, your heart goes out for both the characters. Juhi Chaturvedi's writing is so poignant and pure that you end up feeling for Dan and Shuili and how fate changes their life forever.", "title": "We Picked Top 11 Bollywood Movies Of This Year That You Need To Watch Before 2018 Ends!", "date_publish": "22/12/2018, 14:42:53", "description": "2018 was all about Vicky, Donor, and Rao. Well, startled? While the bankable Khans failed to attract the audience to the theaters, it was Rajkummar Rao, Vicky Kaushal and Ayushmann Khurrana who changed the game of commercial Bollywood films this year.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/we-picked-top-11-bollywood-movies-of-this-year-that-you-need-to-watch-before-2018-ends-358987.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/manmarziyaan_top_film_2018_1545471473_800x420.jpg"}