{"text": "According to filmmaker Kabir Khan, there were \"hushed whispers\" about most of the people who have been named in the #MeToo movement but everyone ignored it, something that will not happen again.\nThe #MeToo movement has rocked the film industry with prominent names such as Vikas Bahl, Alok Nath, Sajid Khan among others been called out for sexual harassment and inappropriate behaviour.\nAgencies\n\"In a certain sense, honestly, we all have been complicit. I have seen people all around me fall, left right and centre. These are people I've worked with, represented me, people who were doing casting for me, they were my actors. There were hushed whispers about most of them,\" Kabir said.\n\"There was a general consensus that most of the people whose names have come up, are people who we seemed to have known about, but we all did keep quiet,\" he added. The filmmaker was speaking at a special #MeToo session at the ongoing 20th edition of JIO MAMI Film Festival.\n\"I came here about 12 years ago as a documentary filmmaker. I got into the system, I was with Yash Raj Films for six years... There would be so many occasions were one would hear about a certain behaviour from a person. But we all, in a certain way, ignored. The biggest change coming out because of the #MeToo movement is that we aren't going to do that anymore. The moment I hear even a murmur that something like this (happened), I am going to come down like a ton of bricks,\" he added.\nThe \"Bajrangi Bhaijaan\" director said recently one of his assistant directors on a web series he worked on spoke about how she was made to feel uncomfortable by someone.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"On my last web series, one of my ADs did come to me just last week. She was with us for a very brief while, one international schedule, and she told me about two incidents when she felt uncomfortable. I told her she should've told me, we are very accessible but she said she thought I would be busy, and this happened on the last day but now she felt like (talking about it). But apart from those two incidents, fortunately they were not very serious in nature, it hasn't really happened on my set.\"\nKabir said the biggest learning from the movement is that no one should \"ever ignore hushed whispers or murmurs.\"\n\"The moment we hear something like this, it's our responsibility to find out what's happening,\" he said.\nKabir has had a successful collaboration with superstar Salman Khan with films like \"Bajrangi Bhaijaan\" and \"Ek Tha Tiger\".\nWhen asked whether his association would be viewed as problematic today since Salman was himself accused of harassment by a female actor a decade ago, Kabir said commenting on individual cases would trivialize the movement.\n\"We all need to be sensitised towards what's happening around us. That's one of the main changes which will take place. We have to be more aware of the people we are working with. I don't want to get into individual (cases) but definitely we need to be more responsible about the people around us and the people we associate with. If we focus on individual cases then we trivialise the issue,\" he added.\n(With PTI inputs)", "title": "We've All Been Complicit, Won't Ignore Hushed Whispers, Says Kabir Khan On #MeToo", "date_publish": "27/10/2018, 11:00:54", "description": "Filmmaker Kabir Khan said Friday that there were \"hushed whispers\" about most of the people who have been named in the #MeToo movement but everyone ignored it, something that will not happen again. The #MeToo movement has rocked the film industry with prominent names such as Vikas Bahl, Alok Nath, Sajid Khan among others been called out for sexual harassment and inappropriate behaviour.", "authors": [], "url": "https://www.indiatimes.com/entertainment/we-ve-all-been-complicit-won-t-ignore-hushed-whispers-says-kabir-khan-on-metoo-355543.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/kabir_khan_1540618637_800x420.jpg"}