{"text": "Whacky Outfits To Mushy Speech, Deepika Padukone-Ranveer Singh Gave Marital Bliss A Whole New Definition Last Night!\nWhacky Outfits To Mushy Speech, Deepika Padukone-Ranveer Singh Gave Marital Bliss A Whole New Definition Last Night!\nWe get happy to see people around us happy, don’t we? They send out a positive vibe. Ranveer Singh and Deepika Padukone have tied the knot and their love pouring out for each other is making lots of hearts flutter.\nYesterday, the lovely couple attended the wedding bash thrown by Ranveer Singh’s sister Ritika Bhavnani, and videos doing the rounds from the bash are making our hearts melt.\n“Ladies and gentlemen, I married the most beautiful girl in the world!” – that’s what Ranveer Singh said as he introduced the love of his life Deepika Padukone, amid cheers and claps.\n“She's obliged me by wearing this today. She's looking like Frieda Kahlo on acid,” he added leaving the guests in splits. Deepika was overwhelmed!\nDescribing his attire of the day, he said, “I would also like to introduce you to my pussycat... she's going to be meeting eyes with you for the rest of the evening sitting on my right shoulder.”\nAnd he thanked everyone for gracing the party, which marks the beginning of the beautiful phase of their lives. “Guys, we are really really happy to have all of you together here tonight. It's going to be an epic, epic night because there are so many of you... all of our lovers and friends under one roof and the dance floor looks too empty to me. We are here to celebrate the epic future baby you and me,” he said.\nDon't Miss 282 SHARES 185 SHARES 1.1 K SHARES 120 SHARES\nJust look how happily they danced together!\nHere are some more pictures from the bash!\nThese videos are proof that Deepika Padukone and Ranveer Singh have found happily ever after.", "title": "Whacky Outfits To Mushy Speech, Deepika Padukone-Ranveer Singh Gave Marital Bliss A Whole New Definition Last Night!", "date_publish": "25/11/2018, 14:40:11", "description": "Ranveer Singh and Deepika Padukone attended the wedding bash thrown by Ranveer Singh’s sister Ritika Bhavnani, and video doing the rounds from the bash are making our hearts flutter. “Ladies and gentlemen, I married the most beautiful girl in the world!” – that’s what Ranveer Singh said as he introduced the love of his life Deepika Padukone, amid cheers and claps.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/whacky-outfits-to-mushy-speech-deepveer-gave-marital-bliss-a-whole-new-definition-last-night-357344.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_singh_introduces_wife_deepika_padukone_as_most_beautiful_girl_in_the_world_at_wedding_party_1543134730_800x420.jpg"}