{"text": "You have just watched three-hour finale of Marvel Cinematic Universe. Now what? Well, it’s not the end of MCU yet. There will be prequels and spin offs.\nAlso Read: Man Gets Beaten Up Outside Theatre In Hong Kong For Shouting 'Avengers: Endgame' Spoilers\nTwitter\nAvengers Endgame sure marks the end of an era, but it also marks the beginning of a new one. In Marvel Cinematic Universe phase 4 movies, new superheroes and teams will grace the silver screen.\n#1 Spider-Man: Far From Home (July 2, 2019)\nA sequel to sequel to Spider-Man: Homecoming, Spider-Man: Far From Home will be the first movie post Avengers: Endgame. It will follow the story of Peter Parker (Tom Holland). The teaser of the movie has already been released, and it’s unclear if the movie is set before or after Endgame. Spider-Man: Far From Home is going to be the final chapter in MCU phase 3.\n#2 Black Panther 2\ndigitaltrends.com\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES 130 SHARES 289 SHARES\nBlack Panther, which became the first Marvel film to be nominated for Best Picture at the Oscars, is returning with a sequel. According to The Hollywood Reporter, director Ryan Coogler will write and direct Black Panther 2. An official announcement, however, is awaited.\n#3 Doctor Strange 2\nBenedict Cumberbatch and Benedict Wong will return in Doctor Strange sequel for which writer-director Scott Derrickson has agreed to comeback too.\n#4 Guardians of the Galaxy Vol. 3\nignimgs.com\nIt was in 2018 that James Gunn, who has directed the last two films in the franchise, was fired, after his offensive tweets that touched on areas like pedophilia and rape resurfaced. However, he has been rehired by Marvel in 2019 to direct Guardinas of the Galaxy Vol. 3. The movie will begin its production in 2021 reportedly. So, there are a couple of years before you see Groot and Rocket in action again.\n#5 Black Widow prequel\nwikia.nocookie.net\nBlack Widow is finally getting her own film. In the film, Scarlett Johansson will play her role from Avengers and tell her back story. It is being said that the story of the movie to be directed by Cate Shortland will tell the story of Natasha Romanoff, and how the Russian spy ended up defecting to the US’ S.H.I.E.L.D.\n#6 Shang-Chi\ncbrimages.com\nThis will be Marvel’s first film with an Asian lead. Shang-Chi is a story of master of martial arts who has the ability to create endless duplicates of himself. Director Destin Daneil Cretton who has previously worked with Captain Marvel actress Brie Larson on film Short Term 12 will direct the movie.\n#7 The Eternals\nThis one is one of the most exciting upcoming MCU projects. The movie is based on The Eternals, which are a race of empowered beings created Celestials, the cosmic God-like aliens, to defend good from evil. The movie will reportedly star Angeline Jolie, Kumail Nanjiani and Dong-seok Ma.", "title": "What’s Next After Avengers: Endgame? Here Are 7 Upcoming Marvel Movies To Watch Out For", "date_publish": "28/04/2019, 16:07:48", "description": "You have just watched three-hour finale of Marvel Cinematic Universe. Now what? Well, it’s not the end of MCU yet. Avengers Endgame sure marks the end of an era, but it also marks the beginning of a new one. In Marvel Cinematic Universe phase 4 movies, new superheroes and teams will grace the silver screen.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/hollywood/what-s-next-after-avengers-endgame-here-are-7-upcoming-marvel-movies-to-watch-out-for-366236.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/here_is_the_list_of_upcoming_marvel_phase_4_movies_1556446457_800x420.png"}