{"text": "‘What A Comeback’! Fans Give A Big Thumbs Up To Kapil Sharma As He Returns With Season 2 Of His Show\n‘What A Comeback’! Fans Give A Big Thumbs Up To Kapil Sharma As He Returns With Season 2 Of His Show\nKapil Sharma is back and how! After a long gap, the comedy king is back with what he does the best. The second season of The Kapil Sharma show aired last night, and the ace comedian worked his magic leaving everyone laughing their hearts out.\nbizasialive.com\nHe returned with his team that included old cast members including Chandan Prabhakar, Kiku Sharda and Sumona Chakravarti, and some new ones like Bharti Singh and Krushna Abhishek.\nBharti Singh said that she approached Kapil Sharma and waited for about nine months to be a part of the show. Krushna Abhishek who has had a tiff with Kapil in the past was also excited for this one.\nTwitter\nBut Sunil Grover was nowhere to be seen. He is apparently busy with his own show Kanpur Wale Khuranas.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nAlso Read: Before Kapil Sharma's Comeback, Sunil Grover's Show Hits The Small Screen & Fans Have Mixed Reactions\nLast night, finally, the show premiered and fans were elated. With so many punches tickling audiences’ funny bones, Kapil Sharma was in a refreshed mood all set to rock again. Adding cherry on the cake were guests Ranveer Singh and Rohit Shetty who also had a blast.\nHere’s how fans reacted to the first episode of The Kapil Sharma Show.\n#1\nWhat a comeback for @KapilSharmaK9 , Kapil Sharma show was amazing tonight, I'm crying from laughter.\nIt's been a long time since our family sat down together, and it was worth it. #KapilSharmaShow — Gursimran Singh (@yesitsmeguru) December 29, 2018\n#2\n#TheKapilSharmaShow yaad teri aayegi 😂loved every moment of kapil sharma show @KapilFans @KapilSharmaK9 @SonyTV way to go guys .. thank you for awesome time .. you guys rock — rajan minocha (@rajanngp) December 29, 2018\n#3\n#4\nMy favorite show #TheKapilSharmaShow is back with full energy of @KapilSharmaK9. Now I have something to wait for during the week and watch in the weekend. What a come back! — Abdullah Yadgare (@Abdullahyadgare) December 29, 2018\n#5\n@KapilSharmaK9 this lion was just resting before a Roar! And he roared too loud ❤️❤️❤️❤️❤️ #TheKapilSharmaShow @SonyTV — Dhwani (@dhwani2993) December 29, 2018\n#6\nHilarious episode of #thekapilsharmashow .. @KapilSharmaK9 @RanveerOfficial uhh were terrific.... #yaadteriaaegi super funn... cant stop laughing man!!! U r back with a bang..!!thnku for doing dis... — Yashika (@yashika_12) December 29, 2018\n#7\n#8\nScreen on fire #TheKapilSharmaShow! After long gap, we are laughing openly! Thank you @KapilSharmaK9!! pic.twitter.com/DvshVpV76M — Rakesh (@BeingTheRakesh) December 29, 2018\n#9\n#TheKapilSharmaShow Awesome come back .. I like the new characters .. @KapilSharmaK9 U r awesome man & u nailed it again .. #Real_Comedy_king — Vivek Anand (@Saying_Vivek) December 29, 2018\n#10\n@KapilSharmaK9 sir my heartiest congratulations #TheKapilSharmaShow what a great start #TheKapilSharmaShowIsBack with a bang — Pradyumn (@enigmapradyum) December 29, 2018\n#11\n#thekapilsharmashow people who have not supported @KapilSharmaK9 in his bad time now singing song yaad teri aayegi mujhko bada sataegi😂😂😂 — Shubhs (@shubhsshukla99) December 29, 2018\n#12\nSo so happy to have your show back #KapilSharmaShow, you are the India’s best hindi standup by far! Welcome back @KapilSharmaK9 pic.twitter.com/m7ghzeqezK — PoonamAB (@PoonamBavdankar) December 29, 2018\n#13\n#14\n#KapilSharmaShow I am delighted to see Kapil back on small screen and have been eagerly waiting for you since 1 year. I am watching it now and simply loving it. God bless you & team and hope you rock on TV forever. — Vishwajit Choudhary (@vishwajit1983) December 29, 2018\n#15\nWatching #TheKapilSharmaShow Damnn Hilariousssssss😂😂😂 Kapil... You're Back and What a Come Back...😍👏👏\nWishing ya All the LUCK ✌ #KapilSharmaShow #TheKapilSharmaShowIsBack Wohoo🎉\nLOVE YOUUUUUuuu @KapilSharmaK9 — Alisha VIP💗 (@AlishaArmaan22) December 29, 2018\nIn today’s episode, Sara Ali Khan and Sonu Sood will join them. It’s going to be a laughter riot.", "title": "The Kapil Sharma Show:‘What A Comeback’! Fans Give A Thunderous Applause To Kapil Sharma As He Returns With Second Season Of His Show", "date_publish": "30/12/2018, 13:00:16", "description": "Kapil Sharma is back and how! After a long gap, the comedy king is back with what he does the best. The second season of The Kapil Sharma show aired last night, and the ace comedian worked his magic leaving everyone laughing their hearts out. He returned with his team that included old cast members including Chandan Prabhakar, Kiku Sharda and Sumona Chakravarti, and some new ones like Bharti Sin", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/what-a-comeback-fans-give-a-big-thumbs-up-to-kapil-sharma-for-his-show-s-second-season-359506.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/kapil_sharma_returns_with_second_season_of_his_show_the_kapil_sharma_show_1546153801_800x420.png"}