{"text": "When West Met East! 11 International Songs That Were Shot In India And Became An Instant Hit\nWhen West Met East! 11 International Songs That Were Shot In India And Became An Instant Hit\nWhenever we want to take inspiration, weather it's a fashion trend, music, destination or the Kardashians, we always look up to the West and Hollywood. They give us all the possible goals. In fact, the whole paparazzi culture also came from the west. They have given us or rather created jobs in India that I never thought would have existed. But the ugly truth is they have become a part of us and is also our guilty pleasure.\nBut Western artists clearly think otherwise. They enjoy the traditional India which includes the stunning festivals, fervour and colourful costumes. Infact, many have even shot their international music videos here.\nSo here's taking a look at 11 fun music videos that were shot here and went onto become an instant hit.\n1. Jai Wolf - Indian Summer\nDon't Miss 153 SHARES 362 SHARES 544 SHARES 923 SHARES\nIn 2015, Jai Wolf released his debut single \"Indian Summer\" and it went onto become a super hot number. The video has been shots in various parts of India.\nIndian Summer saw great commercial success, hitting #1 on Spotify’s US Viral Chart, #2 on iTunes’ Electronic Chart, and #31 on Billboard's Hot Dance/Electronic song's chart. That's not all, the track also earned a spot on Triple J 2015 Hottest 100 in Australia.\n2. Coldplay - Hymn For The Weekend\nThis is by far the latest international song to be shot in India. Covering Holi, stunning forts, our national bird and the colourful taxis, we gave a beautiful rich look to the video. The song went onto achieve close to 110 million views.\nBut this is not the only highlight of the video. Bollywood actress Sonam Kapoor also featured in the music video, which is a first for an Indian celebrity. Although a tiny role, we were elated to see her in a tribal outfit looking royal as always.\nColdplay also managed to feature Beyonce who is seen on a television box which says Mariya Mata in Hindi. This is a first international video to capture so many emotions, celebrities and show India in just the right culture and light.\n3. Iggy Azalea - Bounce\nThe song has a festive feel where Iggy Azalea can be seen nailing the Indian bridal avatar. In one of her earlier interviews, Azalea mentioned she wanted the track to showcase a fun side to her artistry and offset the seriousness of her previous single \"Work\".\nIn the track, she has nicely clubbed the western EDM and hip hop with the eastern music tabla and sarangi instruments.\n4. Vidya Vox - Kerala Boat song\nShe is one of the most popular musicians we have. Vidya Vox is known for her original music, some cult mashups and covers. She is in true sense, blending a beautiful amount of eastern and western music and we couldn't be more delighted. The song has garnered 51 million views and has shown South Indian culture.\n5. Major Lazor - Lean On\nThe music video for Lean On was filmed in ND Studios, Karjat (India) and Kaul Heritage City, Vasai in Maharashtra. We all hummed the song the minute it released and made it the hit song of 2015.\nLean On was a critical and commercial success, peaking at number four on the US Billboard Hot 100 chart and at number two on the UK Singles Chart.\n6. The Beatles - Across The Universe\nEveryone knows the amount of times, The Beatles visited India. For many who don't know, there is a cafe also by their name in Rishikesh. They loved our country and the traditional touch it provided to their songs and videos.\nOne of their early songs, Across The Universe was heavily influenced by Jai Guru Deva. In his 1970 interview with Rolling Stone, Lennon referred to the song as perhaps the best, most poetic lyric he ever wrote: \"It's one of the best lyrics I've written. In fact, it could be the best. It's good poetry, or whatever you call it, without chewin' it. See, the ones I like are the ones that stand as words, without melody. They don't have to have any melody, like a poem, you can read them.\"\n7. Calvin Harris - Let It Go\nYou have to see the video to believe it. It's fun, frivolous and ammature and despite all of this, the song received a nomination for Best Dance Recording at the 55th Grammy Awards held in February 2013.\nThat's right, the music video shows different locations of India, from the airport, local kids playing, boarding an Indian cab to the colours, it has all this and much more.\n8. Hilight tribe - Shankara\nWhen Indian classical music meets electronic music, this happens. While some poeple call it the stoner's anthem, some call it the best piece on psychedelic trance. The music includes lyrics like Om Saraswati ki jai, Om Maa Parvati ki jai, Om Ganesha ki jai which makes it spunkier and pacey.\n9. Imogen Heap - Minds Without Fear\nGrammy Award-winning singer-songwriter Imogen Heap teamed up with prolific composer duo Vishal-Shekhar for a track inspired from Rabindranath Tagore's poem - 'Where the mind is without fear'. The music video was filmed at the luxurious, 479-year-old Samode Palace on the outskirts of Jaipur in Rajasthan.\n10. Skindred - Kill The Power\nA ragga metal number, the band chose India as a location to shoot their music video. Kill The Power is aimed at people who are sick of being the underdog, and wanna step up and destroy all those who oppress and hold them down. It's pretty much how our country got our freedom back and has been living life each day.\n11. Mumford & Sons - The Cave\nThe official music video for \"The Cave\" features each of the four band members driving on scooters through the roads of Goa while singing the song in tandem with four Indian men in marching band uniforms to whom they gave their instruments at the start of the video.\nWe hope this tradition of shooting on Indian soil continues.", "title": "When West Met East! 11 International Songs That Were Shot In India And Became An Instant Hit", "date_publish": "03/02/2019, 13:19:21", "description": "When West Met East! 11 International Songs That Were Shot In India And Became An Instant HitWhen West Met East! 11 International Songs That Were Shot In India And Became An Instant Hit When West Met East! 11 International Songs That Were Shot In India And Became An Instant Hit", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/when-west-met-east-11-international-songs-that-were-shot-in-india-and-became-an-instant-hit-361292.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/hollywood_1548835322_800x420.jpg"}