{"text": "While BCCI Is Still Considering A 2-Match Ban On Hardik Pandya & KL Rahul, Hotstar Has Pulled Down KWK Episode\nWhile BCCI Is Still Considering A 2-Match Ban On Hardik Pandya & KL Rahul, Hotstar Has Pulled Down KWK Episode\nHailed as Indian cricket team’s all-rounder, Hardik Pandya doesn’t really ask women’s name when he meets them? If you think that’s because he gets lost into the conversation, you might want to take another guess.\n“It’s not talking. It’s just watching. I like to watch and observe how they move. I’m little from the black side so I need to see how they move,” he said on Koffee With Karan’s latest episode, and received immense amount of flak for his misogynistic remarks.\nHardik Pandya : When i lost my virginity, i told them, \"Mai Aj kar kay aya ho\" pic.twitter.com/6HfX0zRWHy — Thakur (@ThakurHassam) January 6, 2019\nHe was forced to apologise, but when he did that, his apology, people thought wasn’t sincere enough.\nMr. Talwar gets it right. pic.twitter.com/OCMXSgCXHA — Drupad Dave (@DrupadSays) January 9, 2019\nBCCI is troubled after this incident. It served the two cricketers a show-cause notice for their crass and misogynistic remarks since it triggered a massive outrage. Furthermore, BCCI is currently in a legal dilemma on whether it should ban Hardik Pandya and KL Rahul for two matches or not. Barely 24-hours before India had to line-up their playing eleven, BCCI is still confused over the quantum of punishment that shall be granted to the two cricketers.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nOn the other side, Hotstar, which is the online streaming partner for the show, has taken down the episode of Koffee With Karan featuring KL Rahul and Hardik Pandya. Furthermore, Star World has also removed all the teasers and photos from social media handles.\nWhat’s more? BCCI is also considering to ban cricketers on non-cricket chat shows.\n\"It will be considered whether players should even be allowed to appear on such shows which have got nothing to do with cricket,\" a BCCI source told PTI.\nWhat’s more? Virat Kohli has finally broken silence on the entire fiasco. In a pre-game media conference when Virat Kohli was asked about the controversial remarks of Hardik Pandya and KL Rahul, he made it clear that the comments were not acceptable.\n\"From the Indian cricket team point of view, any inappropriate comments that are made in that scenario are something that we definitely don't support,\" he said adding that they have “understood the magnitude of what's happened. Definitely it has to hit hard, they will definitely understand the things that have not gone right.”", "title": "While BCCI Is Still Considering A 2-Match Ban On Hardik Pandya & KL Rahul, Hotstar Has Pulled Down KWK Episode", "date_publish": "11/01/2019, 12:25:15", "description": "Hotstar, which is the online streaming partner for the show, has apparently taken down the episode of Koffee With Karan featuring KL Rahul and Hardik Pandya. Furthermore, Star World has also removed all the teasers and photos from social media handles.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/while-bcci-is-still-considering-a-2-match-ban-on-hardik-pandya-kl-rahul-hotstar-has-pulled-down-kwk-episode-360219.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/while_bcci_is_considering_2match_ban_on_hardik_pandya__kl_rahul_hotstar_has_pulled_down_kwk_episo_1547189741_800x420.png"}