{"text": "While Half Of The B-Town Was At Ambani’s Bash, Other Half Celebrated Rani Mukerji’s Daughter Adira’s Birthday\nWhile Half Of The B-Town Was At Ambani’s Bash, Other Half Celebrated Rani Mukerji’s Daughter Adira’s Birthday\nChristmas and New Year are around the corner, but Bollywood has already kicked off the party season. After DeepVeer and NickYanka’s wedding, the B-Town was spotted at Isha Ambani and Anand Piramal’s pre-wedding celebrations in Udaipur last night.\nWhile half of the Bollywood including Shah Rukh Khan, Aamir Khan, Salman Khan, Deepika Padukone, Ranveer Singh among others were spotted at the bash last night, the other half was apparently at Rani Mukerji’s daughter Adira’s birthday party. This Sunday had all the party vibes for Bollywood stars.\nYouTube/ An old picture of Rani Mukherji with her daughter Adira.\nWhile Karan Johar was at the Ambani bash, his toddlers Yash and Roohi were spotted at Adira’s birthday bash accompanied by granny Hiroo Johar.\nSimilarly, while Abhishek Bachchan and Aishwarya were in Udaipur, Shweta Bachchan Nanda made it to the little one’s birthday celebrations.\nDon't Miss 264 SHARES 357 SHARES 322 SHARES 3.4 K SHARES 234 SHARES\nSoha Ali Khan with daughter Inaaya was there too.\nTusshar Kapoor also arrived with his son Lakshya.\nTwinkle Khanna and Akshay Kumar’s daughter Nitara, and Shilpa Shetty, her son Viaan and husband Raj Kundra also graced the party.\nBut where was Taimur?", "title": "While Half Of The B-Town Was At Ambani’s Bash, Other Half Celebrated Rani Mukerji’s Daughter Adira’s Birthday", "date_publish": "10/12/2018, 15:59:05", "description": "While half of the Bollywood including Shah Rukh Khan, Aamir Khan, Salman Khan, Deepika Padukone, Ranveer Singh among others were spotted at the bash last night, the other half was apparently at Rani Mukherji’s daughter Adira’s birthday party. This Sunday had all the party vibes for Bollywood stars.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/while-half-of-the-b-town-was-at-ambani-s-bash-other-half-celebrated-rani-mukerji-s-daughter-adira-s-birthday-358284.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/while_half_of_the_btown_was_at_ambanis_bash_other_half_celebrated_ranis_daughters_birthday_1544436047_800x420.png"}