{"text": "While Women Share Their #MeToo Stories, Shilpa Shinde Has A Totally Different Take On It\nWhile Women Share Their #MeToo Stories, Shilpa Shinde Has A Totally Different Take On It\nEver since the #MeToo movement has erupted, celebrities are breaking their silence and speaking about the real issue. While Twinkle Khanna and Akshay Kumar are the only A-list couple who have taken a firm stance on the issue.\nMany stars have come out in support of survivors and have made a clear decision of not working with accusers in the future projects until proven innocent. The #MeToo that started out in the West has become a full throttle revolution in India.\nThe industry has come together to fight the accused but one actress has called the movement \"rubbish and useless.\"\nSpeaking to a leading channel, The Bhabhiji Ghar Par Hai actress said,\n“It's rubbish. You have to take a call that time only, it's simple. You should speak about that matter that time only. Even I got a lesson. Jab hota hai, tabhi bolo - baad mei bolne ka koi faayeda nahi, it's useless. Baad mei aap voice raise karte ho, usko koi nahi sunega, just controversy hogi – nothing else. You have to take a call that time only when it happens and obviously, you need power.”\nDon't Miss 106 SHARES 282 SHARES 193 SHARES 862 SHARES\nShe further added, \"She said, “This industry is not bad and it's not very good. Everywhere these things happen. I don't know why khud hi industry ka naam kharaab kar rahe hai. (why is everyone themselves spoiling the name of the industry). So those who are working and they got work – sab hi log kharaab hai? (Is everyone wrong?) Aisa nahi hai, it totally depends on you.\"\n\"Aapse saamne waala insaan kaise react karta hai, aap usko kaise answer karte ho. (how someone reacts to you and how you react to someone) It's totally a give and take policy. Women are speaking now but at that time also I said that there's no rape in this industry - zabardasti nahi hota. (it’s not forced) Whatever has happened in our industry, it's a mutual understanding. It's a mutual thing. If you are not ready to do that, just leave that thing.”\nLet's not forget, Shilpa is the same celebrity who walked out of her popular show, Bhabhiji Ghar Par Hai, after accusing the producer of the show of harassing her. Well, Shilpa, slow clap on your statement but we definitely do deserve better from you.", "title": "While Women Share Their #MeToo Stories, Shilpa Shinde Has A Totally Different Take On It", "date_publish": "12/10/2018, 17:16:09", "description": "In The Wake Of #MeToo Movement, Shilpa Shinde Has Most Dumbest Thing To SayIn The Wake Of #MeToo Movement, Shilpa Shinde Has Most Dumbest Thing To SayIn The Wake Of #MeToo Movement, Shilpa Shinde Has Most Dumbest Thing To SayIn The Wake Of #MeToo Movement, Shilpa Shinde Has Most Dumbest Thing To SayIn The Wake Of #MeToo Movement, Shilpa Shinde Has Most Dumbest Thing To SayIn The Wake Of #MeToo Mov", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/while-women-share-their-metoo-stories-shilpa-shinde-has-a-totally-different-take-on-it-354671.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/shilpa_1539340738_800x420.jpg"}