{"text": "Gone are those days when just the presence of a superstar in a film would ensure a box office hit. Salman Khan's Race 3 got worst reviews ever, Aamir Khan's Thugs Of Hindostan flopped, and Shah Rukh Khan’s Zero also failed miserably at the box office. So much so, that it’s struggling to even touch the Rs 100 crore mark!\nthenational.ae\nAfter two weeks of release, Anand L Rai’s Zero has only managed to score about Rs 90 crores at the box office in India. With release of Rohit Shetty’s Simmba, which has already minted about Rs 150 crores, there seems like no scope of improvement.\nbrecorder.com\nEven big budget films need good scripts, thinks Tigmanshu Dhulia, who played Shah Rukh Khan’s father in the movie, which also starred Katrina Kaif and Anushka Sharma in prominent roles.\nTwitter\nOn the other hand, Vidhu Vinod Chopra thinks that it’s time for stars to realise that scripts come first.\n“I think all the so called stars must realise that the script comes first. During 'Dangal', Aamir Khan had hosted a party and I was there. Someone asked me about Aamir and his top position in the industry. I was like, if the film would have had Hrithik Roshan in it, it would have worked anyway. But if it was a bad film, it wouldn't have worked.' Then Aamir called me and said, you are taking a dig on me at my own party.' Now ask him what has happened? Whatever I had said back then was true or false?,” he was quoted as saying by IANS.\nDon't Miss 5.1 K SHARES 185 SHARES 1.7 K SHARES 153 SHARES 343 SHARES\nTwitter\nIf Zero fails, I won’t get work for 6-10 months – that’s what Shah Rukh Khan had said before the release of the movie.\nthenational.ae\nIndian cinema is for sure going through a transitional phase, and audiences are accepting good films. With the advent of streaming platforms such as Netflix, Amazon Prime and Hotstar among others, the competition is definitely on the rise.\nquoracdn.net\nAudiences can’t be fooled anymore! Good scripts and good actors are finally getting their dues.", "title": "While Simmba Surpasses Rs 150 Crore, SRK’s Zero Is Struggling To Even Touch Rs 100 Crore Mark", "date_publish": "04/01/2019, 15:01:07", "description": "After two weeks of release, Anand L Rai’s Zero has only managed to score about Rs 90 crores at the box office in India. With the release of Rohit Shetty’s Simmba, which has already minted about Rs 150 crores, there seems like no scope of improvement.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/while-simmba-surpasses-rs-150-crore-srk-s-zero-is-struggling-to-even-touch-rs-100-crore-mark-359843.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/while_simmba_has_crossed_rs_150_crore_shah_rukh_khans_zero_is_struggling_to_touch_rs_100_crore_mar_1546593550_800x420.jpg"}