{"text": "Who’ll Sit On The Iron Throne? Game Of Thrones Season 8 Posters Suggest It Can Be Night King Too\nWho’ll Sit On The Iron Throne? Game Of Thrones Season 8 Posters Suggest It Can Be Night King Too\nWe all know that “when you play a game of thrones you win or you die.” But who would have thought the dead has the possibility to emerge a winner!\nGive us the trailer already . pic.twitter.com/UW0D9jPu6S — arshiyaan ali (@Arshiyaan_Ali) February 28, 2019\nGame of Thrones season 8, the finale season is just 45 days away from its premiere. To surprise the fans and whet their appetite, HBO has released new posters to tease fans and let them know that winter is coming. There 20 posters that the channel has unveiled.\nWho will sit on the Iron throne? Fans have been speculating for so long. But did you even think that there is a possibility that Night King might end up sitting on the throne? Ever thought about that? Well this poster suggests so.\nWinter is here.\nUse #ForTheThrone to pledge your allegiance to the #ArmyoftheDead. pic.twitter.com/2z5OdhrJMG — Game of Thrones (@GameOfThrones) February 28, 2019\nJon Snow, Daenerys, Cersei Lannister, Jaime Lannister, Tyrion Lannister, Sansa Stark, Arya Stark, Bran Stark, Grey Worm, Jorah Mormont, Missandei, Samwell Tarly, The Hound, Brienne of Tarth, Euron Greyjoy, Theon Greyjoy, Varys and Melisandre – they are all contenders of the Iron Throne.\nDon't Miss 161 SHARES 842 SHARES\nWin or die #ForTheThrone.\nRetweet this Tweet to see who remains in the realm. pic.twitter.com/6b5GYM5GWQ — Game of Thrones (@GameOfThrones) February 28, 2019\nMusical chairs - game of thrones style. The song chosen ? Rains of castamere. The Game is coming to an end. #JaimeLannister #finalseason pic.twitter.com/nWBNh1j39F — Nikolaj CosterWaldau (@nikolajcw) February 28, 2019\nI love all the new @GameOfThrones promos but this is the only one that matters pic.twitter.com/tpFHu44E4D — Drew Waldron (@drew__waldron) February 28, 2019\nWith that new emojis have also been launched. Take a look!\n@GameOfThrones This is amazing. ALL the trends here are for #GameofThrones with #ForTheThrone being on Top. pic.twitter.com/U1FvAnV8tO — Ultimate Book Maniac (@ULTBookManiac) February 28, 2019\nGame of Thrones season 8 will premiere on April 14.", "title": "Who’ll Sit On The Iron Throne? Game Of Thrones Season 8 Posters Suggest It Can Be Night King Too", "date_publish": "01/03/2019, 13:43:04", "description": "Who will sit on the Iron throne? Fans have been speculating for so long. But did you even think that there is a possibility that Night King might end up sitting on the throne? Ever thought about that? Well these new Game Of Thrones poster suggests so.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/who-ll-sit-on-the-iron-throne-game-of-thrones-season-8-posters-suggest-it-can-be-night-king-too-362979.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/wholl_sit_on_the_iron_throne_game_of_thrones_season_8_posters_reveal_it_can_be_night_king_too_1551425555_800x420.png"}