{"text": "Last week, Total Dhamaal entered the highly-hyped Rs 100-crore club, while the Sushant-Singh-Rajput-starrer, brilliantly-written film, Sonchiriya didn't even come close to a giant splash or positioned itself as something remotely legendary when compared to cult classics (of similar genres) like a Bandit Queen or a Phoolan Devi.\nForget box-office collection (which by the way, was less than Rs 5 crore on its fifth day), Sonchiriya didn't even create a buzz until quite recently when it was tweeted and appreciated by B-Town biggies - Anurag Kashyap and Prakash Jha.\nAnother brilliant film SONCHIRIYA from another brilliant and consistent filmmaker Abhishek Chaubey releases today, written by on of the best in business Sudeep Sharma ... and its with subtitles. The best chase film you’ll see — Anurag Kashyap (@anuragkashyap72) March 1, 2019 Don't Miss 862 SHARES 346 SHARES 183 SHARES\nOn a normal day, you would have said Bollywood has failed to recognise a masterpiece like Sonchiriya because: (a) it didn't have A-listers, and (b) it didn't have the done-and-dusted, painfully overrated dramatic angle.\nI beg to differ.\nSmall-budget, content-driven movies did make it big last year. Case in point: Stree, Andhadhun, Badhaai Ho and Stree. Like Sonchiriya, these movies stood out because of their well-researched scripts, talented cast, a gripping plot and applaudable direction. And boy, were they appreciated! All those films entered the 100-crore bracket and how.\nSo, why didn’t Sonchiriya work out? Did box office really fail to recognise a great piece of work like that?\nWell, I have a theory and it’s going to hurt.\nNot every small-budget project is a Andhadhun or a Badhaai Ho. I am not saying, these films got 'lucky', but somewhere they did manage to produce content that was unconventional yet had an immediate connect with the audience in terms of Bollywood-approved twists, subtle romantic inclusions and tad dramatic cliches, only well scripted.\nHowever, Sonchiriya is as real as it gets. It's un-minced, brutal, and doesn't confirm with the obvious twists that we as audience land up anticipating. Set against the merciless land of Chambal, somewhere around the mid 70s, Sonchiriya is a dacoit drama with a hint of practicality.\nWe deserve quality films like #SonChiriya\nSo it's important that you go and see the film. Do it! — Vir Das (@thevirdas) March 3, 2019\nHere, the dacoits don't ride horses or kill without a cause or converse in crude language just for the heck of it. In fact, in Sonchariya, the dacoits have a conscience; the female lead (Bhumi Pednekar) is not just another helpless character but an extremely-empowered sketch of a woman battling out patriarchy; the practical re-imagination of a situation during Emergency and of course, the rugged look-and-feel of the cast and the landscape which in simple words, was believable sans the tiring exaggerations, which MAY have not worked for the audience at large.\nIt’s sad, but it’s true!\nSonchiriya\nDespite a stellar performance by Sushant, Manoj Bajpayee, Bhumi Pednekar and Ranvir Shorey, the film failed to garner the attention it deserved.\nDid we fail as an audience? Maybe!\nNot to forget, the incessant controversies, rumours and trolls the movie received, thanks to the so-called Twitterati who criticize almost everything under the sun without much context.\nHey, Sourav, I used to think like you, and ended up not getting work. So now I’ve decided to retweet like commercial celebrities. Please bear with me. पापी पेट का सवाल है। Thanks for watching! 🙏🏾 https://t.co/5HpE7DBkok — रanviर_ डhoरeय_ (@RanvirShorey) March 4, 2019\n#Sonchiriya flop bakwas movie he — Divyesh (@Divyesh64729660) March 4, 2019\n#Sonchiriya is heading towards being one of the Biggest DISASTERS ever and no one can stop it now says @Popdiarieslive #sonchiriyareview #SonchiriyaBoxOffice pic.twitter.com/90PszzHwKm — Karishma Mehra (@movies_fc123) March 5, 2019 What I feel is we, as consumers, really need to reconsider about what content we watch and promote. Because, Bollywood is showing it’s full potential right now, but we are failing miserably in showing our support at the ticket counter. Sonchiriya has the potential of being a timeless wonder. Indian cinema is evolving and taking massive risks with experimental scripts and contemporary talents, it's time we appreciate it before it is too late. If you agree, go ahead book your tickets here and let us know what's your take on the movie.", "title": "Why Good Movies Struggle To Make It Big On The Box Office?", "date_publish": "06/03/2019, 09:28:09", "description": "Good Indian cinema is a rarity, and even if they are made, they do not make the business they deserve on box office. Let me proof it to you. Did you hear about the movie, Sonchiriya, until Anurag Kashyap and Prakash Jha recently tweeted about it? You didn't right? Despite the fact, that the movie released a promising trailer on December 6.", "authors": ["Sneha Dey"], "url": "https://www.indiatimes.com/entertainment/bollywood/why-good-movies-struggle-to-make-it-big-on-the-box-office-363224.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/sonchiriya_1551800548_800x420.jpeg"}