{"text": "Will Smith Might've Just Dropped The First Sneak Peak Into #StudentOfTheYear2 In The Most Unique Way!\nWill Smith Might've Just Dropped The First Sneak Peak Into #StudentOfTheYear2 In The Most Unique Way!\nIf you follow Will Smith on his Instagram, you'd know that he has a passion for creating content for the internet. His commentary in the videos and a stellar team that follow him (creating those videos on the go) have led him to gain a steep rise in following on the social media platform.\nNow, imagine that mad energy and enthusiasm intersperses itself with shots of Bollywood and knowledge from the Ganges and the aarti, he attended.\nIf this seems vague to you, let us help you set the timeline here, straight:\n* Remember the time when Will Smith was getting a true taste of India, back in October,18?\nOr\n* Remember the whole exchange of nice words between Will Smith & Ranveer Singh when Gully Boy released and our man got praises on his performance all the way from Hollywood? ‘Salaam tumko bade bhai’\nWell, it seems like all that was a build up to THIS! For, what we have now, in the form of a whacked out 21min-ish documentary, is this episode where Will Smith travels to Haridwar, meets Ranveer Singh and ends up doing a cameo in Student Of The Year 2.\nSkip to 18:12 to see him perform on the famous(maybe a newer version) of Radha!\nIt has little(read a lot of) zing from apna Gully Boy Ranveer Singh and apt gyaan from sass kween, Karan Johar apart from a self-reflecting Will Smith.\nBollywood has seen full-blown songs from stars like Kylie Minogue, for Blue, Akon singing Chammak Chhallo for Ra.One and some unique cameos like Sylvester Stallone's in Heroine, but none that was announced so subtly and via the golden word of the internet - great content!\nDon't Miss 862 SHARES 346 SHARES 183 SHARES\nAlso Read: Will Smith Makes His Bollywood Debut, Shakes A Leg With Tiger Shroff For Student Of The Year 2", "title": "Will Smith Might've Just Dropped The First Sneak Peak Into #StudentOfTheYear2 In The Most Unique Way!", "date_publish": "04/04/2019, 11:59:27", "description": "If you follow Will Smith on his gram, you'd know that he has a passion for creating content for the internet. His commentary in the videos and a stellar team that follow him(creating those videos on the go) have led him to gain a steep rise in following on the social media platform.", "authors": ["Siddharth Aalambayan"], "url": "https://www.indiatimes.com/entertainment/will-smith-might-ve-just-dropped-the-first-sneak-peak-into-studentoftheyear2-in-the-most-unique-way-364840.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/will_smith_1554360216_800x420.jpg"}