{"text": "Winter Is Coming! Lovebirds PC - Nick Jonas Likely To Tie The Knot In Jodhpur This December\nWinter Is Coming! Lovebirds PC - Nick Jonas Likely To Tie The Knot In Jodhpur This December\nWhen will Priyanka Chopra and Nick Jonas get married? This is one of the most popular questions that everyone is asking. The couple who got engaged in October is all set to tie the knot.\nThe couple also visited Jodhpur last month that sparked the rumors of their destination wedding. And now, fresh reports claim that the couple that PC and Nick are indeed all set to tie the knot in December.\nAccording to a TOI report, the couple is planning a 3-day wedding function from 30th November to 2nd December in Jodhpur. Reports claim that it was Nick's decision to choose Jodhpur as their wedding destination.\nAgencies\nA few weeks ago, a media report quoted a source close to the couple as saying,\nInstagram/PC\nDon't Miss 161 SHARES 12.5 K SHARES 186 SHARES 161 SHARES 1.1 K SHARES\n“Nick and Priyanka were recently in India and had even gone to Jodhpur. That was when they decided the gorgeous Umaid Bhawan to be their dream wedding venue. They will have a limited guest list of 200 people with only their close friends and family in attendance. Since a lot of their Hollywood friends are settled in New York, PC is quite excited to have her bridal shower there followed by a grand wedding in Jodhpur”.\nIf we talk about PC's wedding lehenga, reports suggest that it would be designed by Abu Jani and Sandeep Khosla.\nAgencies\nWhile we wait for the official confirmation on the same, we are happy that another modern-day love story has found its happy ending!", "title": "Winter Is Coming! Lovebirds PC - Nick Jonas Likely To Tie The Knot In Jodhpur This December", "date_publish": "17/10/2018, 12:41:06", "description": "The couple also visited Jodhpur last month that sparked the rumors of their destination wedding. And now, fresh reports claim that the couple that PC and Nick are indeed all set to tie the knot in November. According to a TOI report, the couple is planning a 3-day wedding function from 30th November to 2nd December in Jodhpur. Reports claim that it was Nick's decision to choose Jodhpur as their we", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/winter-is-coming-lovebirds-pc-nick-jonas-likely-to-tie-the-knot-in-jodhpur-this-december-354930.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/nick_and_pc_1539757691_800x420.jpg"}