{"text": "Right now, everyone is talking about how fabulous and outstanding Vicky Kaushal’s Uri is. But apart from Vicky, there is another actor’s work which is also being appreciated and applauded, and it is none other than Yami Gautam.\nThe actress who made a debut with Vicky Donor has made some bad choices like Sanam Re, but today she is in a good space. Yami is extremely happy after Uri worked in her favor.\nIndiatimes met the actress and had a heart to heart conversation with her. Firstly she began with the interview expressing her happiness over Uri’s success, “I knew it’s a good film, we knew we are a part of something big; you get to know the energy of the film from day one.”\nDon't Miss 233 SHARES 870 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES\nYami who plays the role of an intelligence officer, shared an anecdote, “ We had an army screening, and one army officer walked to me and said, ‘Mam you are absolutely believable as an intelligent officer, that’s how our female officers are in the department,’ well, this is a true validation for me.”\nInstagram\nWe asked if she feels Uri will be a game changer for her and she said, “ I want to do films where I have something substantial to do, and I am hoping there will be more such exciting roles coming up to me, I am very thankful to Aditya (director of Uri) to look beyond the stereotypical banner. I have been given the tag of girl next door, very sweet and beautiful girl who does love stories, I don’t want any image, but if it all I am called the quintessential girl next door, because despite that Aditya saw me beyond that image and gave me Uri, which is a very different dimension.”\nTwitter\nShe further added,\n“ I am hoping some very strong and powerful roles come my way. I am not restricted to any genre, especially in today’s times, I would love to be a part of something which are not replaceable which you don’t think, so and so could have done it. I want to do a role where I can be irreplaceable, I want to do justice with every role. And with every role you still feel you are proving yourself, especially being an outsider, it’s not easy to get good roles, it’s not easy to get work which resonates from the kind of work you want to do.\"\nOn doing lesser films, Yami defended herself saying she doesn’t want to do films just for the sake of it, “ I don’t believe in working on something which I don’t have my heart in, it’s very unfair. I am not saying every film of mine has done well, there are films which haven’t done well, but there must be a reason behind signing it, so I will never disrespect that decision.”\nInstagram\nHowever she admitted there have been failures in her career and she doesn’t disrespect that,\n\"There could be some films where you watch and feel this is not something you wanted to do, because when you see a film in totality, you get to know what’s the problem. I won’t take the names of those films, but I have felt that it could have been something else, but that time, it’s a vision of the director and I can’t do anything about it, I have to believe in that vision, but that’s fine, cinema is the director’s vision.”\nInstagram\nYami even highlighted why it gets difficult for an outsider to survive,\n“ Why I say it is difficult for an outsider because when your film does well, there are broader options for you and if your film doesn’t do well, then it gets difficult and you have to make the best choice out of what is offered. “\nInstagram\nBollywood is becoming more and more competitive, there are new talents coming every day, we asked Yami how insecure or secure she is, seeing this rapid change,\n\"You are right there are lots of competition, I will put it as contemporaries, there is a lot of talent, they all look good, they all are fit, polished and groomed. When we came, we weren’t like this, I look back at those bad pictures of mine and say what was I thinking, but that also has its own novelty and charm. I don’t feel insecurity is a healthy emotion. Also it’s human to get bogged down for a second on what’s happening around you, but you have to immediately pull up yourself and tell yourself that you are here for a reason, believe in that and go with your gut. I will never be successful if I get affected by others success and good work. I really feel it’s important to be happy in life.”\nInstagram\nShe even spoke about her life in Mumbai\n\"Life in Bombay any which ways is very fast, you don’t even get to know, 'kab subah hui aur kab shaam', so when will you get time to enjoy for yourself, I am not trying to be philosophical, I am just trying to say that it’s very important to have a healthy mind because this is a very exhausting place, and it can really consume you if you don’t have your mind under control and then you won’t be able to make a right decisions out of an insecure mind.”\nInstagram\nBut Yami has a stress buster in her family, “When my family is in Bombay, it’s a party for me and when they are not there, I watch my favorite shows, like Friends, no matter if I have watched it for 1000 times, I will laugh on the same jokes, I will watch Andaz Apna Apna, that’s my favourite film, I do anything that makes me happy, or I will cook some dessert, cooking is very therapeutic for me.”\nInstagram\nWe concluded the interview by asking her favourite film in recent times and she said, “I would love to do a female version of Andhadhun”. Clearly, Ayushmaan Khurrana is giving his co-stars some major role goals.", "title": "With Uri’s Success, Yami Gautam Is Hopeful To Get Powerful Roles And Become Irreplaceable", "date_publish": "15/01/2019, 16:27:18", "description": "The actress who made a debut with a film like Vicky Donor has made some bad choices like Sanam Re, but today is in a good space. Yami is extremely happy with Uri working in her favor. Indiatimes met the actress and had a heart to heart conversation, Firstly she began with the interview expressing her happiness of Uri’s success, she said, “I knew it’s a good film, we knew we are a part of somethin", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/with-uri-s-success-yami-gautam-is-hopeful-to-get-powerful-roles-and-become-irreplaceable-360464.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/yami_gautam_1547552626_800x420.jpg"}