{"text": "Vivek Oberoi has been in news ever since the trailer of his upcoming movie Prime Minister Narendra Modi dropped. The actor has faced a lot of criticism from the social media as the trailer screams Modi Ji ki 'Jai Ho', many called him Modi Bhakt but he proudly says he is his fan and that he inspires him.\nTwitter\nVivek fought all the backlashes and criticism by standing tall and enforcing that he is still here and unbreakable. The film on Modi biopic was supposed to release tomorrow (April 11) which has now been delayed by Election Commission as it might influence the voters in upcoming elections. The internet welcomed this ban with arms wide opne while the actor is definitely upset.\nTwitter\nIndiatimes got in touch with a few trade analysts only to know how this will affect Vivek’s career, to which one said that he had nothing to do and tried to gain publicity with this film and while others said if he has done a fair job his career will have a kick start.\nDon't Miss 638 SHARES 182 SHARES 175 SHARES 6.8 K SHARES\nTalking to Indiatimes, trade analyst Komal Nahta said, “I don’t think anybody’s career can be made or marred by one film. The film has been delayed now, and the business depends on the elections, if the election will be pro BJP then the film will do wonders and if not then the world knows what will happen with that film”.\nWhile Raja Sen, another trade analyst said, “I think his career will proceed as it has been, end of the day directly on the paper it looked like a very tacky and badly made film, but it gained a lot of publicity because of the controversy, and it only helped it. If it is a good film and Vivek is good, it will get appreciated anyway after the elections.\"\nTwitter\nAmod Mehra, the trade expert had a different opinion about the film and the country on the whole, “Banning the film is childish. The film is made, it will release, but on the whole, nobody is bothered about the country, they all are here to earn quick bucks and fame. Even Vivek Oberoi had nothing in his hand, so he tried to gain as much publicity as he can, but this statement is not helping him, whether he is a Modi Bhakt or not, he said he is a Modi fan, now there is no difference between it.”\nTwitter\nWell, only time will tell if this film will kick start Vivek Oberoi’s career or not? Do tell us your thoughts on what will happen to Vivek ’s career as Modi biopic is been stalled in the comment box below.", "title": "With Modi Biopic Being Stalled, What Lies Ahead For Vivek Oberoi? Trade Analysts Share Insights", "date_publish": "11/04/2019, 12:34:38", "description": "Amod Mehra, the trade expert had a different opinion about the film and the country on the whole, “Banning the film is childish, the film is made it will release, but on the whole, nobody is bothered about the country, they all are here to earn quick bucks and fame. Even Vivek Oberoi had nothing in his hand, so he tried to gain as much publicity he can, but this statement is not helping him, he wa", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/with-modi-biopic-being-stalled-what-lies-ahead-for-vivek-oberoi-trade-analysts-share-insights-365234.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/vivek_oberoi_1554968036_800x420.jpg"}