{"text": "With Grand Sets & Intense Emotions In 'Kalank', Is Karan Johar Trying To Follow In Sanjay Leela Bhansali's Footsteps?\nWith Grand Sets & Intense Emotions In 'Kalank', Is Karan Johar Trying To Follow In Sanjay Leela Bhansali's Footsteps?\nHe is a genius and a master of his art. Sanjay Leela Bhansali's films are an extravagant visual feast. Adjectives would fall short to describe such larger than life movies. From Devdas to Bajirao Mastani, his movies are nothing short of poetic experiences. He has an impeccable eye for details. From palatial sets to elaborate costumes, he is a master of storytelling.\nOn the other hand, Karan Johar is known for masala entertainers. While his films always have a happy ending, SLB’s movies end on a sad note. KJo is known for his multi-starrer movies. He once even said that he fears what if his films stop working, and so he chooses to rope in many stars. Perhaps, he thinks the star-power works.\nTOI\nWhen the teaser of his upcoming movie – again a multi-starrer – was released, it had everything but the Karan Johar feels. Is Karan Johar trying to break into the grandeur and charm of Sanjay Leela Bhansali, everyone is asking.\nDon't Miss 544 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n#1\n#2\n#3\n#4\n#5\nWatch the teaser and decide for yourself.\nAnd after watching the teaser, everyone has the same question.\nAre you sure it's not a Sanjay Leela Bhansali movie?#KalankTeaserhttps://t.co/9nCD4d87eU — Shubham Verma (@ashubhguy) March 12, 2019\n#Kalank looks like a sanjay leela bhansali style movie! Beautiful visuals, a huge star cast! #KalankTeaser — Harnoor Singh (@hrnurtweets) March 12, 2019\nKaran Johar pulls a Sanjay Leela Bhansali with his upcoming movie KALANk. The much anticipated teaser of the Varun Dhawan, Alia Bhatt, Sanjay Dutt, Madhuri Dixit, Aditya Roy Kapur & Sonakshi Sinha starrer period love tale is out.#Kalank #entnetwrk #sanjayleelabhansali #karanjohar pic.twitter.com/tNcEjncHfA — Ent Netwrk (@entnetwrk) March 12, 2019\nLooks amazing... teater like another Sanjay Leela Bhansali’s creation but not.. supposedly Sridevi but now Madhuri... although not a fan of Varun but cant wait... #Kalank pic.twitter.com/o6rvPhBTST — Ms Lissa 🌺 (@Mell_Lissa94) March 12, 2019\nKalank trailer looks like KJo trying a Sanjay Leela Bhansali — Sanyukta (@dharm_adhikari) March 12, 2019\n#Kalank teaser is filled with all the unused footage from Sanjay Leela Bhansali films. There, I said it. — simran (@simrankanal) March 12, 2019\nPeople comparing #KalankTeaser with Padmaavat / Bajirao Mastani/ Sanjay Leela Bhansali's Vision are itself biggest Kalank in this world. — Sidharth♡Malhotra (@Sidforever) March 13, 2019\nKalank tried too hard to create Sanjay leela Bhansali’s aura — childish bambino (@Ronakrebel) March 12, 2019\n#Kalank references/copies Sanjay Leela Bhansali’s patent aesthetic. It’s a fact, this is not an argument. Fans need to understand that. The similarities are way too much.. — Sharad (@OmgSharad) March 13, 2019\nWhat’s more interesting is that Kalank is directed by Abhishek Varman, a man who is a great fan of Sanjay Leela Bhansali films. In fact, he has assisted Sanjay Leela Bhansali on several films as well, according to a DNA report.\nSome people feel even the poster is copied!\n#KALANK is a Om Jai Jagdish retelling by Sanjay Leela Bhansali pic.twitter.com/hust7AAdZc — Ek tarfa pyaar (@awwwnchal) March 12, 2019\nWhat's more? To some people, the background score reminded them of Game of Thrones.\n#Kalank BGM sounded like one of the Scores from GOT .\nNo wonder everyone is liking it :P — A r n a V (@Being_arnav_) March 12, 2019\nSome even feel that the background score has been borrowed from popular TV series Flash!\nYe #KalankTeaser me The Flash ka BGM daal diya hai Indian version bana kar — Rishabh Srivastava (@AskRishabh) March 12, 2019\nWe know it's too early to decide. It's just a teaser. According to Karan Johar, Kalank is a “story of turbulent relationships and eternal love”.\nMeanwhile, tell us what you think about Kalank teaser in the comments section below!", "title": "With Grand Sets & Intense Emotions, Is Karan Johar Trying To Copy Sanjay Bhansali?", "date_publish": "13/03/2019, 17:55:01", "description": "When the teaser of his upcoming movie – again a multi-starrer – was released, it had everything but the Karan Johar feels. Is Karan Johar trying to break into the grandeur and charm of Sanjay Leela Bhansali, every one is asking. What’s more interesting is that Kalank is directed by Abhishek Varman, a man who is a great fan of Sanjay Leela Bhansali films. What’s more? He has assisted Sanjay Leela B", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/with-grand-sets-intense-emotions-in-kalank-is-karan-johar-trying-to-follow-in-sanjay-leela-bhansali-s-footsteps-363657.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/is_kjo_trying_to_copy_sanjay_bhansali_kalank_looks_like_a_rip_off_of_ace_filmmakers_movies_1552474821_800x420.png"}