{"text": "PARTNER\nDisney has had us all, children and adults alike, captivated with their iconic princesses. They have had an impact, and influence on everyone who watched them growing up. And who wouldn't love them? They are everything that's whimsical, magical and beautiful in the Disney world. So of course, when we came across this selfie of our favourite princesses, we got super excited!\nDisney\nSo after some research, we found out upcoming movie Ralph Breaks The Internet will give us an opportunity to see all the Disney Princess interact with each other! There is going to be a scene where the canon of Disney princesses in going to reunite for the very first time. And the fun doesn't stop there! With the full power of Disney behind the move, just about everyone who’s still with us is going to reprise their roles! Which means that we will see the return of all of the original voice actresses, except Snow White, Cinderella, and Aurora.\nDisney\nThe royal reunion includes Irene Bedard (“Pocahontas”), Kristen Bell (Anna in “Frozen”), Jodi Benson (Ariel in “The Little Mermaid”), Auli’i Cravalho (“Moana”), Linda Larkin (Jasmine in “Aladdin”), Kelly Macdonald (Merida in “Brave”), Idina Menzel (Elsa in “Frozen”), Mandy Moore (Rapunzel in “Tangled”), Paige O’Hara (Belle in “Beauty and the Beast”), Anika Noni Rose (Tiana in “The Princess and the Frog”) and Ming-Na Wen (“Mulan”).\nIn Ralph Breaks The Internet, Video-game bad guy Ralph (John C. Reilly) and best friend Vanellope (Sarah Silverman) leave the comforts of Litwak’s arcade in an attempt to save her game. Watch the trailer:\nWill Ralph and Vanellope be able to fulfill their quest and save her game? With Vanellope wholeheartedly embracing the world wide web (WORDPLAY, GUYS), will Ralph lose the only friend he’s ever had? Book your tickets here and find out for yourself today!", "title": "With 14 Disney Princesses Coming Together For A Epic Selfie, Disney Movie 'Ralph Breaks The Internet' Is Literally Breaking The Internet", "date_publish": "23/11/2018, 13:53:50", "description": "Disney has had us all, children and adults alike, captivated with their iconic princesses. They have had an impact, and influence on everyone who watched them growing up. And who wouldn't love them? They are everything that's whimsical, magical and beautiful in the Disney world. So of course, when we came across this selfie of our favourite princesses, we got super excited!", "authors": [], "url": "https://www.indiatimes.com/entertainment/with-14-disney-princesses-coming-together-for-a-epic-selfie-disney-movie-ralph-breaks-the-internet-is-literally-breaking-the-internet-357182.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/disney_1542882297_800x420.jpg"}