{"text": "With No Filmy Background To Boast About, Anushka Sharma Has Made It All On Her Own & It's Commendable!\nWith No Filmy Background To Boast About, Anushka Sharma Has Made It All On Her Own & It's Commendable!\nThere are lots of outsiders who made it big in Bollywood and proved that you don’t need a filmy family to become successful in the film industry. Anushka Sharma is one of them. The Zero actress is proud of what she has achieved and so are we.\nAnushka got candid with the media where she spoke her heart out on almost everything. Films, failures, achievements, future plans and everything in between.\nTwitter\n#Being Nervous After The Completion of Film Is Mindless Thinking\nTo begin with, she was asked if she is nervous about the release of her film Zero, she said, “ I am not nervous, I feel nervous when I generally begin my work on it, like before shooting for Zero I was extremely nervous on whether I can pull of my character or not. But now I am not because I have done it with the best of my ability, and so I don’t want to do mindless thinking.\"\nDon't Miss 3.5 K SHARES 518 SHARES 235 SHARES\n#Don’t Take Baggage Of Failure On Another Film\nAnushka was informed how SRK admitted he did a mistake choosing Jab Harry Met Sejal and does she feel the same and how careful was she on choosing another film after the failure, to which she said, \"I don’t take baggage of another film and go forward; it’s a different team and story I am working with, so I genuinely don’t feel that way. When you take baggage of success or failure on to the next film it doesn’t work. When you take baggage of a successful film on another film you become complacent and when you take baggage of a bad film on your another film you become fearful and bring a lot of bad energy to your work and even for others on set.”\nInstagram\n#Take Challenging Roles Because That Keeps Me Going\nAnushka speaks on why she loves doing challenging roles, “I take challenging films because otherwise I get bored, if I am not doing something which excites me then I get really bored, I want to reinvent myself with every film and I feel it’s important for me. And this year has been high on performances for me, with Pari, Sui Dhaaga and Zero. It’s good take up something which is not easy for you and then, when you pull it off it’s a sense of accomplishment.”\nInstagram\n#Will Not Do Just A Glamours Role & Have Nothing To Do In It\nAnushka said she will never pick a glamours role and do nothing in it, “ Of course I will do glamours role, but I should be happy with the role too, I should know na ki mai kuch kar rahi hu, I don’t want to do a role in which I don’t have anything to contribute to, I have not done that ever. Right from my first film, I have done a role where it required me to perform, and that’s very important for me, I can’t just do a role to look glamours. I am glamorous anyway.”\n#Anuhska Talks About The Most Challenging Roles In Her Career\n\"Every role challenges you in a different way, for example Sui Dhaaga, I could not rely on my instincts and react, I had to think so much about how that character must be feeling and then react on it. You have to really change your thought process for it. Mamta’s character was totally opposite of me, similarly with Pari, to become so messed up in your head, and you are not even human ,you are half demonic, so where do I get the reference from? Even Sultan had it's own set of challenges. \"\n#Achieved It On My Own Had No Film Background\nThe actress is super proud of her achievements , “I am very happy with the way things are moving forward. You have to understand that I was very young when I started my own production house, I want to really credit myself for having done what I dreamt off and achieved it on my own. I don’t come from a filmy background, so I have done it all on my own with my brother and it’s a big thing. I take a lot of pride in what I am doing.”\n#Not An Insecure Actor\n\"I am not insecure as an actor. Whenever I suggest something it’s not out of greed that my character or role will become nice or strong, I think on the whole because I am a producer too, and that is why maybe I have worked with best of directors.\"\nInstagram\n#Was Working Even Two Days Before My Wedding\n\"When I am acting in a film which I am producing, it automatically takes double my time. Also I am an entrepreneur, I have my clothing line and I genuinely look into it. I had a very chaotic last year, in fact I was working before last 2 days of my marriage and after that I took a week off for my wedding, I came aback and started shooting for Sui Dhaaga. So, it’s been mentally exhausting for me. Before I start anything new I want to get prepared for it. I don't want to burn out.\"\nInstagram\nMs Sharma is clearly an inspiration for all.", "title": "Anushka Sharma Is Proud Of Her Achievements As She Is An Outsider & Had No Filmy Background", "date_publish": "29/11/2018, 18:09:44", "description": "There are lots of outsiders who have made it big in Bollywood and proved you don’t need a filmy family to become successful in the film industry and Anushka Sharma is one of them. The Zero actress is proud of what she has achieved and so are we. Anushka got candid with the media where she spoke her heart out on almost everything. Films, failures, achievements and future plans.", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/with-no-filmy-background-to-boast-about-anushka-sharma-has-made-it-all-on-her-own-it-s-commendable-357603.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/anushka_1543495089_800x420.jpg"}