{"text": "Woman Who Accused Vikas Bahl Of Sexual Harassment Won't Pursue Case, Says She's Had Enough\nWoman Who Accused Vikas Bahl Of Sexual Harassment Won't Pursue Case, Says She's Had Enough\nHe must have made a film on woman empowerment but irony died a brutal death when a woman accused Queen director of sexually harassing her. Sharing her #MeToo, the woman reported how Vikas came to her room and later passed out on her bed pretending to be drunk.\nIn her allegations, she added that Vikas Bahl then masturbated on her. After these allegations and amid #MeToo movement picking up like wildfire in India, he was suspended from Super 30 and had to let go of a project with Amazon.\nAfter the accusations, Anurag Kashyap tweeted on social media how they're now dissolving their production company Phantom films. Vikas Bahl filed a defamation suit worth Rs 10 crores against his former partners Vikramaditya Motwane, Madhu Mantena and Anurag Kashyap for running an orchestrated smear campaign against him.\nWhile the case was being held in the Court, the woman who accused Bahal has reportedly refused to depose before the Judge.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nAgency reports claim that her lawyer read out a statement that said,\n\"I have had enough and I am still suffering at the hands of this man even after three years. I do not want to be involved in litigation so will not file an affidavit. Will only put out a statement.\"\nBut the woman admitted that whatever was reported in the Huffington Post was true. SJ Kathawalla presided over the hearing. Navroz Seervai, the victim's counsel said she did not wish to take the legal route against Vikas. Bahl is yet to make a statement on this.", "title": "Woman Who Accused Vikas Bahl Of Sexual Harassment Won't Pursue Case, Says She's Had Enough", "date_publish": "20/10/2018, 13:22:47", "description": "While the case was being held in the Court, the woman who accused Bahal has reportedly refused to depose before the Judge. Agency reports claim that her lawyer read out a statement that said, \"I have had enough and I am still suffering at the hands of this man even after three years. I do not want to be involved in litigation so will not file an affidavit. Will only put out a statement.\"", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/woman-who-accused-vikas-bahl-of-sexual-harassment-won-t-pursue-case-says-she-s-had-enough-355124.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/vikas_bahl_1540022137_800x420.jpg"}