{"text": "1. 21-Year-Old Woman Cried Uncontrollably After Watching Avengers: Endgame, Was Rushed To Hospital\nAfter watching the surprise and dramatic end to the Avengers: Endgame, this woman reportedly named Xiaoli, began to hyperventilate. So much so, that she was facing difficulty while breathing, her hands and feet were numb, and she couldn’t even stretch out her fingers. She was rushed to the hospital immediately.\n2. Tahira Kashyap Pens A Powerful Note On Self-Love & Acceptance During Cancer & It’s A Must Read!\n3. What’s Next After Avengers: Endgame? Here Are 7 Upcoming Marvel Movies To Watch Out For\nAvengers Endgame sure marks the end of an era, but it also marks the beginning of a new one. In Marvel Cinematic Universe phase 4 movies, new superheroes and teams will grace the silver screen.\n4. These Three Characters Will Most Likely Meet Their End In Game Of Thrones Season 8 Episode 3\nDon't Miss 2.5 K SHARES 1.7 K SHARES 1 K SHARES\nAs per bets on Sportsbetting.ag, which is online sports betting site, chances of Theon Greyjoy dying in episode 3 are the highest. Bets put 4-to-1 odds on him dying first.\n5. Man Gets Beaten Up Outside Theatre In Hong Kong For Shouting 'Avengers: Endgame' Spoilers\nAccording to reports, this man shouted spoilers, the movie’s ending in particular, to the fans who were walking in the queue to the theatre. This led to a violent outburst.", "title": "Woman Hospitalised After Watching Avengers, Tahira's Note About Self-Love & More From Ent", "date_publish": "28/04/2019, 18:50:59", "description": "From crazy fandom for Avengers Endgame to Tahira Kashyap opening about self-love and acceptance during cancer, here is all that rocked the world of entertainment. Suffering from cancer is almost like a close encounter with death. Lucky are the ones who win the battle. And once you survive, your perspective towards life changes – for good.", "authors": [], "url": "https://www.indiatimes.com/entertainment/woman-hospitalised-after-watching-avengers-tahira-s-note-about-self-love-more-from-ent-366241.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/woman_hospitalised_after_watching_endgame_tahira_writes_about_selflove__more_from_ent_1556452514_800x420.png"}