{"text": "The #MeToo movement in India is not fizzling out anytime soon. A Chennai-based woman artiste has accused actress Maya S Krishnan, who is part of top actor Rajinikanth's upcoming movie 2.0, of sexually harassing her.\nKrishnan has refuted the allegations. This is the second such instance in which a woman has been named, and first from Tamil Nadu with the campaign surging ahead.\nChennai-based theatre artiste Ananya Ramaprasad in a Facebook post said, \"I am a victim of sexual, mental and emotional manipulation, abuse, and most horrifically, gas-lighting, all at the hands of my abuser, Maya S Krishnan.\"\nrepresentational image\nOn her Facebook page, Krishnan, however, refuted the allegations and said she was trying to help and ready to face legal proceedings.\n\"I deny all the allegations mentioned in the post.... Considering her to be a child was a mistake, I will not repeat that anymore,\" said Krishnan, who is part of actor Vikram's upcoming film 'Dhruva Natchathiram.'\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nLast month, popular comedienne Kaneez Surka accused fellow comic Aditi Mittal of \"forcibly kissing\" her on the mouth two years ago at a comedy show.\nMittal has issued an unconditional apology. Popular singer Chinmayi Sripaada recently levelled allegations of sexual harassment against lyricist Vairamuthu, who has refuted it.\nThe Indian version of the movement in entertainment, media and film industry started after actress Tanushree Dutta levelled sexual harassment charges against veteran actor Nana Patekar.\nInputs From PTI", "title": "Woman Artiste Accuses Rajinikanth’s Female Co-Star In 2.0 Of Sexual Harassment", "date_publish": "02/11/2018, 11:05:47", "description": "As the #Metoo movement gathers pace, a Chennai-based woman artiste has accused actress Maya S Krishnan, who is part of top actor Rajinikanth's upcoming movie 2.0, of sexually harassing her. Krishnan has refuted the allegations. This is the second such instance in which a woman has been named, and first from Tamil Nadu with the campaign surging ahead. Chennai-based theatre artiste Ananya Ramaprasad", "authors": [], "url": "https://www.indiatimes.com/entertainment/woman-artiste-accuses-rajinikanth-s-female-co-star-in-2-0-of-sexual-harassment-355903.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/woman_accuses_rajinikanths_female_co_star_in_20_1541138753_800x420.jpg"}