{"text": "Women Come Out To Tell Their #MeToo Stories And More From The World Of Entertainment\nWomen Come Out To Tell Their #MeToo Stories And More From The World Of Entertainment\nOnce again, talking about the incident to Bollywood Hungama, Chitrangda Singh said that Nawazuddin Siddiqui didn’t take a stand for her. She said instead of extending support to her, he waited for the storm to blow over.\nPooja Misrra has claimed Salman Khan, Arbaaz and Sohail raped her on multiple occasions. She also said that Shatrughan Sinha hacked her phone and laptop to steal her creative ideas, which were used to lift up Sonakshi Sinha and Malaika Arora Khan’s career. She claimed that the veteran actor used black magic on her, and that she is being haunted by ghosts since then.\nDon't Miss 174 SHARES 122 SHARES 193 SHARES\nTalking about #MeToo movement in India, Sushmita said, “It’s just the beginning. We need to listen and believe. You have to understand the simple truth that when one person blames another, you may question it. But when 50 people blame the same person, there must be some truth to it. You should listen to people and give them a fair hearing; justice will prevail. Well done, women and men who are supporting the movement. It’s about time.”\nIn his letter, he wrote, \"Last week has been a whirlwind of sorts in my life. Amidst the distress and confusion, I have discovered the kind solidarity of many strangers. I was at the receiving end of an anonymous allegation that I know and can prove to be false. In the macro perspective, the wave is bigger and way more important than my isolated small case. Centuries of patriarchy and oppression have created a system that cannot be taken down through polite means.\"\nShe shared the picture with a sweet caption. She wrote, “Was a little low and lonely as @goldiebehl had left for Mumbai… thank you @priyankachopra for lifting my spirits! #AGirlsDayOutIsLikeChickenSoupForTheSoul @sophiet @danasupnick @mimi”\nBut it looks like Sonali is not just fond of Priyanka Chopra but her pet Diana has become her favorite too.", "title": "Women Come Out To Tell Their #MeToo Stories And More From The World Of Entertainment", "date_publish": "16/10/2018, 16:48:17", "description": "Chitrangada Singh Shares Her #MeToo Story, Says Nawazuddin Didn’t Take A Stand For Her When She Was Harassed 2 Years Ago Chitrangada Singh Says Nawazuddin Siddiqui Didnâ\u0080\u0099t Take A Stand For Her When She Was Harassed Once again, talking about the incident to Bollywood Hungama, Chitrangda Singh said that Nawazuddin Siddiqui didn’t take a stand for her. She said instead of extending support to her, h", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/women-come-out-to-tell-their-metoo-stories-and-more-from-the-world-of-entertainment-354905.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Oct/trending_1539688843_800x420.jpg"}