{"text": "Wore More Makeup For This Film Than Entire Film Career, Says Akshay Kumar On '2.0'\nWore More Makeup For This Film Than Entire Film Career, Says Akshay Kumar On '2.0'\nAkshay Kumar is one actor who never stops experimenting. Versatility could clearly be his middle name. Today, the actor was present in Chennai to unveil the trailer of his upcoming film.\nTalking to media, he said that his role in forthcoming multilingual science-fiction action drama \"2.0\" demanded him to wear more make-up than what he had worn in his entire career.\nAkshay plays the antagonist in superstar Rajinikanth's \"2.0\", which marks his southern debut. Speaking at the trailer launch event, Akshay said working on the project has been both challenging and fun.\nscreen grab/youtube\nAkshay began his speech in Tamil amid a loud cheer from the audiences. He said he practiced for two hours to speak in Tamil. Quickly switching to English, Akshay said: \"I can't express my feelings in words. I'm really thankful to Shankar sir and Lyca Productions for this opportunity.\"\nTalking about his role, he said, \"It was a very challenging role and it took a toll on my body. But the pain and sacrifice was worth it. My character required around 4 hours of prosthetic make-up and another hour and a half to remove it. In my whole career, I've never put so much of make-up.\"\nscreen grab/youtube\nDon't Miss 814 SHARES 1.2 K SHARES 18.3 K SHARES 9.8 K SHARES 12.5 K SHARES\nThe film, slated to release on November 29, in Tamil, Hindi and Telugu, also stars Amy Jackson, Adil Hussain and Sudhanshu Pandey in key roles.\nInputs From IANS", "title": "Wore More Makeup For This Film Than Entire Film Career, Says Akshay Kumar On '2.0'", "date_publish": "03/11/2018, 15:06:52", "description": "Akshay plays the antagonist in superstar Rajinikanth's \"2.0\", which marks his southern debut. Speaking at the trailer launch event here, Akshay said working on the project has been both challenging and fun. Speaking at the trailer launch event here, Akshay said working on the project has been both challenging and fun.", "authors": [], "url": "https://www.indiatimes.com/entertainment/wore-more-makeup-for-this-film-than-entire-film-career-says-akshay-kumar-on-2-0-355981.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/akshay_kumar_1541239140_800x420.jpg"}