{"text": "Yami Gautam Becomes Goodwill Leader For Super Sniffers Campaign, Pledges To Combat Wildlife Crimes\nYami Gautam Becomes Goodwill Leader For Super Sniffers Campaign, Pledges To Combat Wildlife Crimes\nNot long ago, a male Rhino was found dead with his horn removed at the Kaziranga National Park. Ruthless poaching has been happening in the National park for a long time. This was the sixth case that came to limelight.\nAmid this, Bollywood actress Yami Gautam has been named as the brand ambassador for TRAFFIC and WWF-India’s wildlife sniffer dog Super Sniffer Programme.\nAFP\nAs part of the campaign, a band of specially trained dogs, who with their handlers and the forest department, will combat wildlife crime by helping collect concrete evidence against wildlife poachers and smugglers.\nThe Vicky Donor actress on Sunday also attended the graduation ceremony of the seventh batch of the wildlife sniffer dog squad at the BSF's National Training Centre for Dogs here.\nbccl\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n\"Wildlife poaching is a serious issue. A more organised way and tactics are needed. That's exactly what Super Sniffers programme does by training these amazing dogs who are trained to expose such activities with training that's given to them,\" Yami said in a statement.\nIllegal trade of animal, animal skin and body parts is truly concerning and it needs to be addressed,\" she added.\nInputs From IANS", "title": "Yami Gautam Becomes Goodwill Leader For Super Sniffers Campaign, Pledges To Combat Wildlife Crimes", "date_publish": "17/12/2018, 17:30:00", "description": "Amid this, Bollywood actress Yami Gautam has been named as the brand ambassador for TRAFFIC and WWF-India’s wildlife sniffer dog Super Sniffer Programme. Not long ago, a male Rhino was found dead with his horn removed at the Kaziranga National Park. Ruthless poaching has been happening in the National park since a long time. This was the sixth case that came to limelight.", "authors": [], "url": "https://www.indiatimes.com/entertainment/yami-gautam-becomes-goodwill-leader-for-super-sniffers-campaign-pledges-to-combat-wildlife-crimes-358759.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/yami_gautam_becomes_goodwill_leader_for_super_sniffers_campaign_pledges_to_combat_wildlife_crimes_1545045561_800x420.jpg"}