{"text": "The Bhavnani's and the Padukone's are currently in Italy, rejoicing the union of two of the most special people in their lives. Ranveer Singh and Deepika Padukone tied the knot in Italy and every bit of their wedding was like a chapter straight out of a fairy tale.\nWhile no one from Bollywood could make a cut in their guest-list, their wedding was exactly how it should have been about them and their family. If we talk about family, just like Ranveer, who is popular for being an enthu-cutlet, looks like his Dad Jagjit Singh Bhavnani is also as filmy as his son!\nAccording to an Instagram story posted on social media, Ranveer's Stylist revealed a sweet thing to the world. She wrote,\n\"Presenting the newly minted Mrs & Mr. Ranveer Singh Bhavnani!!\" She also added, \"In the words of Mr. Bhavnani Sr today, yeh deewani toh Bhavnani ho gayi!\"\nWell, this was Mr. Bhavnani's way of welcoming Deepika into their world but it was sure was an epic one.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nIn just a few minutes of Nitasha's story, people started talking about it and how this comment is as apt as it could get.\n\"Yeh Deewani toh Bhavnani ho gayi \"- Jugjeet Singh Bhavnani pic.twitter.com/zIGP3grqwi — Venus #Ladkiwale (@TheSecondPlanet) November 15, 2018\nConsidering how Ranveer-Deepika's love blossomed and then grew on the sets of their next film Bajirao Mastani, this was an absolutely special filmy ode to the couple.", "title": "'Yeh Deewani Toh Bhavnani Ho Gayi', Ranveer's Dad Coins A Special Phrase To Welcome Deepika!", "date_publish": "16/11/2018, 11:16:48", "description": "While no one from Bollywood could make a cut in their guest-list, their wedding was exactly how it should have been about them and their family. If we talk about family, just like Ranveer, who is popular for being an enthu-cutlet, looks like his Dad Jagjit Singh Bhavnani is also as filmy as his son!", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/yeh-deewani-toh-bhavnani-ho-gayi-ranveer-s-dad-coins-a-special-phrase-to-welcome-deepika-356775.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/deepika_and_ranveer_1542348203_800x420.jpg"}