{"text": "Yo Yo Honey Singh Is Back & How! His New Video Song Makhna Is Now The Top Trend On YouTube\nYo Yo Honey Singh Is Back & How! His New Video Song Makhna Is Now The Top Trend On YouTube\nThe wait is over! Finally, Yo Yo Honey Singh is back in a video song and fans are jumping with joy already.\nAfter making a comeback with Sonu Ke Titu Ki Sweety songs, which were recreations including Dil Chori, and also, Shahid Kapoor starrer Urvashi, Yo Yo Honey Singh is back with a single titled Makhna, and this time, he has featured in the song too.\nAfter going through a rehabilitation phase, Honey Singh made a comeback with what he does the best. Catchy tunes and foot-tapping music that leaves you grooving -- no matter what the lyrics are, you’ll still be dancing to the tunes of Makhna.\n“Tu hai jaanti mein hu shikaari\nTujhe kha jaaunga saari ki saari”\n“Sab baith ke kare chill\nPar main hoon womanizer\nMujhe akele mein mat mill”\nWith these lyrics, Makhna is trending #1 trend on Youtube. People apparently love Honey Singh’s comeback in a little bulky, long hair and bearded look!\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nDid you know, Yo Yo Honey Singh, who has so far worked with superstars of Bollywood, has launched four new talents in this one -- Singhsta, Sean, Alistair and Pinaki? These singers who’ve earlier sung Punjabi songs were trained for 10 months before their big launch, it is said.", "title": "Yo Yo Honey Singh Is Back & How! His New Video Song Makhna Is Now The Top Trend On YouTube", "date_publish": "23/12/2018, 13:44:56", "description": "After going through a rehabilitation phase, Honey Singh made a comeback with what he does the best. The song title Makhna with these lyrics is trending #1 trend on Youtube. People apparently love Honey Singh’s comeback in a little bulky, long hair and bearded look.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/yo-yo-honey-singh-is-back-how-his-new-video-song-makhna-is-now-the-top-trend-on-youtube-359120.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/yo_yo_honey_singh_is_back__how_his_new_video_song_makhna_is_the_top_trend_on_youtube__fans_are_ra_1545551988_800x420.png"}