{"text": "You May Love Listening To Arijit Singh On Loop But He Finds His Own Songs 'Claustrophobic'\nYou May Love Listening To Arijit Singh On Loop But He Finds His Own Songs 'Claustrophobic'\nFinding a person who dislikes Arijit Singh’s voice is a rarity. Ask anyone why they love his voice, and they can instantly write an essay on the amazingly mesmerising singer that he is.\nArijit Singh is hailed as the singer of the generation -- the king of playback singing. He weaves magic with his soulful voice in every song that he sings. From Phir Le Aaya Dil To Channa Mereya and Tum Hi Ho, people listen to his songs on loop.\ncloudfront.net\nBut did you know, Arijit Singh doesn’t listen to his own songs! He feels claustrophobic listening to himself. Well, that’s what he said recently.\ncreativeeyephotography.in\nThe 31-year-old singer recently attended the opening ceremony of 49th edition of International Film Festival of India (IFFI). The host of the event, Amit Sadh, asked him about how does he generate the intensity to sing such romantic songs, to which he replied, \"Is that a question?\".\nYouTube\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.5 K SHARES 3.1 K SHARES 2.5 K SHARES\nWhen asked if he listens to his own songs, he said, “I feel claustrophobic when I listen to myself.”\nWell, that’s surprising, or it isn’t?\nWith inputs from PTI", "title": "You May Love Listening To Arijit Singh On Loop But He Finds His Own Songs 'Claustrophobic'", "date_publish": "22/11/2018, 16:47:58", "description": "Did you know Arijit Singh doesn’t listen to his own songs? He feels claustrophobic listening to himself. Well, that’s what he said recently. The 31-year-old singer recently attended the opening ceremony of 49th edition of International Film Festival of India (IFFI). The host of the event Amit Sadh asked him about how does he generate the intensity to sing such romantic songs, to which he replied,", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/you-may-love-listening-to-arijit-singh-on-loop-but-he-finds-his-own-songs-claustrophobic-357189.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/arjit_singh_doesnt_listen_to_his_own_songs_because_he_feels_claustrophobic_1542887887_800x420.jpg"}