{"text": "Don’t you just hate waiting for your favourite show’s new season? All the Game Of Thrones fans would agree with me here. Now imagine that some shows make you wait between a season. Confused? Well, the much loved American legal drama series Suits likes to give its fans a hard time for they take a big break in between seasons. Yes, i am not even kidding. As if waiting for a new season wasn’t enough, this one show leaves us halfway during a season with a major cliffhanger in tow.\ngifer\nNow, in case you haven’t been following it religiously, fret not! We have got you covered. The second half of Suits Season 8 is all set to premiere on Jan 23. Since we know, you aren’t left with a lot of time to catch up, we took it upon ourselves to give you a run down about everything major that has happened till date.\nWithout further ado, scroll!\n1. Jessica Person is gone. For good!\ntwitter\nWell, for the uninitiated, the show revolves around a law firm Pearson Specter Litt with Jessica as the managing partner for many seasons. However, after a lot of twists and turns, the dynamics get changed with Pearson finally deciding to relocate to Chicago and quit her own firm altogether, leaving Harvey Specter and Louis Litt high and dry. A lot of hearts broke, including mine, to see one of the most powerful female characters in the history of TV series leave the show. All of us got so used to her powerful persona that managed to overshadow THE Harvey Specter more often than not.\nDon't Miss 828 SHARES 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES\n2. After tying the knot, Mike Ross and Rachel Zane have moved to Seattle to run a new firm by themselves\ntwitter\nThis probably has to be another major change that hit home hard! Even though, all of us were prepared for it much in advance, but to finally see it happen left a lot of us emotional. Not only are we going to sorely miss Mike-Harvey banter but also the beautiful love story angle between Rachel and Mike. On the bright side, Meghan Markle finally got her happily ever after in real life with Prince Harry. All hail for the Duchess of Sussex!\n3. Pearson got replaced by Rachel’s daddy dearest Robert Zane after the firm almost sunk!\npinterest\nYes, that happened! In a unanticipated twist, Zane came to the rescue of Harvey and Louis. Just when the firm was about to slip away from their hands, Zane made a grand entry and saved it from drowning. TBH, it was hard to see our man Harvey take commands from Zane but as the season unfolded, we got our hearts’ desire fulfilled to the maximum. Get ready to witness alpha males locking horns on the smallest of things.\n4. Donna has been promoted from a legal secretary to the new COO\nus tv network\nThis is something that made our hearts happy. After giving her blood, sweat and tears to both the firm and Harvey Specter, Donna stood up for herself and asked for a promotion to become a senior partner. However, due to lack of a law degree, she is offered the COO position which turned out to be a win-win for all! Especially for us as she now holds the fort and makes all the major decisions along with the name partners.\n5. Harvey and Donna undergo a tumultuous fallout which results in Harvey breaking up with Paula\ntwitter\nWell, well, well! This one is going to make a lot of Darvey fans scream with joy. The couple that we all have been rooting for since years finally got together albeit for a brief period. Donna kissed Harvey which resulted in a lot of mixed feelings for him. So much so, that he chose Donna over his girlfriend cum therapist Paula. What’s more, be prepared to see Harvey turning green with envy because Donna has a new man in her life! Don’t believe us? Check this out:\n6. Louis Litt and his on-off girlfriend Sheila Sazs are back together AND are expecting a baby!\npinterest\nAfter a rocky relationship with Sheila and another heartbreak from his architect ex fiancee, Louis is finally back with the love of his life Sheila! In fact, these two are eagerly waiting to start a family. After a lot of hurdles, Louis is all set to become a father! Well, this definitely is one plot twist that no one imagined would see the day.\n7. Get ready to meet the female counterpart of Harvey Specter, Miss Samantha Wheeler!\ntwitter\nKatherine Heigl gave all of us a pleasant surprise when she made an announcement about joining the cast of Suits with season 8. In case, you are wondering why so much excitement over her, well let’s take you on a walk down memory lane. Heigl made us all fall in love with her after acting as a medical intern/resident in Grey’s Anatomy. She then went on to become a regular face of hit rom-com movies including 27 dresses, Knocked Up and The Ugly Truth among others.\nThe excitement became ten fold because we have always seen her in sweet and bubbly roles but this is the first time the world got to witness the ferocious, shrewd and conniving side of her onscreen. Interestingly, she cut to the chase and managed to rile up the lion of the jungle - Harvey Specter. Their enmity and power struggle definitely makes up for the exit of the key characters.\n8. While Mike’s shoes can never be filled, Harvey has a new right hand - Alex Williams!\nsuits/instagram\nOne star lost, a new one is found! Say hello to Alex Williams, a fearless attorney who shakes things up from the word go. Just like his predecessor, he is not a yes man and doesn’t take shit from the name partners or his competitor Samantha Wheeler. He for sure will give you a lot of surprises and some not so pleasant ones as well.\n9. It’s raining powerful women at Zane Specter Litt\nofficial poster\nJessica Pearson might have left the building but some new badass women have arrived. From our favourite red aka Donna to new Senior Partner Katarina Bennett, it’s women power all around.\n10. Last but definitely not the least, LOUIS LITT is the new managing partner\ntwitter\nGet ready to be 'litt' up! The most finicky character of the show Louis Litt is given the reins of the law firm. Litt is one character that we all love to love, love to hate and sometimes hate to love! I mean, let’s give it to the man for showing so many different shades of his character seamlessly. I for one, can’t wait for him to take the lead and show 'em how it’s done.\nAre you as excited as we are? Tell us in the comments section below.", "title": "You Just Got 'Litt' Up! Suits S8.5 Is Back & Here's A Quick Recap Before The Explosive Premiere", "date_publish": "23/01/2019, 16:00:02", "description": "Don’t you just hate waiting for your favourite show’s new season? All the Game Of Thrones fans would agree with me here. Now imagine that some shows make you wait between a season. Confused? Well, the much loved American legal drama series Suits likes to give its fans a hard time for they take a big break in between seasons. Yes, i am not even kidding. As if waiting for new season wasn’t enough,", "authors": ["Bhavya Sadhwani"], "url": "https://www.indiatimes.com/entertainment/hollywood/you-just-got-litt-up-suits-s8-5-is-back-here-s-a-quick-recap-before-the-explosive-premiere-360848.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/suits_1548150414_800x420.jpg"}