{"text": "You Can't Miss The Glow On Ranveer And Deepika's Face During The Chooda Ceremony\nYou Can't Miss The Glow On Ranveer And Deepika's Face During The Chooda Ceremony\nAfter six years of dating, Ranveer Singh and Deepika Padukone tied the knot in scenic Lake Como, Italy.\nThe wedding was a very private affair with only close friends and family attending it. Deepika and Ranveer's special security measures became the prime reason why we couldn't get a closer look at the wedding ceremonies.\nInstagram\nNot even one picture was shared or leaked but on 15th November, both Ranveer and Deepika themselves took to Instagram and Twitter to share their happiness with the world.\nThe pictures went viral in no time and from fans to their friends from the fraternity, everyone started gushing over this couple. And now slowly, there are other pictures from their ceremonies that have started paving their way on the internet.\n(Also read: 12 Endearing Things About Ranveer-Deepika's Fairytale Wedding That Will Make You Swoon!)\nA picture from their chooda ceremony is doing rounds on the internet. One of the key highlights of this picture is how Ranveer is seen wearing a pair of sneakers with a heavily embroidered Sabyasachi outfit. Just like their other functions, here also Deepika is seen in a matching salwar-suit.\n(Also read: Ranveer Singh's Mumbai Home Gets A Special Makeover To Welcome Bride Deepika!)\nYesterday, Deepika and Ranveer's teams too shared pictures from the wedding.\nDon't Miss 185 SHARES 460 SHARES 544 SHARES 1.7 K SHARES 411 SHARES\nWe can't wait to see them back in India, this time as Mr. and Mrs.", "title": "You Can't Miss The Glow On Ranveer And Deepika's Face During The Chooda Ceremony", "date_publish": "17/11/2018, 11:18:59", "description": "Not even one picture was shared or leaked but on 15th November, both Ranveer and Deepika themselves took to Instagram and Twitter to share their happiness with the world. The pictures went viral in no time and from fans to their friends from the fraternity, everyone started gushing over this couple. And now slowly, there are other pictures from their ceremonies that have started paving their way", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/you-can-t-miss-the-glow-on-ranveer-and-deepika-s-face-during-the-choodha-ceremony-356831.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/ranveer_and_deepika_1542433975_800x420.jpg"}