{"text": "YouTube Star Lilly Singh & Ranveer Singh Rap To 'Apna Time Aayega' And It's Everything!\nYouTube Star Lilly Singh & Ranveer Singh Rap To 'Apna Time Aayega' And It's Everything!\nWhat happens when two powerhouses of talent come together? Well, the results are phenomenal and that's exactly what happened at the GQ Style Awards in Mumbai last night.\nAfter winning the hearts of the audience with his rapping skills in Zoya Akhtar's blockbuster Gully Boy, Ranveer Singh was in his full elements last night, as he rapped his way to glory with YouTube star Lilly Singh aka Superwoman.\nThe GQ event was attended by a lot of Bollywood stars including Anushka Sharma, Jacqueline Fernandez, Jim Sarbh, Taapsee Pannu, Kalki Koechlin, Fatima Sana Shaikh, and Sanya Malhotra.\nBut what caught everyone's heart and attention was when Ranveer Singh and Lilly Singh took over the stage to entertain the audience.\nScreengrab\nThe jugalbandi between the two Singhs received a lot of adulation and love and that says everything! Watch the video right here.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\nLilly Singh is in Mumbai currently for her massive YTFF( Youtube Fab Fest) show. Apart from that, both Ranveer and Lilly were in news recently for different, yet relevant reasons.\nWhile Ranveer announced launched independent music label IncInk, Lilly dropped her new single two days ago, which went viral in no time.", "title": "YouTube Star Lilly Singh & Ranveer Singh Rap To 'Apna Time Aayega' And It's Everything!", "date_publish": "31/03/2019, 10:49:32", "description": "After winning the hearts of the audience with his rapping skills in Zoya Akhtar's blockbuster Gully Boy, Ranveer Singh was in his full elements last night, as he rapped his way to glory with YouTube star Lilly Singh aka Superwoman.The GQ event was attended by a lot of Bollywood stars including Anushka Sharma, Jacqueline Fernandez, Jim Sarbh, Taapsee Pannu, Kalki Koechlin, Fatima Sana Shaikh", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/youtube-star-lilly-singh-ranveer-singh-rap-to-apna-time-aayega-and-it-s-everything-364612.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/ranveer_singh_1554009672_800x420.jpg"}