{"text": "Before Ranveer Singh-Deepika Padukone, Virat Kohli-Anushka Sharma and Ranbir Kapoor-Alia Bhatt, there was a couple who kept fans gushing over their sweet-adorable love story. Yes, it was cricketer Yuvraj Singh and Hazel Keech.\nSoon after their wedding, the lovebirds were spotted at the Goa airport where shedding their inhibitions, they did Bhangra on a Punjabi track. And it proved that Yuvraj Singh and Hazel Keech are a fun couple.\nIt’s been long that we haven’t heard about them, right? Hazel Keech has been keeping away from social media for a about a month. She recently revealed that she underwent a nose surgery after her mother-in-law suggested, because she couldn’t see her uncomfortable. She took her to the hospital and insisted on getting the treatment. In a heartfelt note, Hazel revealed how happy she is and thanked her mother-in-law writing “Love You Shabu.”\nDon't Miss 184 SHARES 237 SHARES 1.9 K SHARES 12.5 K SHARES\nIsn't that adorable? During the #10YearChallenge that went viral on social media, Hazel Keech had revealed about her suffering from depression a decade ago and how she would starve herself during those days.\nRead More: Hazel Keech Takes #10YearChallenge, Admits She Had Depression And Would Starve Herself", "title": "Yuvraj Singh’s Wife Hazel Keech Undergoes Nose Surgery, Thanks Mother-In-Law In A Heartfelt Note", "date_publish": "02/04/2019, 13:50:52", "description": "Yuvraj Sigh's wife Hazel Keech has been keeping away from social media for a about a month. She recently revealed that she underwent a nose surgery after her mother-in-law suggested, because she couldn’t see her uncomfortable otherwise. She took her to the hospital and insisted on getting the treatment. In a heartfelt note, she revealed how happy she is and thanked her mother-in-law.", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/yuvraj-singh-s-wife-hazel-keech-undergoes-nose-surgery-thanks-mother-in-law-in-a-heartfelt-note-364729.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Apr/yuvraj_singhs_wife_hazel_keech_undergoes_nose_surgery_thanks_motherinlaw_in_a_heartfelt_note_1554193343_800x420.png"}