{"text": "Zayn Malik's Version Of 'Allah Duhai Hai' From Race 3 Is Winning The Internet\nZayn Malik's Version Of 'Allah Duhai Hai' From Race 3 Is Winning The Internet\nInternational singer Zayn Malik has given some phenomenal hits like Dusk to Dawn, Pillowtalk and I Don't Wanna Live Forever. And we all know his love for Bollywood too. Early this year, the singer uploaded his version of Kailash Kher's 'Teri Deewani'. The cover of the original song went crazy viral as it was soulful.\nAnd now, the former member of British band One Direction, uploaded yet another Bollywood song. Yes, Zayn sang Salman Khan's song, Allah Duhai Hai, from Race 3.\nTaking to Instagram, Zayn released the cover and within hours, the song is breaking the internet. Take a look.\nZayn' s cover of Allah Duhai Hai...it's his white desi accent that's killing me — نِداء (@intoxicatedwave) November 20, 2018\nDon't Miss 862 SHARES 346 SHARES 812 SHARES\nWHAT DID I JUST LISTEN?!!!!\nAllah duhai hai cover by Zayn is soooooooo cool😩😍😭 — maliha (@desibadbitchx) November 20, 2018\nZayn singing \"Allah Duhai hai\" and I think I am in heaven. People commenting that they don't understand the language but they loved it and I think this how it feels to listen to your language from a talent like @zaynmalik❤️ ❤️ ❤️ #ZaynAllahDuhaiHai #AllahDuhaiHai — Priya Singh (@Priya3483) November 20, 2018\nZAYN'S ALLAH DUHAI HAI COVER IS SO FYCJING LIT WHOLE BOLLYWOOD MUSIC INDUSTRY IS SHAKING ITS TIME FOR HIM TO GIVE MUSIC FOR BOLLYWOPD NOW OR IM — Deeva🥀 (@ltaphrodite) November 20, 2018\nZAYN REALLY SANG ALLAH DUHAI HAI BITCHES KDJSKDKD IM LOSING MY SHITpic.twitter.com/gAHlxoEHj3 — 𝒕𝒂𝒉𝒓𝒊𝒎𝒂 (@baddestpaki) November 20, 2018\nAllah Duhai Hai cleared my skin and cured my depression ZAYN did that — duygu (@choniposie) November 20, 2018\nDedicating the song to his fans, Zayn's audio clip has become a rage and people who don't even understand the language are loving it. Now time to take a look at the original song and tell us which one you prefer. Tell us in the comments section below.", "title": "Zayn Malik's Version Of 'Allah Duhai Hai' From Race 3 Is Winning The Internet", "date_publish": "20/11/2018, 17:53:16", "description": "The former member of British band One Direction, uploaded yet another Bollywood song. Yes, Zayn sang Salman Khan's song, Allah Duhai Hai, from Race 3. International singer Zayn Malik has given some phenomenal hits like Dusk to Dawn, Pillowtalk and I Don't Wanna Live Forever. And we all know his love for Bollywood too. Early this year, the singer uploaded his version of Kailash Kher's 'Teri Deewani", "authors": ["Saloni Singh"], "url": "https://www.indiatimes.com/entertainment/celebs/zayn-malik-s-version-of-allah-duhai-hai-from-race-3-is-winning-the-internet-357052.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Nov/zayn_1542716864_800x420.jpg"}