{"text": "1. Shah Rukh Khan’s Zero Falls Flat At The Box Office & Fans Are Roasting It With Memes And Jokes\nDespite good promotional strategies that included his character Bauua Singh popping out from different forms of media, Shah Rukh Khan’s new-age film turned out to be a disaster for most of the people. The movie opened quite well at the box office (Rs 20 crore), but on the second day (Rs 16 crore) itself, the collections started to dip.\n2. Yo Yo Honey Singh Is Back & How! His New Video Song Makhna Is Now The Top Trend On YouTube\n\"Sab baith ke kare chill\nPar main hoon womanizer\nMujhe akele mein mat mill”\nWith these lyrics, Makhna is trending #1 trend on Youtube. People apparently love Honey Singh’s comeback in a little bulky, long hair and bearded look!\n3. After His Controversial Remarks, Naseeruddin Shah Gets Threats, Richa Chadha Extends Support\nDon't Miss 5.1 K SHARES 153 SHARES 343 SHARES 2.4 K SHARES\nThe controversy fuelled up so much that the organisers of Ajmer Literature Festival on Friday called off an event, which was to be addressed by Naseeruddin Shah. Protests were being held out by right-wing activist outside the venue. One of them even hurled ink at Naseeruddin Shah’s poster. Because of the protests, the show was called off.\n4. Virat Kohli Calls Anushka Sharma’s Performance In Zero ‘Outstanding’ & Trolls Can’t Keep Calm\nSo, recently, when Virat Kohli, who is in Australia for the test series, watched Shah Rukh Khan, Anushka Sharma and Katrina Kaif starrer Zero, he couldn’t stop gushing over the love of his life. The movie, which has otherwise been receiving flak and getting trolled, was praised by Virat Kohli. Here’s what he said!\nThe first 'Pirates' film, 'The Curse of the Black Pearl', hit the big screens in 2003, the most recent movie in the franchise, 'Dead Men Tell No Tales', was released in 2015.\n6. Naseeruddin Shah Hits Back At Pak PM Imran Khan, Tells Him To Take Care Of His Own Country\n“I read what Naseeruddin Shah had to say about the current situation of India, what he is saying now, Jinnah said the same all those years ago,” Khan added.", "title": "Zero’s Brutally Honest Tweet Review By Fans, Honey Singh’s Comeback Song & More From Ent", "date_publish": "23/12/2018, 16:44:44", "description": "From Shah Rukh Khan, Katrina Kaif and Anushka Sharma starrer Anand L Rai’s Zero falls flat on box office and fans trolling it with savage yet honest reviews to Yo Yo Honey Singh’s new video song Makhna becoming the number one trend on YouTube, here is all that rocked the world of entertainment and Bollywood.", "authors": [], "url": "https://www.indiatimes.com/entertainment/zero-s-brutally-honest-tweet-review-by-fans-yo-yo-honey-singh-s-comeback-song-more-from-ent-359139.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2018/Dec/zeros_brutally_honest_tweet_review_by_fans_honey_singhs_comeback_song__more_from_ent_1545563778_800x420.png"}