{"text": "However, as per trade analyst Taran Adarsh, after opening with Rs 20 crore, the movie saw a dip in the first weekend only and was called 'disappointing'. The movie barely managed to get the crowd in the hall and the word of mouth ruined it further.\nApart from their fun banter, the stars were at their candid best and spoke unabashedly. While interacting with the media, Alia expressed how she considers upcoming superstars of Hindi cinema Ranveer Singh and Ranbir Kapoor as superb human beings and outstanding actors.\nDon't Miss 5.1 K SHARES\nThe actor has been secretly watching his latest release with the fans at some of the favourite cinema spots. The newly married star also made recordings of the crazy reactions after every punch and every song from the film.\nRanveer Singh is so good and apt in the role of a street rapper that even before we watch the entire film, we can say that it’s hard to imagine someone else in those shoes, right? Well, Ranveer Singh thinks the same too. He thinks he was born to do Gully Boy, and if somebody else would have done this role, he would have been jealous.\n“If a situation like this arises in the West, we want to read about it and we are like 'oh so good' and if something happens here, we have to criticise it. I think it's the hypocrisy of society and that's not going to change,” he told Pinkvilla.", "title": "Zero Becomes A Top Grosser, Alia Talks About Working With Ranbir-Ranveer And More From Ent", "date_publish": "10/01/2019, 18:51:42", "description": "However, as per trade analyst Taran Adarsh, after opening with Rs 20 crore, the movie saw a dip in the first weekend only and was called 'disappointing'. The movie barely managed to get the crowd in the hall and the word of mouth ruined it further. Read more here.", "authors": [], "url": "https://www.indiatimes.com/entertainment/bollywood/zero-becomes-a-top-grosser-alia-talks-about-working-with-ranbir-ranveer-and-more-from-ent-360195.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Jan/trending_1547124642_800x420.jpg"}