{"text": "With Gully Boy, Zoya Akhtar and Reema Kagti managed to create a world that wasn't just closer to reality but it showed us the mirror of the real world that exists in the slums of Mumbai. The world where dreams are bigger than their bank balance and their enthusiasm can win your heart at any given day.\nGully Boy wasn't just an ordinary story that revolved around the rap music scene of Mumbai but it drew inspiration from Indian street rappers Divine and Naezy.\n(Also read: 9 Facts About Gully Boy That'll Give You Insights On What It Took To Make This Gripping Film)\nThe film was both a critical and commercial success and managed to win a lot of hearts. And if you are someone who was left wanting for more, here is a good news. Zoya Akhtar has confirmed that the sequel to the film is being planned and executed.\nDon't Miss 12.5 K SHARES 5.5 K SHARES 3.4 K SHARES 3.1 K SHARES 2.5 K SHARES\n(Also read: From Lyrics To Dialogues, Here Are 14 Epic Lines From 'Gully Boy' You Need To Use Right Now)\nConfirming the news to Deccan Chronicle, director Zoya Akhtar said,\n“My co-writer Reema Kagti and I do feel there’s so much more to be said on the entire hip-hop culture in our country. And another film exploring the theme is being scripted and planned.”\nWhen asked about his brother Farhan and whether he will be seen in the Gully Boy sequel, she said,\n“He just didn’t fit into Gully Boy. And we’re both sorry about it.”\nShe had a legit reason to why Farhan doesn't fit in into the world of Gully Boy. She added,\n“Also, his image from the Rock On series is affiliated to an entirely different genre of music. It would have been a bit of a culture shock for the audience to suddenly see him swerve from stadium-rock to hip-hop.”\nGully Boy did manage to live upto the hype that it created and emerged as a winner at the box-office.\nIn less than a week of its release, Gully Boy had raked in about 80 crore, as claimed by a report in Box Office India.", "title": "Zoya Akhtar Confirms 'Gully Boy' Sequel, Says There's More To Explore In India's Hip Hop Scene!", "date_publish": "10/03/2019, 12:56:24", "description": "With Gully Boy, Zoya Akhtar and Reema Kagti managed to create a world that wasn't just closer to reality but it showed us the mirror of the real world that exists in the slums of Mumbai. The world where dreams are bigger than their bank balance and their enthusiasm can win your heart at any given day.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/zoya-akhtar-confirms-gully-boy-sequel-says-there-s-more-to-explore-in-india-s-hip-hop-scene-363467.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/zoya_akhtar_gully_boy_1552203849_800x420.jpg"}