{"text": "Zoya’s next Gully Boy is receiving an outstanding response, in fact, the film was screened in Berlin and it left the audiences stunned. Most of the critics claim Ranveer Singh and Alia Bhatt have given their career-best performances. Zoya too cannot get enough of her actors.\nInstagram\nAfter the screening of Gully Boy in Berlin, Zoya had an interaction with us in Mumbai, where she shared how crazy an experience she had at the premiere. Zoya reveals it was her dream to see her film being screened at Berlin and how Alia said the audience's response to the film was nothing less than a Gaiety audience.\nInstagram\nWe spoke to Zoya about both the actors where she tells us how outstanding an actress Alia is but she left her stressed,\nDon't Miss 185 SHARES 336 SHARES 544 SHARES 247 SHARES 699 SHARES\n“Alia is just outstanding actor, she is a delight to work with, Alia is one actor who chased me to do homework, normally it’s reverse, I have to chase the actor and ask them to rehearse, but she stressed me out, her manager was like you have to meet her for readings, we went to our readings, scenes, we got her a dialect coach for the accent, she made notes , she did her homework herself and I was just in love with that. She is possibly the easiest actor I have worked with.”\nTalking about why Ranveer was her only choice for Gully Boy, she said, “He is very easy to handle, this is my second film with him, honestly I don’t feel I have to handle him, I don’t think I am ever comfortable with any actor, we are friends since he wasn’t an actor and I wasn’t a director, so we get on pretty well. He is an absolute joy to work, he was always my first choice because I knew he was deeply influenced by rap culture, he raps and writes which I hear all the time. Also, he is very easy with Mumbiaya lingo, it doesn't look he is faking it,so he was just perfect for it”.\nTwitter\nHowever Zoya wasn't sure to let Ranveer do the vocals for her music album and she tells us why, \"I have heard him rap, but it’s very different when you have to give 5 songs of the album. He plays the lead and I didn’t want his singing would look even a bit off because that would reflect very bad, I was like I know you can, but I really need to be sure, so he came to the studio, we spent a day with Divine, him and Ankur Tiwari and he rehearsed and so he is here.\"\nZoya is counted as one of the most eminent directors in Bollywood. But her first film Luck By Chance didn’t receive much love at the box office, but today that film is a cult. Somewhere she is still disheartened with her first film Luck By Chance not doing well, we asked her if she was taken aback with the failure and she said,\nTwitter\n“Firstly it took me so long to make that film, When you make your first film, you are so innocent, I did not even ask my producers about the box office business because my lowest review was 3 and a half stars, otherwise all the reviews were above 5, people were sending me flowers, my friend Karan Johar came and met me, the industry and journalistic attention was so much that I was like wow, it was the most loved film from the industry and trade community\".\nTwitter\nSo after the release I asked them how is the film doing, they were like not well, I was like WHY? They said people couldn’t connect with it or maybe they didn’t go and watch it, of course, you get depressed with it, but different films get you different things, sometimes you make a crap film and earn money and sometimes the film is great but it makes no money, you are lucky that the film is great and makes money and you are ruined if the film is great and doesn’t make money.”\nZoya was also asked about Zindagi Na Milegi Dobara sequel, to which she said,\nTwitter\n\"I am dying to work with Hrithik again because it's been a while. Hrithik and Farhan are like my first two boys so I can’t wait to work with them, but I can’t just make a sequel of Zindagi Na Milega Dobara to capitalise on it, it has to work as a story within itself. Only when I get the unique idea then I will make it and I am working on it so let’s see. It has to stand on its own, I don’t want to just do a sequel that will market and capitalise on one, I want to make a film that is as good and fulfilling then the first one.\"", "title": "Zoya Akhtar Says Alia Bhatt Is An Outstanding Actor But She Was Stressed Seeing Her Energy", "date_publish": "12/02/2019, 17:16:01", "description": "Zoya’s next Gully Boy is receiving an outstanding response, in fact, the film was screened in Berlin and left the audiences stunned. Most of the critics claim Ranveer Singh and Alia Bhatt have given their career-best performance. While Zoya too cannot get enough of her actors. After the screening of Gully Boy in Berlin, Zoya had an interaction with us in Mumbai, where she shared how crazy experie", "authors": ["Manisha Mandal"], "url": "https://www.indiatimes.com/entertainment/zoya-akhtar-says-alia-bhatt-is-an-outstanding-actor-but-she-was-stressed-seeing-her-energy-362038.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Feb/alia_bhatt_1549972988_800x420.jpg"}