{"text": "The show is supported by a strong ensemble cast that includes Shashank Arora and Shivani Raghuvanshi and other pivotal guest appearances that includes Deepti Naval, Shweta Tripathi, Vinay Pathak, Ayesha Raza, Rasika Duggal among others.\nThe film was both a critical and commercial success and managed to win a lot of hearts. And if you are someone who was left wanting for more, here is a good news. Zoya Akhtar has confirmed that the sequel to the film is being planned and executed.\nDon't Miss 10.9 K SHARES\nIt was when Host James Corden asked Nick -who had a lie detector on- 'Was there a point during your many weddings that you thought, ''I'm done with these weddings?''' While Nick took a few seconds to answer this one, he was prompt enough to answer it with a dash of humor. He said, 'Yes. It's when I looked at the bill!'\nThe episode remains one of the most iconic ones as Kapil also displayed pictures from the iconic match that took all the players back to their winning days of glory. Later, the team also went on to narrates trivias and anecdotes from 1983, the very year when they registered the epic victory of World Cup.\nThe wedding soon turned into a star-studded event and a Bollywood bash when all the A-listers from the industry turned up to bless the couple.", "title": "Zoya Akhtar Confirms Gully Boy Sequel, Review Of 'Made In Heaven' And More From Ent", "date_publish": "10/03/2019, 18:07:56", "description": "Made In Heaven: Finally A Show That's Much More Than Just Crazy Rich Indians Getting Married! The show is supported by a strong ensemble cast that includes Shashank Arora and Shivani Raghuvanshi and other pivotal guest appearances that includes Deepti Naval, Shweta Tripathi, Vinay Pathak, Ayesha Raza, Rasika Duggal among others.", "authors": ["Isha Sharma"], "url": "https://www.indiatimes.com/entertainment/celebs/zoya-akhtar-confirms-gully-boy-sequel-review-of-made-in-heaven-and-more-from-ent-363487.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/top_bollywood_news_1552221671_800x420.jpg"}