{"text": "Whether we talk about it or not, we all know that sexual desire in women is normal. But that's not what we show in our Hindi films Ironically, in one of the world's most populated countries, talking about sex is taboo. Add to that the fact that misogyny is still raging in India. All this has taken a toll on how sex is portrayed on the big screen. In one word: unrealistic.\nTwitter\nAccording to Zoya Akhtar, for the longest time, the industry showed physical abuse on the big screen instead of consensual sex. She thinks that it is problematic especially when people are consuming such content at a young age. Zoya Akhtar says that we might not realise it now, but the impact is visible later.\n“I realised this much later that while I was growing up, I have only seen physical abuse in Hindi films. It was crazy because we were allowed to watch rape scenes, molestation and assault but we weren't allowed to see consensual sex,” she was quoted as saying by PTI.\nDon't Miss 180 SHARES 3.5 K SHARES 255 SHARES 12.5 K SHARES 5.5 K SHARES\n“That has to impact the psyche because you do not watch people kissing, tenderness. You don't see people making love and how they want to be treated,” she added.\nZoya Akhtar says that this portrayal of sex sends the wrong message.\n“What you are putting out is that women will always say no and you will just jump on them. When you are a kid, you don't really focus on it. When you grow up, you realise that was weird and it should change.”\nAlso Read: Meet Real Life Gully Boys Divine & Naezy Who Went From Raps To Riches & Inspired Ranveer’s Film\nZoya says strong women as well as men in her life has helped shape her personality.\n\"I have been raised by a hardcore feminist. My male friends, colleagues in the industry and outside are all feminists. It took me a long time to realise and recognise a certain amount of sexism because it didn't exist in my world. A lot of it went by without me even reacting to it.\"\nThe Gully Boy director thinks that the important bit right now is to put out more women stories and include the female gaze.\n\"When I am making films, I am putting out men that I want in the world... The need of the hour is to enable more women and their stories to come out.”\nAlso Read: Zoya Akhtar Says Alia Bhatt Is An Outstanding Actor But She Was Stressed Seeing Her Energy\nWith inputs from PTI", "title": "Zoya Akhtar Feels Hindi Cinema Shows Physical Abuse Not Consensual Sex, Says That's Problematic", "date_publish": "09/03/2019, 11:48:45", "description": "Whether we talk about it or not, we all know that sexual desire in women is normal. But is that how sex is depicted in our Hindi films? In a country where sex is still a taboo and misogyny is still a thing, the portrayal of sex on the big screen isn’t realistic. According Zoya Akhtar, for the longest time, the industry showed physical abuse on the big screen instead of consensual sex. She thinks", "authors": ["Garima Satija"], "url": "https://www.indiatimes.com/entertainment/zoya-akhtar-feels-hindi-cinema-shows-physical-abuse-not-consensual-sex-says-that-s-problematic-363412.html\n", "image_url": "https://media.indiatimes.in/media/facebook/2019/Mar/zoya_akhtar_feels_hindi_cinema_showing_only_physical_abuse__not_consensual_sex_is_problematic_1552110337_800x420.jpg"}