{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/anupam-kher-calls-ranbir-kapoor-indias-best-actor/articleshow/68736347.cms\n", "description": "Bollywood News: रणबीर कपूर अभी न्यू यॉर्क में इलाज करा रहे अपने पिता से मिलने गए हैं। अनुपम खेर भी इस समय अमेरिका में शूटिंग में बिजी हैं। दोनों की मुलाकात हुई और इसकी तस्वीर अनुपम ने ट्विटर पर शेयर की है।", "date_publish": "05/04/2019, 13:19:21", "authors": [], "title": "अनुपम खेर ने Ranbir Kapoor को बताया इंडिया का सबसे अच्छा ऐक्टर", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68736347,width-650,resizemode-4/weather.jpg", "text": "It is always delightful to meet one of India’s finest & my most favourite actor & person #RanbirKapoor. He is affec… https://t.co/RRXyCQ2BZU — Anupam Kher (@AnupamPKher) 1554435460000\nरणबीर संग शादी की खबरों पर आलिया भट्ट ने तोड़ी चुप्पी\nX\nबॉलिवुड के सीनियर कलाकार अनुपम खेर ने रणबीर कपूर से मुलाकात की और उन्हें भारत के सबसे बेहतरीन ऐक्टर्स में से एक बताया है। इस मौके पर दोनों ने अपनी फिल्मों, बॉलिवुड और जीवन से जुड़ी बातें कीं। अनुपम ने ट्विटर पर रणबीर के साथ अपनी तस्वीर भी शेयर की है।बता दें कि रणबीर कपूर अभी न्यू यॉर्क में इलाज करा रहे अपने पिता से मिलने गए हैं। अनुपम खेर भी इस समय अमेरिका में शूटिंग में बिजी हैं। अनुपम में तस्वीर शेयर करते हुए लिखा, 'मुझे भारत के सबसे अच्छे ऐक्टर्स और बेहतरीन इंसानों में से एक रणबीर कपूर से मिलकर हमेशा खुशी होती है। वह काफी प्यारे, सम्मान करने वाले, दयालु और बेहद टैलंटेड हैं। उनके साथ न्यू यॉर्क सिटी की सड़कों पर घूमना और उनसे फिल्मों और लाइफ के बारे में बात करना काफी अच्छा रहा।'बता दें कि अनुपम खेर और रणबीर कपूर फिल्म 'वेक अप सिड' में साथ काम कर चुके हैं। वर्क फ्रंट की बात करें तो रणबीर इस समय अपनी अगली फिल्म ' ब्रह्मास्त्र ' की शूटिंग में बिजी हैं। अयान मुखर्जी के डायरेक्शन में बन रही इस फिल्म अमिताभ बच्चन, आलिया भट्ट और मौनी रॉय प्रमुख भूमिकाओं में नजर आएंगे।"}