{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/bollywood-celebrities-wish-fans-on-holi/articleshow/68508512.cms\n", "description": "Bollywood News: होली के त्योहार पर बॉलिवुड भी झूम रहा है। इस मौके पर लगभग सभी बड़े सिलेब्रिटीज ने फैन्स को होली की शुभकामनाएं दी हैं। इन सिलेब्स में हेमा मालिनी, माधुरी दीक्षित, करण जौहर और अक्षय कुमार जैसे बड़े नाम शामिल हैं।", "date_publish": "21/03/2019, 12:39:28", "authors": [], "title": "बॉलिवुड सिलेब्रिटीज ने यूं किया फैन्स को होली विश", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68508512,width-650,resizemode-4/weather.jpg", "text": "May this Holi add more colors to your life. Wishing you all a very #HappyHoli and Navroz Mubarak as well :) — Akshay Kumar (@akshaykumar) 1553140675000\nColor the world with your goodness and good intentions....#happyholi to you and yours...❤️ — Karan Johar (@karanjohar) 1553141301000\nThis Holi let us strive to paint a colourful world for everyone! Stay safe, enjoy responsibly! Happy Holi https://t.co/LHNSqf5Ctj — Madhuri Dixit Nene (@MadhuriDixit) 1553139326000\nMay the spirit and colors of Holi fill you with happiness, peace and love. Happy Holi beautiful people. #HappyHoli — Hrithik Roshan (@iHrithik) 1553140339000\nHoli Mubarak to everyone , lots of love , happiness and brotherhood ❤️ — ali abbas zafar (@aliabbaszafar) 1553143288000\nHappy Holi to all of you! https://t.co/anrF4n77IW — Hema Malini (@dreamgirlhema) 1553140589000\nLet the vivid colors of Holi spread love and happiness. Hope you all enjoy and treasure some joyful moments #HappyHoli — Mahesh Babu (@urstrulyMahesh) 1553139395000\nWishing a very happy and colorful holi to everyone!! And navroz mubarak to all my parsi friends . — Emraan Hashmi (@emraanhashmi) 1553139361000\nHappy Holi to all enjoy this colourful festival , spreading love happiness and unity. Play safe play organic — Arbaaz Khan (@arbaazSkhan) 1553137590000\nपर बॉलिवुड भी रंगों का त्योहार मना हा है। बॉलिवुड सिलेब्रिटीज ने इस मौके पर अपने फैन्स को होली की शुभकामनाएं दी हैं। करण जौहर माधुरी दीक्षित , अली अब्बास जफर, महेश बाबू, हेमा मालिनी और रितिक रोशन जैसे दिग्गज बॉलिवुड सिलेब्स ने सोशल मीडिया पर होली की शुभकामनाएं दी हैं।अक्षय कुमार की इस साल की होली तो डबल स्पेशल है क्योंकि न केवल उन्होंने इस बार होली अपने परिवार के साथ मनाई बल्कि उनकी हालिया फिल्म 'केसरी' भी होली के मौके पर रिलीज हुई है। इस फिल्म को क्रिटिक्स की तरफ से बहुत सराहना मिल रही है।फिल्मी सितारों ने सोशल मीडिया पर सभी को होली विश करते हुए सुरक्षित तरीके से हर्षोल्लास के साथ त्योहार मनाने की गुजारिश की है। देखें, सितारों के कुछ ट्वीट्स:"}