{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/bollywood-celebrities-support-pm-narendra-modi-in-his-vote-kar-campaign/articleshow/68552773.cms\n", "description": "Bollywood News: आगामी लोकसभा चुनाव में ज्यादा से ज्यादा लोगों की भागीदारी सुनिश्चित करने के लिए प्रधानमंत्री नरेंद्र मोदी ने रविवार को ट्विटर पर #VoteKar नाम से एक नया कैंपेन शुरू किया, जिसमें उन्होंने बॉलिवुड हस्तियों से भी अपील की।", "date_publish": "24/03/2019, 23:30:37", "authors": [], "title": "PM के #VoteKar कैंपेन को मिला बॉलिवुड का साथ, सिलेब्स ने यूं दिखाया जोश", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68552773,width-650,resizemode-4/weather.jpg", "text": "Dear @iHrithik and @ActorMadhavan, Your work has stood out not only for the entertainment quotient but also for t… https://t.co/9UAUBx5xyk — Chowkidar Narendra Modi (@narendramodi) 1553437645000\nA request to @ektaravikapoor, @ParineetiChopra and @SidMalhotra- As prominent Indians whose achievements are much a… https://t.co/mupXlTYDXP — Chowkidar Narendra Modi (@narendramodi) 1553438570000\nI call upon @itsSSR, @TheAaryanKartik and @kritisanon to help increase voter awareness. You are the younger generat… https://t.co/i4SIBCJRYr — Chowkidar Narendra Modi (@narendramodi) 1553438709000\nDear Hon'ble Prime Minister, I will strive to do the best within my capacity to encourage people to vote. It’s a pr… https://t.co/eTxtLk8JXd — Ekta Kapoor (@ektaravikapoor) 1553444362000\nOne vote can make all the difference. As citizens of this great nation, it is our duty & right to vote. So pls make… https://t.co/9jkBGjIjFL — Anil Kapoor (@AnilKapoor) 1553441465000\nDefinitely @narendramodi Sir! I strongly support our democracy. I urge all citizens to vote for a better India in t… https://t.co/bkT7d1034W — Sidharth Malhotra (@SidMalhotra) 1553440170000\nThank you PM @narendramodi for the compassion with which you work for our country. Yes! It is through our vote we e… https://t.co/mcVBPU5RVZ — Anupam Kher (@AnupamPKher) 1553440604000\nVoting is not only our right but also our duty! Every single vote matters. Lets be responsible citizens and help ma… https://t.co/zl7prWSGcj — Kriti Sanon (@kritisanon) 1553449055000\nआगामी लोकसभा चुनाव में ज्यादा से ज्यादा लोगों की भागीदारी सुनिश्चित करने के लिए प्रधानमंत्री नरेंद्र मोदी ने रविवार को ट्विटर पर #VoteKar नाम से एक नया कैंपेन शुरू किया। इस कैंपेन के तहत उन्होंने अन्य क्षेत्रों के दिग्गज लोगों के अलावा फिल्म इंडस्ट्री के दिग्गजों से भी अपील की ताकि वे देशवासियों को ज्यादा से ज्यादा संख्या में पहुंचकर वोट देने के लिए प्रोत्साहित कर सकें। इसके लिए उन्होंने प्रड्यूसर एकता कपूर से लेकर परिणीति चोपड़ा, सिद्धार्थ मल्होत्रा, सुशांत सिंह राजपूत, कार्तिक आर्यन और कृति सेनन, राजकुमार राव, मधुर भंडारकर, अनिल कपूर, अजय देवगन, माधुरी दीक्षित, रितिक रोशन जैसे बॉलिवुड स्टार्स से लोगों को वोट देने के लिए प्रोत्साहित करने की अपील की।उन्होंने ट्वीट किए:इस पर बॉलिवुड सिलेब्रिटीज़ ने प्रधानमंत्री को सपॉर्ट दिखाया और विश्वास दिलाया कि वह ज्यादा से ज्यादा लोगों को वोट देने के लिए प्रोत्साहित करेंगे। इस संबंध में कई सिलेब्रिटीज़ ने ट्वीट किए।एकता कपूर ने लिखा, 'डियर प्रधानमंत्री, मैं ज्यादा से ज्यादा लोगों को वोट देने के लिए प्रोत्साहित करने के ही भरपूर कोशिश करूंगी। यह मेरा सौभाग्य होगा कि मैं अपने प्रजातंत्र को मजबूत करने के लिए कुछ कर सकूं।'अनिल कपूर ने ट्वीट किया:सिद्धार्थ मल्होत्रा ने ट्वीट किया:अनुपम खेर ने ट्वीट किया:ऐक्ट्रेस कृति सेनन ने भी ज्यादा से ज्यादा लोगों से वोट करने की अपील की और ट्वीट किया:बता दें कि पीएम मोदी ने लोगों से अपील की करते हुए ट्वीट किया, 'यदि आप वोटरों को जागरूक करने के लिए कोई भी नई पहल कर रहे हैं तो उसकी जानकारी #VoteKar के साथ साझा करें।'"}