{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/bollywood-actor-rishi-kapoor-shares-some-beautiful-pictures-from-new-york/articleshow/69071641.cms\n", "description": "Bollywood News: बॉलिवुड ऐक्‍टर ऋषि कपूर ने हाल ही में अपनी पत्‍नी और दोस्‍त के साथ सोशल साइट पर कुछ बेहद प्‍यारी सी तस्‍वीरें शेयर की हैं। सोशल साइट्स पर ये खूब वायरल हो रही है। लोगों ने इसपर प्‍यारे-प्‍यारे कॉमेंट्स भी किए हैं।", "date_publish": "27/04/2019, 16:32:05", "authors": [], "title": "खूबसूरत चेरी ब्‍लॉसम और दोस्‍त के साथ तस्‍वीरों में यूं नजर आए ऋषि कपूर", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-69071641,width-650,resizemode-4/weather.jpg", "text": "With Gullu Waney at the Zuma,New York. The Cherry Blossom is so awesome this time of the year and so was the lunch! https://t.co/D28781oz8K — Rishi Kapoor (@chintskap) 1556319395000\nThank you my good man,Maniesh Paul. Wish you all success for the projects you mentioned to me. Happy you enjoyed To… https://t.co/ZQVt3wlK7Z — Rishi Kapoor (@chintskap) 1556320078000\nके बेहतरीन ऐक्‍टर्स में से एक ऋषि कपूर पिछले साल इलाज के लिए न्‍यू यॉर्क गए थे। वहां से अक्‍सर ही कभी वह खुद तो कभी उनकी पत्‍नी नीतू कपूर तस्‍वीरें शेयर करते रहते हैं। फैंस को भी इन फोटोज का बड़ी ही बेसब्री से इंतजार रहता है। यही वजह है कि ऋषि कपूर की फोटोज को ढेरो लाइक्‍स और फैंस का ढेर सारा प्‍यार मिलता है। अक्‍सर ही उनके फैंस उनकी सेहत के बारे में और फिल्‍मों में काम करने के बारे में पूछते ही रहते हैं। ऐसे में जब हाल ही में ऋषि कपूर ने न्‍यू यॉर्क के खूबसूरत फूल के साथ अपनी कुछ तस्‍वीरें शेयर कीं तो सोशल साइट्स पर यह खूब वायरल हुई।ऋषि कपूर ने हाल ही में न्‍यू यॉर्क से अपनी पत्‍नी नीतू कपूर और दोस्‍त गुल्‍लु वानी के साथ ही एक बेहद प्‍यारी तस्‍वीर सोशल साइट पर शेयर की। इसमें वह खूबसूरत चेरी ब्‍लॉसम के नीचे अपनी पत्‍नी और दोस्‍त के साथ काफी हैंडसम नजर आ रहे हैं। ऋषि कपूर ने इस फोटो के साथ प्‍यारा सा कैप्‍शन भी शेयर किया है।इसके अलावा एक दूसरी तस्‍वीर में ऋषि ऐक्‍टर मनीष पॉल के साथ नजर आ रहे हैं। इस फोटो पर उन्‍होंने मनीष को उनके प्रॉजेक्‍ट्स के लिए तमाम शुभकामनाएं भी दी हैं।ऋषि कपूर की इन तस्‍वीरों पर फैंस ने लाइक्‍स के साथ प्‍यारे-प्‍यारे कॉमेंट्स भी किए हैं। किसी ने उनकी अच्‍छी सेहत की प्रार्थना की है तो किसी ने लिखा है खूबसूरत तस्‍वीर। इसके अलावा लोगों ने उनके जल्‍दी ही स्‍वस्‍थ होकर वापस आने की भी प्रार्थना की है।बता दें कि ऋषि कपूर ने हाल ही में एक इंटरव्‍यू के दौरान अपने इलाज के बारे में बात की है। साथ ही जल्‍दी ही पूरी तरह से स्‍वस्‍थ होने की जानकारी भी दी है।"}