{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/ek-ladki-ko-dekha-toh-aisa-laga-box-office-collection-day-3-anil-kapoor-and-sonam-kapoor-continues-with-its-poor-collection/articleshow/67835638.cms\n", "description": "Bollywood News: समलैंगिक रिश्‍तों पर आधारित फिल्‍म 'इक लड़की को देखा तो ऐसा लगा' से दर्शकों को काफी उम्‍मीद थी। फिल्‍म के ट्रेलर्स भी लोगों के बीच काफी पसंद किए जा रहे थे लेकिन रिलीज होने के बाद‍ यह कुछ कमाल नहीं दिखा पाई।", "date_publish": "04/02/2019, 19:21:16", "authors": [], "title": "ELKDTAL box office collection Day 3: दम तोड़ती दिख रही सोनम और अनिल कपूर की फिल्‍म", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-67235196,width-650,resizemode-4/weather.jpg", "text": "ऐक्‍ट्रेस सोनम कपूर की फिल्‍म 'इक लड़की को देखा तो ऐसा लगा' से न सिर्फ उन्‍हें ही बल्कि दर्शकों को भी काफी उम्‍मीदें थी। फिल्‍म के ट्रेलर्स से भी लोगों में काफी उत्‍साह था लेकिन फिल्‍म कुछ खास कमाल नहीं दिखा सकी। मीडिया रिपोर्ट्स की मानें तो तीसरे ही दिन फिल्‍म दम तोड़ती हुई दिखी। फिल्‍म में एक ही बात लोगों को पसंद आई कि इसमें ऐक्‍ट्रेस सोनम कपूर की शुरू से आखिरी तक काफी मासूम नजर आईं। हालांकि यहां भी दर्शकों को सोनम और उनकी पार्टनर रेजिना के साथ बेहतरीन केमेस्‍ट्री देखने को नहीं मिली।Boxofficeindia.com के अनुसार फिल्‍म तीन दिनों में केवल 11.25 करोड़ का ही बिजनेस कर पाई है। हालांकि फिल्‍म की ओपनिंग के बाद यह उम्‍मीद थी कि कलेक्‍शन अच्‍छा होगा लेकिन सटरडे और संडे होने के बावजूद फिल्‍म दर्शकों को मल्‍टीप्‍लेक्‍स तक खींचने में सक्‍सेस नहीं हुई। वहीं मंडे का फिल्‍म कलेक्‍शन देखकर यह कहना गलत नहीं होगा कि लोगों ने इसे पसंद नहीं किया।फिल्‍म में अनिल कपूर, जूही चावला और राजकुमार राव की मौजूदगी भी कुछ खास कमाल नहीं दिखा सकी। रिपोर्ट्स के मुताबिक अभी भी समाज में इस तरह की फिल्‍मों को फैमिली फिल्‍म नहीं माना जाता। यह भी एक रीजन हो सकता है कि फिल्‍म को वीकेंड्स पर भी दर्शक नहीं मिले।रिपोर्ट के मुताबिक इस फिल्‍म के फ्लॉप होने से विनोद चोपड़ा और ऐक्‍टर अनिल कपूर की फ्लॉप फिल्‍मों की हैटट्रिक पूरी हो गई। इससे पहले इनकी फिल्‍में ' परिंदा ' और '1942 ए लव स्‍टोरी' फ्लॉप रही थीं और अब 'इक लड़की को देखा तो ऐसा लगा' का कलेक्‍शन न होने से विनोद चोपड़ा की फ्लॉप फिल्‍मों की हैटट्रिक पूरी हो गई। अब यह अलग बात है कि इस अनचाही फ्लॉप हैटट्रिक को पूरा करने में 30 साल का गैप रहा है।"}