{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/priyanka-will-join-in-women-in-the-world-summit-in-2019/articleshow/68408691.cms\n", "description": "Bollywood News: लॉस एंजिलिस, 14 मार्च (भाषा) अभिनेत्री प्रियंका चोपड़ा का नाम उन वक्ताओं में शामिल हो गया है जो ‘2019 वीमेन इन द वर्ल्ड समिट’ में अपनी बात रखेंगी। ‘वीमेन इन द वर्ल्ड’ की संस्थापक टीना ब्राउन की तरफ से रखे गए सत्र में 36 वर्षीय अभिनेत्री एक कार्यकर्ता एवं उद्यमी के तौर पर अपने करियर पर चर्चा करेंगी। ‘वैरायटी’ के मुताबिक कार्यक्रम में शिरकत करने वालों में ब्री लार्सन, सिंडी मैककेन, सुजान राइस, स्टेसी अब्राम्स, एशले जूड, जिल सोलोवे, ब्रायन क्रैंस्टन और एना विंटोर के नाम शामिल हैं। कार्यक्रम में मुख्य भाषण ओपरा विनफ्रे का होगा। लिंकन सेंटर", "date_publish": "14/03/2019, 15:45:39", "authors": [], "title": "‘वीमेन इन द वर्ल्ड समिट’ 2019 में प्रियंका भी करेंगी शिरकत", "image_url": "https://navbharattimes.indiatimes.com/photo/msid-33600677,width-473,resizemode-4/NBT.jpg", "text": "लॉस एंजिलिस, 14 मार्च (भाषा) अभिनेत्री प्रियंका चोपड़ा का नाम उन वक्ताओं में शामिल हो गया है जो ‘2019 वीमेन इन द वर्ल्ड समिट’ में अपनी बात रखेंगी। ‘वीमेन इन द वर्ल्ड’ की संस्थापक टीना ब्राउन की तरफ से रखे गए सत्र में 36 वर्षीय अभिनेत्री एक कार्यकर्ता एवं उद्यमी के तौर पर अपने करियर पर चर्चा करेंगी। ‘वैरायटी’ के मुताबिक कार्यक्रम में शिरकत करने वालों में ब्री लार्सन, सिंडी मैककेन, सुजान राइस, स्टेसी अब्राम्स, एशले जूड, जिल सोलोवे, ब्रायन क्रैंस्टन और एना विंटोर के नाम शामिल हैं। कार्यक्रम में मुख्य भाषण ओपरा विनफ्रे का होगा। लिंकन सेंटर में 10 से 12 अप्रैल के बीच आयोजित हो रहा यह कार्यक्रम अपनी 10वीं वर्षगांठ मना रहा है। कार्यक्रम में गलत सूचनाओं से लड़ना, ‘मी टू’ अभियान को आगे बढ़ाना एवं पत्रकारिता को बचाए रखना जैसे विषयों पर चर्चा होगी।"}