{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/pulwama-terror-attack-ali-fazal-opts-out-of-urdu-fest-in-dubai-jashn-e-rekhta/articleshow/68056557.cms\n", "description": "Bollywood News: पुलवामा अटैक के बाद फिल्म इंडस्ट्री के कई सितारे अपने कई प्रोग्राम कैंसल कर रहे हैं... जावेद अख्तर और शबाना आजमी के बाद अब अली फजल ने दुबई में होने वाले एक उर्दू फेस्टिवल से अपना नाम वापस ले लिया है।", "date_publish": "19/02/2019, 07:56:03", "authors": [], "title": "पुलवामा: अब अली फजल ने कैंसल किया अपना दुबई उर्दू फेस्टिवल प्रोग्राम", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68056557,width-650,resizemode-4/weather.jpg", "text": "पुलवामा में मुठभेड़ खत्म, तीन जैश आतंकी मारे गए\nX\nरिचा चड्ढा ने की अली फजल के साथ अपने रिलेशनशिप की पुष्टि\nX\nहुए पुलवामा अटैक के बाद अपने एक ट्वीट को लेकर ट्रोल हुए अभिनेता अली फजल ने अब दुबई में होने वाले एक उर्दू फेस्टिवल से अपना नाम वापस ले लिया है। पिछले दिनों कई फिल्मी हस्तियों ने अपने प्रोग्राम कैंसल किए, जिनमें मशहूर गीतकार जावेद अख्तर और उनकी शबाना आजमी ने अपनी पाकिस्तान यात्रा को रद्द किया। इधर भारतीय फिल्म इंडस्ट्री ने पाकिस्तानी कलाकारों पर पूरी तरह से पाबंदी लगा दी है।अली ने दुबई में होने वाले उर्दू के सबसे बड़े प्रोग्राम 'जश्न ए रेख्ता' के 5वें एडिशन से अपना नाम वापस ले लिया है। इस फेस्टिवल में अली फजल को हिंदी फिल्म इंडस्ट्री में उर्दू भाषा के बढ़ावे पर बात के बुलाया गया था। तीन दिनों तक चलने वाले इस आयोजन में शामिल होने से अली ने मना कर दिया हैं। आपको बता दें कि हर साल 'जश्न ए रेख्ता' में भारत की तरफ से कई बड़े नाम शामिल होते रहे हैं।'जश्न ए रेख्ता' के दिल्ली में आयोजित अलग-अलग कई प्रोग्राम में बॉलिवुड से जावेद अख्तर, शबाना आजमी, वहीदा रहमान, विशाल भारद्वाज, गुलजार, प्रसून जोशी, नवाज़ुद्दीन सिद्दीकी, नंदिता दस, मुज्जफर अली, अन्नू कपूर, हंस राज हंस जैसे तमाम शामिल हो चुकी हैं। अब दुबई में होने वाले इस आयोजन से अली के नाम वापस लेने के बाद इवेंट से जुड़ी एक और बड़ी खबर सामने आ रही है कि यह पूरा प्रोग्राम ही आगे खिसका दिया गया है। 28 फरवरी से लेकर 2 मार्च तक चलने वाले 'जश्न ए रेख्ता' के इस कार्यक्रम को अब बाद में शेड्यूल किया जाएगा।"}