{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/see-what-happen-when-kriti-sanon-reached-at-sushant-singh-rajput-birthday-party/articleshow/67644683.cms\n", "description": "Bollywood News: बॉलीवुड ऐक्‍टर सुशांत सिंह राजपूत ने हाल ही में अपना 33वां बर्थडे सेलिब्रेट किया। इस मौके पर उनकी एक्‍स गर्लफ्रेंड कृति सेनन भी पहुंच गई। आइए बताते हैं कि उन्‍हें देखकर सुशांत ने कैसे रिऐक्‍ट किया।", "date_publish": "22/01/2019, 21:17:05", "authors": [], "title": "जानें, क्‍या हुआ जब सुशांत सिंह राजपूत के घर पहुंच गईं उनकी एक्‍स गर्लफ्रेंड कृति सेनन", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-66991507,width-650,resizemode-4/weather.jpg", "text": "ऐक्‍टर सुशांत सिंह राजपूत हाल ही में अपने करीबी दोस्‍तों के साथ अपना 33वांं बर्थ डे सेलिब्रेट कर रहे थे। उसी समय उनकी एक्‍स गर्लफ्रेंड कृति सेनन भी वहां पहुंच गई। उन्‍हें देखकर कुछ पल के लिए तो सुशांत सिंह राजपूत शॉक्‍ड रह गये थे लेकिन थोड़ी ही देर में वह नॉर्मल नजर आए। इसके बाद दोनों ने ही पार्टी को खूब इंजॉय किया।बता दें कि जिस वक्‍त सुशांत अपना बर्थडे सेलिब्रेट कर रहे थे। उसी समय उनके घर के बाहर कृति सेनन की कार रुकी। जैसे ही वह कार से बाहर निकलीं, वहां मौजूद फॅटाग्रफर्स ने उनकी पिक्‍चर लेनी शुरू कर दी। कृति ने भी सभी को स्‍माइल दी। उन्‍होंने ग्रीन कलर की शर्ट पहनीं थी। बेहद सिंपल लुक में थीं, कोई मेकअप नहीं किया था। इस लुक में भी वह अट्रैक्टिव लग रहीं थीं। इसके बाद उन्‍होंने सुशांत सिंह राजूत के साथ बर्थडे पार्टी में खूब धमाल मचाया।कृति सेनन से पहले सुशांत मणिकर्णिका से डेब्‍यू करने वाली ऐक्‍ट्रेस अंकिता लोखंडे के साथ रिलेशनशिप में थे। इसके बाद जब उनका ब्रेकअप हो गया, तो सुशांत कृति सेनन के साथ नजर आए। इनका भी अगस्‍त 2018 में ब्रेकअप हो गया। हालांकि इसके बाद कृति और सुशांत अच्‍छे दोस्‍त बन गए। वर्कफ्रंट की बात करें तो सुशांत इस समय फिल्‍म 'सोनचिरैया' को लेकर खासे चर्चा में हैं। इसके अलावा वह रायफलमैन में मुख्‍य किरदार में नजर आएंगे।"}