{"url": "https://navbharattimes.indiatimes.com/movie-masti/news-from-bollywood/throwback-video-of-priyanka-chopra-licking-superwoman-and-youtuber-lilly-singh-goes-viral/articleshow/68163099.cms\n", "description": "Bollywood News: शल मीडिया स्टार और 'सुपरवुमन' लिली सिंह द्वारा यह कबूल किए जाने पर कि वह बाइसेक्शुअल हैं, एक विडियो वायरल हो रहा है जिसमें प्रियंका चोपड़ा उनकी उंगली को lick करते नज़र आ रही हैं। हालांकि यह विडियो काफी पुराना है।", "date_publish": "26/02/2019, 10:23:57", "authors": [], "title": "जब 'सुपरवुमन' की उंगली को Lick करती दिखीं प्रियंका, विडियो वायरल", "image_url": "https://navbharattimes.indiatimes.com/thumb/msid-68167396,width-650,resizemode-4/weather.jpg", "text": "X\n✅ Female ✅ Coloured ✅ Bisexual Throughout my life these have proven to be obstacles from time to time. But no… https://t.co/L68ls7RoUL — Lilly Singh (@IISuperwomanII) 1551056775000\n@TeamSuperMumbai @IISuperwomanII Baby we ALL knew it — Jaiyhana B. (@JaiyhanaB) 1551057065000\n@IISuperwomanII OKAY FIRST OF ALL: i am so so proud lilly ❤️ but second of all,,,, it was kind of about time b… https://t.co/0vMn89emY0 — ty (@zallphantastic) 1551062680000\n@StoddardDesiree @IISuperwomanII SAME LIKE DEEP DOWN INSIDE LILLY WAS TURNED ON ❤️❤️❤️❤️❤️❤️❤️❤️❤️ — Erica ♡ ☆*+:｡. (@iiteamsuperlov1) 1551059418000\nसोशल मीडिया स्टार और 'सुपरवुमन' लिली सिंह ने जैसे ही अपनी सेक्शुऐलिटी के बारे में खुलासा किया और कबूल किया कि वह बाइसेक्शुअल हैं, वैसे ही सोशल मीडिया पर फैंस के कॉमेंट्स की बाढ़ सी आ गई। जहां लिली के फैंस के लिए यह कबूलनामा काफी हैरान करने वाला था, वहीं लिली के कुछ विडियोज़ भी इंटरनेट पर सामने आए।हालांकि कुछ लोगों को कहना था कि उन्हें लिली की सेक्शुऐलिटी के बारे में पहले से ही पता था। इसका ज़िक्र कुछ फैंस ने ट्विटर पर करते हुए लिखा भी है कि उन्हें किस तरह लिली की सेक्शुऐलिटी के बारे में क्लू मिलते चले गए।एक फैन ने लिखा है कि लिली की सेक्शुऐलिटी को लेकर उसे तब संदेह हो गया था जब प्रियंका और लिली का एक Bloopers विडियो आया था। उस विडियो में प्रियंका लिली की उंगली को लिक करते नज़र आईं। प्रियंका के लिक करने पर लिली विडियो में कहती नज़र आती हैं, 'I am aroused.'यह विडियो अब एक बार फिर से वायरल हो रहा है, जिस पर फैंस खूब कॉमेंट कर रहे हैं। बता दें कि प्रियंका और लिली सिंह काफी अच्छी दोस्त हैं। प्रियंका ने अपनी शादी में भी लिली को इनवाइट किया था। खैर, अब देखना यह होगा कि प्रियंका अपने इस विडियो पर क्या रिऐक्शन देती हैं।"}